{
    "chapter": 2586,
    "title": "Purple Copper Jian’s Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2586",
    "text": "As Han Sen held the purple copper jian, his entire body was bathed in purple light. It was like an infinite number of purple stars were dancing around him. His whole body appeared blurry, as if his form was being obscured by purple clouds.\n\nSome strange power was at work, but Han Sen couldn’t tell what it was. It felt so mysterious and difficult to understand.\n\n“I wonder what this does,” Han Sen wondered, intrigued. He swung the tool at the stone wall, and the purple starlight struck the rock.\n\nBut the stone wall didn’t move. Not a speck of damage was inflicted, and the purple stars were gone.\n\nEveryone looked closely at the stone wall. They thought that some sort of change would happen eventually, but after a while of waiting, the wall looked the same.\n\n“Is it over?” Ning Yue asked in disbelief.\n\n“I think it is over,” Han Sen said as he looked at the purple copper jian weirdly. He didn’t know what all that had been about. The jian had been brimming with power earlier as it repeatedly blew them to hell. But now, when he swung the jian himself, nothing occurred. It was very strange.\n\n“It must hold something other than destructive power. It should have another function, if we can figure it out. I wonder what element it is associated with,” Gu Qingcheng said with a frown.\n\nHan Sen thought the same thing, but he couldn’t tell what element was associated with the purple copper jian. Han Sen used his Dongxuan Area and the Purple-Eye Butterfly to examine it. He could see the universal cogwheels spinning within the jian, but the universe cogwheels were different from anything that he had seen before. He couldn’t discern what element they were.\n\nHan Sen tried to use the jian’s power a few times, but it didn’t seem to do anything. Han Sen’s attempts to attack the wall were failures, and when he brought out a book and swung the jian against it, nothing happened there either.\n\n“How weird. This jian doesn’t destroy anything. That is rare,” Elysian Moon said.\n\n“White Tiger, are you sure this jian has the power to destroy the monsters out there?” Han Sen asked the white tiger.\n\nThe white tiger returned a vigorous nod, and then it growled encouragingly at Han Sen. It began to run back up through the tunnels, hurrying Han Sen to slay the monster.\n\nHan Sen had his doubts, but he had no choice. Taking the purple copper jian with him, he began to run toward the surface. He would try to kill the monster with it. If he failed, he could escape and return underground with ease.\n\nWhen they saw the white tiger coming, Fang Qing Yu and the others were given a shock. They all scattered and tried to run away. But when they saw Han Sen behind the tiger, they breathed a sigh of relief. Han Sen, however, didn’t have the time to spare talking to them. He allowed them to stay there while he continued to follow the white tiger up through the tunnels.\n\nWhen they emerged, snakes were everywhere. Their numbers were unimaginable. Han Sen looked around, and he saw that the whole landmass had been swarmed by the snakes.\n\nThere was a small part of the island that still had a few intact mushrooms, but it looked as if it would not be long before the snakes ate those, too.\n\nThere were already a few smaller snakes turning into monsters. The big monster was still gorging on mushrooms, and its body was starting to change.\n\nThe black body suddenly looked like a rainbow crystal. The silk-like tentacles shone with refractive clarity. It looked very weird.\n\nHan Sen slashed the jian at the snakes upon the ground, and it achieved nothing. When the purple light hit the snakes, it produced the same result as when it hit the stone wall. Nothing happened.\n\n“Can this thing really deal with the big monster?” Han Sen wondered.\n\nThe white tiger meowed loudly at Han Sen. It was hurrying him to fight the big monster.\n\nHan Sen had to try, so he gritted his teeth and summoned his peacock king’s soul robe. Then, he flew toward the big monster.\n\nBefore Han Sen reached the monster, it sensed his approach. It turned around and looked at Han Sen. Its body looked like a transparent crystal silkworm, and its hair-like tentacles were wriggling frantically.\n\nThe tentacles formed together to create wings and a shell to protect the monster. From within its shielding, the monster kept a wary eye on the purple copper jian in Han Sen’s hand.\n\nHan Sen saw it and thought, “It looks like this monster is afraid of my purple copper jian. Maybe the jian will finally do something?”\n\nSetting aside his hesitation, Han Sen used the jian like he would a knife. He used Fang to slash the monster.\n\nThe monster didn’t use the tentacle shield to block the purple light. Instead, it flapped its wings to evade the strike completely.\n\nHan Sen smiled. Before, the monster had felt no need to dodge attacks from him or the little red bird. The enormous creature had simply absorbed their attacks with no ill effects. If it was now putting in the effort to evade the jian, it must have been afraid of the purple light.\n\n“You are afraid! This will be easy,” Han Sen said as he continued to swing the jian.\n\nHe used his Under the Sky knife skills, and several purple lights became knife silks that covered the whole monster.\n\nThe monster was unable to dodge the purple light completely, and it raised its tentacle shield to block the portion of the light that it couldn’t evade. When the tentacles came into contact with the purple light, it was like ice being thrown onto smoldering charcoal. The tentacles melted, and the purple light went clean through. When the light touched the monster, it left a deep wound behind.\n\nThe monster gave a weird, high-pitched scream. Han Sen was surprised to find that where the monster had been hurt by the purple light, the tentacles couldn’t come back to patch up the damage.\n\n“It works!” Han Sen was exultant. The purple light continued to shine as it headed for the monster.\n\nThe purple light didn’t deal damage to anything except the monster. The monster had once seemed invincible, but now it was defenseless before the purple copper jian. It shrieked as the purple light tore its body apart piece by piece.\n\nThe monster no longer seemed interested in eating the mushrooms of the island. It turned around, intent on returning to the depths of the black sea. Han Sen teleported next to the beast, though, and he continued to strike it with the jian. The monster’s form was corroded pretty badly, and as its body started to rot, dead tentacles were strewn over the ground.\n\nThrough the corroded holes, Han Sen could catch a glimpse of the interior of the monster’s body. There was a transparent crystal core inside. It looked like a soft, transparent version of a human head.\n\nHan Sen waved the jian, and the purple light struck the crystal core. The crystal core broke and oozed some sort of sticky liquid.\n\nPang!\n\nWhen the crystal core broke, the monster’s body exploded. The body and the tentacles liquified instantly.\n\nHan Sen froze. He hadn’t heard the hunting announcement. He didn’t hear a single word about a xenogeneic gene nor anything about a beast soul.\n\nThe snakes never dropped any items, either. Han Sen had thought they were a part of the big monster and that killing the big monster would yield a xenogeneic gene and beast soul. However, destroying the big monster had given him nothing."
}