{
    "chapter": 1690,
    "title": "Laboratory",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1690",
    "text": "Old Cat was shocked. He leaped down from the tablet and ran toward Han Sen.\n\nBut the glove had pulled him away too quickly, and by the time Old Cat reached the spot Han Sen had been in, he was gone. There were some broken buildings and paths ahead, but Old Cat wasn’t sure which one Han Sen had taken.\n\nOld Cat stopped. He looked around and sniffed what he could before deciding on a trail to follow.\n\nHan Sen had been dragged deeper into the ruins by the glove. His legs were simply dragging, leaving two trenches in the ground for a wake. Still, nothing stopped the force that pulled him along.\n\nHe was taken into a broken building, and after a few twists and turns, the glove drilled into another building’s entrance that was half-buried by rubble.\n\nIt was dark inside there, and Han Sen couldn’t tell what was around him. He felt very nervous, though, being dragged in the way he was. But that nervousness did not lead to panic. He’d been through a lot, and he’d had a lot of experience with dire and uncertain situations.\n\nHan Sen fumbled around the dark with his free fist and hit something. The item was shattered, whatever it was, but the glove did not stop pulling him onwards.\n\nHe broke a few more items after that, but eventually, the glove stopped.\n\nThe place was dark and still. There wasn’t a sound to be heard.\n\nThe glove was ahead of Han Sen, and then it jerked him forward and up so that he was standing up straight\n\n“Why did this thing stop here? Is there another glove here?” Han Sen wondered to himself. He swung his left hand and ignited a flame upon it to use as a torch.\n\nIn front of Han Sen was a dried-up corpse that was staring right at Han Sen.\n\n“Argh!” Han Sen screamed, wanting to fall back. But the glove held him firmly, and no matter how he tried to resist and move away, his arm remained still.\n\nAfter Han Sen calmed-down from the sudden surprise, he noticed it wasn’t moving. There was no lifeforce, and it was very dead.\n\nThe body was sitting on a chair, with its clothes all rotten and its skin dry. It was very complete, though, and it looked like some zombie in the dark.\n\nHan Sen looked around and noticed it was a crystallizer room. There were crystallizer tools everywhere, far more than he had seen in the main control room. It made Han Sen feel as if he was standing in a lab.\n\nAside from the tools, though, Han Sen spied the presence of a number of crystal containers. They were full of liquid, and things were soaking inside.\n\nThere were animals, livestock, plants, even things Han Sen had never seen before.\n\n“Is it just as Old Cat said? Is this a greenhouse? A laboratory in their base?” Han Sen thought. But then, his right hand moved, and it started to drag him forward again.\n\nHan Sen was being brought towards the dead body that was slumped in a chair. The glove began feeling around the corpse, as if it was searching for something.\n\n“Sh*t! Is this thing a necrophiliac?” Han Sen felt depressed, but fortunately, nothing really messed up occurred.\n\nAfter a while, the right hand found something inside a tattered pocket. It pulled it out.\n\nBecause his hand was being controlled, though, Han Sen was unable to see what it was. Then the hand returned to his chest, Han Sen felt like he could control it again.\n\nAnd Han Sen could feel himself holding something hard like a chestnut.\n\nHan Sen took a peek and was shocked. It was like a seed, and it was smaller than a ping-pong ball. It was dark grey, with a green sproutling on it. It had a circumference of around three centimeters.\n\nHan Sen had assumed that the glove was like the crystal shoe, in search of another glove to complete the pair. He hadn’t expected it to have been searching for a seed.\n\n“Does it want to grow another glove?” Han Sen wondered. The glove had done him no harm, ultimately. And the glove had now given back control to Han Sen.\n\nWanting to look around now, Han Sen pocketed the seed. He could not read the text that adorned the tools of that place.\n\nBut what concerned him the most were the items inside the crystal containers.\n\nThe containers looked similar to the one Stay Up Late was found inside, but the liquid was certainly different.\n\nStay Up Late had been soaking in a colorless liquid. But in that place, the colors ranged from yellow, to green, to even blue. Some were plain and transparent, too.\n\nHan Sen had a look. Anything could have been inside them. Some included armor and helmets.\n\nStill, everything he saw seemed broken and twisted. It gave Han Sen the impression that they were not yet complete.\n\n“It looks like these might be failed products,” Han Sen thought, right as his eyes grew wide and bright\n\nThere was a container with transparent liquid, and inside it there was a humanoid creature that looked both male and female. It had white wings, and it looked like an angel.\n\n“It looks like Little Angel, but this one seems genderless.” Han Sen observed the angel-looking creature, and then looked down.\n\n“It has no penis. Maybe this thing is a failure, as well.” Han Sen saw the person was very smooth down below, and due to it not having any gender-specific parts, it could have very well have been a failure, he believed.\n\nAfter Han Sen looked down, he looked up. But right at that moment, the angel creature opened its eyes.\n\nThe eyes opened wide, but there were only pupils there. It wasn’t like an ordinary creature. The red pupils consumed the whole eye, but turned to gaze right at Han Sen.\n\nHan Sen was shocked, and so he started walking backward slowly. The red eyes followed him wherever he moved. The head turned like a robot.\n\n“I can’t be this unlucky!” Han Sen felt glum. Crystallizers made weird stuff, and that thing inside the container didn’t look too friendly.\n\nOld Cat appeared in the lab, and after he saw the angel inside the container, he shouted at Han Sen. “Run! It’s a Feather!”\n\nHan Sen did not react. The angel-looking creature burst through the container, and then the creepy and beautiful body came forward to grab him."
}