{
    "chapter": 945,
    "title": "The Unseen Shooter",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_945",
    "text": "\"She is Thorn Baron! Hmph, I suppose that rules out my use of the red dagger. If she sees that, she'll recognize me.\" Han Sen was glad he had decided to bring a bow.\n\nAfter opening his second gene lock, Han Sen's dongxuan aura had improved a considerable amount. Its effective radius had greatly increased, and it now allowed Han Sen to inspect and observe every member of Thorn Baron's team.\n\nThe team was massive. A royal class spirit accompanied Thorn Baron, and seven mutant class creatures encircled him.\n\nThere were three hundred primitive creatures in Thorn Baron's company, all in all, and even with the Dragon-Blood Snake on Han Sen's side… If they were to triumph, it would be a hard-fought victory.\n\n\"It is lucky I came out here to scout. I may have gotten everyone killed, had I chosen to remain in the shelter waiting for all this to descend upon them.\" Han Sen continued observing the creatures.\n\nHe knew he'd have to start taking them out, thinning the herd before they arrived at the knight shelter. All he would have to do was wait for the right opportunity to start doing so. Spirits would respawn, so killing the creatures would be the best course of action, since it dealt permanent damage to the strength and integrity of the enemy horde.\n\nHen Sen spent time looking at the seven mutant creatures the baron had brought with her.\n\nA gold-winged hawk was one of them, and it flew high above the rest, as if in airborne defense. Its eyes flickered with gold lightning, as its body glistened in the warm rays of the sun.\n\nIt was a powerful thunder class mutant creature, in terms of the damage it could deal out. Han Sen, however, could gauge the strength of its defense and tell that it had a weak body. It was like a glass cannon.\n\nIts weakest spot, Han Sen could detect, was a furry section on its chest. It was even less sturdy than the plated wings.\n\nHan Sen remained hidden for the time being, clutching the bow he had borrowed from Annie. He summoned his Flaming Arrow and nocked it on the string. Having prepped himself for dealing with the host of creatures he would engage solo, he pulled the string back.\n\nHan Sen suddenly felt very heavy. He had to exhaust all his strength in preparation of firing the bow.\n\nThe bow was aimed at the exposed spot of the gold thunder-hawk's chest, and the moment it spread its wings to reveal it clearly, Han Sen loosed the arrow.\n\nWithout making a sound, the arrow glided towards its target without drawing any attention to its presence. It pierced directly through the hawk's chest, causing it to gush blood in a cascade to the ground below.\n\nThe hawk cried out, fell to the earth, and after a few futile flaps of its wings in an attempt to return to the skies, died.\n\nEveryone and everything that accompanied Thorn Baron saw it happen and were dazed. The baron herself was shocked, seeing one of her most prized creatures suddenly assassinated.\n\nThe creatures and spirits all peered in the direction they believed the arrow had come from, and without hesitation, the baron barked an order for them to annihilate the hidden assassin.\n\nWhen they arrived in the area where they suspected the arrow had come from, there was no one there. No sense or lifeforce revealed the presence of an enemy in that place.\n\n\"Mutant Creature Gold Thunder-Hawk killed. No beast soul gained. Consume its flesh to gain zero to ten mutant geno points randomly.\"\n\nBefore Han Sen could even hear the announcement chime, he had already vanished from the area.\n\nHe was not afraid that others could find him, as he was able to erase any indication of his lifeforce and even the precise trail of the arrow. Unless they could see the arrow, no one could detect where he might have attacked from.\n\nHan Sen used the skill Cold Arrow, which masked the flight of an arrow and made it incredibly difficult for people to deduce where the attack originated. If he had not done this, he might not have been able to kill the creature without catching its attention and giving it a chance to evade.\n\nHe thought it was a shame he could not retrieve the dead body, though.\n\nWhen Thorn Baron noticed that the hawk had been murdered, Han Sen was already long gone.\n\nHe simulated the powers used by Qu Lanxi and masked his scent. Although he wasn't as proficient at it as she was, it was still good enough to mask the scent of one person.\n\nEven mutant creatures that were of the same level as Han Sen would not be able to detect him.\n\nAnd the creatures that were naturally talented in detecting scents and lifeforces were unable to detect Han Sen due to his dongxuan aura.\n\nLike a ghost, Han Sen weaved his way between the trees. With his bow raised, the Flaming Arrow was nocked and ready to fire again.\n\n\"How can there be no one there?!\" Thorn Baron frowned.\n\n\"Roar!\" As Thorn Baron mulled what phantom might have decided to attack them, she was suddenly interrupted by the cry of another creature. An arrow of fire had pierced through Gold-Talon Wolf's left eye.\n\nIt writhed around in agony as the arrow vanished into thin air. Blood flowed out of the annihilated eye socket in a gruesome stream.\n\nIt wasn't dead yet, but it would be soon.\n\nThorn Baron looked angry, and she herself raced towards the area where she believed the arrow had come from.\n\nBut when she reached there, as reported by others in the first location, there was no one to be seen. No lifeforce could be detected, and it was as if her team was being assassinated by a ghost, one by one.\n\n\"Who is this? Who is out there? Reveal yourself! Quit hiding in the foliage like a rat and face me. Allay your cowardice for a time and fight me like a real warrior!\" Thorn Baron exclaimed to the trees, but was met with no response.\n\nRoar! A primitive class beast was killed.\n\nThorn Baron's formation of creatures descended into anarchy and chaos. They looked around for their phantom aggressor, but it could not be found.\n\nSpirits and creatures searched high and low, but they were jittery, each fearing that they might be the next to greet the murdering arrow.\n\nKatcha!\n\nAnother arrow was fired into Gold-Talon Wolf's right eye. The same fire arrow that had initially dropped it had returned to finish the job.\n\nA few creatures leapt to where they believed the arrow had come from, but there was nothing to be found.\n\nThe spirits and creatures were terrified, as if the reaper himself was playing some game with them. They did not know who would be the next to go or when they would be taken.\n\n\"Mutant Creature Gold-Talon Wolf killed. Beast soul gained. Consume its flesh to gain zero to ten mutant geno points randomly.\"\n\nWhen the wolf died, the announcement played inside Han Sen's head."
}