{
    "chapter": 1283,
    "title": "Skts of Yore",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1283",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“You’re serious? You want to challenge me?” Xie Yuxin was legitimately surprised.\n\nWAA was the top warframe league across the entire Alliance. Those who were eligible to compete in such a league were the best of the best; true professionals in every sense of the word. They might not have received much fame, but that was no slight to their talents.\n\nHan Sen put Bao’er on his shoulder and said, “If Bao’er made this deal, I’d be foolish to turn this down. I wouldn’t want to disappoint her.”\n\nA young man then stepped forward to ask Han Sen, “You know what the WAA is, don’t you?”\n\nHan Sen shook his head to tell them he didn’t. Aside from those who were invested in the warframe community, it was not likely people would know about each league there was.\n\nHan Sen spent most of his time in the sanctuaries, so he genuinely had no clue as to what the WAA was.\n\nXie Yuxin, and all who followed her, were given a shock.\n\n“Might I ask, where did you learn to operate a warframe?” Xie Yuxin nervously asked.\n\n“Oh, let’s see… I think it was during my time in the military school,” Han Sen said.\n\nEveryone was becoming breathless with their repeated gasps. The crowd that had come now looked amongst themselves, all with looks of confusion on their faces. What Han Sen had just told them was basically the equivalent of learning a sport through what you’ve seen on the telly.\n\n“We’ll go to the holographic room. There’s no need to make use of real warframes. We like Bao’er,” Xie Yuxin said.\n\n“Okay.” Han Sen then turned around and asked Ji Yanran and Zero, “Would you two like to wait here, or would you like to come and watch?”\n\n“We’d love to go!” Ji Yanran exclaimed, pulling Zero roughly by her arms.\n\nEveryone promptly went to the holographic room. The opponents took their positions.\n\nXie Yuxin winked to Bao’er and said, “If your father loses, you are ours.”\n\n“My Daddy-o won’t lose,” Bao’er said, emotionlessly. Her flat tone was almost creepy.\n\n“Bao’er, I would like you to remember this word: professional. That’s what I am.” After that, Xie Yuxin entered the holographic machine.\n\nHan Sen then passed Bao’er over to Ji Yanran. After that, he entered the holographic machine. After the two entered the battleground, the lobby displayed a screen for all spectators to watch.\n\n“Go Dad!” Bao’er shouted, in support of Han Sen.\n\nBao’er then punched the palm of her other hand, proclaiming, “When I win, all that candy will be mine!”\n\nEveryone in the lobby had gathered around to watch. Then, another woman appeared there, wearing sunglasses.\n\n“Shaoqing, why are you here?” The woman looked shocked at seeing everyone there.\n\nA young man turned around then and asked, “Why have you come here, sister?”\n\nHearing Yu Shaoqing call her sister, everyone turned to look at her.\n\n“Is that your big sister? Is that our idol?” another young man asked.\n\n“How many sisters do I have?” Yu Shaoqing said, with a long roll of his eyes.\n\n“You’re Yu Qianxun?” Everyone gasped in shock.\n\nThe woman took off her sunglasses, revealing herself to be the ace operator that she was.\n\nYu Shaoqing was a professional, but even he could not compete with the talents of Yu Qianxun.\n\n“What are you doing here?” Yu Qianxun asked.\n\nYu Shaoqing explained what was going on, which prompted Yu Qianxun to then ask, “Why are you trying to hustle a random person?”\n\n“The little girl is too cute. We want to spend some time with her! We told her father we’re from the WAA, and yet he still agreed,” Yu Shaoqing pleaded in defense.\n\nYu Qianxun did not say anything more, as the match was about to begin.\n\nShe was shocked, seeing Han Sen’s warframe.\n\n“SKTS? Who uses an old model like that in this day and age? I’m surprised that thing is not a rusted mound of bolts and scrap.” Yu Shaoqing wanted to laugh, but he noticed something, and then went on to ask, “Sister, didn’t you advertise this model?”\n\n“Yes. It has been many years since then,” Yu Qianxun said.\n\nShe had done many adverts for super warframes in the past, but the SKTS was the only model she had not operated herself.\n\nShe sighed and then said, “It is a shame this guy did not take a career as a warframe operator. He’d be a legend.”\n\nYu Qianxun seemed to take great interest in the fight that was about to unfold, and so she watched the screen intently.\n\nXie Yuxin recognized Han Sen’s warframe and identified it as the supremely outdated SKTS. This did not boost her confidence, though. She was humble enough to realize she had underestimated her opponent.\n\nBut she herself was using a Sky Warrior, a model that was, for all intents and purposes, better than the SKTS.\n\nThe SKTS did not have much in terms of weaponry and firepower, so even though its infrastructure was weaker and more fragile, it wasn’t as if it made up for it with greater damage output.\n\nShe wanted to showcase her agility, so she pulled out her laser sword and ran forward.\n\nHan Sen had not operated a warframe for a while, so he chose to use the old SKTS. After all, it was the model he was most comfortable with and knowledgeable about. Han Sen moved around and got into the groove of its use again, despite acknowledging he was still quite rusty.\n\nFortunately, Han Sen had a high fitness. So, any bumps he took as he got comfy with the SKTS again were no big deal.\n\nHan Sen laughed, seeing his opponent come at him with a close-quarter combat weapon. It surprised even him that she did not seek to use ranged weaponry.\n\nIf she was a real soldier, she wouldn’t behave that way. The warframes of the Alliance were mostly for show, so range was favored in almost every way. It was strange how she wished to showcase her talents and impress the audience through close-quarter combat."
}