{
    "chapter": 2874,
    "title": "Maha God Elephant",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2874",
    "text": "Han Sen hastily appeared on the space battleground. He saw a red, giant elephant also appear across the distance of space between them.\n\nThat giant elephant was all red. Its body had a burning red flame. If one went to feel it, one would notice that the blaze did not have a temperature.\n\n“Roar!” Maha God Elephant’s trunk lifted. The crystal-looking, fiery, crystal stone elephant teeth were also lifted.\n\nHan Sen reached out with his hand and had his Sky Vine Radish God Lance appear in his arms. In the next second, Han Sen teleported directly before the Maha God Elephant. The Sky Vine Radish God Lance was thrust into Maha God Elephant’s flesh. The tip of the lance plunged into the elephant’s tough skin. As Han Sen pushed it in, he felt the muscles inside the elephant were like beef tendons. They were very tough. The Sky Vine Radish God Lance only had its tip pierce into it. It was difficult trying to push it deeper in.\n\n“That’s a very tough body. No wonder it was able to reach the top 20 as a true god xenogeneic.” Han Sen was shocked. Before the elephant’s trunk came at him, Han Sen pulled the lance back and leaped away.\n\nMaha God Elephant had a massive amount of power. He was able to hit a true god body with a might other true gods would not even attempt to block. Han Sen was only a butterfly, so he did not want to get hit.\n\nAfter the Sky Vine Radish God Lance was pulled out, the wounds did not drip with god blood. A sapling was growing, but it did not grow fast.\n\nThe god elephant’s red lights were burning. The wound where the sapling had appeared quickly healed. The saplings were like little tufts of grass weaseling their way through a wall stone. They tried their best to squeeze through the gaps. It was so hard that it was like fighting the sky. They did not get squeezed to death, but it was hard for them to grow.\n\n“If one hit won’t work, then I will have to give it many more.” Han Sen’s body flashed like a ghost. He kept appearing in front, at its back, and to the left and right of the god elephant. At the same time, the Sky Vine Radish God Lance in his hands flashed like thunder. It kept striking the god elephant’s flesh. Before the god elephant’s elephant trunk got close, Han Sen could easily flash and bolt over to another location.\n\nThere was infinite power when using the Sky Vine Radish God Lance. It left one hole and another hole on the god elephant. Every hole creating saplings growing from the wounds. Even though the god elephant’s flesh was extremely sturdy, and it was running under the bounty of the powerful healing fires, its body had many saplings growing all over it like a layer of green hair. But the saplings were having great difficulty growing. They were squeezed by the god elephant’s flesh, almost to the point of death.\n\nHan Sen thought, “Any true god xenogeneic in the top 100 is hard to deal with. If I could become true god, I could use my own power to rip its body to shreds before it healed once. Now, I need the Sky Vine Radish God Lance power. Even so, it is still really difficult.” His hands did not stop. The lance’s green lightning kept striking the god elephant’s body. It left many saplings behind in its wake.\n\nIt looked like he had the advantage, but it was still hard to damage the god elephant.\n\n“Maha God Elephant’s healing power is too effective. It is no wonder it is the xenogeneic that represents life. Even god personality armaments cannot kill it.”\n\n“It looks like Dollar is in trouble.”\n\n“He could pick anyone, yet he decided to challenge the Maha God Elephant. If he selected a higher rank xenogeneic, he would have killed it already.” The audience was talking. Sky Palace Leader was laughing and saying, “It looks like Dollar underestimated Maha God Elephant’s defense and healing powers. This is the xenogeneic with the best life element. Although the god personality armament is a weapon, it is plant-based. Normal creatures might be able to be killed easily by it but killing the Maha God Elephant with it will not be easy.”\n\n“It is a shame the Maha God Elephant is very grumpy and proud,” the woman said with a sigh. “If we could tame it to protect the palace, we could have a true god join our forces.” “Although that guy is living in Ancient God’s holy place, it has been living in the Sand Lake,” Sky Palace Leader said with a laugh. “No one can do anything there. Even the Ancient Gods cannot do anything there.” “Fortunately, its healing power is strong and supremely powerful,” the woman said. “It is very clumsy, though. It can easily be tricked by geno arts. It is good enough to be a guard but not enough to be a warrior.”\n\n“Maybe not. With it here, it will be like a needle in the sea. It would be hard for it to die. It would be very useful for fighting in a xenogeneic space.” Sky Palace Leader sighed and said, “But it keeps guarding Sand River. It won’t work for anyone.” Han Sen realized he had underestimated Maha God Elephant’s power. Killing it with the Sky Vine Radish God Lance was not easy.\n\nIf Han Sen had selected it, he was prepared. He retreated and stopped attacking Maha God Elephant.\n\n“He is so strong. Even Dollar, who has a god personality armament, cannot do anything.” “Is he going to give up?” “I do not think so. Dollar still has that eye skill that judged Sky Armor God.”\n\n“You are right. It looks like we can see the scary judgment power again.”\n\nEveryone wanted Han Sen to use the eye of law. Han Sen had seen that although the Maha God Elephant looked very red, in the eye of the law, it was white like a sheet of paper. It did not have any level of crime. Using the law eye would not work on it.\n\nMaha God Elephant saw Han Sen leave, but it was not planning on chasing him. He provoked him by raising its trunk and screaming a lot of taunting noises. Its body was full of green saplings, but it did not care. It was like the saplings did not affect him.\n\nHan Sen laughed. “You were cocky too soon.”\n\nHan Sen put the Sky Vine Radish God Lance away. His thumb and middle finger on his right hand came together. A gold light was shining in between them. It created a gold coin.\n\nHan Sen was holding a coin. He did not move. He watched the number on the coin keep jumping up. 1… 2… 3… 4… 5… 6…\n\nAs the number on the coins jumped, Han Sen’s presence became scarier. It was like he was a bomb brewing and about to explode.\n\nMaha God Elephant realized something might have been wrong. It roared and used its four legs to run at Han Sen. At the same time, its elephant trunk was like a pillar that opened the sky. It created a scary red light that tried to break Han Sen.\n\nSeeing Maha God Elephant in front of him, Han Sen did not dare use his own body to block its attack. Maha God Elephant suddenly bounced the coin away.\n\nBzzt!\n\nThe coin created some gold light in space. It hit Maha God Elephant’s forehead. It gathered up all the way to 13 times the power. At that point, the coin was like a heavy hammer. It shook the Maha God Elephant, which was running away.\n\nHan Sen thought, “It is a shame I am just butterfly. If I was true god, that would have been Saving Money times 13. It would turn his body into dust.”\n\nMaha God Elephant madly roared. It wanted to run at Han Sen again. It was too slow. It was like it was carrying a mountain."
}