{
    "chapter": 2728,
    "title": "Can’t Even Be a Son",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2728",
    "text": "The Six-Eared Macaque was deified, and Han Sen wasn’t being supported by any treasures. In the eyes of the monkey, he was a barebones half-deified. The monkey didn’t bother dodging Han Sen’s strike, and so Han Sen’s attack swept over it. The monkey had become too eager with the thought of tearing Han Sen to pieces.\n\nBut when the Xuan Yellow Sutra’s power came upon it, the Six-Eared Macaque’s body shook. Its blood-pulse reversed, and its power just disappeared. Its body and fur were changing, shriveling as if it was dying.\n\n“What is going on here…” The Six-Eared Macaque saw its body withering away, more and more. It looked horrified.\n\nHan Sen didn’t answer. He calmly looked upon the Six-Eared Macaque.\n\nThe changes to the Six-Eared Macaque’s body became stronger and stronger. Its gold hair that shone like a sun suddenly dimmed, and its gold eyes no longer had their shine.\n\nAnd then there was a weird snapping noise. The Six-Eared Macaque’s substance chains fell apart. In a moment, it went from deified to King class. It still had half-deified power, but it was much worse than it had been before. Previously it had been high in the sky, but now it was on the ground.\n\n“This… how can this be possible?” The Six-Eared Macaque’s eyes were wide with terror. It couldn’t believe it had become King class.\n\n“You… what did you do to me? What sort of trick have you used on me again?” The Six-Eared Macaque snarled, then it spun toward Han Sen.\n\n“Monkey, did you know that I have a title here in this universe?” Han Sen asked, smiling at the Six-Eared Macaque.\n\n“I don’t give a wet fart about your title. What trick did you use on me?” The Six-Eared Macaque kept jumping around and shouting, but it didn’t dare to attack Han Sen again.\n\nOne strike had reduced him to a lowly King class being. He never imagined such a thing was possible. He was now quite scared of Han Sen. He didn’t dare to attack Han Sen again.\n\nHan Sen ignored the squealing of the Six-Eared Macaque. He laughed and said, “In the universe, people call me the Father of God. Do you know why I earned this title?”\n\n“How do I… God’s Father? You are so cocky…” Upon hearing Han Sen’s title, the monkey looked even more annoyed.\n\nThat monkey was deified, but Han Sen seemed to be claiming to have a higher rank. It was clear that the monkey didn’t agree with him.\n\nHan Sen looked at the Six-Eared Macaque, and with a disdainful tone of voice, he said, “The people in the universe call me God’s Father because deified elites are like children before me. I let them become my sons and daughters, if they are qualified. If I don’t permit a man to become my son, then his best hope is to become my grandchild. Just like you. You aren’t qualified to be my son.”\n\nThe monkey was frozen. He wished to say something, but when he thought of how Han Sen’s strike had reduced him to King class, what Han Sen said seemed to make sense.\n\n“I don’t care. You must have used some sort of trick on me… If you think you have what it takes…”\n\n“Shut up!” Han Sen hissed coldly, cutting the monkey off. He stared icily at the monkey and said, “I saw that there is talent in you, and I wanted to keep you alive, but you still didn’t appreciate my mercy. Do you really think I won’t kill you? The gods, in my eyes, are a bunch of rubbish. I let them live. They live. If I want them dead, they die. I let them be gods. If I am not happy, the gods are mere toys to me.”\n\nAfter that, Han Sen’s body shone with a godly light. He raised his hand, ready to kill the monkey.\n\nThe Six-Eared Macaque was very scared already. Now, it was super scared by the might of Han Sen. It shivered violently and shouted with fear, saying, “Don’t kill me! I’m willing to obey…”\n\n“Don’t worry about it. There’s no need to push yourself.” Han Sen glared at the Six-Eared Macaque. His hands rose, ready to kill the creature.\n\nThe Six-Eared Macaque quickly said, “I’m not pushing myself. I’m really not pushing myself… It would be a glorious thing to follow an elite like you! Can you return me to deified class?”\n\n“That isn’t difficult. Come over here.” Han Sen looked like a god as he stared down on the Six-Eared Macaque from above.\n\nThe Six-Eared Macaque looked hesitant and unwilling to come close to Han Sen.\n\n“If I wanted to kill you, all I would need to do is raise my hand. It wouldn’t be that difficult.” Han Sen looked at the fiend with disdain.\n\nThe Six-Eared Macaque forced a smile. “No, no… I’m not suspicious of your intent…”\n\nThe Six-Eared Macaque ran over to Han Sen. Its body was half the average height of a human’s, and as it stood before Han Sen, it looked like a little kid.\n\nHan Sen looked at it and raised his hand. He touched its head like a godfather and said, “I… Han Sen… by the name of all gods… give you eternal holy power… open the door of destiny…”\n\nHan Sen made up a bunch of nonsense that worked well to bluff the Six-Eared Macaque. It had no idea that Han Sen was just wasting time and putting on a show. Han Sen just needed to wait until the effects of the Xuan Yellow Sutra wore off. Then, the Six-Eared Macaque would be deified again. Han Sen wouldn’t even need to use the Blood-Pulse Sutra. He just randomly cast a light on the Six-Eared Macaque’s head.\n\nHan Sen calculated the time and slowly spoke his fabricated blessing. By the time he was done, the Xuan Yellow Sutra’s power had disintegrated. The body of the Six-Eared Macaque changed again.\n\nThe Six-Eared Macaque saw Han Sen’s power inside its body, and it felt its body change. It quickly became deified again, which filled the creature with joy and relief.\n\nIt was so happy to be deified again. And it was scared of the man before it. He could reduce or raise the monkey’s level on a whim.\n\n“This guy is too scary. It looks like it might be true that he is some sort of Father of God. He might be King class, but I am inferior to him in every way. I can’t fight him. For a while, at least, I need to stop trying to beat him,” the Six-Eared Macaque tried to comfort itself. It was terrified, and it no longer dared to fight Han Sen.\n\nWhen the Six-Eared Macaque was back to deified class, it immediately kneeled before Han Sen and said, “I’m willing to follow you, now and forever. I hope you let bygones be bygones and are still willing to take me under your wing.”\n\nWhile its mouth spoke, in the Six-Eared Macaque’s heart, it was saying to itself, “Let me find out your true self. Then, I will find a chance to escape this trap and maybe even kill you.”\n\nHan Sen could discern what the Six-Eared Macaque was thinking, but he didn’t confront the beast. He coldly said, “You should think this through. Once you start following me, there is no chance for regret.”\n\n“I have thought about it. I will only follow you for the rest of my life, and I will only ever pledge allegiance to you,” the Six-Eared Macaque said dramatically, but his true intent was the opposite.\n\n“Get up and tell me your name.” Han Sen allowed the Six-Eared Macaque to stand up.\n\n“I am the Six-Eared Macaque. I do not have a name,” the creature said.\n\n“In that case, I will give you a name.” Han Sen fell silent for some time, and then said, “Since you are a monkey deified xenogeneic and a Six-Eared Macaque, I will call you Little Number Six.”\n\nThe Six-Eared Macaque froze when it heard Han Sen’s grand pronouncement. Its heart complained, “That is a crap name! He was quiet for so long, and he ended up giving me such a childish name.”"
}