{
    "chapter": 2943,
    "title": "One Life Is Too Short",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2943",
    "text": "“Deified gene +1.”\n\nHan Sen’s brain had the geno increase announcement playing, but he did not care about it. In the next cycle, those points would be out of his system.\n\nQin Xiu drank all the wine. He put down his wine cup and said, “It is a shame that this body is just a spirit. I cannot drink a lot with you. I do not have much time. After I am gone, the holy garden’s time and space loop will end. You can use this statue to go to the back door. Then, you can reach the holy palace.”\n\nAfter that, before Han Sen could say anything, he turned around to look at Nine Thousand King, who was repeatedly slapping himself in the face while kneeling before the stone pavilion. His face was going to break.\n\n“Number 9, from now on, you will follow Mister Han,” Qin Xiu coldly said. “If he wants you to live, you will live. If he wants you to die, you will die.”\n\nNine Thousand King was shocked. He did not dare think about it. He just immediately answered, “Yes, I understand.”\n\nQin Xiu said that, but he did not even look at Nine Thousand King. He looked at Han Sen. His eyes looked as if the man could see through his lungs.\n\nQin Xiu sighed and said, “It is a shame that this life is too short, and I could not take care of you.” He looked at Han Sen. His body had a holy light leak out from it.\n\nAs the light was fading, the lifeforce on the statue became weaker. The body started to look like jade.\n\nThe jade statue was looking smaller. After a while, the jade statue had no more lifeforce. It became a doll that landed in Han Sen’s hands.\n\nHan Sen was holding the jade statue. The holy garden felt a little different, but he could not tell what was different about it.\n\nNine Thousand King stood up and looked around. He had gone crazy. He started running toward the holy garden’s door. This time, when he ran out, he did not reappear via the back door. He was actually able to stand outside the door.\n\n“The Sacred power has been extinguished.” Nine Thousand King was surprised and happy. When he looked at Han Sen, conflicted emotions shone in his eyes.\n\n“How is this kid connected to the leader? What was the last thing Sacred Leader meant? Why did he say that?” Nine Thousand King kept thinking about what had happened.\n\n“The restrictions of the holy garden are already gone. It is best that we leave.” Han Sen waved his hand. He picked up the stone pot, wine bottle, and cups.\n\nBefore, there was Sacred power covering those items. No one was really able to consume the food and the drinks there. Now, things were different. Han Sen was not going to let the opportunity pass him by.\n\nAfter picking up the items, Han Sen held Bao’er. He called the goldfish family forward to take them to the back door of the holy garden.\n\nQin Xiu had said that the back door would enable him to reach the holy palace. That must have been the Sacred race’s hall. Han Sen was going to go there, regardless of the purpose Qin Xiu had. He had come this far, so he was certainly not going to turn back now.\n\nHan Sen had only just walked a few steps when Nine Thousand King teleported behind Han Sen.\n\nHan Sen was suddenly alerted. He looked at Nine Thousand King. He did not expect Nine Thousand King to bow to him and say, “Sacred Leader asked me to protect Mister Han. That is what I am going to do. I am going to ensure your safety.”\n\n“That was just a spirit in the image of your master. Now that the spirit is gone, there is no need for you to take it so seriously.” Han Sen did not think an old man like Nine Thousand King would be so loyal, even when Qin Xiu was not around.\n\n“How could you say something like that?” Nine Thousand King seriously asked. “I am a servant of the master. If this is the wish of the master, even if it leads to my death, I will carry out my given tasks.”\n\n“You really do not have to do that. You and I both know that with you by my side, I will be in danger,” Han Sen laughed.\n\nNine Thousand King looked serious. With a wry smile he said, “To be honest, if the master did not give the order, I would try everything I could to kill you. Things are different now. No matter how much courage I have, I will never want to bring you harm.”\n\nAfter pausing, Nine Thousand King looked sincere and said, “Believe it or not, Mister, but I would never disobey an order given to me by my master. Otherwise, the results would be worse than death.”\n\n“The spirit is gone. What can you be afraid of?” Han Sen frowned. He did not know if what Nine Thousand King said was true. Judging by the way he looked, it did not appear to be a lie.\n\n“No matter how you think or feel, I am going to do what the master told me, even if it involves me risking my life.” Nine Thousand King did not explain. He insisted on following Han Sen.\n\nHan Sen thought about how Nine Thousand King behaved when the statue moved. He knew Nine Thousand King was really scared of Sacred Leader, so perhaps this really was a genuine sentiment. It was not out of the realm of possibility.\n\nHan Sen did not say anything more. If Nine Thousand King insisted on following, he would not mind a spare meat shield. He called for the goldfish family to gather around. As he held Bao’er, they all left the holy garden.\n\nNine Thousand King knew what Han Sen was thinking, so he quickly said, “I will lead the way for you.”\n\nAfter that, Nine Thousand King went in front of Han Sen. He behaved just like a servant.\n\nAfter leaving the holy garden, aside from the two long, bright lanterns near the gate, darkness was all around. Han Sen asked Nine Thousand King, “How did you walk through the darkness?”\n\nNine Thousand King quickly and politely said, “Mister, I have the Thousand Eye Battle Armor. I can repel the dark power that seeks to consume. If we do not meet the space charm, we will not be in danger.”\n\n“What is the space charm?” Han Sen frowned.\n\n“The space charm is a xenogeneic, but it is different when compared to the average xenogeneic. This thing appears after a disaster happens to Sacred. It only exists within the darkness inside Sacred. It has incredibly scary powers. Even a top-class true god cannot fight a space charm, but the space charm only travels in the dark. A place with the long, bright lantern is a place they will not draw near.” Nine Thousand King looked at the darkness ahead and said, “It looks like the way ahead does not have long, bright lanterns. I will scout for you. If there is a space charm, you need to leave. Do not care about my safety.”\n\nHan Sen thought Nine Thousand King was honest, but he did not know if it was coming from his heart or he was just pretending. But Nine Thousand King had the Thousand Eye Battle Armor, which could repel the power of the dark. The big and small goldfish could not do the same, so Han Sen summoned the stone lantern and held it for travel.\n\nNine Thousand King saw Han Sen hold that stone lantern that could push away the darkness. It put him in awe. He thought, “This stone lantern can push away Sacred’s darkness. This kind of treasure must have come from the leader himself. I was right. The leader’s relationship with Han Sen is not something normal.”\n\nThinking of that, Nine Thousand King’s face looked weird. That was because he thought about the sentence Qin Xiu said before he departed.\n\n“It is a shame that this life is too short, and I could not take care of you.” Nine Thousand King had a strange expression as he thought, “Is Sacred Leader gay?”"
}