{
    "chapter": 2655,
    "title": "Deified Star Beetle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2655",
    "text": "Star beetles were very good at physical-reinforcement. Even a primitive deified beetle would have a shell that was considerably harder than most primitive deifieds. Even if Han Sen could make use of his peacock soul robe or his Six Core Snake Bow, punching through that shell would be no small feat. Plus, there was the added fact that he couldn’t make use of those tools right now.\n\n“Don’t even think about tackling a deified star beetle. You are better off sticking with the King class star beetles to get your star fruit.” Han Sen continued looking around for star beetles to slay.\n\nHe didn’t know where the star beetles had flown in from, but there were indeed many of them. Han Sen had been worried that the tree might not have one thousand star beetles for him to kill, but now it looked like there were at least ten thousand star beetles descending on the tree.\n\nWhen the star beetle swarm reached the tree, they spread out and landed on its leaves, branches, and fruit. Their sharp teeth began to gnaw on the star tree. And while the star tree was very hard, their teeth were sharp and hard enough to leave marks in the bark. It didn’t seem like a big deal now, but if they kept chewing the tree like that every day, it would only be a matter of time before the tree fell.\n\nHan Sen continued killing all that he could. He slew many star beetles, and in three or four hours, he had brought down five hundred of them. He had also earned three beast souls.\n\n“It looks like I should be able to kill two thousand star beetles before the timer is up. That means I will be able to grab twenty star fruits. But the star fruits are so big, how will I even cart them off?” As Han Sen pondered this conundrum, he felt something cold approaching his back. He immediately teleported away.\n\nAfter he teleported off, the deified star beetle reached his old position. It landed on a branch, and its small blue eyes peered at the newly re-positioned Han Sen.\n\n“Oh no! Why did this guy come here?” Han Sen had deliberately avoided the deified star beetle as he moved on down the tree. He hadn’t expected the powerful beetle to come after him and attempt a sneak attack.\n\nHan Sen didn’t have much time to think about it. The deified star beetle was attacking him again. Its blue body became lightning that zapped its way forward to reach Han Sen.\n\nHan Sen wasn’t fast enough to dodge the beetle’s charge with speed alone. He teleported away again. He put some distance between himself and the deified star beetle. He didn’t stop there, either. He teleported again to get even farther away from his attacker.\n\nBut the deified star beetle wasn’t keen on letting Han Sen off the hook. It continued to use its blue light to try to attack him, and Han Sen’s teleportation skills weren’t taking him far enough away. He couldn’t shake off the star beetle. Every time Han Sen appeared out of a fresh teleportation, the star beetle was coming for him like a beam of blue light. Han Sen had no choice but to continue teleporting. He no longer had enough time to continue killing star beetles, as his focus rested on dealing with his new deified foe.\n\nHan Sen couldn’t help but frown. Because he was being pursued by the deified star beetle, he was missing out on any chance to kill the average star beetles. If he didn’t kill one thousand beetles, he wasn’t sure if the old man would allow him to collect star fruit.\n\n“Weird. Why won’t this deified star beetle let me go?” Han Sen frowned. This creature seemed very driven to attack him.\n\n“This is so strange. Why does this deified star beetle keep chasing Han Sen?” Exquisite was confused, too. Star beetles weren’t very intelligent, and even finding the star tree was a matter of instinct for the creatures. If their intelligence had been higher, they would have fled the moment they saw the old man sitting beneath the tree.\n\nLiyu Zhen laughed to himself. The moment the star beetles descended, he and Han Sen both saw them. After seeing the deified beetle, an idea hatched in his mind.\n\nHe didn’t have the power to control the star beetle, but he didn’t need to control the deified; he just needed to give the creature a target. Han Sen was hunting the star beetles, and wisps of the dead beetles’ presence would be clinging to his body. Liyu Zhen merely used a secret trick to enable the deified star beetle to smell the presence of the exterminating Han Sen. It drew the deified fiend to Han Sen exclusively.\n\n“This deified star beetle’s appearance has saved me a lot of trouble. I do still need to teach him that lesson, after all. I didn’t even have to do this myself.” Liyu Zhen stopped focusing on Han Sen, and he returned his focus to killing King class star beetles.\n\nEven if Han Sen was able to escape the attacks of the deified star beetle, he wouldn’t have the time to kill the King class star beetles anymore. He wouldn’t achieve one thousand star beetle kills, which would keep him from earning any star fruits.\n\nThe old man squinted, but his face didn’t change. Liyu Zhen’s trick had been done in secret, but it hadn’t managed to escape his attention. Still, the old man didn’t say anything.\n\nHe cared very little about a grudge between two boys. He only needed someone who could effectively protect the star tree.\n\nFor now, Liyu Zhen’s performance hadn’t been bad. His abilities were higher than others of the same class. He could scrape by and be labeled guardian of the star tree.\n\nThe trick he used on Han Sen had been unfair, but it was also another way of proving his power.\n\nHan Sen knew things couldn’t keep going on this way. He didn’t have the time to kill other star beetles, so if this continued, he would fail the test.\n\n“It looks like I can’t get rid of it. In that case, I will just ignore it.” Han Sen’s brain was spinning quickly.\n\nExquisite was worried about Han Sen, but what he did next shocked Exquisite even more.\n\nStill being chased by the deified star beetle, Han Sen evaded the next attack, then headed toward a King class star beetle.\n\nFrom the perspective of others, it might have looked like a coincidence. It would appear that when Han Sen dodged, he had just happened to encounter a King class star beetle and randomly kill it before teleporting away from the deified star beetle’s next attack. It all played out so smoothly. It was like one grand move that happened to look like a coincidence.\n\nBut Exquisite could clearly feel what Han Sen was thinking. This wasn’t a coincidence. Han Sen was planning every move he made.\n\nIn this high-speed chase, Han Sen still had the power to plan all that. Exquisite knew his methods, but if she was in his shoes, she didn’t think she could have pulled it off.\n\nThe old man, as he watched Han Sen’s latest performance, looked stunned.\n\nUnder the continued pursuit of the deified star beetle, Han Sen took down another King class star beetle. It was the same as before, and just as precise. The deified star beetle’s attacks didn’t seem to be hampering him significantly. And he maintained the surgical precision of his attacks. The King class star beetles never had the chance to fight back, either, so they couldn’t deal damage to the star tree.\n\n“He is so young, and yet he is still so calm. He hasn’t freaked out, and he has continued to do everything he has planned to the best of his abilities. This crystallizer really is a genius. You picked a tremendous silkworm,” the old man suddenly said to Exquisite."
}