{
    "chapter": 491,
    "title": "Moon Blade",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_491",
    "text": "The evolver matched with Han Sen was completely dazed after he entered the battlefield, seeing how packed the stands were. Wang Xun had no idea what had happened.\n\nAlthough he was a sacred-blood evolver and was quite well known for that, he had never had such a treatment. The limit of the audience was several million, which was surprisingly filled up momentarily.\n\n\"What on earth has happened? Did someone find out about my porn collection and report me? No way, even so, there would not be so many bored people!\" As Wang Xun was puzzled, the countdown had stopped.\n\nAfter entering the battlefield, Wang Xun saw his opponent and thought, is my opponent some celebrity? Is that why there are so many people watching?\n\nThinking of that, Wang Xun quickly checked his opponent's record, which was only more than twenty fights, 100% wins.\n\nHe must be a celebrity. This is my opportunity. If I beat him, won't I be famous as well? Wang Xun felt very excited. Without any hesitation, he seized his two broadswords and hit his opponent with all his strength.\n\nThe broadswords were shaped like crescents, and his broadsword skills had a strong spinning force. It turned out to be the famous Moon Blade, an evolver broadswords skill that was very hard to practice.\n\nMoon Blade required the person who practiced the skills to have a special talent called ambidexterity, which sounded a bit odd.\n\nAn ordinary person was either left-handed or right-handed. Even with training, one would naturally prefer one hand over the other.\n\nVery few people had no preference as a baby, maybe 1/10,000. Therefore, the rudimentary requirement to practice Moon Blade was very high, and only a few people could practice it.\n\nHowever, moon Blade was very powerful. One person using two blades would be as powerful as two persons using blades at the same time. One could even fight to persons at the same time. In one-on-one fights, the person who practiced Moon Blade would have the absolute advantage.\n\nWith the same fitness and martial arts skills, almost no one could beat someone who had practiced Moon Blade. Even the opponent was also using double blades, Moon Blade would still be much better.\n\nThose who came to see Dollar did not expect Dollar to be randomly matched with someone who had practiced Moon Blade.\n\nHowever, they soon understood. Dollar himself was a sacred-blood aristocrat, so it was impossible for him to be matched with someone weak. Although Dollar was strong, all his opponents were aristocrats among evolvers with great skills.\n\n\"Do you think Dollar will win?\"\n\n\"There's no need to guess. Dollar will win.\"\n\n\"I don't think so. Moon Blade is not that easy to cope with. In addition, Dollar had only entered Second God's Sanctuary for 2 to 3 years. I don't believe his geno point count is too high.\"\n\nThere were a lot of discussions among the audience, while Wang Xun had already attacked Han Sen with Moon Blade.\n\nHowever, his opponent's reaction made Wang Xun pause. He had never met someone trying to attack him first when he was using Moon Blade. In addition, his opponent was not using any weapon, attacking at him with bare hands.\n\n\"Heck, don't you dare to look down on me. Your brother will teach you how impressive Moon Blade is.\" Wang Xun added force to the broadswords, trying to kill his opponent in one strike, which would make him really famous.\n\nHowever, before his broadsword fell on Han Sen's body, Han Sen moved sideways although Han Sen's hands were going forward. Han Sen's position was so strange that Wang Xun did not know how to react for the time being.\n\nThis guy is weird. I will take it slow. Wang Xun thought, then took back his weapon and stepped back, trying to figure out what was happening.\n\nBut he never had a second opportunity. Han Sen's fists flew at him nonstop in a manner similar to Sprocket Sword. The attacks were so tightly arranged that Wang Xun had to protect himself first, without any chance or time to fight back.\n\nBoom!\n\nWang Xun failed to make a single strike until the end when he was finished off by Han Sen.\n\nFeeling regretted and upset, Wang Xun presented himself for not insisting during his first attack. Otherwise, he would not have ended up like that.\n\n\"Ha-ha! Dollar indeed. Incredible skills.\"\n\n\"That looked exactly like the video. This is a random match, so there was no way to cheat.\"\n\n\"My king is so strong.\"\n\n\"Such incredible fight. Only Dollar could achieve that.\"\n\n\"The king is after all a king. Who dares to say that he has fallen?\"\n\n…\n\nDollar did not pay any attention to the audience and chose to be randomly matched again.\n\nAs he moved, all the audience chose to be randomly matched as well, wishing to be his opponent.\n\nWhen Han Sen started the fight again, those who were not matched with him became the audience. Momentarily, the room was filled up.\n\nThis time, Fang Mingquan who had received the message also came into the room, broadcasting the fight as he watched.\n\nIt was just an ordinary fight on the official platform, instead of a match. The two players were even randomly matched. However, the number of the viewers were still rising at an incredible speed. The online viewers had hit ten million in just a few seconds and was growing still. It seemed that it would take no time for the number to hit a hundred million.\n\n\"Eventually I see Dollar.\"\n\n\"You did not get into the room either?\"\n\n\"Yes, there are too many people trying.\"\n\n\"Ha ha, when we were in First God's Sanctuary, Dollar was our faith. Now we are all evolvers, D-god is still peerless.\"\n\n\"I really enjoy watch him beating others.\"\n\n\"Kill Dollar, what an ironic name. Dollar is probably the only person who could kill himself.\"\n\n\"Look at Dollar's opponent.\"\n\n\"Well! What a bimbo. She must have had the surgery.\"\n\n\"Oh my! There are huge!\"\n\n\"Dammit, those globes!\"\n\n…\n\nOpposite Han Sen, a tall woman came out. Besides her long legs, her ample breasts were almost out of this world. At first glance, anyone would be attracted to look at her girls. It would take people a while to notice that her other features were pretty as well.\n\nHan Sen looked at his opponent and was also immediately attracted by her nice racks. Being a man of cast iron will, he only took a glance before he looked at her profile. Her ID name was \"Wish I Did Not Understand.\""
}