{
    "chapter": 2975,
    "title": "Better Than True God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2975",
    "text": "Yet, Human King knew about Littleflower, and he knew a lot about him. Nine-Life Cat represented Blood Legion and was a mascot for them. It made Han Sen start to think of many things.\n\nHuman King weirdly looked at Han Sen asked, “Do you want to know about the relationship between me and Old Cat?”\n\nHan Sen nodded but did not say anything.\n\nHuman King laughed to himself. “To be honest with you, I am just like you. We are the failures that were abandoned by Old Cat.”\n\n“I do not understand what you mean,” Han Sen said.\n\n“Old Cat was the guardian of the sanctuaries,” Human King coldly said. “Without his help, do you think the crystallizers would have been able to hide in the sanctuaries for good? I even wondered that. With the crystallizers sharing Qin Xiu’s blood and escaping to the sanctuaries to do all kinds of research, everything that happened involved Old Cat and Qin Xiu. Perhaps it was Qin Xiu who was trying to find his heir.”\n\nAfter that, Human King looked at Han Sen. He went on to say, “You and I are the failures Old Cat has been watching over the years. He gave up. Only your son Littleflower was approved by Old Cat. He became Qin Xiu’s heir.”\n\nHan Sen now understood what Human King meant. Simply said, Human King was just like him. They had Old Cat’s help and attention, but they were not selected by him.\n\nHuman King squinted his eyes as he peered at Han Sen. It looked like he was smiling, but he was not smiling. “You should not think that being an ancestor of Qin Xiu is a good thing. It is actually the opposite. If Qin Xiu dared to choose my son as an ancestor, I would do all in my power to rip him apart and destroy all that remained of his petty factions.”\n\nWhat Human King said was something Han Sen was in total agreement with, but he still wanted to know why Human King felt that way. Therefore, he asked, “Why?”\n\n“He took my son and sent my son to die,” Human King coldly said. “That is enough of a reason for me to kill his entire family 10,000 times over.”\n\n“Are you saying Qin Xiu’s plan would not work?” Han Sen quietly asked. He understood what that meant.\n\n“If he succeeded, Sacred would not be what it is today.” Human King looked at Han Sen. “Don’t you have the holy spirit of that Kirin Qin Xiu made? What do you think of that Kirin’s holy spirit power?”\n\n“It is very strong,” Han Sen said.\n\n“Really?” Human King’s smile grew deeper. “You should use that holy Kirin spirit that you said is very strong to strike me as hard as you can. I want to see how strong Qin Xiu’s stuff is.”\n\n“Sure, if you don’t mind that.” Han Sen pulled out his cause karma knife and summoned the holy Kirin’s holy spirit on it.\n\nThe Kirin’s holy spirit possessed a blade. It was possible for it to be anything, as long as it was a weapon.\n\nHan Sen wanted to know how strong Human King was, so he was not going to deny Human King’s request. He also knew Human King had suggested this as a way for him to gauge Han Sen’s strength. So, there was no use denying him.\n\nHan Sen looked at Human King. The holy light on the blade was strong. It was like a demon flame that flickered.\n\nHuman King was still sitting on the throne. He observed Han Sen and his knife with interest.\n\n“I am so sorry…” Han Sen slashed Human King like mad. The knife light was like some laser that could split a world. It came right before Human King.\n\nDing!\n\nHuman King did not move. Even his face remained the same. He continued to sit where he was. Somehow, his hand appeared beneath the knife. His middle finger and index finger captured Han Sen’s cause karma knife. That scary knife light was immediately broken by his very powerful fingers.\n\nHan Sen’s expression changed. Although he had not used all of his strength with that slash, it was still at about 70%. Despite that, the holy Kirin’s scary power was able to kill a top-class true god xenogeneic. It could not, however, beat Human King’s two fingers.\n\nHuman King let his fingers go and looked at Han Sen. “You are being too polite. If it was me, I would strike as hard as I could.”\n\nBefore Han Sen was able to say anything, Human King asked, “What do you think of my power?”\n\n“It’s very strong.” Han Sen used only those words to describe it because he could not yet gauge just how strong he was.\n\n“My power is still not as strong as Qin Xiu. Considering the thing Qin Xiu wanted to do back then, do you think this holy spirit, which Qin Xiu himself did not know if it was a success or not, was something he could do? In the end, the heir he selected was just a test. They were lab rats whose sole purpose was for testing.” Human King spoke with a look of disdain.\n\n“Hang on… Why is your power…” Han Sen felt Human King’s power was better than most people at true god class. He felt as if he was no weaker than Moment God.\n\n“Why are my powers stronger than a true god?” Human King laughed and looked at Han Sen. “You should know the answer. Because Qin Xiu had blue blood genes, for humans to be better than a sky full of races, you need what it takes to battle God Spirits. If you are willing to, I can make you a member of the blue bloods. For you, it means you can become stronger. You would be much stronger than you are now. You might end up as strong as Qin Xiu was back then.”\n\nHan Sen did not speak. He silently rejected Human King’s offer. That offer seemed tempting, but there were many things he wished to figure out first.\n\nIf blue-blood genes were that powerful, Qin Xiu would not lose.\n\nThinking about that from a different perspective, if Qin Xiu thought his blood could overcome God Spirits, why did he not seek to continue his bloodline?\n\nEven if he could not make babies, with Sacred’s technology, they could copy the genes of Qin Xiu. That would not have been difficult to do.\n\nYet, Qin Xiu had not done that, and there had to be a reason for it.\n\n“Telling me all these secrets cannot be the sole purpose for seeking me out. What do you want me to do for you?” Han Sen still had not figured out why Human King had called him there.\n\n“You do not have to do anything for me,” Human King coldly said. “You are human. Your sons and daughters are humans. So, my child, no matter whether you are willing to or not, you and I will be the same. Go against the God Spirits and do whatever you think it is we must do. There is no need for me to request anything.”\n\nHan Sen still did not understand. Due to the fact Qin Xiu wanted to destroy god palaces and kill God Spirits, the God Spirits wanted to erase Qin Xiu’s bloodline.\n\nThat logic seemed to make sense, but Han Sen thought there was a problem somewhere. He just couldn’t figure out what the problem was.\n\n“I asked you here to remind you, my child, that you cannot trust Qin Xiu. You cannot rely on the relics of his past. Maintain your crystallizer identity. No matter what happens, tell no one about your true identity. You need to do that to live longer and have more chances.” Human King looked serious."
}