{
    "chapter": 2530,
    "title": "The Sea Sky Eye",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2530",
    "text": "Han Sen promised to help Li Keer kill a deified xenogeneic, but Li Keer didn’t know where the xenogeneic she needed actually lived. She only knew which system it was said to be in. Han Sen had to go to that system with her.\n\nBut this time, Li Keer didn’t offer to teach God’s Wander to Han Sen first. She was going to wait until Han Sen slew the deified xenogeneic before giving him the final part.\n\n“It looks like Teleport and Galaxy Teleportation were just a down payment.” Han Sen wasn’t upset about that. It wasn’t as if he and Li Keer were family, so this was normal. If Li Keer taught him the skills without anything to gain, he wouldn’t know how to repay the favor.\n\nHe was chatting with Li Keer on the way, and he was pleasantly surprised to learn that Li Keer was well-educated about most geno arts. In fact, she spoke of many that Han Sen hadn’t even heard of. Aside from the woman in Two World Mountain, there was no one Han Sen knew that was as smart as Li Keer.\n\nHan Sen himself was very good at geno arts. He had studied them a lot, but he had never poured his full energy into those studies. He focused more on practicing geno arts rather than researching them.\n\n“With Li Keer’s knowledge, and with her being King class, she should be famous in Sky Palace. Why haven’t I heard her name before?” Han Sen wondered.\n\nAfter visiting the system Li Keer told him about, they searched for the deified xenogeneic for two whole days without finding anything. They did manage to kill a dozen King core xenogeneics, though.\n\nThe system was huge. If they searched every planet, it would take a while.\n\nFortunately, Han Sen had continued studying Teleport and Galaxy Teleportation, and searching the system was a perfect opportunity to practice. Han Sen teleported everywhere he needed to go. He was getting the hang of it. He was a fast learner.\n\nThe two of them and the furnace were hurrying along their way when, all of a sudden, they saw a group of people coming toward them. Han Sen had a closer look, and he noticed it was Dia Robber, Dragon One, and a few others.\n\nAt this point, Han Sen considered them to be old friends. He had expected Dia Robber would come looking for him. He hadn’t expected it to take this long for Dia Robber to find him, however.\n\n“Brother Dollar, do you have some free time to help me kill a core deified xenogeneic? We can discuss the price.” Dia Robber knew Dollar’s personality well, so he didn’t beat around the bush. He jumped immediately to his real request.\n\n“I do have the time, but I have just struck a deal with this Lady Li. I need to help her kill a xenogeneic, too,” Han Sen said, nodding to Li Keer.\n\nDia Robber and Dragon One looked at Li Keer. They didn’t know her. She was one of the Sky, too, so they didn’t pay much attention to her after giving her a once-over.\n\nDia Robber looked happy and he said, “That’s okay. Can I book you in for next time?”\n\n“Sure, but I don’t have a lack of xenogeneic genes at this point. If you want my help, I’m going to need a geno art as a reward. Lady Li is rewarding me with a geno art, and that is why I’m helping her,” Han Sen explained.\n\n“Geno art? What geno art do you want?” Dia Robber was surprised.\n\n“I have heard your race has a geno art called Big Destroyed. From what I’ve been told about it, I find it quite interesting,” Han Sen said.\n\n“I… is there any other geno art I can give you? Big Destroyed is a secret geno art of the Destroyed. We don’t teach it to outsiders. Plus, without the body and talent of a Destroyed, it’s impossible to learn Big Destroyed. It wouldn’t work, even if I did give it to you. If you are interested in geno arts, I can give you another geno art that is on the same level as Big Destroyed,” Dia Robber offered.\n\nHan Sen shook his head, looking determined, “For the time being, I’m only interested in Big Destroyed. Please think about it, Brother Robber.”\n\nHe had too many geno arts to practice already. He didn’t have any time to take on more geno arts that he didn’t already need. He only wanted Big Destroyed so he could use it as a replacement for Consume. That way, he could absorb things faster.\n\n“We can talk about this more as we travel. What kind of deified xenogeneic are you looking for? If you aren’t opposed to the idea, we can help you out with your task.” Dia Robber smiled.\n\n“But I don’t have anything to pay you with,” Han Sen said.\n\n“Being allowed to follow Brother Dollar is enough of a payment already.” Dia Robber smiled.\n\nIf someone was offering to help them for free, Han Sen had no reason to refuse the offer. So, he brought Dia Robber and the others along. Han Sen had witnessed their powers before, and he knew they could be useful in the hunt for a deified xenogeneic.\n\nHan Sen told Dia Robber and the others about the xenogeneic Li Keer wanted to kill, asking if they had already seen it.\n\n“Li Keer is hunting the Sea Sky Eye?” When Dragon One and Dia Robber heard the deified xenogeneic’s name, they were shocked.\n\nLi Keer smiled. “I’m not that powerful. Hence why I asked Dollar for his aid.”\n\nDia Robber sighed and said, “The Sea Sky Eye is known as one of the stronger deified xenogeneics in the core area. He is no weaker than Gold Armor General was. Many races have tried to fight it, but no one has been able to hurt it.”\n\nDia Robber spoke in a hesitant manner as he tried to explain the situation to Han Sen. If he wasn’t standing in front of Li Keer, he would have told Han Sen not to take the job.\n\nThe Sea Sky Eye was very destructive to Kings and half-deifieds. It was scarier than the Gold Armor General had been.\n\nBut Dia Robber couldn’t offend the Sky, so he tried to tell Han Sen in a non-direct way. The Sea Sky Eye was a scary being.\n\nHan Sen nodded. “I have heard the Sea Sky Eye appears someplace in this system. Do you know where it can be found?”\n\nLi Keer had mentioned that the Sea Sky Eye was very scary, but Han Sen wanted the final part of Galaxy Teleportation. So, he wasn’t planning on running.\n\nEven if he couldn’t deal with it, he could always use the Peacock King’s soul robe and the Gold Robot General.\n\n“It is difficult to determine. The Sea Sky Eye hangs around this system, but it doesn’t have a nest. And it sometimes leaves this system. Encountering it all depends on luck,” Dragon One said.\n\nDragon One and Dia Robber didn’t know where the Sea Sky Eye could be found. There was nothing Han Sen could do about that. His only option was to keep trying his luck, hoping to meet the Sea Sky Eye.\n\n“I know that the Sea Sky Eye will be difficult to find. If you guys need Dollar, I can lend him to you first. I’m not in a rush.” Li Keer seemed to be an easy woman to get along with.\n\n“Thank you very much.” Dia Robber was happy to hear this, but then his expression soured a little. He said, “Brother Dollar, aside from Big Destroyed, is there no other geno art you would be willing to learn?”\n\n“I am only interested in one geno art. I have no interest in any others.” Han Sen’s answer was very resolute.\n\n“In that case, can you give me some time? I will talk to my people.” After Dia Robber said goodbye, he left the core area.\n\n“Hopefully I’ll be able to get Big Destroyed now,” Han Sen thought to himself. He had so many xenogeneic genes left, and at his current rate, he could only eat three a day."
}