{
    "chapter": 2797,
    "title": "Going to King’s Kingdom Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2797",
    "text": "“How about I tell you the secret of the chessboards, and you let me go,” Han Sen said. “Just pretend you have never seen me before.”\n\nHoly Pirate had to shake his head. “Even thieves have a moral code. I accepted a job and received the sky silk picture. I cannot go back on my word and break my promise.”\n\nHan Sen felt depressed and replied, “You are just a thief. Don’t talk to me about having morals. Does your brain have a problem?”\n\nHoly Pirate preferred to not go back on his word about handing Han Sen over learning the secret of the chessboards. That really depressed Han Sen.\n\nHan Sen suddenly thought of something. He said, “If you think things are really that way, then you don’t have to let me go. I will use the chessboards’ secret to barter with you.”\n\n“What kind of trade are you thinking about?” Holy Pirate did not want to give up learning the secrets of the chessboards. He looked at Han Sen with interest.\n\n“I will hire you to kidnap me again.” Han Sen said. He sounded like he was rapping hip-hop.\n\nStill, Holy Pirate understood what Han Sen meant. “What you mean to say is that you want me to kidnap you back from the Extreme King once you’ve been handed over, right?”\n\n“That is absolutely right,” Han Sen said with a nod.\n\n“That is not something easily done,” Holy Pirate quietly said.\n\n“You can easily go around the Space Garden,” Han Sen said. “Is it really that hard to penetrate the Extreme King?”\n\n“In this universe, no one can enter the Space Garden freely except for me,” Holy Pirate said. “Entering the Extreme King is easier than going to the Space Garden, but the Extreme Kings have many elites in their ranks. And, there is, of course, that horny old man, Bai King. That guy is a true god-class guy. Stealing you under their all-seeing eyes without bringing attention to myself would be incredibly difficult. If I am exposed and they learned I stole you, I am afraid I would have to keep running for the rest of my life.”\n\n“Ugh, it doesn’t work for you no matter what I suggest.” Han Sen smiled and said, “I don’t think you should call yourself Holy Pirate. Instead, you should call yourself the Crybaby Pirate.”\n\nHoly Pirate was not angry. He went silent for a little while before saying, “That is fine. I might need to take a risk, but it is worth it for the secret of the chessboards. Tell me, what is the secret of the chessboards?”\n\n“We will trade when you’ve done your part. Once you have rescued me from the Extreme King, I will tell you what you need to know.” Han Sen was not going to divulge the secrets of the chessboards to Holy Pirate just yet.\n\n“I would never betray a promise I made. Everyone in this universe knows I keep my word.” Holy Pirate stroked his beard and looked at Han Sen. He looked angry.\n\n“You are a thief that kidnaps children, so why would I believe you?” Han Sen asked.\n\nHoly Pirate was speechless. His three-rule pirate code consisted of the fact he would never steal a child, but he did not consider xenogeneics as counting. After all, hunting xenogeneics or eating xenogeneics was perfectly normal in the universe. Holy Pirate would never have believed this xenogeneic could be so smart and possess the personality it did.\n\n“It is the same as when I go and save you,” Holy Pirate coldly said.\n\n“Who left the pictures of the 17 stalemates on the walls?” Han Sen changed the subject and pointed at the chessboards scrawled into the walls.\n\n“An old fart monster.” Holy Pirate seemed to be in a bad mood. He did not answer Han Sen’s question. He went back to his rocking chair and fell asleep.\n\nHan Sen examined the stalemates alone. After researching them for a while, he was unable to open the password of the chests. Thus, he had to remember them.\n\nThe next morning, someone was outside the valley calling out for Holy Pirate. When Han Sen heard the voice, he immediately knew it was Bai Wanjie.\n\n“It really is him,” Han Sen coldly grunted. “What an annoying man. Don’t let me see you again.”\n\nHoly Pirate picked up Han Sen and teleported away from the valley. He threw him to Bai Wanjie and said, “That is what you wanted. This transaction is complete.”\n\nBai Wanjie picked up Han Sen with confusion and asked, “Why does he have black hair and black eyes? I wanted a bald guy in red robes.”\n\n“He could have changed clothes and grew hair,” Holy Pirate replied. “Besides, there was only one xenogeneic in the Space Garden that met the defined criteria. If you can find another one that looks like this, you can have my head on a plate.”\n\n“Of course, I believe you, Holy Pirate.” Bai Wanjie checked out Han Sen.\n\nBack then, he had only seen Han Sen bring the red-robed child to save the Flower Gods. He did not see any further details.\n\nAside from Han Sen’s clothes and hair, he did look like the red-robed child. And, it was a xenogeneic body. Bai Wanjie was unable to tell that it was Han Sen and not the red-robed child he was after.\n\nBai Wanjie looked at Han Sen as he asked, “Are you the red-robed child from the Space Garden?”\n\nHan Sen looked at him coldly and did not speak.\n\nBai Wanjie frowned. He was going to do something, but Holy Pirate coldly said, “You guys may go now.”\n\n“Thanks, Holy Pirate. I am going to leave.” Bai Wanjie did not want to offend Holy Pirate. He was suspicious, but he still left with Han Sen.\n\nAfter they departed the planet, Bai Wanjie returned to his battleship and locked Han Sen inside a supergravity cabin.\n\nBai Wanjie looked at the monitor for a while, but he was still unable to confirm if Han Sen was or was not the red-robed child he had seen that day.\n\n“It looks like I have to return to King’s Kingdom and try to read his memories to confirm his identity.” Bai Wanjie did not bother interrogating Han Sen. That was unnecessary for him to do. There were many professionals in the Extreme King that could do that for him.\n\nHan Sen was worried Bai Wanjie would opt to torture him. If that happened, he was going to suffer a lot. After Bai Wanjie locked him in the supergravity cabin, he did not come back.\n\n“I wonder when Holy Pirate will come to save me.” Han Sen did not place all of his faith in Holy Pirate. If Holy Pirate was scared of the Extreme King, then he would be waiting for nothing.\n\n“If my body was ordinary, I could escape this mere supergravity cabin. It could not contain me.” Han Sen felt depressed. His body’s power was currently unavailable. He was unable to make use of anything.\n\n“Fortunately, I can still use beast souls. It is not like there are any other ways.” Han Sen was still wondering if there was a way for him to escape.\n\nBefore Han Sen had the chance, they were already in King’s Kingdom.\n\nThis was Han Sen’s second time with the Extreme King, and he was filled with a bevy of emotions. He expected he would come back to the Extreme King again, but he thought he would only have done so as some sort of king. He would have dominated the Extreme King and kept them below his thumb.\n\nNo one expected he would be returning to the Extreme King as a prisoner. The skies were familiar there, and Han Sen could not help but sigh. “I cannot believe this. This is a bad stroke of luck. I am the red-robed child’s scapegoat, and I have been captured and brought to his Extreme King hellhole. Furthermore, I have no power.”"
}