{
    "chapter": 1849,
    "title": "The Real Purpose",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1849",
    "text": "“They are my personal guards,” Han Sen said.\n\nSo far, they only had Deep Blue Viscount’s word that the lotus roots could suppress the mark. Until it was confirmed, Han Sen wasn’t willing to let Xie Qing King and Gu Qingcheng take any risks.\n\nCaptain Wood frowned and said, “This is dangerous. It is best to get this done as soon as possible. You should get over there and start digging.”\n\nHan Sen looked at Captain Wood and said, “In that case, why don’t you guys go and dig, as well? You are guards, too, isn’t that right?”\n\n“How dare you! You cannot compare us to them!” exclaimed an infuriated Marquise.\n\nCaptain Wood looked at Han Sen darkly and said, “They are guards, but they have a different master.”\n\nHan Sen understood Captain Wood, but he didn’t change his mind about anything. He said, “It is different, but I think mine are more important than you are. Dig it up if you want, but I will distribute the work of my people how I choose to.”\n\nCaptain Wood looked glum, but Black Steel chimed in to say, “Captain Wood, this is Han Sen’s place. And they are indeed his people to command. Please watch your tone.”\n\n“Little Master, we are responsible for this. This is about the safety of the Rebate and Narrow Moon as a whole. I have to take charge of this situation,” Captain Wood coldly said. He didn’t care too much for Black Steel, either.\n\nBut Black Steel then frowned, and he said, “Captain Wood, this entire operation is my responsibility.”\n\n“Master says that you still too young. When this is a matter that concerns the entire Rebate, I am to be the one who takes care of it. Please understand this.” Captain Wood bowed down in respect to Black Steel, but he obviously wasn’t willing to relinquish his authority in this scenario.\n\n“If things are indeed like that, then we will go our separate ways.” Han Sen then took off, going in a different direction.\n\n“We’re going to do things however I say we’re going to do them. Without my explicit order, no one here works alone. If they do, I will kill them.” Captain Wood spoke, as the Marquise swooped forward to block Han Sen’s passage.\n\n“Wood Duke!” Black Steel looked extremely grim.\n\n“Please forgive me, Little Master. This is an important time.” Captain Wood and a few of the Marquise bowed to Black Steel. But even so, they still held their knives to Han Sen.\n\nYou guys stay here and do not run off. Otherwdse, don’t blame me for what happens next.” Because of Black Steel, Captain Wood did not force Xie Qing King and Gu Qingcheng to dig.\n\nThe flowers were soft, and the excavation work was not difficult. The Barons were able to dig up a lot of lotus roots. They were as white as jade and as thick as a baby’s arm. The dusting of dirt that remained on them made them look strong and nutritious.\n\nWhen the lotuses were handed up, Captain Wood pointed at them and asked Deep Blue Viscount, “Were these the lotus roots that you ate?”\n\n“Yep, these are the ones.” Deep Blue Viscount nodded.\n\n“You! Come here and eat this,” Deep Blue Viscount told one of the Barons. He cut off a small slice of the root for him to eat.\n\nThe Baron was shocked and scared at the same time. He was the only one who had been given permission to eat it, and yet he hesitated.\n\n“Eat!” Captain Wood coldly looked at the Baron. The Baron stopped hesitating and did as requested; he started to eat the piece of root.\n\nThe lotus root was very crunchy, and a pleasant scent wafted from it.\n\nThe Baron took a small bite at first. No one knew if it was working, but it didn’t seem to be hurting the Baron, either.\n\nHe finished it off with a big bite.\n\nThe other Nobles looked at him. Nothing happened after he ate it, and the egg mark was still present.\n\nCaptain Wood kept his eyes fixed on the Baron, and after a while, the Baron’s face turned green. It looked like the Baron was freezing. He held himself, shaking and shivering. “Cold! I am so cold!”\n\n“Deep Blue Viscount, what is going on?” Captain Wood looked at Deep Blue Viscount.\n\nDeep Blue Viscount looked happy, though. And he explained, “Yes, this is it. When I first ate it, I felt cold, too. He’ll be fine in a second, you’ll see.”\n\n“How long precisely?” Captain Wood asked.\n\n“I didn’t have any way of recording time when I first ate it. Maybe ten minutes?” Deep Blue Viscount said, after a minute of thought.\n\nCaptain Wood did not say anything more, and he just waited for the results.\n\nTen minutes later, the Baron’s chill began to subside, and he started to look better. The egg shape on his forehead became lighter. It had become just a mere shading on his forehead now.\n\nHurry and dig the rest of them up!” Captain Wood chided them.\n\nA group of Barons dug the roots out for two hours, and when they were done, they managed to collect a thousand kilograms of the stuff. Captain Wood took some, and gave the rest to the Barons. He didn’t let them eat it just yet, though.\n\n“Mister Wood, can I have some of the lotus now, please?” Deep Blue Viscount carefully asked.\n\n“Don’t worry, there are many of them. Once this is done, you are free to have them. Now, take me to where Chiron Earl found the egg,” Captain Wood said emotionlessly.\n\nDeep Blue Viscount’s face changed. He didn’t want to go, but he had to lead.\n\n“This guy is here for an ulterior purpose. He is not just here to remove the threat of the Ravens on our heads.” Gu Qingcheng moved her lips to speak quietly. Only Han Sen heard her say it.\n\nHan Sen sucked at whispering, so he just nodded in response. He could tell Captain Wood had not come here for the lotuses. He was taking the operation far too seriously, and it was obvious that the object of their pursuit was something bigger.\n\n“They take their orders from Black-Moon King. If this item is that precious, why didn’t he come here himself? Or is it really just because it isn’t that important, after all?” Xie Qing King said.\n\nXie Qing King was the master of whispering. Only Han Sen and Gu Qingcheng could hear what he had said.\n\n“It looks like little tricks like that are useful,” Han Sen felt depressed. He hadn’t learned anything about the powers of sound. If he had, he might not have had to be a mute in that situation.\n\nGu Qingcheng said, “No, it’s the opposite. Black-Moon King not coming means the item is worth even more than we can imagine. If he came, other kings would notice and pay attention to what is happening here. This is Narrow Moon, and it would be suspicious for him to come to Planet Eclipse. Why would he go to Han Sen’s planet? If other kings found out about his venture here, he might not be able to claim the item he desires.”\n\n“I see.” Xie Qing King nodded, thinking what she said had made perfect sense. Then he said, “What is the item?”\n\n“We need to ask Captain Wood. He is the only one who knows something about what we’re doing. Black Steel doesn’t know what’s going on, and neither do the four Marquise,” Gu Qingcheng said quietly."
}