{
    "chapter": 2246,
    "title": "White Bone Hell",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2246",
    "text": "When Han Sen’s vision returned to him, a very disturbing sight greeted his eyes.\n\nWhite bones were everywhere. In one place, they had been piled up to form a small mountain. It was difficult to fathom how many lives had been lost there.\n\nThe earth there was full of the essence of death. The skies were blood red, and the rains that fell from the sky were crimson.\n\nA river coursed its way through the mountain, and its water was red. He had stepped into a new world, and the whole place was bloody.\n\nHan Sen stood atop the mountain of bones, and he could see that the entire thing was composed of skulls. The hellish skeletal gate stood at the mountain’s peak.\n\nFox Queen stood next to Han Sen, chains still running from her neck and limbs. The chains had followed her through the gate.\n\n“What is this place?” Han Sen asked as he looked around.\n\nIf this was all real, it was difficult to imagine just how many creatures must have been killed to form the land they now stood upon.\n\nFox Queen answered coldly, “Ghost Bone King was the captain of Sacred’s Sacred Blood army. He led the Sacred Blood army to kill everything in his path, and in the process, he claimed many territories in the name of Sacred. Many beings died by their hands. These bones are the collected remains of all the creatures and people slain by Ghost Bone King.”\n\n“Why amass all of the bones in here?” Han Sen asked.\n\nIt would have made sense if Ghost Bone King had used the xenogeneic bones to gain strength, but throwing all the bones in a pile and leaving them there was a waste.\n\nFox Queen stroked her hair and smiled. “Ghost Bone King was of the Bone. This is the White Bone Hell, the origin place of the Bone. He buried all of his enemies here in order to create more Bone. Things didn’t go as he planned, as no more of the Bone were born here, but…”\n\nFox Queen’s voice trailed off.\n\n“But what?” Han Sen asked.\n\nFox Queen looked at Han Sen and asked, “Have you heard of a general becoming famous by destroying his compatriots?”\n\nHan Sen nodded. He had heard of this when he was in the Alliance, and also during his time in the geno universe.\n\nFox Queen gave the white bone mountain a mocking look. “The Bone are like that. A long time ago, the Bone were numerous. But the evolution of the Bone is a very bloody thing. Ghost Bone killed the rest of his race, and in so doing, he became the greatest Bone King. While his strength allowed his race to achieve new heights of power, it also destroyed them. He was the only Bone left, when all was said and done. He eventually became very lonely, and he sought to create more of the Bone. But his efforts were in vain, and he failed. His actions benefitted his enemies, more than anything.”\n\nHan Sen still didn’t really understand.\n\nFox Queen then went on to say, “Ghost Bone bound me here, so I don’t know what became of the outside world. After billions of years, he has yet to return. The bones here were unable to produce more of the Bone. Instead, they have just helped the growth of other beings.”\n\nAs she spoke, Fox Queen pointed to a place far in the distance. Han Sen turned his gaze to a range of mountains that were positioned like lotus flowers.\n\n“Between those white bone mountains, there is a blood pool. The pool is home to a creature that feeds on the blood bone air. That xenogeneic is quite small, and it is just the heir of some long-forgotten Viscount. It was one of the nameless xenogeneics that General Ghost Bone killed and brought here to rot. This one, however, was pregnant. Unbelievably, the child survived. Nothing should live in White Bone Hell, but the heir of that xenogeneic has managed to. In fact, it had thrived here. It has feasted on the bones here and grown strong.” As she spoke of the creature, Fox Queen looked visibly afraid.\n\nShe sighed. “This should have nothing to do with me, but that xenogeneic is right on my doorstep. It keeps growing and growing, and above all, it loves death. If it continues to grow, it will one day become deified. And it is sure to find a way to leave White Bone Hell eventually. When it does, you and I will be the first things it kills.”\n\n“You tricked me into this place, just so I can kill it for you?” Han Sen now understood what she wanted.\n\nFox Queen gave Han Sen a bright smile. “If you don’t like killing things, then you are welcome to remain here with me. We can wait until it becomes deified, and then it can kill us together!”\n\nHan Sen stared at her for a while before saying, “If I’m not mistaken, aren’t you deified? Why don’t you go and kill it? With your level of power, such a task should be easy.”\n\nFox Queen rolled her eyes and raised her hands to rattle the chains that bound her wrists. ” Ghost Bone trapped me here to watch over White Bone Hell for him. But he was always worried I would ruin his work, so he placed a restriction on my powers that activates when I enter White Bone Hell. I can’t even break one of these bones in here, in my current state.”\n\nAfter saying this, Fox Queen picked up a skull from the ground. She flexed her arms to crush the skull, and the chains binding her released a thick black fog. Streams of fog latched onto her like black hands and lifted her up into the air.\n\nFox Queen’s neck looked ready to break. Her body sagged in submission, and after a while, the black fog disappeared. She fell to the ground and coughed.\n\n“As you can see, I am unable to do anything,” Fox Queen groaned, gingerly regaining her feet. “You and I are trapped here. If that xenogeneic becomes deified and manages to leave White Bone Hell, we will be unable to escape. By killing it, you won’t just be saving me; you’ll be saving yourself, too.”\n\nHan Sen was quiet for a moment. “What is the xenogeneic’s current strength?”\n\nFox Queen looked quite grim, and she told him, “I have searched for help all these years, but not many creatures were ever able to come here. When it was just a baby, any Baron would have been able to kill it. But now? Now it has reached King class.”\n\n“A King class xenogeneic… Do you think that I, having just become a Duke, can kill a monster like that?” Han Sen asked.\n\n“You have to! Unless you really want to die alongside me.” Fox Queen laughed and poked his shoulder. “But don’t worry; it wasn’t easy for me to find a cute guy like you. I have no intention of getting you killed. And furthermore, I have a way to help you.”"
}