{
    "chapter": 2608,
    "title": "Fighting in the Pond",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2608",
    "text": "“Leader, I have been thinking about it. I’m willing to go to the Very High. But before that, I would like to speak with Exquisite alone.” Han Sen went to see Sky Palace Leader and started explaining the reason for his visit.\n\n“What do you want to say to her?” Sky Palace Leader squinted his eyes in the direction of Han Sen. He knew Han Sen and Lone Bamboo were the same. Convincing men like them of anything wasn’t easy.\n\n“I would like to discuss the terms and conditions of me accompanying the Very High. I’m an eleven armor talent genius, after all. It’s okay for me to strike a bargain that will suit me, right?” Han Sen laughed.\n\n“Tell me what you need. There is a team in Sky Palace that can fight for the best terms and conditions to benefit you.” Sky Palace Leader didn’t believe that Han Sen just wanted a better deal.\n\n“There is one aspect of the deal that needs to remain private. Don’t worry, I know what I’m doing. I won’t do anything that will cause you trouble,” Han Sen said seriously.\n\n“Fine. Go home for now, and I will establish a private meeting for you.” After Sky Palace Leader said that, he allowed his eyes to linger on Han Sen for a while. And then, he said, “If you really don’t want to go, though, you don’t have to. I can deal with the Very High.”\n\n“It’s okay. I have decided to go. I thought about it some more, and I figure that it isn’t a bad deal. It will take one and a half years for me to recover. If I go there, I can save at least a year. And I will be given lots of goodies. So, why not?” Han Sen laughed.\n\nAfter Han Sen left, Sky Palace Leader looked at Yu Shanxin and asked, “Do you think he is really going to go to the Very High?”\n\nYu Shanxin bowed. “Leader, I cannot guess how Han Sen’s mind works. But I don’t think he is a liar. I don’t think he will crap all over Sky Palace, given how we have treated him, and I don’t think he means us harm.”\n\n“I thought that, too. But this little guy does cause us a lot of trouble. He’s kind of annoying,” Sky Palace Leader said as he rubbed his temples.\n\n“Who isn’t annoying when they are young?” Yu Shanxin said with a smile.\n\n“You are right. You should go and get ready yourself. After reaching the Very High, your safety comes first. Do what you can, and don’t push yourself further than that,” Sky Palace Leader said.\n\n“Understood.” Yu Shanxin bowed.\n\nHan Sen arrived back on his little jade island, and a Sky Palace butler came to see him shortly after. The man told Han Sen that Exquisite was going to meet him at the Sky Water House that night.\n\nHan Sen followed the butler to the Sky Water House. Exquisite was there, as expected. She was sitting atop a staircase that led down into a pond. Her feet were in the water, displaying the pale skin of her legs.\n\n“Tell me what you want. Do you want xenogeneic genes, treasures, or geno arts?” Exquisite asked, her expression unreadable. On her face, not a single human-like emotion was visible.\n\n“I don’t want any of those things,” Han Sen said to her, sitting down next to the pool. He took off his shoes and rolled up his pants. Just like Exquisite, he allowed his legs to dangle in the water. A cooling sensation rushed against his feet, prompting Han Sen to shiver in pleasure. It was like eating ice cream in the summer.\n\nThe water in Sky Water House wasn’t ordinary water. It was blue water, and it was filled with energy. It was able to quicken the growth of cells and aid in the rejuvenation of one’s body.\n\n“What do you want then?” Exquisite looked curiously at Han Sen, who was sitting next to her.\n\nExquisite had given up on Lone Bamboo and selected Han Sen. Aside from Han Sen’s talent and power, the most important motivator was the fact that Li Keer had chosen Dollar.\n\nDollar had once beaten Lone Bamboo in the Geno Being Scroll. And Exquisite and Li Keer had both seen Dollar’s power. If she chose Lone Bamboo, he would always be compared to Dollar. That wouldn’t be much better.\n\nLi Keer had a ten armor talent. Exquisite had a nine armor talent. So, Exquisite didn’t want a silkworm that was inferior to Li Keer’s. That was why she was taking a risk by going for Han Sen.\n\nIf Han Sen really had an eleven armor talent, then her silkworm would be better than Li Keer’s. If Han Sen’s talent wasn’t great, she would only lose once. But this way, at least she would have a chance to win.\n\nHan Sen looked at Exquisite. After a while, he laughed and said, “You can use me. But you need to be better than me. Why would I follow someone who is inferior to me? Don’t you think there is sound logic to that thought?” “Of course,” Exquisite said. She wasn’t angry.\n\n“If you think this is right, then it is settled. If you can convince me, I will follow you to the Very High. If you cannot, can you leave me and Sky Palace alone?” Han Sen said.\n\n“Sure,” Exquisite answered with haste. She sounded very confident.\n\nHan Sen looked at Exquisite with interest. “How are you going to convince me?”\n\nExquisite looked at Han Sen calmly and asked, “What is your best geno art?”\n\n“Knife skills, I guess.” When Han Sen was Han Sen, he used knives the most.\n\n“Then let us compete with our knife skills.” Exquisite reached out her hand. A stream of water rose into her palm in a serpentine swirl, then formed itself into a knife. “I will sit here, and you can attack me. If you can make me stand up in one hundred attacks, you win.”\n\nExquisite was very confident, which was evident in the way she had chosen to fight with a water knife. She hadn’t even stood up. Han Sen smiled. He reached out a hand toward the pond. He sucked up some of the water to form a water knife of his own.\n\n“Sure. One hundred attacks is the limit. Let us see who stands up first,” Han Sen said to Exquisite with a smile.\n\n“Please, go ahead,” Exquisite said without argument.\n\n“In my home, ladies always go first. After you.” Han Sen wanted to see Exquisite’s real power.\n\nHan Sen had traveled with Li Keer and Exquisite for a long while, but he was never able to accurately gauge their real power.\n\n“Sure,” Exquisite answered. She didn’t hesitate to attack Han Sen with the water knife.\n\nShe didn’t apply much strength, so the knife didn’t make much sound as it slid through the air. But even so, Han Sen felt a chill at the sight. Her knife was coming for his head. Her hand appeared to be moving in a smooth arc, but Han Sen felt as if he couldn’t see where the knife was coming from. It was as if the water knife adhered to the rules of some strangely shifting space.\n\n“Good knife skill,” Han Sen complimented her. He swung his own water knife, using Teeth Knife’s Fang."
}