{
    "chapter": 1233,
    "title": "Emperor Treasure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1233",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe entry point was not submerged in Sky Pure Water, but was dry as land instead. Veiling himself in a cloak of silver lightning, Han Sen proceeded forward as the blue lightning cowered away from him.\n\nThe hole was the perfect size for one person to go through. As he felt his way through, it was practically a tunnel, complete with its own twists and turns. After traversing as far as he could, he eventually reached the bottom. There was nothing particularly special about the way he had gone, and it was just as he had seen it from the outside.\n\nInside the stone was a semi-circular space, and each hole had an exit point that led into that place. Han Sen saw a small tree inside, growing in a pot.\n\nThe tree was thirty centimeters tall, and it looked like a small coconut tree. The strangest thing about it was that the tree seemed to have been forged from actual electricity or lightning. Its appearance was not too dissimilar to that of a plasma ball.\n\nThere were three blue fruits growing on the electric branches of the tree, but weirdly, each fruit had something within it. The three lightning fruit each held something different. The highest of the trio had a knight in armor sitting inside as blue lightning flickered around him.\n\nThe knight was wearing armor and a helmet, though, so Han Sen could not see its face. He could not even see its eyes.\n\nThe left fruit had a hammer inside it. Its shape was fairly unremarkable, and it looked like an average blacksmith’s hammer, aside from the blue lightning that crackled around the head. It also had the symbol of lightning forged on it.\n\nThe right fruit had a hand. It was white and pristine, with beautiful, untarnished nails.\n\nIn the palm of the hand was another lightning symbol.\n\nHan Sen felt strange as he looked upon them. The plant was growing three wholly different items.\n\nThe fruits were not yet mature, but the lifeforces of the tree and its fruit were frighteningly powerful. There was no doubt in Han Sen’s mind that he had stumbled across treasure belonging to an emperor spirit.\n\nBut if they were geno weapons, why would a knight and a hand be growing inside the fruits?\n\nThey could have been creatures, but the idea of a creature that had the form of a hammer was bewildering.\n\nHan Sen might not have been able to tell what they were right now, but whatever would come from them had to be good. There was a reason why Thunder Hell Emperor had gone to such great lengths to hide the tree beneath a well submerged in Sky Pure Water.\n\n“Whatever these are, they’ll be awesome when they’re mature. I should help boost its growth; you can’t find an emperor plant every day, after all.” Han Sen summoned his black crystal and bestowed a number of drops upon the tree.\n\nHe examined the fruit the fruit one last time, and he got giddy as he wondered how good the items would be.\n\n“If they’re beast souls, that’d be terrific. Imagine if they were berserk super class!” Han Sen thought to himself.\n\nHan Sen decided to summon Dragon King. He was a knowledgeable fellow on a great number of subjects, so there was a chance he could shed some more light on what was growing on the tree.\n\n“Do you know what this is?” Han Sen said.\n\nDragon King, seeing the mini tree, looked shocked. He went around it to observe it carefully, saying, “How very peculiar. This should be a lightning emperor geno plant, correct? It is strange how the things inside don’t look very… electric.”\n\n“Excuse me? The stuff inside isn’t lightning?” Han Sen frowned in a pause, before continuing on to say, “You must be mistaken. You are, aren’t you? The items inside even have the symbol of lightning emblazoned across them.”\n\nDragon King explained, “I have hundreds of thousands of years of experience. Trust me, I am not mistaken when I tell you that whatever is inside that tree is not lightning.”\n\n“Then, can you explain?” Han Sen asked, frowning.\n\nDragon King looked at the fruit and said, “I can’t be sure about the hand and the hammer, but I know for sure everything you’d need to know about the knight.”\n\n“Okay, go on; I’m listening.” Han Sen gestured for him to proceed.\n\nDragon King laughed and said, “I used to grow those. It’s a super beast soul, and it goes by the name Twin Knight.”\n\n“Twin Knight? But there is only one of them!” Han Sen found it hard to believe they were twins.\n\n“Before you spirits sign a contract with humans, you can’t use beast souls. Isn’t that right?” Han Sen said.\n\nDragon King balked and said, “No, it wasn’t for me. It was for my man, Dragon Knight.”\n\n“Dragon Knight? You had someone to ride you?” Han Sen looked at Dragon King with shock.\n\nDragon King’s face turned green, and he explained, “No, it’s not like that! Dragon Knights are knights with dragon blood. They are powerful super creatures, actually; not too far off your Disloyal Knight. I had a whole battalion of them, at one point.”\n\n“You had a whole battalion to ride you? You are good.” Han Sen laughed and went on to say, “Anyway, keep going. What is the Twin Knight?”\n\n“The Twin Knight beast soul should grow on the Twin Tree. I had them, and I was going to use a Twin Knight to combine with my favorite Dragon Knight, so he could act as a leader. But something went wrong with the tree and it died; you know how it goes. But I am telling you, this is identical to my Twin Knight. And believe me, I am as perplexed as you about why it is growing on a lightning tree.” Dragon King looked genuinely confused.\n\n“You still haven’t told me what it does,” Han Sen said, looking directly at him.\n\nDragon King laughed and said, “Oh, that is simple! It can possess other knights and have powers opposite to what it currently has.”\n\n“Does that mean if a knight has a fire element, and it is possessed, it will instead use an ice element?” Han Sen asked.\n\n“No. It is extra; as in, you can use ice and fire together,” Dragon King explained.\n\nHan Sen was delighted with the treasure he had stumbled across. He thought that item would be a terrific gain for him. If Disloyal Knight used it, he wondered, what would his powers become?"
}