{
    "chapter": 2268,
    "title": "Holy Monument",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2268",
    "text": "“My good little brother, are you really that naive? Surely you don’t think that the blood kirin’s power is sufficient to challenge someone like me?” Fox Queen smiled at Han Sen and the blood kirin as she stood before the mountain.\n\n“Big sis, you’re far too suspicious. Have you forgotten about the close bond between us? Why would I ever want to attack my big sister? When I realized that you’d been freed, I wanted to come and celebrate the occasion with you. I just thought I would bring along the blood kirin,” Han Sen said.\n\n“If you’ve come here to celebrate with your big sister, you should have brought her a gift, isn’t that correct? Otherwise, your big sister would be made rather angry,” Fox Queen said, maintaining her smarmy smile.\n\nHan Sen knew what gift Fox Queen was referring to. He moved without hesitation, pulling out the item and holding it up. “Of course, this is your big day! As a little brother, I want to give you the best gift I can.”\n\nFox Queen looked at the item in Han Sen’s hand, and then she looked at Mister White and asked, “What do you guys think of the gift my little brother is offering?”\n\n“We have no idea. Only Edward knew what the item was,” Mister White confessed, looking slightly ill.\n\nFox Queen held out her hand, and Han Sen placed the item in her palm. Fox Queen looked at the crystal tablet carefully, but there did not appear to be anything special about it.\n\n“Is this really the item you retrieved from Ghost Bone Town?” Fox Queen directed a piercing stare at Han Sen.\n\n“The one and only,” Han Sen assured her.\n\nFox Queen gave Mister White the stone tablet. “Mister White, what do you make of it?”\n\nAfter a brief moment of thought, Mister White said, “I don’t know what exactly is special about this item, but I can tell you that it is very old. It must be truly ancient, in fact. Its age alone makes it interesting.”\n\nMister White was making it clear to Fox Queen that he didn’t know if the tablet was the same item that Han Sen had taken from Ghost Bone Town. It was too old to be a forgery, though.\n\nHan Sen thought to himself, “Of course it is old. I went back to the Alliance and took it from a crystallizer ruin.”\n\nFox Queen smiled and looked at Han Sen. “Since you’ve been so nice to your big sister, come and walk alongside me.”\n\n“Of course, my big sister.” Han Sen smiled.\n\nFox Queen found it suspicious that Han Sen would give up his prize so easily, and she couldn’t be certain if the tablet was genuine. She had to take Han Sen with her to the holy monument. Then, they could find out whether or not it was the real deal.\n\nFox Queen cast a spell, and one of her cords of power tethered Han Sen and the blood kirin to her. She smiled and said, “Please don’t blame me for this precaution. You have been misbehaving recently, my little brother, so I’m afraid I have no choice.”\n\n“Oh, I’m so sorry that I’ve made you worry, big sister.” Han Sen smiled coldly.\n\n“What was that bird’s nest that I saw you use earlier?” Fox Queen looked Han Sen over, but she saw no sign of the bird’s nest. The item had melted her cord of power, which made quite an impression on her.\n\n“I hid it someplace in the White Bone Hell. If you can find it, I can give it to you as a gift.” Han Sen smiled.\n\nFox Queen wasn’t in the mood to look. She couldn’t find the bird’s nest when she searched Han Sen’s body, but that was fine by her. Hiding the nest in the White Bone Hell was like lobbing it into her personal warehouse. She would have plenty of time to seek it out later.\n\nFox Queen led Han Sen and the others out of the White Bone Hell and locked the hellish skeletal gate behind them. Then she ripped down the palace’s gate, and the group left the palace.\n\n“It has been so long since I’ve had the chance to breathe fresh air.” Fox Queen stood under the sky, looking out at the stars as she spoke.\n\nHan Sen and Mister White stood together, but they didn’t speak. Mister White and Ice Blue Knight King weren’t in any better of a situation than Han Sen.\n\nFox Queen’s temperament changed with the wind, and there was no telling who she might be ready to kill one hour from then.\n\n“Let’s go! We will head for the holy monument. Let’s see what the Sacred Leader chose to leave behind,” Fox Queen said, looking at Mister White.\n\n“Crime, you lead the way,” Mister White ordered.\n\n“Sir…” Crime said, his face pale.\n\n“What are you thinking? Right now, surviving is our priority.” Mister White gave a wry smile.\n\n“Mister White, you are very smart. Don’t worry, though; I do not like killing. Once I have collected the legacy items of the Sacred Leader, you will all be allowed to return home safe and sound.” Fox Queen smiled.\n\nIce Blue Knight King and the others were too smart to believe Fox Queen’s promise to them, but they were in no position to gainsay her decisions. They had to do as Fox Queen told them.\n\nEven if they didn’t tell Fox Queen the monument’s location, she would find it at some point anyway. Withholding the information would only delay the inevitable.\n\nHarder and Ice Blue Knight King both looked at Mister White. It had taken them a second to realize that Mister White was the only one who knew where the monument was.\n\nHarder thought quickly as he walked. Amidst the people there, he was the only one who knew that Han Sen had stolen a stone tablet from Ghost Bone Town. The crystal stone that Han Sen had presented to Fox Queen wasn’t the same item he had taken.\n\n“Han Sen has guts, I’ll give him that. He has actually dared to present a fake relic to Fox Queen. It is fake, though; they are sure to find that out once we reach the holy monument. And when that happens, I wonder what he is planning to do. Has he found a way to escape?” Harder looked at Han Sen. If Han Sen behaved strangely, Harder would notice.\n\nHan Sen’s chances of running away didn’t seem very good. Fox Queen had a cord of power tied around him and the blood kirin, and she was being very careful to keep an eye on him. There was no way he could escape.\n\nWith Crime leading, they quickly traveled through the mountains and entered a primal forest. Many xenogeneics wandered across their path, but Ice Blue Knight King and Crime were able to cut them all down quickly. None of their foes were too strong.\n\nThey walked through the primal forest for four days. Eventually, Mister White pointed forward and spoke. “Here it is!”\n\nEveryone looked where Mister White was pointing. They all looked shocked, and even Han Sen furrowed his eyebrows in suspicion.\n\n“This is the holy monument?” Fox Queen frowned at the sight.\n\nMister White was indicating an old tree. The tree was very thick; it would require four people holding hands to encircle it. But other than that, it looked quite ordinary. Not to mention the fact that it was dead. There was not a single leaf on it, and many of its branches were broken. It stood alone in a small clearing in the forest.\n\nIn a primal forest like the one they were standing in, such trees must have been a dime a dozen. Mister White told them it was a holy monument, but the unimpressive sight before them made it difficult to believe his claim.\n\nHan Sen used his Dongxuan Aura to scan the tree, and he could discern nothing special about it.\n\n“The Sacred Leader didn’t want to put his treasure somewhere obvious. If you look a little closer, though, you are sure to see the truth of this amazing old tree,” Mister White said quietly."
}