{
    "chapter": 2403,
    "title": "Vampire",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2403",
    "text": "Just as Han Sen predicted, if God was a creature that had Causal powers, then he could reverse Causal relationships.\n\nFor example, take a person who wished for one million dollars. Normally, the person would have to work for ten years to earn that much money.\n\nBut God’s powers reversed the Causal relationship. God could give that one million to the person immediately, and then the person would have to work to pay it back.\n\nIf someone wished for far more than they could ever pay back, then the wisher would destroy the Causal relationship, which would create a serious imbalance within that Causal power. It was difficult to imagine what might happen.\n\n“If this line of thought is true, making a wish is like pre-paying wages. If my wish is something I can pay back, then I might not get hurt. Or at least, I might not get hurt very much. Just like Han Jinzhi. He made a wish, but the wish he made didn’t backfire on him,” Han Sen thought.\n\nThe man smiled. “You are smart. You understand the meaning behind wishes. I believe you will be able to make the correct wish.”\n\nHan Sen thought to himself, “Many of the Extreme King have entered Destiny’s Tower, and their lives don’t seem to be falling apart afterwards. They must have deciphered the meaning behind the man’s words. But is it really true that no one was greedy enough to make a wish they were unable to make good on?”\n\nHan Sen didn’t know if this guy was the same self-proclaimed God that the Seventh Team had encountered. Whether he was or not, though, Han Sen believed there to be something amiss with this offer. He just hadn’t figured out what was wrong yet.\n\nWhen Han Sen didn’t speak, the man went on to say, “Young man, make a wish you are able to handle. It will be good for you, and it will not harm you.”\n\nThe way he said this made Han Sen frown. There was something familiar about this whole interaction, actually.\n\n“Hang on, I forgot to consider God’s perspective in this wishing process. God wouldn’t just randomly help people. Why is this guy willing to help others by fulfilling their wishes? Maybe the wishing process isn’t like a pre-paid wage, but more like an interest-charging loan? This guy might be some sort of celestial loan shark!” The thought gave Han Sen a sudden chill.\n\nWithout a doubt, this God must be benefitting somehow from the wishes that were made. No way he would just sit here and grant wishes out of kindness.\n\nThere had to be something this God needed that the wishes were providing. Most likely, that benefit would come from the interest rate he charged for each wish.\n\nThe bigger the wish that was made, the more interest the wisher would owe. And that meant God would benefit even more.\n\nAs he considered the idea, Han Sen became increasingly convinced that he was right. Han Sen might not have figured out the process perfectly, but he was confident he had gotten the core of the relationship correct. God wasn’t some benevolent fulfiller of dreams. He was more like a vampire.\n\nBut God wouldn’t be interested in money, obviously. Han Sen hadn’t quite figured out what form this God would want his interest in when he collected it.\n\nHan Sen’s face turned sour as he thought about all this. If his guesses were even remotely accurate, then regardless of what he wished for, he was still going to lose something.\n\nAfter all, loan sharks kept the interest going even after payment.\n\n“I still don’t know what wish to make. Let me go and have a look at those godly pictures before I make one,” Han Sen said, as he looked at the man.\n\n“You really should think about it, yes. You only get one chance.” The man smiled encouragingly.\n\nHan Sen left the seventh floor of Destiny’s Tower. As he walked, he kept on thinking, “From what I have been able to see thus far, God’s power must have many restrictions. He cannot directly harm the wish maker. And he cannot harm creatures of this universe. And it seems as if he cannot use lies and tricks. Otherwise, why would he have told me all that he did?”\n\n“The rules do not permit the use of force or falsehoods. This whole thing sounds very legal and lawyer-like. Although they can’t change the rules, they’re perfectly happy to use word games and manipulation to get what they want. That is how they trick people,” Han Sen thought to himself. Ultimately, he thought it was a good thing that he had come here.\n\nHe had agreed to make a wish in order to figure out what the wishing process and this God’s powers were actually like. Now, he had a much better idea of what was happening. His theories couldn’t be one hundred percent accurate, but he was better off now than his previous state of complete cluelessness.\n\nTo defeat an enemy, you had to understand them. Ignorance was the most frightening thing on a battlefield.\n\nNow that Han Sen had agreed to make a wish, he might end up paying a price. But he still thought that this was all worth it. At least he would be able to understand God more.\n\nWhat Han Sen needed to do now was avoid getting tangled in the interest he would owe God upon making a wish.\n\nAccording to the theory he was crafting, the smaller the wish Han Sen made, the smaller the price he would have to pay. That would mean there would be less interest.\n\nBut Han Sen had no idea what scale he should use to measure wishes. How would he know if the wish he made was big or small?\n\nFor instance, Han Sen might want a single dollar. That was a small amount. And according to the theory, the wish should accrue very little interest because one dollar would be easy to pay back.\n\nBut God wasn’t playing with money here. He was playing with Causal powers.\n\nIf Han Sen wanted that one dollar, and that one dollar came from a scary elite’s son, that scary elite’s son might die. And the responsibility for that would land firmly upon Han Sen. At that point, Han Sen would have to face the scary elite’s payback.\n\nWhen wishes were fulfilled by Causal power, even seemingly small wishes could turn out to be very dangerous. And whatever the price turned out to be, Han Sen would have to pay it.\n\nAnd the final decision would be in hands of that untrustworthy God. Han Sen would have a difficult time trying to navigate around those rules.\n\n“It is hard fighting God. The Seventh Team had so many good people, and yet they all ended up the way they did. It looks as if Gu Qingcheng, who didn’t make a wish, made the best decision by far,” Han Sen thought to himself. “I wonder what wish Han Jinzhi made. How did he avoid the trap set up by God?”\n\nHan Sen didn’t understand. Or at least, he didn’t for the moment. But he needed a way to mitigate his risk and make a wish that would cost him the least.\n\nThere was another thing that Han Sen found extra suspicious.\n\nIt was the fact that so many of the Extreme King entered the tower, and yet they all ended up okay. Perhaps this God really was a nice loan shark who only ripped people off a little.\n\nHan Sen didn’t think that was possible, though. All vampires drank blood, after all.\n\n“What is keeping these Extreme King from having their lives destroyed by these wishes?” Han Sen kept walking as he thought, staring at the paintings on the walls along the way."
}