{
    "chapter": 2979,
    "title": "Forever a Slave",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2979",
    "text": "Han Sen felt a bit regretful about allowing Fox Queen to enter the god temple and make a wish. After she made her wish, he was unable to hurt or kick Fox Queen to the curb. He was not allowed to reject the wish. He had a find a way to make her wish come true.\n\nHan Sen saw that the Nine Spin Destiny Mirror was only worth 300 years of her life span. That was too little for him, so he did not want to make the trade.\n\nFortunately, Han Sen’s position as a god was Annihilation class. Compared to the Destruction class and Disaster class, Annihilation God Spirits had special powers. It was like Han Sen was able to apply more rules that lesser God Spirits could not enforce.\n\nA Destruction class God Spirit did not have that power.\n\nOf course, Destruction class God Spirits were able to make the same conditions, but the conditions they enforced would not be protected by the rules of God Spirits. Even if the wisher betrayed the rules, the Destruction class God Spirit could not do anything about it.\n\nUpon hearing this, Fox Queen felt her body shake. Although she knew she was going to lose some years of her life span, hearing the two conditions made her scared.\n\nBased on her knowledge of God Spirits, she knew looking for a Destruction class God Spirit to make a wish would not put on an extra condition. Destruction class God Spirits may not have been able to take the Nine Spin Destiny Mirror from Han Sen. Even if it was taken back, the price to pay would have been very high. Perhaps her life span would be all gone.\n\nFox Queen risked coming there to find an Annihilation class God Spirit. She hoped such a God Spirit would complete the wish with ease, and she would not have to pay up much of her life span.\n\nHigh-class God Spirits had the power to apply an additional charge. Fox Queen was helpless to control it. If she did not agree to the extra condition, the wish would not be done. It would become a problem. There was a chance she would not leave that place alive.\n\n“Please tell me, Mister.” Fox Queen looked at Han Sen with sad eyes. Her face looked very pitiable. It was the sort of look that could make one buckle and comply with whatever she wanted. It made people want to comfort her.\n\n“By using small tricks against me, do you want to die?” Han Sen coldly grunted. His body had god powers. It was like hell. It was like a sea. It was headed for Fox Queen.\n\nFox Queen’s body shivered. She immediately kowtowed and said, “Please do not be mad. It was my fault. Please forgive how ignorant I\n\nam.”\n\nSeeing Fox Queen quivering beneath the altar, Han Sen felt delighted.\n\nFox Queen used to cause him so much trouble. Now, Fox Queen’s fate was in his hands. It made him feel incredibly good.\n\nIt was a shame Han Sen had let her into the temple to make a wish. That kind of offense was enough to cancel the wish transaction. Therefore, Han Sen had no choice but to continue.\n\n“I can help you get back Nine Spin Destiny Mirror, but you need to be my slave forever.” Han Sen was like a lion opening his mouth.\n\nHe did not want to give her the Nine Spin Destiny Mirror for 300 years of her life span. If Fox Queen did not agree to the terms and conditions, the wish would fail. Han Sen would no longer have to give her the Nine Spin Destiny Mirror.\n\nIf Fox Queen agreed, her life would forever be in Han Sen’s hands. She would become a slave and forever be ruled by him. Giving her the Nine Spin Destiny Mirror did not change much.\n\nUpon hearing this condition, Fox Queen looked terrible. Her body started to shake.\n\nThe conditions he made were greater than she thought they would be. It was like taking her\n\nlife.\n\n“Mister, can you do that for me because I am so poor?” Fox Queen pretended to be destitute as she kneeled.\n\n“You cannot talk in front of a god. If you don’t want it, forget about it. Turn around and go home.” Han Sen did not care about her feelings, so he spoke as harshly as he wanted to.\n\n“Please do not be mad.” Fox Queen bowed again. She looked sincere, but her mind was thinking, “I just wanted to come and try this God of Wealth that I have never heard of before. I did not expect he would compose conditions this gross. But that is good. If he makes a condition like that, he is not going to steal all the years of my life span. Perhaps I will not lose much of my life span. This is the end of the road. To be held by this Annihilation God Spirit is safer. If the Extreme King wants to kill me, it will be even harder for them.”\n\nAlthough she thought of things this way, in her mind, she was a bit annoyed. “This is all because of that Han Sen. If it was not for him, I would not have gone to Destiny’s Tower. He also took the Nine Spin Destiny Mirror, which made me become an enemy of the Extreme King. That Bai Wuchang keeps chasing me. He has forced me into this position, so now I have no choice.”\n\nShe continued to think, “This time, the God of Wealth will take the Nine Spin Destiny Mirror. Han Sen will be doomed, which makes me feel a bit better.”\n\nThinking of all this, Fox Queen realized she did not have much of a choice in the matter. If she went to another Annihilation God Spirit, they might not have even allowed her to make a wish. She bowed and said, “I will do whatever you tell me to do.”\n\nAs Fox Queen said that, the Sky God Crown shone with a god light. Han Sen knew that the deal was made. He only had to give her the Nine Spin Destiny Mirror and 300 years of Fox Queen’s life span would be his.\n\n“Fox Queen! Fox Queen! I bet you never dreamed of this day.” Han Sen was feeling very cocky. He did not give her the Nine Spin Destiny Mirror yet. He coldly said, “You go home first. Come back to the god hall in three days and pick up the Nine Spin Destiny Mirror.”\n\nFox Queen immediately said thank you, but she did not leave just yet. She changed her tone and said to Han Sen, “Mister, there is something I know. Perhaps it will help you get the Nine Spin Destiny Mirror back. I do not know if I should tell you.”\n\nHan Sen coldly asked, “Oh? Why don’t you indulge me?”\n\nFox Queen was not able to see Han Sen’s face, but he did not sound very interested. She quickly said, “The Nine Spin Destiny Mirror is in that crystallizer Han Sen’s hands. From what I know about him, he got the Nine Spin Destiny Mirror from Destiny’s Tower. He destroyed the god doll inside.” “Really?” Han Sen feigned surprise. In his mind, he coldly laughed. “Very good, Fox Queen. You are convincing a God Spirit to trick me. I will remember this, and I will make you\n\npay.”\n\nFox Queen looked at Han Sen, who now seemed interested. She quickly said, “That god doll was in the Extreme King for many years. It must have collected a great number of years. Han Sen broke the god doll, so he must have a lot of life span in him.”\n\nFox Queen stopped talking, but it was so obvious what she was doing. It was like she was saying, “Mister God Spirit, look at Han Sen like he is a big slab of meat. You should go and dine on him.”\n\n“You know a lot about God Spirits,” Han Sen coldly said as he looked at Fox Queen.\n\nFox Queen was shocked. She lowered her head and said, “I have just heard a thing or two.”\n\n“OK, you go home. Come back and pick up the Nine Spin Destiny Mirror in three days.” Han Sen sent Fox Queen away, but then he was quite angry. “Women are the evilest! You better watch out, Fox Queen. I will make you cry for your Mommy and Daddy.”"
}