{
    "chapter": 2911,
    "title": "Ghost Car",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2911",
    "text": "This bird had four wings and was very big. Its feathers were very long, especially those on its back. They were like a stream of knives on the creature’s back, reminiscent of a waterfall.\n\nIt had nine small necks and nine bird heads. It looked like a phoenix. Its small feathers were like small blades. It was very white and very murderous.\n\nThis strange, murderous nine-headed bird emerged from the rainbow. The two parts of the tablet were gone from the ground. Rainbow rain poured down on the weird bird.\n\nIts four wings flapped. Its knifelike feathers made “katcha-katcha” noises. The sounds were like knives and swords colliding against one another.\n\n“This is the true god xenogeneic Ghost Car!” a primitive deified screamed.\n\nHan Sen was shocked. He had heard the name of the Ghost Car xenogeneic before. Some people said the Ghost Car had phoenix blood. Some people said Ghost Car was a murderous bird, and wherever it went, chaos followed in its wake.\n\nThat was not the reason Han Sen had heard of Ghost Car before. In the legends, one of Sacred’s four holy beasts was Ghost Car. That was where Han Sen had heard its name before.\n\nIn the legends, Ghost Car had black feathers. This one had white feathers like knives. It was a stone element. It had absorbed Han Sen’s Under the Sky Knife light, which was why it looked how it did.\n\nHan Sen thought, “This is a weird xenogeneic. I cut it in half, yet it did not die. Instead, it turned into the Ghost Car xenogeneic. What if I killed this thing again? Would it turn back into a stone tablet?”\n\nThe Ghost Car flew around Han Sen. It did so three times before stopping in front of him. It raised its head and squawked. Nine voices broke the sky and universe. It was like 10,000 knives moaning together.\n\nAfter the scream, Ghost Car put away its four wings. Its body and nine bird heads leaned forward. It was like it was obeying Han Sen.\n\n“Can I bring this bird out of God Area?” Han Sen tried opening the God Area door to take the Ghost Car outside of God Area.\n\nBecause ordinary creatures could only use their own God Area door to enter the God Area, the creatures in God Area could not open a God Area door to leave.\n\nIf Ghost Car was unable to leave the God Area with Han Sen, it was pointless for Han Sen to keep it around.\n\nHan Sen did not expect Ghost Car would follow him out of the God Area door back to Space Garden.\n\nHan Sen thought it might be because Ghost Car absorbed Under the Sky Knife power. It was very curious.\n\n“Holy sh*t! Where did this murderous bird come from?” Upon seeing Ghost Car, Wang Yuhang was shocked. Ghost Car stared at him with raised feathers. It was scary. It was like a mountain of knives.\n\n“It is a pet I just claimed,” Han Sen said with a smile. “It looks good, doesn’t it?”\n\n“Pet? What level?” Wang Yuhang stared at Ghost Car.\n\n“True god,” Han Sen said with a smile.\n\n“You and your family get all of the luck in the world for yourselves. You just went out there and came back with a true god xenogeneic pet.” Wang Yuhang looked very envious and jealous.\n\n“Come. Let me ride it and see what it feels like to ride a true god.” Wang Yuhang got close to Ghost Car, which made Ghost Car mad. Its knifelike feathers shone. Snow white knife lights were like a galaxy rising upon him. It covered the sky, ground, and the entirety of Space Garden.\n\nWang Yuhang was frightened and fell back. He waved his hands and said, “No, no, no. I was just joking with you. I would not dare ride it.”\n\n“Do not hurt people randomly,” Han Sen told Ghost Car. The knife stream on Ghost Car retreated. The bird still angrily stared at Wang Yuhang.\n\n“Little Uncle, this is a xenogeneic,” Han Sen said with a laugh. “It is not a beast soul mount. You cannot just ride it.”\n\nBao’er and Ling’er were holding hands as they came running forward. They looked at Ghost Car with curiosity. The Six-Eared Macaque and Holy Baby were behind them. They arrived like servants.\n\nBao’er pulled Ling’er next to Han Sen. She looked at Ghost Car. “Dad? What is this bird, and why is it so ugly?”\n\nHan Sen looked at Ghost Car and said, “I do not know what it is called.”\n\nAlthough its name was Ghost Car, it was a stone element that merged with Han Sen’s Under the Sky Knife power. It was not the true Ghost Car. Calling it Ghost Car, therefore, was not appropriate.\n\n“Call it Little Nine. I am going to pick fruit with Little Sister. Tell Little Nine to take us there.” After speaking, Bao’er pulled Ling’er with her and jumped toward Little Nine.\n\nHan Sen was shocked. Little Nine was a true god xenogeneic and could get very angry. If its anger were invoked, it would hurt Bao’er and Ling’er.\n\nHan Sen wanted to stop them, but the nine-headed bird, which had been named Little Nine by Bao’er, put away its knifelike feathers. It lowered its body and allowed Bao’er and Ling’er to climb atop its neck and sit.\n\nThe Six-Eared Macaque and Holy Baby wanted to follow. Before they could get close, Little Nine used its knifelike feathers to threaten them. It also screamed from its nine heads.\n\n“Little Nine, let’s go,” Bao’er said while patting it on the head. “Take me and Ling’er to collect fruit.”\n\nLittle Nine flew into the sky. It seemed worried about Bao’er and Ling’er not being comfortable, so Little Nine flew slowly and kept its body balanced.\n\n“How does that work?” Han Sen was frozen as he watched. He was the one who claimed Little Nine, but Bao’er had been able to commandeer it.\n\n“It must be Little Nine knowing that Bao’er and Ling’er are my daughters. They carry my blood. Hence, they listen… I am the strongest…” Han Sen tried to comfort himself.\n\nAfter thinking of that, Han Sen felt calmer.\n\nAlthough Little Nine had been tamed by him, its identity was still very weird. Han Sen did not trust the thing completely. He would not leave it in Space Garden alone.\n\nHan Sen planned on taking it outside of Space Garden so it could fight for Space Garden. If Bao’er could control it, he did not need to do that.\n\nHan Sen thought, “The stone tablet was absorbed by Under the Sky Knife power. The Ghost Car xenogeneic’s power has reached top-class true god. I feel safer with it protecting Space Garden. Even if people like Holy Pirate have a special power to sneak into Space Garden, it can protect Space Garden during my absence. No one will be able to do anything to it.”\n\nAlthough it was a good thing to have Little Nine, Han Sen was still annoyed that he had been unable to claim any more deified xenogeneic genes.\n\n“Speaking of that, the true god materials are deified xenogeneic genes, right? Am I able to eat them?” Han Sen wanted to do that, but he forgot about it. Getting true god items was harder than killing butterfly xenogeneics."
}