{
    "chapter": 2571,
    "title": "Crystal Furnace Database",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2571",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen memorized the Crystal Furnace skill, then he broke the crystal wall back down and tossed the remains into the burning sea.\n\nAlthough the Crocodile God hadn’t clamped down on his freedom to explore, Han Sen knew that a being of such power would be to control the whole fortress. If Han Sen did something bad, like opening his core area hall, he would be immediately stopped. So, Han Sen didn’t make any reckless escape attempts. Instead, he did legitimate work, shoveling and cleaning things up properly. He cleaned like a man who had come from a long line of noble janitors.\n\nThe crystallizers were a race that focused on technology. Unfortunately, it meant there were few leads for Han Sen to follow up on. There were many tools available, but Han Sen didn’t know how to make use of any of them. Most of the machines were probably too broken to be repaired, anyway.\n\nAs he continued to fail to find anything useful, Han Sen became less and less enthused with cleaning. He tried bringing out many items to attract the attention of the little Crocodile God, but the creature wasn’t interested in any of the things he offered to it. Clearly, Han Sen had no idea what it fancied.\n\nExquisite and Li Keer kept trying to escape, but all their attempts failed. They were in more of a rush to get out of there than Han Sen was. However, every time they tried to run, the Crocodile God’s control of gravity pulled them back. They were unable to teleport away, either.\n\nOne day, as Han Sen was cleaning up a fallen room, he found a table.\n\n“What is this?”\n\nThe table and the room’s equipment were all broken. The table was cut in half, and all four of the table’s legs were broken. But there was a drawer under the table that hadn’t been damaged. Due to the fact that the table had been broken, the drawer had popped open. After quickly rummaging through it, Han Sen found a box.\n\nThe box was made of wood, which was rare to see in a crystallizer’s territory. Han Sen opened the lid and found a pair of glasses inside.\n\nThe glasses sort of looked like sunglasses. They looked really cool, and the glass itself was dark like charcoal. They didn’t look see-through at all.\n\n“What is this rare and strange item? Were these glasses intended for a blind man?” Han Sen murmured as he fiddled with the item. There was nothing weird about them, and so he simply put them on.\n\nThe moment Han Sen put them on, the pitch-black glasses grew transparent like crystal.\n\nNo, they were more transparent than crystal. When Han Sen looked out through the glasses, he couldn’t even see the glass that was resting across his own face. And as this happened, lots of data began to scroll across the screen of the glasses. The data whizzed by in a blur, and Han Sen soon heard a voice. It seemed to be coming from the glasses, but it played directly in Han Sen’s ears.\n\n“System scanning… Genes confirmed… Crystallizer identity confirmed… Crystal Furnace data opened.”\n\nHan Sen suspected that this was a high-tech piece of equipment since it could scan one’s genes. When the voice grew quiet, though, Han Sen couldn’t feel anything different. The lights and numbers on the glasses had disappeared.\n\nAside from that initial procedure, nothing seemed to be happening.\n\n“Hey, are you still there?” Han Sen asked the glasses.\n\n“Please don’t ask dumb questions. The Crystal Furnace carries intelligence and sense. Please align yourself with intelligence to avoid sending the Crystal Furnace unnecessary messages. It is a waste of energy.”\n\nHan Sen heard the voice directly in his head, and he suppressed a sigh. A pair of glasses didn’t like him.\n\n“So…” Han Sen said one word, but then he decided to be quiet. He spent a moment thinking about what he should say first. He ended up telling the glasses, “Your name is Crystal Furnace, right? What functions can you perform?”\n\n“My full name is ZXT27 Crystal Furnace Database. I am in charge of feeding juveniles.” The voice of the glasses played in Han Sen’s ears again.\n\n“ZX… what? I am just going to call you Glasses. And what did you say about feeding juveniles?” Han Sen asked.\n\n“I am designed to aid babies in growing up healthily,” Glasses answered.\n\n“Be specific. What can you do for babies?” Han Sen asked after a second.\n\n“The main services I provide are collecting a person’s data and analyzing it with the Crystal Furnace Database.” That explanation didn’t really help Han Sen. Clearly, Glasses wasn’t that smart.\n\nGlasses seemed to be able to sense what Han Sen was thinking. It said, “ZXT27 Crystal Furnace Database is the greatest piece of crystallizer technology. It has an intelligence growth system. The starting intelligence level is that of a five-year-old crystallizer child.”\n\n“That’s pretty good,” Han Sen complimented Glasses, but he was still unable to figure out what it did.\n\nAs Han Sen tried to think of a way to ask Glasses more about its purpose, he saw Exquisite approaching from the swimming pool.\n\nHan Sen’s heart jumped. He used his mind and spoke to Glasses. “Let’s be more pragmatic. Do you have a see-through function that allows you to see through walls, or maybe clothes?”\n\nHan Sen remembered that pairs of glasses in fiction often had that function. He had his Dongxuan Aura, but he couldn’t use it to see through clothes. If Glasses had that function, then maybe the device wasn’t too shabby.\n\n“Voyeurism goes against crystallizer law, article 16221. Violations can result in prison sentences of five to ten years. ZXT27 is an AI for children, and so it does not allow that function. A professional worker allowance card is required to enable that function on your Crystal Furnace Database.”\n\n“Are the crystallizers such good people?” After mulling that over, Han Sen sighed.\n\n“Then, what is it that you do? Show me,” Han Sen said finally.\n\n“Please select a target,” the pair of glasses said.\n\n“I want her,” Han Sen said as he directed his gaze at Exquisite, who was coming over.\n\nSymbols and data suddenly ran across Glasses’ screen. The view of Exquisite zoomed in slightly, like a camera was focusing on her. The crosshairs locked on tight as Glasses started its analysis.\n\nThe glasses didn’t release any light or anything, so Han Sen didn’t know how Glasses was performing its analysis.\n\n“Collecting data… analyzing data… data…”\n\nExquisite was already in front of him by now, and the device was continuing to scroll through data.\n\n“This thing is so slow. It’s as laggy as a dying computer,” Han Sen thought to himself.\n\n“Why are you wearing black glasses that you can’t see through? Are you pretending to be a blind man?” Exquisite said, peering at Han Sen’s face.\n\n“Yeah, I’m just messing around,” Han Sen said casually. But he was actually thinking, “It looks like I’m the only person who can see through the glasses. If other people look at the glasses, all they see is black. This is quite smart.”\n\nAt this time, the voice in the glasses spoke in Han Sen’s head again. “Scanning was successful. The data has been successfully analyzed.”\n\nHan Sen observed the image of Exquisite and the data being displayed on Glasses’ screen. There was a report, too.\n\n“Target: Very High female…” Han Sen looked at the first few words in front of him in stunned silence."
}