{
    "chapter": 2977,
    "title": "God Spirit's Special Authority",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2977",
    "text": "Han Sen looked at God and said, “You got here at just the right time. Why did I become a God Spirit for just wearing this Sky God Crown?”\n\nGod laughed and said, “You did not become a God Spirit. Because the Sky God Crown is here, you temporarily became a God Spirit. If you remove the Sky God Crown, none of that will exist.” After hearing that, Han took off the Sky God Crown and departed the god temple. When he put the Sky God Crown again, he returned to that god temple. The white god flag appeared in front of him.\n\n“Is that all this Sky God Crown does?” Han Sen was disappointed. To him, becoming a God Spirit did not appear to be particularly useful.\n\nGod sat down on the god altar’s edge and casually asked, “Is that still not enough for you? You do not need to do what God Spirits do, but you get to enjoy the benefits of a God Spirit. Many God Spirits would like that.”\n\nHan Sen’s heart jumped as he quickly asked, “What responsibility and benefits do gods have?”\n\n“As long as you wear the Sky God Crown, if the Sky God Crown is not broken, you will be like other God Spirits,” God said. “You will have an immortal body inside the god temple. Even if you are killed, you will respawn here in the god temple.”\n\nHan Sen lifted his lips and asked, “What does that mean? I do not want to be stuck inside a god temple forever.”\n\n“Of course, it does have meaning. For example, if you are up against a powerful enemy that you cannot beat, you do not need to be afraid of dying when you are in the god temple. You can fight them without fear.” God laughed.\n\nHan Sen shook his head. “That does not make sense. If I were killed by my enemy, he would just take my god flag. Then, I would end up dead.”\n\n“That is the power of Sky God Crown. Even if someone removes your flag, it will just break your Sky God Crown. You will still respawn, but you will lose the authority of being a God Spirit.” God pointed at the Sky God Crown and went on to say, “Plus, when you’re a God Spirit, you have the authority of a God Spirit. You can trade with any creature in the universe and gain their lifespan.” Han Sen had always wondered that. The God Spirits were immortal existences, so why did they require the years of others?\n\nBased on God’s method, they used a lot of effort. They would do anything for another creature’s life span. Han Sen did not understand why they did it.\n\n“To the immortal God Spirits, what is the point of extending their life span?” Han Sen pretended to look disdained.\n\n“About that, you will understand in the future.” God did not answer Han Sen’s question. He laughed and told Han Sen, “As for the responsibilities of gods, it is quite simple. There is only one task, which is to protect the geno hall and forbid it from being invaded by other creatures.”\n\n“Protect the geno hall?” Han Sen asked with an obvious look of confusion. “Does the geno hall require protection? Let’s not talk about other things, but that woman inside the geno hall is invincible.”\n\nGod shook his head. “The goddess you talk about is one of the 12 Annihilation class God Spirits. Those 12 Annihilation class God Spirits guard the geno hall in sequence. Their responsibility is the same as all the other God Spirits though. There is no difference between them.”\n\n“What about the geno hall? Does the geno hall have no God Spirits?” Han Sen quickly asked. God laughed but did not answer. “When you enter the geno hall, you will understand. As long as you have the Sky God Crown, you will earn the benefits of a God Spirit minus the responsibility. You can also give up the God Spirit identity whenever you please. Are you still not satisfied with this good stuff?”\n\n“Aside from all that, Sky God Crown has no battle abilities?” Han Sen still thought it was useless for him to become a God Spirit.\n\nGod laughed. “Of course! The Sky God Crown is almost indestructible. Its durability is stronger than most Annihilation class god personality armaments. You can use it like a brick, but the item itself does not have battle power. OK, you should think of a powerful title now. Once you have a god name, you can really enjoy the powers of being a god.”\n\n“You said there were only 12 Annihilation God Spirits,” Han Sen said. “If I use the Sky God Crown, will I count as one of the 12? Will I have to go and guard the geno hall?”.\n\n“You do not need to,” God answered with certainty. “Did I not tell you? You are not a real God Spirit. You do not take on the responsibilities of God Spirits.”\n\nHan Sen knew that God was not a liar, but he was still disappointed. If he could go to the geno hall, he would like to see what the interior of that place looked like.\n\nSeeing the empty god flag, Han Sen thought for a few moments and said, “I will call myself the God of Wealth. I love that name, and it goes with my name Dollar.”\n\n“Huh?” God heard Han Sen’s god title and laughed. He weirdly looked at Han Sen and said, “Your god name is very… Happy. It’s not bad and very creative.”\n\n“I know, right? This title is great!” Han Sen knew that God did not mean it, but he did not mind.\n\nThe front of the white god flag now had the word “Wealth” on it. The back displayed the words “God of.” The flag shone with a god light. It flew out of the god hall and stuck to the god temple’s door. The moment the god flag went there, the Sky God Crown on Han Sen’s head shone brightly. Many mysterious messages emerged from the Sky God Crown, which made him understand many things. “I see it now…” Han Sen was feeling mysterious messages. He suddenly seemed to really understand what it was like to be a God Spirit. He was not clueless anymore.\n\nAside from what God said, the God Spirits had other powers. It was better than what Han Sen expected.\n\nGod Spirits earned the buffs of a god temple, and the buffs did not merely apply to immortality. There was a god power buff. The higher level the god temple was, the more god power he would receive.\n\nHan Sen had that Annihilation class god temple. It gave Han Sen god power buffs. It made his battle power increase another level.\n\nThat buff only worked in his god temple area. If he left the god temple, the god power buff would be gone.\n\nThere was also a special God Spirit authority. That special authority only belonged to God Spirits. Every God Spirit had its authority. Different god temples and different God Spirit powers and different authorities. Han Sen did not know what other powers God Spirits had. The God Spirit authority he received was called “Wealth.” If any creature paid with their life span, Han Sen could bless them with some wealth and give them significant wealth for a short amount of time.\n\nOf course, God Spirit authorities could only be used when that person paid a sum of their years. The scarier thing was that the wealth Han Sen gave did not just come out from nowhere. It used the wealth that the person would have in the future.\n\nIf Han Sen gave someone more wealth than he earned in his life, very bad things would happen to that person."
}