{
    "chapter": 1057,
    "title": "Bullying the Shura Prince",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1057",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nZhou Ping looked at Han Sen. He and the others agreed with what the old officer had told them, but they really did not want the human competitor to lose.\n\nYu Tuoshan looked at his opponent and said, “I must say I never expected to encounter a human as honorable as you.”\n\n“Our culture is richer than you might think; we’re not all composed of heartless rabble. Maybe when this is through, you can consider trying to learn more about us?” Han Sen was not fond of this compliment, as it suggested something quite sour.\n\n“Let’s strike.” Yu Tuoshan’s muscles suddenly rippled and exploded with a number of green, pulsating veins.\n\nThe muscles now looked like steel cannons, and the shura’s once-pretty face looked hideous and demonic.\n\n“If he’s transforming now, he must only now be preparing to fight for real. This time, he means business,” Ji Hailan said, with a frown.\n\n“Desperate times call for desperate measures,” Zhao Yongbo said.\n\nJi Hailan replied, “Of course, that’s what Angel Gene specializes in.”\n\n“You…” Zhao Yongbo’s face looked like he had been delivered a very personal insult.\n\n“Stop arguing,” Bai Yishan said, to quell any possible bickering that may have arisen.\n\nBack in the arena, Han Sen watched Yu Tuoshan transform but remained unfazed. He stayed motionless.\n\nAfter the transformation, he noticed Yu Tuoshan’s lifeforce had increased considerably. The prince was now of much greater strength than Han Sen.\n\nAnd again, he was unfazed. Raw strength was not absolute, and it was only one component of the art of combat. Han Sen had more than a few tricks up his sleeve, ready to deal with this simple, brutish threat.\n\nYu Tuoshan was not as strong as a king spirit of the Third God’s Sanctuary.\n\nWhen it came to fitness, Han Sen was lacking against king spirits, too. But his skills and abilities were, for all intents and purposes, just as strong.\n\nYu Tuoshan believed Han Sen was weak, but the truth was the opposite, and Han Sen knew it.\n\nRaw power wasn’t the end-all.\n\nHan Sen had been fortunate, though. His experiences during his time in the sanctuaries had led to him having nine open gene locks at a fitness level that was believed to be almost impossible. No one had ever achieved what he had done before.\n\nYu Tuoshan noticed Han Sen wasn’t moving an inch, so he took the opportunity to strike. As if his arm was a blade, he swung it towards his despised opponent.\n\nHe was using Shura Slash this time, wanting to ensure he ended the fight now and avoided allowing any more unfortunate mishaps to occur.\n\nYu Tuoshan’s hands were like metal cannonballs, nearing Han Sen at a frightening pace with the plain desire to break him.\n\n“Ah, that is the prince we all know and love. Witness the power, people! If Han Sen even thinks of blocking those fists, he can say goodbye to his hands.” Lian Chan’s smug attitude had returned.\n\nThis was partially true for all the shura now. Excitement and fervor had returned to them in spades, which made Zhou Ping worry quite a bit.\n\nShura Slash was devastating against most humans who were unfortunate enough to be at the receiving end of it.\n\nWhile it appeared fairly ordinary, the power it delivered was more frightening than any weapon.\n\nYu Tuoshan had reached the zenith of what was possible with this skill. He had mastered it, well and truly, and it would bring ruin to any human that sought to withstand it—or so it was believed.\n\nEveryone thought Han Sen would dodge the strike, but just like before, Han Sen reached out his hand and attempted to grab his opponent’s fist.\n\n“Fool!” Lou Lan said.\n\nThe shura who watched the stream yelled in delight.\n\nBut Han Sen was successful. He grabbed Yu Tuoshan’s hand, and the metallic cannonballs were brought to an abrupt stop.\n\nHis hands were like pythons, and following the stop, Han Sen lifted Yu Tuoshan into the air and threw him down on the ground.\n\nBoom!\n\nHan Sen walked forward and grabbed the shura by the waist, piledriving him into the ruined floor of the arena.\n\nRoar! Yu Tuoshan raged like a monster. He leapt to his feet and ran towards Han Sen.\n\nBoom!\n\nHan Sen side-stepped, grabbed the shura’s arm, and suplexed him into the ground.\n\nThe third-rank shura prince’s nose snapped.\n\nGiven a breath, Yu Tuoshan got back to his feet and tried to madly attack Han Sen once again. But it was like they were stuck in a loop because the same thing started to happen over and over. The prince would be thrown to the ground by Han Sen’s mountain-strong muscles, before leaping up to try again and falling prey to the same parry.\n\nEveryone was quiet. There was no booing, and neither was there any thunderous applause. There was just silence. It was incredibly difficult to fathom what their eyes were relaying to them; they were now actually witnessing Han Sen bully a shura prince.\n\nBoom! Boom! Boom!\n\nDespite the countless times he was thrown to the ground, Yu Tuoshan refused to concede. And eventually, he was spending more time on the ground than on his feet.\n\nYu Tuoshan’s hard body was as flimsy as an old dishcloth now.\n\nIt was a horrifying scene, one that nearly petrified all those who watched."
}