{
    "chapter": 2827,
    "title": "A Gamble That Depends on Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2827",
    "text": "I wonder if the method to kill a god is useful with God's Knife. Han Sen's heart jumped. He summoned Sky Vine Radish and threw a punch toward God's Knife.\n\nPang!\n\nGod's Knife was not damaged, but the blood flame demon was hit by Sky Vine Radish. The flames of its composure went everywhere.\n\nIt really works! Is that thing a god too? Han Sen was delighted.\n\nSky Vine Radish was strong. It kept punching the blood flame demon. It made the blood flame demon shatter and shimmer everywhere. It was unable to fight back.\n\nGod's Knife was already falling back. Now, Sky Vine Radish was attacking it. The bloody fires of the knife were becoming weaker. In the end, the bloody flame was broken by Sky Vine Radish. God's Knife turned dim as if it had lost all control.\n\nHan Sen flew in front of the God's Knife, picked it up off the ground, and discovered that God's Knife was nothing more than an ordinary sharp knife without its power.\n\nBoth of his hands held a separate side of the sharp knife. He wanted to break the knife, but he was unable to achieve what he wanted. The knife was still as hard as before. It just did not have a lively presence inside it anymore.\n\nHan Sen thought, I didn't hear the hunting announcement. Perhaps that means I didn't kill it. He put God's Knife inside Destiny's Tower and kept it suppressed.\n\n\"Wan'er, follow me. I am going to take you to see Lone Bamboo,\" Han Sen said as he approached Wan'er.\n\n\"Do you know my brother?\" Wan'er was happy, but then she looked sad and shook her head. \"You should leave now. I cannot come with you.\"\n\n\"God's Knife has already been suppressed by me. What more do you need to concern yourself with?\" Han Sen saw in Wan'er's face that she was hiding something.\n\n\"I signed a contract with a god. I cannot leave here. If I do, I will end up causing my big brother harm.\" Wan'er shook her head.\n\n\"What contract?\" Han Sen asked with a frown.\n\nWan'er shook her head and said, \"I cannot tell you. If I tell you, big brother will be in danger.\"\n\nHan Sen knew he could not blame Wan'er for thinking that way. If he was in her position, he would feel as if this was a trick too. Before being 100% sure, he would never try to do something that could put his family at risk.\n\n\"I will not force you to come with me, but God's Knife has been suppressed by me. Will the god be OK with that?\" Han Sen looked at Wan'er as he spoke.\n\nWan'er nibbled her lips but did not say anything. She was unsure.\n\n\"How about this?\" Han Sen went on to say, \"Tell me where that god is, and I will go out and look for it. I will see if there is a way for me to kill it.\"\n\nIf the god Wan'er had signed a contract with was the same as Evil Lotus God, perhaps there was a chance for Han Sen to kill it. If he did that, Wan'er would be free again.\n\nWan'er still shook her head and said, \"You should go. A god is not something we can deal with. He is so powerful, and he is everywhere.\n\n\"But I did manage to suppress the God's Knife. Suppressing a god is not something impossible.\" Han Sen tried to convince her.\n\n\"This is different. The God's Knife is just a knife. It's one of God's toys. How can it compare with the god itself? The power of a god is not something we can feasibly comprehend.\" After that, Wan'er's small face had a frightening expression. It was as if she was in the recollection of something terrible.\n\n\"How can you know it won't work if you haven't given it a go? If your big brother Lone Bamboo knew you were here, I am sure he would want to see you again.\" Han Sen hoped to use Lone Bamboo to change her mind.\n\nWan'er looked hesitant, but then confidently shook her head. \"Thanks a lot, but please do not tell big brother about me. You should leave now. The God's Knife has been affected, and I am sure the god must have felt it. When he comes, it will be too late for you to escape.\"\n\n\"It is already too late...\" Wan'er's last sentence was spoken a different tone of voice. She was like a different person.\n\nHan Sen's face changed. He saw Wan'er's body start to morph with a blurry god light. It was like her entire body was being showered in the morning light. Her eyes became weirdly clear. She appeared to become an emotionless machine.\n\n\"You have broken into my farm and destroyed my knife spirit. You are a very interesting person.\" Wan'er looked at Han Sen with interest as she spoke. Her face was like a king in a high place, looking down on a clown's performance at the circus.\n\nHan Sen coldly looked at Wan'er and asked, \"Are you the god?\"\n\nHan Sen suddenly realized something, but he did not know what it was.\n\n\"Yes, I am God.\" Wan'er smiled and nodded. She stared at Han Sen and asked, \"What is your name? What race do you belong to?\"\n\n\"I am Dollar. I am a human,\" Han Sen answered.\n\nWan'er shook her head and said, \"You are not a human. Humans don't look like you. You are a xenogeneic.\"\n\nHan Sen's heart jumped with shock. Pretty much no creature in the universe knew about humans, but this so-called God seemed to know about the existence of humanity. It also knew that he was not a human. This was a problem.\n\n\"How do you know I am not a human?\" Han Sen quickly asked.\n\n\"If I think you are not a human, then you are not a human,\" Wan'er replied. \"There is no why.\"\n\n\"What is your name?\" Han Sen asked.\n\n\"I am God,\" Wan'er answered.\n\n\"Don't gods have a title? Something like Empty God? Sky Empty God and etcetera? What is your title?\" Han Sen asked.\n\n\"You know a lot. It is no wonder you were able to destroy the spirit of my knife.\" It laughed and said, \"But I do not have a title. You can just call me God.\"\n\nBefore Han Sen said anything more, God went on to say, \"You destroyed my knife spirit, and I am OK with that. If you want to take away Wan'er, you can do that too. But this world is a fair place. You are taking so much, so you should give something back in the interest of fairness, of course. Wouldn't you agree?\"\n\n\"No. That was something I achieved through my own power. Why should I give out anything?\" Han Sen smiled.\n\nGod was shocked, but it then laughed. \"Well said. Something you take through your own power means you shouldn't give out anything. I really like you. How about this? It is rare to find an interesting xenogeneic like you. I am giving you a chance now. So, let's have a bet. If you can beat me, you can leave without any harm and Wan'er can go with you.\"\n\n\"What if I lose?\" Han Sen frowned.\n\n\"If you lose, you are so funny that I wouldn't want to see you die.\" God went silent. It went on to say, \"You can replace Wan'er's job here. You can feed God's Knife for the next century.\"\n\n\"That's not fair,\" Han Sen said with a smile. \"If I win, you do not have to give anything. If I lose, I have to give you a hundred years of my time. Why would I take part in such an unfair gamble?\"\n\n\"Because that is a bet that involves my own power,\" God said with a smile.\n\nHan Sen was going to say there was nothing he could to him if he didn't do anything. Before he said anything, he shockingly noticed that within God's stare, his hands were not listening to him. He held his neck and squeezed. He squeezed himself so hard that he was going to suffocate. With Han Sen's will and power, he was unable to control his own body.\n\nInside the Sea of Soul, the black crystal armor reduced its presence. It pretended it did not exist. There was no reaction."
}