{
    "chapter": 1710,
    "title": "Snakes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1710",
    "text": "In the dark holes, there was something red like lanterns shining. When the red lights rose to the surface, they were revealed to be the triangularly-shaped heads of snakes. The red lights were their gleaming eyes.\n\nNow, black things were pouring out of the dark holes. They came straight for Han Sen, making a sharp noise.\n\nHan Sen was startled as he looked at them. Old Cat had already escaped with incredible speed.\n\n“Xie Qing, run!” Han Sen shouted and started to run.\n\nThey did not know what those black-scaled snakes were, but if Old Cat had run away upon seeing them, they thought it was a good idea to follow after him.\n\nXie Qing King did not want to run, but he obliged Han Sen’s request and went along with him.\n\nThe toxic snakes were coming at them like a breaking tide. They were very fast, but thankfully, they were slower than Han Sen.\n\nThe trio kept on running as fast as they could. But a while later, the snakes appeared in front of them. The greenhouse also ended up in front of them, too. Somehow, through means unknown, they had been forced to make another loop.\n\nNow that they had snakes in front and behind, they were firmly sandwiched.\n\nSeeing the groups of snakes gathering together, Xie Qing King unleashed a silver light. His fists were like a volcano, spewing silver fire as he threw them forward to punch the black snakes.\n\n“Alu-Alu-Alu!” The raging fists of silver light killed a vast number the black-scaled snakes upon contact. The toxic blood was thrown everywhere.\n\n“I thought these things were something scary! They’re this weak?” When Xie Qing King stopped punching, the place had undergone a makeover to look like a slaughterhouse. The bodies of the snakes were everywhere, and not a single one had survived his rampage.\n\nOld Cat looked at him as if he were an idiot, and he said, “Are you stupid? If this was that easy to deal with, why would we have run? You killed so many of those snakes, she is going to go mental!”\n\n“Old Cat, what do you mean?” Han Sen asked with a frown.\n\nOld Cat did not answer. An explosion came from the greenhouse, one that sounded like the earth tearing apart. Something emerged from the ground.\n\nIt was a person with long hair and a beautiful body. Or at least the upper-part was, for the lower body was a slithering snake. She’d have been a beautiful woman if she was a complete one.\n\nShe opened her eyes, but there were no pupils. She even had the eyes of a snake. She stared at the three of them intensely.\n\n“Don’t move. Don’t make a sound. Her vision is bad, so there is a chance she’ll be unable to see us right here,” Old Cat told them, retreating to the side.\n\n“She can’t see, but she’s not deaf. You’re so loud, she’ll certainly hear you,” Xie Qing King said, not moving.\n\n“She can’t hear, either. She can see moving objects, so if we don’t move, she won’t be able to see us,” Old Cat said.\n\nHan Sen and Xie Qing King did not believe him, but when Lady Snake came out, she made a noise with her tongue but did nothing else. She didn’t pay them any attention.\n\nLady Snake moved around a bit, but it appeared as if she couldn’t see the three of them. It was as if she was moving around in search of something.\n\n“She really can’t hear or see us? If that’s the case, why are we afraid of something so dumb?” Xie Qing King was shocked.\n\n“Dumb? You better hope she doesn’t find us. She can kill you as easily as she might a chicken.” Old Cat looked at him with disdain.\n\n“Stop it, you two. She’s coming,” Han Sen said, looking at Lady Snake.\n\nLady Snake could neither see nor hear, but she was sure Han Sen was around there. It kept searching and searching, leaving him unable to move.\n\n“What should we do? She will bump into us sooner or later. And when that happens, we’ll have no choice but to move,” Han Sen said.\n\n“She can’t hear and she can’t see. Why don’t we just get rid of her when she comes too close?” Xie Qing King said.\n\nOld Cat laughed and said, “No one is stopping you from trying. If you want to die, be my guest; I will be running.”\n\n“How do we escape?” Han Sen asked.\n\nOld Cat laughed and said, “I don’t know. But judging from the way she’s searching, she’ll be bumping into you first. And when she’s busy with you two, I can have a chance to run.”\n\n“You’re f*cking shameless.” Han Sen shot him a glare. “That sounds like a good idea, but even so, you cannot leave here completely. She will hunt you down, one way or another. If we are all going to die, why don’t we work together, find her weakness, and kill her through co-operation?”\n\nOld Cat said, “No. We cannot fight her. I am old, and I still want to live a while longer. I will run first, anyway. There’s nothing you can do about that. Look around you, man. Don’t you think this place looks a little different? Maybe her rising made the restrictions disappear. Perhaps we can waltz out now.”\n\n“Okay. If you want to run off, why don’t you tell us what it is?” Han Sen said.\n\nOld Cat looked at Lady Snake, and then said, “If I’m correct, this thing is a new creature. One combined with a Naga. She has the power of a Naga, and she’s got the creature’s genes. That makes her even scarier”\n\n“What are their weaknesses?” Han Sen asked.\n\n“I told you. Her vision and hearing are awful,” Old Cat said.\n\n“And? How do we kill her?” Han Sen pressed.\n\n“Haha! Nagas are a noble race, and any of them can easily destroy the tribes and families of others. Where the crystallizers found Nagas, I have no idea. But I really don’t think you can kill her. It would be best if you decide which of the two of you would rather die first. Who knows? Maybe one of you can make it out while the other is mauled.” Old Cat sounded quite spiteful.\n\nAfter that, Lady Snake came right before them. If she slithered in another circle, she’d undoubtedly bump into them. She’d hit Xie Qing King first, too, judging from her position.\n\nWhen Lady Snake was only thirty meters away from Xie Qing King, the spirit said, “If she’s as strong as the cat says, I will try and fend her off while you make a break for it. Just remember to upload my comic.”\n\nHan Sen wished to say something, but the monster suddenly changed direction. It was supposed to hit Xie Qing King, but now it was going for Old Cat instead.\n\n“Oh, sh*t!” Old Cat’s eyes widened."
}