{
    "chapter": 2668,
    "title": "Empty God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2668",
    "text": "Han Sen’s face looked weirded-out, and he couldn’t help but think, “This is so similar to what I saw in the Destiny’s Tower of the Extreme King. The man over there looked quite a bit different, though.”\n\nLi Keer heard Han Sen’s thought, and she looked at the man atop the platform with shock. “Weird. It is a creature, but why does it not have a lifeforce?”\n\nAs a look of confusion crossed Li Keer’s face, the man on the stone platform opened his eyes. He looked at them and said, “I am Empty God. The fact that you have met me today is surely the working of fate. I can fulfill any wish you speak. You can make any request you desire.”\n\n“Not again.” Han Sen’s heart jumped.\n\nLi Keer looked at the man coldly and said, “How dare you call yourself a god in front of the Very High. Not even the Ancient God would refer to themselves as proper gods.”\n\nAfter that, Li Keer swung a swordlight at the man.\n\nShe struck too fast for Han Sen to try to stop her. The swordlight came down on the man’s head, but the man didn’t even have to move. The swordlight crashed against one of his eyebrows.\n\nPang!\n\nThe man’s eyebrow wasn’t even ruffled. Li Keer was hurled back by a scary force. The power was so strong that it swept past all of Li Keer’s defenses. She was thrown into the wall hard, and she coughed up a mouthful of blood. She passed out and fell into a coma. Her lifeforce faded quickly.\n\n“How dare you challenge a god’s dignity and question his authenticity. This is your punishment, but seeing as this is your first infraction, the punishment will not be severe,” the man said in an icy voice.\n\nHan Sen quickly ran toward Li Keer and checked her vitals. She had only fainted, and while her lifeforce was fading, it was seeping away slowly. She was in no immediate danger. He thought to himself, “This god seems different from the other one I met. I remember the man in the Extreme King’s Destiny’s Tower shouted ‘Empty God.’ Is this the Empty God he was referring to?”\n\n“Now, make your wish,” Empty God said, looking at Han Sen.\n\n“My life is perfect as it is, thanks. I have a wife, a happy family, great kids, and I always get what I want, anyway. Add to that, I’m super-rich. I have everything. I don’t need anything more. Can I choose not to make a wish?” Han Sen looked at Empty God as he spoke.\n\nHan Sen didn’t know if this Empty God was the same as the other god. If it was the same, then this really was just a statue. It wasn’t the true self of the god it represented. Therefore, he didn’t have to worry too much. The black crystal armor could wipe it out in a heartbeat.\n\nIf this was the god’s real body, though, then a fight might be a bad idea. Han Sen wasn’t sure if the black crystal armor could also defeat these gods in their real forms.\n\n“No,” Empty God said coldly.\n\nHan Sen’s heart felt ill. He ignored Empty God, picked up Li Keer, turned around, and started to run.\n\nEmpty God only looked at Han Sen peacefully. He didn’t look as if he was going to stop Han Sen from leaving.\n\nHan Sen was trying to figure out whether or not Empty God was really going to fight. He was also doing this to test the black crystal armor, and sense if there was any movement from it. But its lifeforce was hidden, so he couldn’t feel anything.\n\nEmpty God didn’t stop Han Sen, either. Still holding the unconscious Li Keer, Han Sen departed the seventh floor. He went down floor by floor without being stopped by any aggressive powers. Finally, he reached the first floor of Destiny’s Tower.\n\nBut when he reached the first floor, Han Sen froze. There should have been a door at the bottom floor of Destiny’s Tower, but there was none. There was only another stone staircase leading farther down into the tower.\n\n“I’ve already reached the bottom floor. Why are there more stairs that can lead me down even farther? Have I remembered it incorrectly, and this is actually the second floor?” Han Sen quickly dismissed that idea. Destiny’s Tower only had seven floors, and with his exceptional memory, he couldn’t have been wrong.\n\nHan Sen reached out a hand to where the door should have been, but there was just a wall there. It wasn’t an optical illusion. There really wasn’t a door.\n\nPang!\n\nHan Sen threw a punch at the stone wall. With his strength, even a mountain would have been destroyed by one of his punches. But the stone wall didn’t buckle, and there wasn’t a single scraped left on its surface.\n\nHan Sen frowned. He knew that nothing would be achieved by using brute force. He looked at the stone staircase, then turned and continued walking down.\n\nWhen he reached the floor below, he noticed that there was another stone platform. The stone platform had that same man on it—the one who had called himself Empty God. It was exactly as it was on the seventh floor.\n\n“Make your wish,” Empty God said, staring expressionlessly at Han Sen.\n\nHan Sen gnashed his teeth. Still holding Li Keer, he continued trying to descend the stairs. There were more of them, and he swiftly descended another seven flights. He was still unable to find the first floor and its door. He only found more and more stairs.\n\nAfter walking down the stone stairs for a while, Han Sen realized he always came back to the seventh floor of the tower. There, he saw Empty God again.\n\n“Is this some sort of space power? Does it connect the seventh floor and the first floor to create some sort of weird Mobius strip? If that is true, no matter how far I walk, I will never reach the exit of this tower. I will just keep looping the same route over and over again.” Han Sen tried using teleportation powers, but it was to no avail. No matter where he tried to teleport to, he always reappeared inside the tower, just in a different location each time.\n\n“Make your wish.” Whenever Han Sen saw Empty God again, the man would repeat the same phrase. He never said anything else.\n\nBut his expression seemed to say that Han Sen had no other choice, and that sooner or later, he would have to make a wish.\n\nHan Sen knew that if he made a wish, some of his lifespan would be taken by those men that called themselves gods. And the wish he made would be twisted by the so-called gods. Even if the wish came true, he would have to pay too high a price.\n\nIf he didn’t make a wish, though, there was a chance that he and Li Keer would never be able to exit the tower. Han Sen couldn’t figure a way out of this dilemma.\n\nHe couldn’t attack Empty God. Li Keer had demonstrated that inability all too well. The only chance he had to attack was if he could somehow make use of his black crystal armor. Attacking Empty God in any other way was practically a death wish.\n\n“Li Keer’s father must know we walked into Destiny’s Tower. If we don’t emerge anytime soon, he will surely come here in search of Li Keer.” Han Sen was placing his chips on Li Keer’s father.\n\nEmpty God seemed to see through what Han Sen was thinking, and he coldly said, “Have you heard of power that warps the passage of time? You might stay in this tower for a thousand years, but only a second will pass outside. If you are expecting a rescue team to come and find you, you’ll be nothing but bones by then.”\n\n“Do I really have to make a wish?” Han Sen looked at Empty God and sighed.\n\n“If you and I have met, it is something that was always meant to be. You deserve this. You cannot escape from it.” Empty God spoke slowly in a bone-chilling voice."
}