{
    "chapter": 1114,
    "title": "Spleen",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1114",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBai Yishan answered, saying, “Hidden Blood is just a name we have given it. But it is an ancient skill, one that was developed by a certain cult. The skill’s original name was Blood Magic, and I can only suppose it was once regarded as being evil.”\n\n“These are the days of greys, though. Determining what is good and what is evil, that which is black and that which is white, is a thing of the past. The roads to hell are paved with good intentions, after all. All that matters is the method and reason for which something might be used. And that is the case with Hidden Blood. I’ve been researching this particular skill for quite a few years, and I think it’s time for the training wheels to come off and for it to be used properly.”\n\nHan Sen was rather shocked by Bai Yishan’s vivid and detailed explanation, but he still wanted to know more. He asked, “What do you mean?”\n\nBai Yishan said, “Hidden Blood increases the strength of one’s spleen. It makes the blood itself stronger, and through using it, you can actually feel your bloodstream pump with greater energy. The blood itself is energized.”\n\n“And what’s so good about that?” Han Sen asked.\n\n“It filters the dirt in your blood and concentrates it. Think of it like fuel for an aircraft; one liter of fuel can allow for the flight of a thousand miles. If aircraft could learn Hidden Blood, that same liter of fuel could allow for a flight of many thousands of miles. It means you can store much more power inside your body.” Bai Yishan looked very excited as he explained Hidden Blood to Han Sen.\n\nBai Yishan was still not done, either. With a remorseful look, he said, “But we have a problem. Ordinary people cannot handle this energized blood pumping through their veins; more specifically, their hearts cannot handle it. Our bodies are designed for ordinary blood, after all.”\n\n“You want me to be your guinea pig?” Han Sen guessed.\n\nBai Yishan looked at Han Sen and said, “Well, you have Heresy Mantra. Your heart and vessels are considerably more powerful than those of others. With your fitness level, you should be able to make use of Hidden Blood without issue.”\n\n“No way.” Han Sen thought it to be a needless risk, one that was too dangerous.\n\n“Think about it! A good generator needs good fuel. You have a powerful heart, but your blood is average. Don’t you think that is a shame?” Bai Yishan said.\n\nHan Sen told him, “You are right, yes. But being a lab rat…”\n\nBai Yishan said, “We have already conducted a plethora of tests. Blood Magic cannot be controlled, though. It is addictive, to say the least. Once you have started learning it, you cannot stop. But that was the skill in its original form. We have tweaked it so that this is not an issue. You can stop practicing it whenever you want. Furthermore, we have developed pills that can revert your blood back to its ordinary, unrefined form.”\n\nHan Sen was starting to look excited as he considered these prospects. He asked, “This skill is going to be forbidden soon, isn’t it?”\n\nWith an awkward expression, Bai Yishan admitted it by saying, “The rules and restrictions of the Alliance are too cruel.”\n\nHan Sen thought to himself, “It’s not about the rules, man. You’re always researching the forbidden, evil arts.”\n\n“But don’t worry, your talent is around thirty percent as good as mine. So again, like I said, you’ll be fine. And you can stop learning it whenever you desire,” Bai Yishan said.\n\nBai Yishan then went on to say, “If you help me with this, I’ll help you research a stomach hyper geno art. How does that sound?”\n\n“For the future of humanity, for the advancement of prosperity and peace across the galaxy, I, Han Sen, will submit and become your lab rat. This is a choice I will not regret,” Han Sen agreed.\n\nHe didn’t like his current stomach hyper geno art, so if Bai Yishan was willing to create a better one for him, it was a worthy deal to accept.\n\nHan Sen thought Bai Yishan was right, too. His heart really was strong, and it would have been best to have finer blood coursing through it. Han Sen was confident about his control over the skill, too, in that he’d be able to stop whenever he wanted.\n\nBai Yishan gave Han Sen Hidden Blood’s information and the geno solution. He still respected Han Sen, so he wanted him to review the situation and what he was getting into first.\n\nThere were risks involved with the skill, too. So, for the duration of his learning, he had to remain where he was and be monitored.\n\nBai Yishan had arranged and done everything, even creating the classified documentation for Han Sen. Neither of them wanted information to leak, stating Han Sen had actually recovered from his crystallization blight.\n\nBut Han Sen was prepared for his healing to receive exposure, whenever that happened. It wasn’t the biggest secret, and no harm would actually come from others learning he was better.\n\n“Little Han, you are so strong. I have never seen a surpasser as strong as you, especially where your heart and vessels are concerned. Dare I say, you were born to learn this skill, boy. You were born to learn it!” Bai Yishan’s constant compliments were becoming sickly.\n\nHan Sen gave up on the idea of leaving the barrens for now, deciding to stay there, practicing Hidden Blood for the time being.\n\nHe felt good practicing it. He used to believe his blood was already quite pure, but this skill taught him differently. After its filtering and refining process, he felt considerably stronger. His spleen was like a clean, energy storage facility that could constantly produce energized blood."
}