{
    "chapter": 2186,
    "title": "A Punch and a Punch",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2186",
    "text": "“Dollar?” The woman recognized the person hovering in front of her.\n\nThe Extreme King were quite full of themselves, and since they always thought themselves superior to others, they didn’t participate in the Geno Being Scroll. They did, however, keenly watch the fights that unfolded there.\n\nThat was especially true of the Marquise fights. The woman had watched each and every one of them. She recognized the gold armor Han Sen was wearing.\n\n“I will be keeping this. You can go now,” Han Sen stated, turning the Destroyed Bible over in his hands.\n\nHe had used Little Invisible to hide himself so he could follow Bai Lin, but he had waited until now to make a move.\n\nHe hadn’t wanted to take action while they were inside Six Star xenogeneic space, but as he followed the fox sisters, he noticed the Extreme King woman was pursuing them as well.\n\nThis would probably be his best opportunity to steal the Destroyed Bible while pinning the crime on the Extreme King woman.\n\nSince the fox sisters had made their escape, everyone would soon learn that the Destroyed Bible had been stolen by the Extreme King. No one would believe that someone had actually confronted one of the Extreme King and stolen it back, so Han Sen would likely be safe from accusations.\n\nEven if people believed that Dollar ultimately claimed it, that wouldn’t matter. No one had a clue who Dollar really was. So, Han Sen was safe.\n\nHe originally planned to launch a sneak attack, but the woman had discovered his presence before he had the chance to. That surprised him.\n\n“In the eyes of the Extreme King, achieving first place in the Marquise Geno Being Scroll is nothing more than a joke,” the woman said cockily, with a snarky tilt of her head.\n\nWith no hesitation, she threw a punch towards Han Sen. The incoming strike was far harder than the one he had seen before.\n\nThe space around him seemed to get compressed by the overwhelming force of that punch. Spacetime itself looked like it was going to freeze and shatter.\n\nAlthough she pretended that Dollar was beneath her notice, after seeing Dollar fighting Evil Eye and Lone Bamboo, she knew he wasn’t a foe to be underestimated. She was well-aware that he would be a difficult foe, so she poured all of her strength and power into that punch.\n\nSeeing the woman’s punch coming for him, Han Sen used Super Spank with his left hand.\n\nPang!\n\nWhen their fists collided, the force of the Extreme King’s punch disintegrated into little more than dust and echoes. The woman’s face paled, and she retreated with haste.\n\nBut it was still too late. Her gauntlet had shattered, and the disintegrating power continued up into the rest of her armor. All she wore was turned to dust. She was left completely naked.\n\nThe Extreme King woman’s implacable face heated with embarrassment. She summoned another set of armor to clothe herself, but by the time she turned back to look for her opponent, Dollar was gone.\n\n“Dollar, I’m going to kill you.” The Extreme King woman was very angry, and her teeth gnashed. Try as she might, though, she was not going to find Dollar that day.\n\nHan Sen had returned the punch he was owed. She had sent Han Sen sprawling on Planet Blade, and he had destroyed her armor. He was only getting what he was due; they were even now.\n\nHan Sen headed to the Six Star xenogeneic space. He needed to return and let everyone know that the real Han Sen was still there. That way, he could eventually leave without raising any more suspicions.\n\nAnd in regards to the Extreme King woman, he had no interest in killing her. He headed back to the Six Star system immediately to avoid wasting any more time with her.\n\nAfter all, as long as she was left alive, Han Sen could frame her for the theft. If she was killed, that would be more difficult. The Destroyed wouldn’t be the only ones investigating her death; the rest of the Extreme King would also want to know what had happened. Having them descend on the investigation would be bad.\n\nHan Sen returned to Six Star xenogeneic space and met up with Little Angel.\n\nAll of the races participating in the search had confirmed that the escaped woman was a shapeshifting fox. There was still hope, however. The lockdown on the Six Star xenogeneic space was yet to be lifted’ so Kings finally went in to look around for themselves.\n\nBut they quickly came to the conclusion that the shapeshifting fox had managed to escape successfully. Two days later, when all was done, the lockdown on the Six Star xenogeneic space was lifted. Han Sen then took his companions back to Narrow Moon.\n\nIn the base on Planet Eclipse, in a secret room, Han Sen happily ran his finger along the spine of the Destroyed Bible.\n\n“A deified treasure. That was a pretty good gain.”\n\nAfter a while, though, Han Sen’s joy turned to frustration. No matter what he tried, he couldn’t unlock the Bible or make use of its power.\n\nHan Sen combined his light and dark powers, but even so, he made no progress in casting the powers of the Bible.\n\nHan Sen couldn’t even open the d*mned book or get a glimpse of its contents.\n\nHan Sen tried a myriad of different elements, but nothing seemed to work.\n\nSo, Han Sen used his Dongxuan Aura and Purple Eye Butterfly to inspect the Bible. After a time of careful observation, Han Sen noticed that it was actually created through a combination of light, dark, and chaos powers.\n\n“Genes are insufficient; cannot absorb deified gene.”\n\nHan Sen kept hearing that announcement, telling him he was unable to absorb it. The Destroyed Bible was a deified xenogeneic gene, so he couldn’t absorb it since he was still just a Marquise. It was the same as with the Sun Gold Bird.\n\n“I can’t eat it, and neither can I make use of it. It’s useless in my hands, even though it is deified. Unless I make it up to the class of deified, it can only be cast with light, dark, and chaos powers. Light and dark powers are already hard enough to simulate, and I can’t simulate chaos powers at all. Unless I learn all three and combine them well, I won’t be able to tap into its power.” After thinking about it for a while, Han Sen decided to give it up.\n\nHan Meng’er pushed open the secret door and stuck her head in, then pointed at the book. “Father, can I have this book?”\n\n“You want to have a look?” Han Sen turned to Han Meng’er with some surprise. She had never asked for anything before.\n\nHan Meng’er nodded. She looked at the Destroyed Bible and said, “That book seems to resonate with a power that is familiar to me somehow.”\n\nHan Sen handed Han Meng’er the Destroyed Bible and thought to himself, “It is possible, I suppose. Meng’er’s blood is complicated. But I do remember the Sacred leader possessing a light power. Her mother had the power of death, and my blood…”\n\nAs Han Sen mulled all of this over, Han Meng’er took the Destroyed Bible. The book had shown no response while Han Sen held it, but it suddenly caught fire when she touched it. Flames wreathed the stone book, then spread to consume Han Meng’er’s entire body.\n\nThree different lights began to shine from the stone book’s triangle. The white was light power, the black was dark power, and the grey was clearly chaos power. Each color correlated with a specific element."
}