{
    "chapter": 1077,
    "title": "Cheating Bao’er",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1077",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nTo the right of the tiger-humanoid monster stood a hydra. It was a hundred meters tall, and it possessed four wings. Each serpent head had a horn.\n\nNext to the hydra was a white sheep, whose wool was fluffy like the clouds of the sky.\n\nBack on the left, besides the red dog, there was a man. He was sitting, and there were devil-like wings on his back. He was clad in purple armor, but the wings wrapped him up like a blanket, obscuring most of the details of his form. Han Sen could not see his face, but he already knew the man was not human.\n\nHan Sen did not know this because of the strange lifeforce this figure possessed, nor the wings he owned, but because he had four arms. The additional two came from under his armpits.\n\nIt was a humanoid creature with four arms, and each hand held a black sword.\n\nThose creatures, along with the steel armor-clad creature Han Sen had engaged earlier, comprised the line of six inside the palace. There was plenty of space around them, but none of the creatures outside dared get closer.\n\nHan Sen saw a red Devil Fang sitting upon the tiled rooftop of a building, and noted how it looked exactly like the Devil Fang King he had slain earlier. It was most certainly a super creature.\n\nEven it, a super creature of remarkable strength, was afraid to go near the palace. The fact that it kept its distance spoke volumes for how fearsome those inside might have been.\n\nHan Sen landed on the ramparts of the shelter and observed the palace.\n\nThere was a stone platform in the middle of the palace. A black bell stood atop it. This was the bell that was tolling, drawing all creatures to the shelter.\n\nHan Sen examined it from where he was, surprised to see how crude and unrefined the bell was. Its making looked coarse, as if it were hastily forged from basic steel. Had he not seen it now, in this setting, Han Sen would not have guessed it was a prized geno treasure left behind by an emperor spirit.\n\nWere it an antique that he had just come into possession of, he’d have tossed it into the trash without a second thought.\n\nMany more creatures were still on their way to the shelter, and when they arrived, placed themselves in a position according to their power. And of course, like before, none tried to join the six inside the palace.\n\nThe bell finally stopped tolling, and when it did, the mist that cloaked the area became much darker and much thicker. Han Sen could no longer see the statue they had left behind.\n\n“Dragon King, what is this?” Han Sen asked, after seeing the creatures remain still and unchanged, following the end of the bell’s ringing.\n\n“Hang on; do not make a sound,” Dragon King whispered harshly.\n\nHan Sen then looked around and noticed many creatures were staring at him.\n\nHe immediately stopped talking. He didn’t want to risk invoking their ire, for if he were attacked now, survival would be nothing more than a fool’s hope.\n\nBao’er seemed annoyed by something. She leaped down from Han Sen’s clutch and used the creatures below as stepping stones she could hop along. She was going directly to the center of the palace.\n\n“Are you trying to get me killed?” Han Sen ran after Bao’er, hoping he could stop her.\n\n“Don’t go!” Dragon King’s call rung with the sound of shock and desperation.\n\nHan Sen ignored the plight, though. He forced Dragon King to come with him and continued his pursuit of Bao’er.\n\nBut Bao’er was too fast for him, as usual. She had successfully hopped across the heads of each creature and entered the palace before Han Sen could catch up.\n\nThe six super creatures all looked at Bao’er strangely, and as Han Sen saw all their eyes drift towards her, he couldn’t help but think, “Bao’er, you’re going to get us killed!”\n\nBao’er was not afraid in the least, though, and she just waddled towards the white fluffy sheep. When she reached it, she jumped up onto the perplexed creature’s back and began to roll and bounce in its fluffy wool.\n\nDragon King was trembling as Han Sen approached them. He was not terrified; instead, he was utterly infuriated with Bao’er’s behavior.\n\nHan Sen had a cold sweat as he entered the palace, and when he was in, he tip-toed over to Bao’er to pick her up,\n\n“I’m sorry. She is a naughty girl, I know. I will teach her better after this!” Han Sen smiled as he chirped an apology before the line of mighty creatures.\n\nJust as Han Sen started to walk back out, Bao’er escaped his grasp again. She swiftly returned to the white sheep’s back and said, “Daddy, this is fun!”\n\nHis heart began to pound like a hammer on stone. He felt as if he was going to suffer a heart attack before any super creature even had the chance to maul him to death, with Bao’er’s insufferable behavior.\n\nDragon King merely looked depressed, believing it was only a matter of time before the super creatures were angered and decided to murder them.\n\nThen the super creatures who were staring at Bao’er averted their gazes.\n\nEven though the white sheep was being used as a baby trampoline, it only glanced at them briefly.\n\nHan Sen and Dragon King could hardly believe what they were seeing.\n\nDragon King in particular, who had a far better idea of what such creatures might be capable of, was stunned to see them only look and turn away. Their lack of action confused him.\n\nHe had no clue why Bao’er was given such treatment, when even a once-renowned spirit such as himself never had been.\n\nHan Sen was starting to get used to it by now, however. Bao’er was strange, and despite her meddling, she never seemed to invoke the anger of creatures or spirits.\n\nHan Sen wasn’t willing to jump on the sheep’s back like Bao’er, but he was satisfied enough to learn he could remain inside the palace without being attacked. Eventually, Dragon King’s nerves calmed down, and Bao’er went to sleep atop the sheep.\n\n“Is she really your daughter?” Dragon King asked in a strained whisper, not daring to alert the super creatures.\n\nHan Sen was going to answer, but before he could, the platform in the center of the palace began to shine. It shone so brightly, he struggled to keep his eyes open. And then, a strange presence emerged."
}