{
    "chapter": 22,
    "title": "Broken Egg",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_22",
    "text": "There was no doubt that this giant snake was a sacred-blood creature. Aquatic creatures were hard enough to kill, let alone a sacred-blood creature.\n\nWith his normal gang, Son of Heaven didn’t even dare to hunt it, but was only trying to fill out the group, so that they could safely reach the other side.\n\nHan Sen took a look at the other side as he was rowing. After they passed the middle of the river, the torch could light up the other side a little bit.\n\nSince Han Sen had started to practice Jadeskin, his body function seemed to get a lot better. vision was also a lot stronger than before and he seemed to have gained night vision as well. Now he could clearly see a cave six to nine feet wide on a cliff. Although there was no path, the cave must have been the gang’s destination.\n\nHan Sen was looking at the cave when he heard a loud splash. His heart sank as he saw the giant snake popping out of water less than six feet from their boat, its mouth moving towards the boat and its fangs showing.\n\nWithout thinking, Han Sen jumped into the water and summoned his armor underwater. Like a fish, he struggled to swim across the river.\n\nThe whole process of crossing the river was tragic. It wasn’t clear whether the black snake was insatiable or just determined to kill humans, but only two boats reached the other side, and only seven people lived. All the others were in the water and most likely dead.\n\nThe snake didn’t show up again.\n\n\"Son of Heaven, although the snake was a sacred-blood creature, it was not intelligent. Now it is full, we should not have too much risk crossing,\" said Luo Tianyang, smiling.\n\n\"Go over.\" Son of Heaven gave the order, and the gang went over in three boats. As expected, the snake didn’t attack anymore and they all landed safely.\n\n\"Continue.\" Luo Tianyang whipped the seven survivors, who were forced to walk inside the cave, trembling. They regretted so much that they had coveted the bounty. What was money good for if they died here?\n\nBut they did not encounter any other creatures along the way. In half an hour, they reached the end of the cave.\n\nAt the end of the cave there was a pool, and next to the pool was a gravel nest 30 feet wide. In the middle of the nest there lay two eggs the size of ostrich eggs with black patterns.\n\nSon of Heaven was overjoyed.\"Ha-ha, awesome! Eggs of sacred-blood creatures, and there are two of them. Now my sacred geno points could go over 80.\"\n\nEven so, he did not lose his caution and winked at Luo Tianyang, who was equally excited. The latter understood immediately and forced the survivors to fetch the eggs.\n\nTrembling, they walked into the gravel nest and carried out the two eggs.\n\nHowever, before they were able to leave the nest, the pool started to bubble, and BANG! A huge snake head stuck out, the dark-red snake eyes staring at the egg thieves.\n\n\"Damn! Throw the eggs over,\" Son of Heaven shouted to them, but they were dumbfounded by the snake up close and did not reply him.\n\n\"Useless motherf*#kers!\" Son of Heaven scolded and summoned his red sword, running forward.\n\nThe gang all summoned their weapons and followed him. Rushing in front of the survivors, Son of Heaven grabbed the eggs and ran towards the mouth of the cave. The snake was originally concerned about its eggs and didn’t move. Seeing Son of Heaven running away with them, it went into a rage and left the pool, chasing the gang madly.\n\n\"Block it,\" cried Son of Heaven, while he kept running without pause.\n\nLuo Tianyang was even more ruthless. He grabbed two shivering survivors and threw them at the snake. Catching one in the mouth, the snake swallowed him without chewing.\n\nThe rest of the gang all followed suit, using the survivors as human shields, which temporarily resisted the snake's attack. They took advantage of it and retreated.\n\nSon of Heaven ran fast, holding the two snake eggs. It took him no time to arrive at the mouth of the cave. When he was excited, a golden fist appeared in front of him and hit him on the face.\n\nHe hadn’t expected someone hiding behind the cave mouth and was unprepared for the attack. Blood spilling and nose crooked, he fell back with his hand covering his face.\n\nThe two snake eggs suddenly flew out from his arms. A golden figure jumped up, caught one egg with each hand, and ran toward the river.\n\n\"Dollar!\" Son of Heaven fell to the ground, clutching his face. He immediately managed to climb up, saw the unique golden armor and recognized who it was.\n\nAfter jumping in the water, Han Sen had swiftly swum to the shore in the chaos, and instead of going into the cave, he hid behind a boulder and waited until the gang entered the cave. He then followed them and watched. When he saw Son of Heaven running with the eggs, Han Sen gave him a hard punch and captured the eggs.\n\nHan Sen just regretted that his bronze crescent spear had been ruined by Xue Longyan, or he might have been able to kill Son of Heaven with this secret attack.\n\nHan Sen reached the river and suddenly saw waves roaring. A huge black-scaled snake appeared from the river.\n\n\"F*#k! There is another one?\" Han Sen looked back and saw the other snake chasing the gang.\n\n\"Dollar, you are so f*#ked!\" Son of Heaven hated Dollar’s guts and gloated that he was stopped by the snake.\n\nHan Sen quickly had an idea as the snake in the river glared at him. He pushed hard with his right hand secretly, and then threw the snake egg at Son of Heaven. \"Catch. We will each keep one egg, and let’s deal with the snakes together first. \"\n\n\"Who agreed to that? I will get both eggs and kill you!\" Thinking Han Sen was terrified, Son of Heaven sneered and caught the egg, but the egg broke when it hit him and the egg was all over him.\n\nSon of Heaven was stunned."
}