{
    "chapter": 1222,
    "title": "Claiming an Emperor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1222",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe newborn king spirit’s face changed. With two purple swords, he repeatedly tried to slash Han Sen.\n\nDong!\n\nThe swords repeatedly collided with force of such magnitude that they produced shockwaves strong enough to blow away the approaching super creatures. The roof of the tower was blown off like a lid, as well.\n\nThe newborn king spirit was fierce, and he kept on swinging his swords without relenting for a moment. As he did so, he’d repeatedly called out and shouted.\n\nHan Sen’s eyes were on fire. There was a stark contrast between his white light and the purple of the spirit.\n\n“Die!” Han Sen blasted.\n\nThe purple sword was cut in half by the angel sword. And as the spirit momentarily froze in shock, its guard dropped just enough for the angel sword to swing back and plunge itself deep inside the spirit’s chest.\n\nAs victorious and relief-bringing as this should have been, Han Sen did not feel a triumph had been achieved just yet. Something felt oddly wrong. The king spirit’s body did not feel solid when the sword cleaved through the flesh. The angel sword was able to pierce through without any resistance. It didn’t sink through the flesh as it should have.\n\nThe king spirit laughed, and then he tried to strike Han Sen.\n\nHan Sen moved forward. In that one step, he managed to get behind the king spirit.\n\nTraveling with a manipulation of space was not considered actual teleportation, but the effects were similar enough to be almost indistinguishable. The purple sword hit nothing.\n\nHan Sen then swung his angel sword with a blistering speed that made the weapon look as if it had disappeared. But it reappeared as it struck the king spirit. Han Sen swung again and again as the smoke of the spirit’s figure began to tear.\n\nEven so, it all looked pointless. After the king spirit was sliced in two, it recovered with ease.\n\nThe king spirit was further angered by Han Sen’s actions, though. The purple smoke became a bunch of swords that again took on a will of their own and tried to kill Han Sen.\n\nHowever, it wasn’t enough to throw off Han Sen’s roll. With another slight move, Han Sen was behind the king spirit once more. Han Sen did not hesitate to strike the king spirit with the angel sword again.\n\n“You can’t hurt me. Give it up,” the king spirit mockingly called out.\n\nHan Sen sliced the king spirit in two again, and after that, he dashed ahead.\n\nBut the king spirit instantly recovered again, telling Han Sen, “You can attempt this many, many times, but…”\n\nBefore he finished, his face had changed. Han Sen was in front of the spirit statue, with his hands touching the spirit stone.\n\n“How dare you?!” The king spirit raced forward to Han Sen and tried to cut him down.\n\nBut without even paying him heed, Han Sen took the spirit stone in his hands.\n\nBoom!\n\nThe purple blade that was about to strike Han Sen broke. The newborn king spirit froze, as his eyes fell on the sight of Han Sen, whose hands were now holding the stone.\n\n“Do you want to live? Or do you want to die?” Han Sen turned to the spirit and gave him the ultimatum, as his fingers quivered as he thought about what he should do. He was tempted to break it then and there.\n\nThe newborn king spirit continued to stare at the spirit stone that was in Han Sen’s hands. After a while of silence had elapsed, he lowered his wings and knelt. He said, “I, Purple Emperor, am willing to submit and offer absolute loyalty to a new master. I will become a faithful servant from now until eternity.”\n\nHan Sen was delighted to hear he was submitting, so he jovially placed the spirit stone inside the emperor’s forehead.\n\nHan Sen felt very nervous. He had been afraid the king spirit was going to self-destruct. After all, his super king spirit mode was not very intimidating, and it had obviously not been of sufficient strength to engage the spirit one-on-one.\n\nThe moment Han Sen put the stone on the spirit’s forehead, a purple light bathed the entire tower in a dazzling haze. Then the spirit entered Han Sen’s Sea of Soul.\n\nHan Sen was exuberantly happy. But unfortunately, he did not have the time to examine the spirit any further. So Han Sen disconnected from Little Angel, an act that left them both feeling very weak.\n\nThen, Han Sen used his Blood-Demon Dragon Wings to remain safely airborne. He then asked Disloyal Knight to help Thorn Queen.\n\nThe moment Han Sen took the stone, the creatures all disbanded and fled in a hurry. Thorn Queen had used her vines to trap one super creature and prevent it from escaping, though.\n\nThe vines were like a cruel cage, pinning the creature in place. The thorns had punctured deep into its flesh, like nails that had been hammered into it.\n\nThe creature spat and frothed out ice from its mouth in a futile bid to escape. But like hungry needles, the thorns sucked its blood and made it weak.\n\nHan Sen looked at the super creature and noted how it was a white wolf with icy powers. It was rather strong, and it surprised him to see that it was so well restrained. He wondered if that was Thorn Queen’s natural strength now, or if it was only possible through the power of the Equinox Flower she had just received.\n\nDisloyal Knight jumped down to help her finish the beast off, but Thorn Queen had already sucked it dry and killed it herself.\n\n“Super Creature Ice Wolf God killed. Beast soul gained. The flesh of this creature can be consumed, and you may also harvest its Life Geno Essence. Consume its Life Geno Essence to gain zero to ten super geno points randomly. Will you accept the beast soul?”\n\nHan Sen wanted it, but a form of ice was already coming out of Thorn Queen. It was then placed in Han Sen’s Sea of Soul, presenting him with an ice wolf.\n\nHan Sen exited the tower but did not see any more creatures. There were some weak stragglers, but they weren’t worth the effort.\n\nUninterested with anything more, Han Sen returned to the tower to examine his spoils."
}