{
    "chapter": 1006,
    "title": "Three Days, Three Years",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1006",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nA monster appeared on the slopes ahead, wreathed in fire. A man, who was looking Han Sen’s way, was suddenly set ablaze.\n\nHan Sen frowned at the sight, but thought it fortunate he had stumbled across the group right before a crisis befell them. Now, he had an opportunity to prove his worth and removed any shadows of doubt they harbored that he might not have been who he said he was.\n\nBut before Han Sen could move, Lin Weiwei tugged at him and said, “Please be careful!”\n\n“I can help,” Han Sen replied.\n\n“Protecting yourself is the best thing you can do for now,” Lin Weiwei said, before she started running towards the monster.\n\nHan Sen wished to tell her, “I can kill that thing. Get your hands off me!”\n\nBut before he could, she and the others in their company had gone forward to run the creature through.\n\nLin He was a fairly accomplished fighter, and he had opened seven gene locks with a skill that aligned to the wind element.\n\nNobody looked happy as they felled that beast. They were upset at the realization they had so suddenly lost a teammate and friend, one who had already endured so much.\n\nHan Sen spoke with them for a bit, and when they believe him, they accepted him into their fold.\n\n“Sister Weiwei, what is the date? I was chased for a few days, so I fear I have lost track of the date and time,” Han Sen asked.\n\nWhen Han Sen exited the cave that led to the valley he had been trapped in, he emerged in a land he had never seen before. As strange as it was, the monkeys did not follow, either.\n\nAfter taking off in flight above the clouds, when he descended, the mountain was gone.\n\nTry as he might, he could not find the same mountain. And during his search, he had stumbled upon Lin Weiwei and her people.\n\nShe told him that her shelter had just been destroyed by a fierce spirit, and they were in search of a new place to stay.\n\nHan Sen asked them if they had heard about Thorn Forest before, but they looked at him blankly. No one knew of such a location!\n\n“Today is the seventh,” Lin Weiwei said. It was common for people not to know the date.\n\n“Which year?” Han Sen asked.\n\n“It is the year twenty-five, the month of March.” Lin Weiwei found it strange he had asked that.\n\n“Are you sure it is the twenty-fifth?” Han Sen asked, with wild eyes.\n\nAlthough there had been no shift in daylight during his stay in the valley, the constant presence of the sun and blue skies might just have been an illusion. And even if he had miscalculated the time that had elapsed, he wouldn’t be as clumsy as to mistake three days for three years.\n\nBut Lin Weiwei told him it was the twenty-fifth year, and he had chased the monkey king on the fourth of March. There was no possible way he had only been absent for three days.\n\n“I am not old enough to misremember the year,” Lin Weiwei said.\n\nHan Sen was flabbergasted and not sure what to say. For him to only have been missing three days was quite the shock.\n\n“That valley must have had some control over the flow of time. Time was still there, and the monkey was able to speed up time. There must be some connection there,” Han Sen wondered to himself.\n\nThe mystery of what occurred on that mountain puzzled Han Sen a great deal. It was a conundrum he was keen to mull over, and so he wondered who or what was responsible for the shift in time there.\n\nHan Sen had never heard of a power that could have such a radical effect on the flow of time.\n\nLin He asked Han Sen a few questions. He told them he had come from Thorn Forest, which disappointed everyone.\n\n“We have to keep moving. We need to cross this Ghost Mountain and find someplace new to settle down,” Lin Weiwei said.\n\nSpirits were strong, but so were super creatures. Past the mountain, the lands were divided like kingdoms, domains ruled either by spirits or super creatures.\n\nIf they ever reached a place with no spirits, they could possibly take a spirit shelter for themselves.\n\nHan Sen followed them. He had opened nine gene locks, but his fitness was low. If he had to go to war, he’d have no chance of competing against super creatures and king spirits.\n\nThey encountered many creatures on the road, ones which Han Sen wished to help fight against. But each time Lin Weiwei pulled him back in the belief she was protecting him.\n\nThey only ever encountered mutant creatures, anyway. And those were killed in the blink of an eye.\n\nLin Weiwei knew Han Sen had just become a surpasser, and so she believed he was weak. Because she regarded him as a friend, she felt compelled to protect him, too.\n\nThe further they went across the mountain, the stronger the creatures became.\n\nThe team stopped after their fourth day of travel. A green forest lay ahead of them, one that looked like an endless expanse. The trees nearest them seemed to be silverleaf poplars.\n\nThe trees there crackled and popped with a green lightning. If you touched them, you’d be painfully electrocuted.\n\nThey wondered whether or not they should have ventured beneath the boughs of such a curious location. The lightning trees were spaced a few meters apart, so if they all traveled together, and something bad happened, they’d be in great danger amidst a scramble.\n\nBut being unable to return the way they came, it didn’t seem as if they had much of a choice. So, they had to keep going.\n\nEveryone ventured beneath the canopy of that forest with care. They dismounted their rides, not wanting to risk touching the trees.\n\nWhen a stiff wind blew, it tickled the electricity of the trees and produced many snapping sounds.\n\nA few lightning-charged leaves fell from the boughs above, and onto a surpasser who was immobile due to grievous injuries sustained in a previous fight. He screamed as his blood boiled, and smoke arose from his head.\n\nThe leaves did not kill him, thankfully. But it made the group doubly wary of the trees on their way."
}