{
    "chapter": 1068,
    "title": "Scary Weapon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1068",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen could not wait to sleep on a bed of those purple crystal cores. Doing so would be better than rolling on a bed of cash.\n\nJi Yanran and Han Sen were not professional scientists, so the correct terminology escaped them. What they did know was that the purple crystal cores were anti-material weapons. They were explosive devices that released obliterating energy upon detonation.\n\nThe Alliance had similar weaponry, but nothing that came close to the sheer devastation the purple crystal cores could unleash. If they were ever to be used, though, they’d need a detonator.\n\nIt took only one core to blow up an entire battleship.\n\nScanners could not detect their presence, and no known weapon could work as a deterrent. They were always primed for use, so they couldn’t be disarmed or disassembled, either.\n\nAs for the previously mentioned need for a detonator, that was where the humans and shura now turned their focus. They had to find a way to use the crystal cores, because no one in either government had figured out a way in which they could be triggered to explode.\n\nHan Sen, however, had.\n\nThe beetle he had come into possession of could load up the purple crystal cores as a manner of artillery. They could be fired from the machine with ease.\n\nThe beams Han Sen had fired before also used an energy that was not too different from that of the purple crystal cores. Put simply, the cores contained something very similar, but condensed.\n\nThe beetle could either fire the purple crystal cores in one shot, or refill the energy lasers for a more controlled and precise method of annihilation. With the lasers, you could use as much or as little of the energy as you wanted and make it last.\n\nIf the energy of the core was unleashed all at once, the explosion was enough to destroy a Star-Class Super Battleship.\n\nThe thought of such destruction, all residing at his fingertips, made Han Sen shiver. It was no wonder why the humans and shura worked so hard to obtain these purple crystal cores. Which species would shy away from the greatest weapons of mass destruction they had ever seen?\n\nHan Sen, having obtained a thousand of the weapons, figured he could dominate the galaxy.\n\nNot that he wanted to. He wasn’t interested in controlling many people, or later having to focus his attention on suppressing rebellions. It’d all be too much hassle.\n\nStill, with the beetle, Han Sen was a force to be reckoned with. He could go up against any faction in the Alliance and come out on top—no sweat.\n\nIf Angel Gene sought to provoke him once again, he could promptly blow them all into smithereens.\n\nUnfortunately, the beetle could not be used in the sanctuaries.\n\nBut that was the only downside. It was a shame, though, considering he spent so much time there. Opportunities to make use of the beetle would be extremely rare, if they showed up at all. For this reason, Han Sen was secretly hoping a band of Alliance brigands and cutthroats, or corporate bigwigs, would suddenly try to kill him. It’d give him a nice reason to make use of the beetle.\n\nSince this was unlikely, though—considering his prestige and everything—he felt the weapon would go to waste.\n\nBack in the Alliance, their efforts in the crystallizer ruins were worthy of medals. The humans obtained a tally of cores that was far greater than what the shuras were able to.\n\nAnd back in the sanctuary, when Han Sen saw Xie Qing King, he was so shocked he felt his socks slip off his feet.\n\nThe spirit was wearing a well-ironed white shirt. On his face was a nice pair of sunglasses. He wore long boots and was decked out with various accessories and jewelry. For all intents and purposes, he was blinged out. The coup de grace for his fashion was the presence of an obnoxious, gold skull necklace that was hanging across his chest. When Han Sen saw him, he had a beer in one hand and a comic in the other. All the while, sausages were sizzling on a barbecue.\n\n“What’s up, my brother?” Xie Qing King made a crazy gesture with his hands. Han Sen had no idea what it meant, but it did look rather gangster.\n\nHan Sen’s eyes twitched. He wondered what on earth the spirit had been up to in his absence, and whether or not the books and comics he had brought him were a bad influence.\n\n“Where did all this stuff come from?” Han Sen sat down and asked him. He had not bought most of the stuff that was there now.\n\n“Lin He bought them for me. He seemed willing to buy whatever I mentioned. I must tell you, humans are cool. I like you guys a lot, yo.” Xie Qing King performed another gesture. Han Sen assumed it was one in praise of humans, but he couldn’t be entirely sure.\n\nHan Sen then thought to himself, “Is it any surprise, with your crazy fists? What idiot would deny your requests, eh?”\n\n“Listen up, bruh. I need to go to the human world, you hear me? I gotta’ go, you know? I want to fly an aircraft, pilot a warframe, and start shooting rockets out of cannons, fool!” Han Sen had never seen Xie Qing King so enthusiastic before.\n\n“Holy crap; what have we done? I only gave him romance comics.” Han Sen looked at the comic he was holding, and he was surprised.\n\nIt was the latest issue of Guts, Guns, and Warframes. Much of it was about war and heroes making use of high-explosive devices. Han Sen would have never bought a comic like that for him.\n\nWhen Xie Qing King finished the material Han Sen had given him, others must have brought him the rest. And in Han Sen’s absence, Xie Qing King became this… monstrosity that was now before him.\n\nFortunately, the comics of the Alliance were all about heroic humans committing deeds of good. The heroes usually triumphed over evil, even if they did use a variety of high-tech weaponry along the way. The last thing Han Sen wanted was for Xie Qing King to be influenced into becoming some cackling, cliche villain.\n\nStill, his new style was embarrassing. Han Sen had no idea where such a clash of styles could come from, and all Han Sen could do was shake his head and cringe.\n\n“My Emperor, is it time we exact our revenge on Holy-Sword Emperor?” Han Sen encouraged him.\n\n“H*ll yeah. We need to go f*ck that punk up, yo. Those who diss me gon’ get their lids peeled, bruh.” Xie Qing King flipped a bird to the high heavens.\n\nHan Sen was cringing until his teeth ground, but he couldn’t help be a little interested in what Xie Qing King had read, to prompt such a large change in dress style and dialogue.\n\n“Oh, and one more thing, kid. Don’t you be calling me an emperor anymore, you feel me? The word ’emperor’ is too high-class, and we be needing something from the streets. Call me Brother King, you got it?” Xie Qing King put on a baseball cap and turned it back, then he slinked his way over towards the exit of the shelter.\n\n“Sure… whatever you want…” Han Sen’s lips twitched.\n\nAlthough Xie Qing King was strange, at least he still wanted his revenge on Holy-Sword Emperor. With his power still there, and his friendliness towards humans still intact, that’s all that really mattered.\n\nThankfully, he hadn’t been inspired by reading material that would prompt a desire for world peace. The last thing he wanted was Xie Qing King reading about the virtues of Gandhi.\n\n“I need to talk with Lin Weiwei about the do’s and don’ts of what to give this guy,” Han Sen thought to himself.\n\nHan Sen and Xie Qing King set off towards Holy-Sword Shelter. There was not much need to prepare, as there would only be two super creatures and one king spirit there. It would be an easy fight."
}