{
    "chapter": 1952,
    "title": "Consume",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1952",
    "text": "“Cool! You became an ant; how did you do that? Teach me! If I learn it, I can sneak into any women’s locker rooms that I want to!” Wang Yuhang’s eyes opened wide. He looked at Han Sen, who was being held by Spell, and smiled.\n\nLittle Silver, Little Angel, and Dragon Lady looked at Han Sen’s ant body curiously.\n\nHan Sen felt depressed. He sent his words to be spoken through Spell. So, Spell spoke for him by saying, “Cool my *ss! Go and find a way to turn me back to normal.”\n\n“How did this happen?” Wang Yuhang used his finger to poke Han Sen, and he laughed.\n\n“Stop! Poke me again and I’ll be mad.” Han Sen felt even sadder now. Being pressed by a finger felt as if he was being bullied.\n\nPlanet Eclipse’s news channels were blocked. The others had not heard about what had happened to Han Sen during his time with the Buddha. So, Han Sen took the time to explain what had transpired.\n\n“A deified elite’s power? Even if we could suppress his ability, he’d still be too powerful. It won’t work, and none of us have the same element as him.” Gu Qingcheng stopped to thought, and then proceeded to say, “What about the power you used to transform? Even Purgatory Heaven did not work on you. Could you not try that?”\n\nHan Sen said, “If there is no other option, I will have to do that. But I am afraid that if I recover too quickly from this state, Yisha might become suspicious. So, I will wait like this for a few days.”\n\n“It won’t be suspicious after a few days?” Wang Yuhang did not understand.\n\n“When I become an ant, I cannot use geno arts. I can only use The Story of Genes. If I can recover, I plan to use The Story of Genes as an excuse. Nobody else has ever practiced it before, so no one will know if I’m telling the truth or not,” Han Sen said, through Spell.\n\n“In that case, let’s see if we can help you.” Dragon Lady gathered up her power, and then put her finger on Han Sen. She wanted to send her power to him.\n\nIt was useless, though. Little Angel and Xie Qing King gave it a try as well. But the results were the same, and it did not work.\n\n“You guys did that on purpose.” Han Sen watched them all come to press a finger against him. When he looked at their faces, he didn’t feel quite right.\n\nLittle Angel and Dragon Lady were not Viscounts yet, but Gu Qingcheng and Xie Qing King were, so there was no need for them to use a finger to touch Han Sen. Even so, that was what they did.\n\n“No! I promise we did not plan on squashing you to death.” Wang Yuhang laughed.\n\n“I promise, it really isn’t like that.” Xie Qing King spoke with a tone of sincerity, but it was obvious that he was trying to suppress his urge to laugh.\n\n“You *ssholes!” Han Sen felt so mad, and so he jumped atop Spell’s shoulder. Spell then started to fire shiny bullets at them.\n\nAfter chasing them away, Han Sen took a break. He felt bored, so he decided to read the Consume skill that Yisha had given him.\n\nThe Consuming Ants were a famous higher race of the universe. They could consume everything, so they were far scarier than humans.\n\nHumans were omnivores, and they could eat both plants and animals. But the Consuming Ants were even better. They could eat metal, ore, any and all sorts of materials. There was nothing they were not able to digest.\n\nThe stronger the ant was, the more digesting power they had. The geno art they learned was called Consume. Practicing the skill required a body that was similar to the Consuming Ants, though.\n\nBurning Lamp Alpha could turn others into ants, but he hadn’t given Han Sen the body of an actual Consuming Ant.\n\nHan Sen was just a common ant without any intelligence. He could not generate a geno armor, so there was no way he could learn Consume.\n\nHan Sen decided to give it a try anyway. After all, there was nothing else he could do while he was in the form of an ant.\n\nAfter Han Sen read through the geno art, he learned that Consume was able to fortify one’s stomach. It made the digestion capabilities of a person’s stomach quite scary. He could digest something like steel in a short amount of time, and turn all types of materials into energy. They would be absorbed by the body.\n\n“This would be good for people who love to eat. If they could learn this geno art, people could eat a lot more than usual in the sanctuary,” Han Sen thought.\n\nWhen Han Sen had been in the sanctuaries, he had wanted a geno art that could digest stuff quickly. He had never been able to find a good one, though.\n\nConsume appeared to satisfy all of his needs, but only Consuming Ants could practice it.\n\nHan Sen wanted to try it, so he started practicing.\n\nHe thought it’d be difficult, but after a few whirls, he felt a chill inside his stomach. It was an odd sensation.\n\n“I can practice this?” Han Sen was shocked.\n\nSince the skill was having an effect, that meant he could practice it.\n\nSince Han Sen had nothing to do, he kept practicing with Consume. He learned quickly, and he achieved beginner status in a few short days.\n\n“I wonder if Metal Eater can practice something like this? I can take it back to the Sanctuary for him.”\n\nBut Han Sen was just practicing for the time being. He didn’t mean to practice it all that much, as he didn’t want to be an ant forever.\n\nAfter a few days, Han Sen could not wait anymore. He wanted to see Ji Yanran, so after four or five days, he tried using his super god spirit mode.\n\nA holy light captured Han Sen’s body. Wherever it went, he became a human again. He became a transparent super god spirit.\n\n“It works! Hopefully, I won’t turn back into an ant when I deactivate the skill.” Han Sen was worried, so he quickly stopped super god spirit mode.\n\nThe light disappeared from Han Sen’s body, and he returned to his ordinary human form. He did not go back to the shape of an ant.\n\n“Good! Being human is better than being an ant.” Han Sen sighed.\n\nHe could not wait to use the Blood-Pulse Sutra to open a portal to the Sanctuaries. So, he went back to his home in the Alliance. Han Sen planned to stay there for a while. He wanted to delay revealing the fact that he had healed to Yisha.\n\nBut after chilling at home for a while, he felt uncomfortable being away from his usual life as an adventurer."
}