{
    "chapter": 2439,
    "title": "Statue With a Thousand Hands and Eyes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2439",
    "text": "Miss Mirror’s rainbow powers kept swinging. They broke many of the reflections in the mirrors, but Han Sen’s body remained completely undamaged.\n\n“My Lady, if you still had a deified body, it is safe to say that my Jadeskin wouldn’t be able to endure your powerful sword strikes. But now, you aren’t too different from me. You are a first-tier King class opponent. Unless you strike me with the broken sword, hitting my reflections isn’t going to hurt me,” Han Sen said.\n\n“So, what? It’s actually quite relieving that I don’t have to worry about striking you. I will just hit the woman instead. Even if you hide her behind you, you cannot protect her shadow from me,” Miss Mirror pronounced as she raised her broken sword again.\n\n“My Lady, you must have heard what I just said,” Han Sen said, as he suddenly looked at Miss Mirror.\n\n“What?” Miss Mirror asked.\n\n“We are the same level as Kings.” Han Sen raised his fists. The ice jade around his fists became a godlight and flashed toward Miss Mirror.\n\nMiss Mirror’s heart jumped, and an old mirror formed in front of her. She wanted to reflect the Jadeskin godlight back on its wielder, but the godlight wasn’t a simple attack power. It was a power for sealing.\n\nThe icy light suddenly wrapped a binding seal around Miss Mirror and the old mirror, resolving into the shape of a giant ice cube.\n\n“Miss Mirror, I’m going on ahead. If I can break the red-eye power, I will come back for you.” Han Sen looked at Miss Mirror’s broken sword, but he decided not to take it with him. He simply resettled his arms a little more comfortably around Wan’er and headed back into the broken city.\n\nEven if the prophecy was true, it would be fulfilled by him and the girl now. Their current situation still aligned with the sixth picture of the mural they had discovered.\n\nBut the broken city in front of them had yet to be cleared. The place was covered in broken stone and debris, and since Night Wind was no longer there to make a path for them, Han Sen had to do it. While carrying the girl, he broke the stones himself.\n\nHe didn’t have substance chains like Night Wind, so he was unable to clear a wide area. Instead, he broke a path just wide enough for him to slip through while still carrying the girl. He tried to travel as fast as he could.\n\nHan Sen felt as if the red-eye power wasn’t affecting him as much, which might or might not have been because his eyes were broken. He still felt the urge to move in a certain direction, but it wasn’t that strong.\n\nHe wasn’t sure what sort of weapon that broken sword had been, but Han Sen’s injured eyes weren’t healing with Jadeskin’s power.\n\nBut Han Sen cared little about that. It didn’t matter to him if he had eyes right now. He could take the time to heal when he got out of there.\n\nHan Sen hadn’t been gone for long with the ice sealing Miss Mirror made a groaning noise. Cracks appeared across its surface, and a second later, the ice cube shattered. Miss Mirror was free.\n\nMiss Mirror looked in the direction that Han Sen had escaped. Her expression was conflicted, but a while later, she sighed. “I hope he can break the red-eye curse.”\n\nMiss Mirror had realized something, and although she didn’t want to think about it, she knew she had to. Unless she became deified again, it wouldn’t be possible for her to defeat Han Sen at his current level. And so, if Han Sen couldn’t find and destroy the source of the red-eye curse, all was lost. Perhaps the prophecy would come true, too, and one of them would die.\n\n“We might be the same level, but I can’t compete with you. I hope when you are deified, you will have the courage to face me in the same way.” Miss Mirror sat on a rock near the entrance to the cave leading into the city. She cast a geno art to block the addiction-like draw of the red-eye power, and she sat there awaiting Han Sen’s result.\n\nHan Sen carried Lady Wan’er forward, breaking rocks as he went. He didn’t encounter anything weird this time. But after two hours of travel, the rocks in front of him were becoming easier to move.\n\nWhen Han Sen moved the next pile of rubble out of his way, he realized that there was open air behind it.\n\nHan Sen stood before the entrance to a hall. And in that hall, there was a statue with a thousand hands and a thousand eyes. It looked exactly the same as the one they had seen previously, but this statue was one thousand meters tall, far bigger than the one he had seen before.\n\nThe moment Han Sen entered the hall, he could feel the statue staring at him. Han Sen’s blinded eyes suddenly burned. The damage in his eyes began to repair itself, and in seconds, and he was able to see again.\n\nEven with no mirror, Han Sen could feel that his eyes were shining with red light. The four pupils in his eyes were now like four red suns.\n\nThat feeling of addiction had suddenly grown by orders of magnitude. Han Sen felt like a moth drawn to a flame. He wanted nothing more than to go to that statue with a thousand hands and a thousand eyes.\n\nHan Sen’s will was really strong, but even he was wavering under the draw of the statue. It was like the statue of a thousand hands and a thousand eyes was his final home. He wanted so badly to go into it.\n\n“Come… come…” a demonic voice whispered from the statue. It was beckoning him over.\n\nAlthough Han Sen tried to control his will, his feet began stepping forward of their own volition. The call couldn’t go unheeded, it seemed. He was slowly walking towards the statue of a thousand hands and a thousand eyes.\n\nBoom!\n\nWithout hesitation, Han Sen deployed his super god spirit body. A glowing light spread in his eyes. It smothered the red and made his entire eyes turn white.\n\nWhen Han Sen last used his super god spirit body, he had been interrupted by Wan’er before it could remove the red color from his eyes. But now that he had unleashed it, the red eyes were gone.\n\nThe white light burned across Han Sen like a cleansing flame. Han Sen’s body hung in the air, white and godlike. He looked down on that giant statue with a thousand hands and a thousand eyes.\n\nThere were red eyes on one of the statue’s pairs of hands, and those hands moved with Han Sen’s body. That eye on the statue was like a demon, tracing Han Sen’s movements.\n\nBut under the influence of his super god spirit mode, the power of the eyes didn’t work on Han Sen. Han Sen gathered up his power to use Super Spank. He wanted to see if he could break the demon-looking eye upon the statue.\n\nBut before Han Sen struck, he felt his super god spirit body’s power begin to fade. It suddenly disappeared and returned to his geno core.\n\n“What is this?” Han Sen was shocked. The power had begun to fade from his back, and that was where Lady Wan’er was.\n\nThe super god spirit body’s power disappeared. The power of the statue landed on Han Sen, and it suddenly turned his eyes back into those red ones. Once more, Han Sen felt like a moth drawn to a flame. It was stronger than last time, too. His body was pulled uncontrollably toward the statue.\n\n“This is bad. Now that Wan’er has no power, why would my super god spirit body be affected by her?” Han Sen was in shock."
}