{
    "chapter": 1135,
    "title": "The History of the Nine-Life Cat",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1135",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“How did you know that I noticed the pendant?” Uncle Bug asked with shock.\n\nUncle Bug had made sure to avoid mentioning anything regarding the Nine-Life Cat to Han Sen, so this surprised him.\n\n“I thought I kept seeing you stare at it.” Han Sen pointed to the spot on his person where the pendant was.\n\nUncle Bug nodded and said, “I was surprised to see you wearing that necklace. Old Han carried that thing around with him, just as you do. Knowing your great-grandfather was Han Jinzhi, I went to learn as much about you as I could. Memories of yore kept me staring at it, I suppose. I didn’t mean nothing by it, and I didn’t suspect you’d find out from the occasional gaze.”\n\nHan Sen did not say anything, as he wanted the man to continue talking.\n\nUncle Bug sighed and said, “The reason why I know it is there, truthfully, is because I can feel its existence.”\n\n“You can feel its existence?” Han Sen looked rather confused. The Nine-Life Cat pendant did not exude any particular force. The only remotely remarkable thing it had done was reacting when Han Sen began learning the Blood-Pulse Sutra.\n\nHan Sen could only assume that Uncle Bug’s ability to feel the existence of this pendant was because he was a member of Blood Legion. There didn’t seem to be another likely alternative.\n\nBut all Uncle Bug had said about his past was that he was an Interstellar Pirate. He had made no mention of an association to Blood Legion.\n\nUncle Bug then pointed towards Han Sen’s chest and asked, “Can I take a look?”\n\nHan Sen was a little dubious about whether he should show it to the man, but he did so anyway.\n\nUncle Bug gently took hold of the pendant, and his eyes fluttered as if he was in remembering something far in the past. He said, “This necklace… it was found in an old ruin. I’m the one who gave it to Old Han, you know.”\n\nHan Sen was delivered another shocking revelation. He had always believed the pendant to be a relic of Blood Legion, and that Han Jinzhi had been a member.\n\nWhat Uncle Bug had told Han Sen surprised him a great deal.\n\nRecalling those past memories, Uncle Bug looked painfully nostalgic. He said, “I hadn’t gained any fame at that point, but I did have a modicum of infamy. I was once a thief, after all. Old Han invited me to poke about and explore an old ruin. It was an experience that changed my life. That is where I found the Qi Gong I mentioned. The Qi Gong and the pendant were both found there.”\n\nUncle Bug then smiled and said, “The Nine-Life Cat and Qi Gong were together, but we became separated at one point. When I found the items, I kept the Qi Gong for myself and only gave the Nine-Life Cat to him.”\n\n“It was because of that Qi Gong I became stronger. I became a renowned pirate because of it.”\n\nUncle Bug gave back the pendant to Han Sen and he said, “The Qi Gong has some association to that pendant, in some way or another. If it isn’t too far away, I can feel it.”\n\nHan Sen put the pendant around his neck again and asked, “And what about the ruins? What was so remarkable about them? Did he only go there for the pendant?”\n\n“It was a city that had been buried beneath a mountain. Perhaps it was a city from ancient times. I think the reason Old Han went there was for the pendant exclusively, as he made explicit mention of it. Just the pendant, too. He said he had to bring it back with him or something,” Uncle Bug further explained.\n\nHan Sen frowned. Uncle Bug’s answers were disappointing, as he had not yet elucidated the relationship between Han Jinzhi and the Nine-Life Cat.\n\n“By the way, there is one more thing I must ask. Why did you think it was impossible for Han Jinzhi to have an heir?” Han Sen asked.\n\nMany people had found it difficult to believe Han Jinzhi had an heir for some reason, so Han Sen was eager to find out.\n\nIn that era, infertility wasn’t an issue. The technology to create babies existed, even if it was only done through the artificial combination of two people’s genes. It was extremely rare for someone to be unable to create a baby.\n\nIf people were so sure Han Jinzhi could not make a baby, he had to have some sort of problem.\n\nHan Sen wanted to know why, to ensure he really was an heir to Han Jinzhi.\n\nUncle Bug gave a wry smile, saying, “I am telling you for sure: you are not Old Han’s heir.”\n\n“Why?” Han Sen needed a firm reason to believe this claim.\n\nUncle Bug said, “That was once a secret. But since he is gone, maybe now I really can tell you.”\n\nHan Sen perked his ears up, eager for the answer he had been awaiting for so long.\n\nStrangely, Uncle Bug ended up asking, “Are you a human?”\n\nHan Sen was immediately taken aback in confusion. He exclaimed, “Of course I am human!”\n\nUncle Bug responded, “That is right. You are a human; he was not.”\n\n“Then what was he? A shura?” Han Sen was shocked, and he did not expect that answer.\n\nIt was then that Han Sen remembered Han Jinzhi was said to be the last human with a master Qi Gong, and he was a commander of the Blueblood Special Forces. But if he was a shura, how could he be allowed such a position?\n\nHan Sen stared at Uncle Bug, wanting even more answers.\n\nBut to this, Uncle Bug shook his head and said, “I don’t know what his race was, but he was certain when he told me himself: he was not human.”\n\n“There must have been something to differentiate him from other humans. Did he have a horn or something?” Han Sen wasn’t convinced.\n\n“He walked, talked, and looked like a human, but his blood was blue,” Uncle Bug said.\n\n“He was a commander of Blueblood Special Forces and he had blue blood. Is that a coincidence?” Han Sen frowned.\n\nUncle Bug then provided Han Sen with a scroll, and he said, “This is the Qi Gong I took. It is pointless for me to have this now, so take a look for yourself. If you’re interested, take it with you.”\n\nHan Sen accepted the scroll and thanked him. They then went on to chat about other things, but they weren’t of importance."
}