{
    "chapter": 2751,
    "title": "Dead Dragon Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2751",
    "text": "After confirming that there wasn’t any danger, Han Sen reached his hand out to touch it. The object was hot to the touch, and the texture of the surface felt kind of like snakeskin or the scales of some other sort of creature.\n\nBut snakes were cold-blooded animals. Their scales were supposed to feel cool, but this black thing was burning hot. It glowed like heated steel.\n\n“This thing can’t be alive, can it?” Han Sen knew that was impossible. The thing wasn’t giving off any lifeforce.\n\nHe dug into the sand around the black object, and it was revealed to be the size of a house when he was all done. When he saw it in all its splendor, it was absolutely massive, just as he had expected. And beside the glowing scale was another scale.\n\n“I’m rich… This could really be the carcass of the true god evil dragon. Maybe the blood coral has grown here because of the nutrients it can absorb from the evil dragon’s dead body.” Han Sen’s heart was frantic with excitement.\n\nHe wanted to haul the body out of the lake as soon as possible, but he soon realized that he faced a serious problem.\n\nIf a single scale was as big as a room, he couldn’t imagine how big the entire dragon’s body might be. Han Sen dug for a while, and he eventually dug under other parts of the blood coral forest. The dragon’s scale seemed to extend even further under the ground. He couldn’t accurately gauge how large the creature was.\n\n“This dragon’s body cannot extend the entire length of the 10,000-mile-wide blood coral forest, can it?” Han Sen thought that must be possible. Otherwise, why would the blood coral only grow in this area and nowhere else?\n\nWith Han Sen’s power, he could easily dig beneath the blood coral. A large amount of sand could be thrown away with a simple wave.\n\nBut displacing the blood coral itself was too much for him. Han Sen’s power was insufficient, and all the strength he exhausted would be absorbed by the blood coral. He had to dig it out slowly, inch by inch. At that speed, and with Han Sen digging there alone, it would likely take him a year or two to excavate the dragon. Digging out the entire blood coral forest would be very difficult.\n\n“No, I can’t keep digging like this.” Han Sen immediately realized that unearthing the dragon corpse by hand simply wasn’t an option. Not to mention that if he continued, Li Keer and Exquisite were sure to find out what he was doing.\n\n“The matter of the dragon body aside, even this blood coral that can absorb elemental powers is very rare and precious. The Very High would desperately want something like that, even if there wasn’t a true god corpse somewhere beneath it all.” If the Very High learned about this place and Han Sen’s find, he wasn’t sure if they would fight him for ownership.\n\nAlthough the Very High allowed the silkworms to take the xenogeneics they killed in Outer Sky, true god xenogeneic bodies were a bit more valuable than the average fare. It was too tempting, and Han Sen couldn’t predict how things might play out if his discovery became known.\n\n“I must find a way. How can I take the dragon body and blood coral without anyone noticing?” Han Sen stopped digging. He replaced the sand he had disturbed with his digging, hiding all evidence that he had been there.\n\nAfter thinking over the matter for a while, Han Sen placed the strange blood coral into his Destiny’s Tower. Then, he paused to examine the beast soul he had received from the Space Electric Eel.\n\n“Deified xenogeneic beast soul Space Electric Eel: Gem beast soul (chance to evolve)”\n\n“Another gem beast soul?” Han Sen was disappointed. Gem beast souls could raise the level of another beast soul and heighten its quality. But in order to use the beast soul, he would need another beast soul of the same type.\n\nHan Sen had received a gem beast soul from the Sun Raven, and he hadn’t yet found another beast soul he could use that one on. In addition, he had no lightning-element beast souls that he could combine with his most recent prize—the Space Electric Eel’s gem beast soul.\n\n“What does the ‘chance to evolve’ part mean?” Han Sen was disappointed to receive another gem beast soul, but the words on the end of the description had managed to intrigue him somewhat.\n\nIt was a shame the gem beast soul couldn’t be used immediately. He also had no way of uncovering the secrets of the whole “chance to evolve” message just yet.\n\nHe dragged the electric eel’s body out of the Buried Dragon Sea, and he found Bai Wei waiting for him on the shore. Han Sen went over to say hello. Bai Wei was surprised to see that Han Sen had actually defeated the electric eel. The conflicted emotions visible in her eyes deepened.\n\nAfter leaving the sea, Han Sen took the electric eel’s corpse back to the Star Tree. Once he absorbed the electric eel’s xenogeneic gene, he noticed that eating the electric eel’s flesh provided more deified genes than ordinary primitive deifieds did. He had only eaten one out of the 20 portions of the electric eel’s flesh, and he had already received two deified gene points.\n\n“It looks like higher class deifieds provide more element genes. If that is the case, maxing out my deified points shouldn’t be all that difficult. Leveling up will be far easier than I thought, actually.” Han Sen kept refining the xenogeneic genes as fast as he could, all the while thinking about how he might dig up the blood coral and the dragon’s body.\n\n“The dragon’s body seemed far too large to dig up on the sly, but I can surely collect some of the blood coral. I can store it in the sanctuary to keep anyone from discovering it. It might take a while, but I should be able to dig up all the blood coral by myself.” Han Sen couldn’t come up with a better idea than that. He needed to grab any benefit he could get while he was able to.\n\nHe rested the night, and when he woke up the next day, he intended to go back to digging up the red coral. He needed that blood coral for the castle he was planning to build.\n\nBut after yawning and stretching, he noticed that something in his body felt off.\n\nHan Sen couldn’t really put his finger on the sensation, but when he looked at his hands, he noticed there was something there.\n\n“What is going on?” Han Sen got a better look at his hands, and what he saw frightened him. The back of each hand had a black dot that was around the size of a fingernail.\n\nIt looked like a freckle at first glance, but when Han Sen looked closer, the freckle seemed more like a piece of red coral or a scale from the dragon’s body. It was black, but it glowed with a faint red light. The freckle was still somewhat incorporeal, though. He could still see his flesh through it.\n\nHan Sen swallowed nervously. He quickly checked over the rest of his body, and he found more freckles growing all over his body.\n\n“What the f*ck? Is this the sign of me growing dragon scales?” Han Sen knew that something was severely wrong. Those freckles weren’t painful or itchy, but they were spreading across his body.\n\nHan Sen used the Dongxuan Sutra to examine the rest of his body, and he discovered that the freckles were now a part of him. They didn’t seem to be damaging his body, though. His body and the freckles were existing symbiotically.\n\nHe steeled his resolve and peeled one of the freckles away, but when the flesh was healed, the black dot returned. More black dots showing up across his body with every minute that passed. He tried many ways to remove them, but none of them stuck.\n\nHan Sen tried activating his xenogeneic geno arts, and he even tried using his super god spirit body. But no matter what he tried, no method worked to get rid of the black dots. That was especially surprising since the super god spirit body had worked on pretty much everything in the past. Now, it couldn’t do anything to remove the freckles.\n\n“What the hell is this? Even my super god spirit body isn’t working.” Han Sen theorized that the freckles had something to do with the blood coral or the dragon body, but he couldn’t accurately predict what effect the freckles might ultimately have."
}