{
    "chapter": 3036,
    "title": "Seeing God Temples Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3036",
    "text": "Ancient Big God Mountain was an old mountain. Although the name sounded like Ancient God City, it was not in Ancient Big God Mountain. It was somewhere quiet near the mountain.\n\nHan Sen dressed in black clothing and followed Mister Yang to Ancient God City. He curiously looked at everything in Ancient God City.\n\nEverything in Ancient God City was new to Han Sen. It was a very modern city. Actually, instead of being a city, it was more like an old fortress that had been modernized.\n\nThe city had cars and aircraft, and there were many of them.\n\nThere was something Han Sen did not understand. For such a developed city, it was still in an empirical era. Ancient God City belonged to the Qin Kingdom.\n\nThe lowest form of measurement in the Qin Kingdom was a city. There were no separations between states. Every city belonged to the big Qin Kingdom, and every planet only had one city. The weird thing was that aside from this advanced technology, every human had all kinds of pets exist near them.\n\nAccording to what Mister Yang said, these pets were called gene races. They were creatures that came out from gene eggs. Han Sen had also come out from a gene egg. He was at a high level for just being born.\n\nHan Sen looked around. He saw some tigers, lions, elephants, and creatures like that. He saw those gene races. One person even had a big green mantis.\n\nHan Sen was not able to use his Dongxuan Aura to scan the gene races and learn a bit more about what they were. He could not tell much about their appearances.\n\n“Mister, ahead is the god temple of Ancient God City.” Mister Yang pointed forward and smiled as he spoke.\n\nHan Sen looked at where Mister Yang was pointing to. He squinted his eyes and noted that the god temple was in the center of Ancient God City. It was built from purple stone and looked very old. The shape of the temple was weird. The temples connected. From afar, it looked like a giant purple flower. On top of the temple’s door was a carving that said, “Evil Lotus God Temple.”\n\nThat name and look of the city was something Han Sen was very familiar with. It made him think, “Aside from the god flag, this place is Evil Lotus God’s god temple.”\n\nHan Sen wanted to walk inside and take a look. He wanted to see if any statues depicted Evil Lotus God, but Mister Yang pulled him away with a nervous look. He said, “Mister, you cannot do this. The god temples are the base of a city. They are very important for a city. The city leader puts heavy guards there. Ordinary people cannot enter. It is only open to the public on Blood Pulse Open Day. Only people of suitable age can enter and seek a blessing inside the god temple to open their god blood.”\n\n“I see. When is Blood Pulse Open Day?” Han Sen was not in a rush to breakthrough.\n\nHan Sen still had his power, but the universe suppressed him. He did not have his full power to fight. According to what Mister Yang told him, this world, which was called a geno universe too, had seven universe kingdoms.\n\nThe Big Qin Kingdom was one such place, and Big Qin Kingdom’s creator was called Qin Xiu. That had happened many years ago. Now, Big Qin Kingdom’s king was the ancestor of Qin Xiu.\n\nIf that Qin Xiu was the Qin Xiu Han Sen used to know, in that era of Qin Xiu, he had not ruled the world either. That meant the other six universe kingdoms were not any weaker than the Qin Kingdom. They were probably no worse than Qin Xiu.\n\nHan Sen was a guest, but he was suppressed by this world. In this world, the geno hall probably existed. Perhaps the geno hall had picked on Qin Xiu. Since Han Sen was an outsider, it might end up picking on him as well.\n\nHan Sen planned to figure out what was going on in that geno universe. He would then decide what to do next. He did not want to maintain a high profile.\n\nThe legend of Qin Xiu and Qin Wan’er was something Han Sen heard about from Mister Yang. He knew for sure Qin Xiu was the creator of the Big Qin Kingdom.\n\n“If this is the antimaterial world, what does it have to do with the other geno universe? Why did the black crystal want me to be brought here? Why does this place also have god temples?” Han Sen just wanted to go to Evil Lotus God Temple and mosey around. He wanted to check out the Evil Lotus God Mister Yang had described to him and see if it was the Evil Lotus God he used to know.\n\n“Mister, Ancient God City opens every three months, which are counted by the days. Blood Pulse Open Day is in two days. At that time, you can go and have a look with other people.” Mister Yang spoke with a small amount of hesitation. Still, he looked very determined. He went on to lick Han Sen’s boots and say, “My house is in Ancient God City. If you are not against the prospect, why don’t you come over and stay at my house for two days? We can come back the day after tomorrow.”\n\n“Why not?” Han Sen nodded.\n\nHan Sen was not an unreasonable man. He was neither a robber nor a thief. If it was not necessary, he did not want to use force. Waiting two days was not a big deal. He did not need to force his way into the god temple.\n\nThey reached Mister Yang’s house. Mister Yang asked Han Sen to sit down in the living room. He brought out tea and said, “Wait for a second, Mister. I am going to the yard to clear a place out for you to live.”\n\nHan Sen looked at Mister Yang coldly as he said, “Mister Yang, you know what you are supposed to say and what you are not supposed to say.”\n\nMister Yang felt a chill and seriously replied, “Do not worry, Mister. I understand. You are just a Mister, a man from out of town.”\n\nAfter Mister Yang left, Han Sen sat in the living room and drank tea. In this world, Han Sen felt that his body was suppressed. Everything else seemed fairly similar to the geno universe he used to know. Even the tea tasted similar.\n\nHan Sen was leaning against the door of the living room. He was drinking tea and looking at the drawings on the wall.\n\nGeno races were depicted in the drawings. Han Sen was surprised by the fact that one of the gene races in the drawings looked quite familiar. It looked like Empty Dragon King.\n\nHan Sen was looking at the drawing when a female’s voice suddenly sounded from beyond the door. “Are you Mister Yang?”\n\nHan Sen looked over to where the voice came from. A woman standing just outside the door. She was clad in green clothing. She looked very pretty. She looked like someone in a drawing. She seemed to be around 20.\n\n“Why are you looking for Mister Yang?” Han Sen casually asked. He also wondered if this was Mister Yang’s house because of the green-clothed woman’s ability to enter and why she did not seem to recognize him.\n\n“I did not expect Mister Yang to be so young. My name is Peaceful. Mister Qiu advised me to come here. I want him to take me to Ancient Big God Mountain and help me calculate the location of the god pulse.” The woman explained why she was there. She did not beat around the bush.\n\nHan Sen had heard about this from Mister Yang. The Mister was just a job title. It was not his name. Mister Yang must have been hired by Mister Meng to find the location of the god pulse.\n\nAll the gene eggs were born inside the god pulses. God pulses were hard to find. God pulse gene eggs were hard to find, and Misters were the professionals that researched them."
}