{
    "chapter": 2466,
    "title": "Fighting God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2466",
    "text": "“Sacred Leader made a wish?” Han Sen looked at the woman with shock.\n\nThe woman shook her head. “No. Sacred Leader was a very self-confident person. If he wanted to achieve immortality, he would find it by himself. He wouldn’t make a wish to another creature.”\n\nHan Sen didn’t speak. He listened to the woman, hanging on every word. After so long spent searching, he was finally touching the center of this mystery.\n\nThe woman sighed and said, “Sacred Leader didn’t want to make a wish. Instead, he wanted to kill God. But no matter what power he tried to use, he couldn’t damage God. He couldn’t even ruffle that being’s clothing. You can’t imagine how shocked Sacred Leader was. He ruled practically the entire universe, and yet, he couldn’t deal a speck of damage to this creature claiming to be God.”\n\n“But this self-proclaimed God was also restricted by some sort of power. He couldn’t kill Sacred Leader either. But after that encounter, Sacred Leader poured all his strength into finding out what sort of creature that God was. Many things happened, and in the end, Sacred Leader did manage to kill one.”\n\n“What? Sacred Leader killed a god?” Han Sen asked, his voice going hoarse as his throat tightened.\n\nThe woman shook her head. “It wasn’t really a god. It was more of a statue. It was like a statue that was controlled by God.”\n\nHan Sen thought about that God inside Destiny’s Tower. It was a statue, more of a representation than an actual god like King Jun.\n\n“After destroying the statue, Sacred Leader conducted some tests. He discovered, to his shock, that his lifespan had increased when he absorbed some power from the statue. Sacred Leader became incredibly excited. And he thought, ‘If killing a statue of God added that much to my lifespan, what would happen if I killed a real one?'”\n\nThe woman smiled. “And so Sacred Leader continued researching how he might kill God. But after his statue was destroyed, that God hated him and wanted him dead. Sacred Leader was unable to kill God, but God was also unable to kill Sacred Leader. They were fighting indirectly, so to speak. When the time came for Sacred Leader to actually battle God, all of us were incredibly excited. And yet, at the same time, that began the period of our greatest suffering.”\n\nSaying this, the woman sighed. “Not all the members of Sacred shared Sacred Leader’s vision. When he fought with God, Sacred Leader’s family, friends, subordinates, and even spouses, all betrayed him for God. And they put Sacred Leader in a difficult position.”\n\n“Sacred Leader’s research of The Story of Genes was at a dead end. No one could practice The Story of Genes, so there was no Super Gene that could threaten God. And by then, Sacred Leader’s lifespan had come to an end.”\n\n“And then God destroyed Sacred and killed Sacred Leader?” Han Sen asked.\n\nThe woman shook her head. “I don’t know. Before that happened, I was already entombed in Two World Mountain. By that time, Sacred Leader had lost everyone. Sacred was unable to hold itself together, so its collapse was only a matter of time.”\n\nWhen Han Sen heard this, he sighed. “Sacred Leader was so strong, but not even he could defeat God?”\n\n“That isn’t quite accurate. But, at the very least, he let us know that God can be resisted,” the woman said.\n\n“Right. So, why were you sealed inside Two World Mountain?” Han Sen actually wanted to ask if she had also been tempted by God and made a wish, but he quickly decided not to.\n\nThe woman’s face changed. With a stony face, she said, “That’s none of your business. I’ve paid my debt in full now. I’ve told you everything, so you can leave.”\n\nHan Sen’s heart jumped, and he thought, “This woman was encased in the stone of Two World Mountain. It must have something to do with the demon spirit. That woman carved into the Sea Demon Car has to be her.”\n\nHan Sen had these ideas rattling in his head, but he didn’t try to confirm them. He told her, “I have known you for so long, but I don’t know your name.”\n\nThe woman looked at Han Sen. “What are you hanging around for? Get lost.”\n\nThere was nothing Han Sen could say to that, so he left the dragon boat. When he turned around to look at the woman, the dragon boat had soared into space and disappeared. Where she went, he had no idea.\n\n“Even in Sacred Leader’s, people were already fighting against these things claiming to be God. But it does seem as if God wins every time.” Han Sen closed his eyes and continued to think, “When Sacred was destroyed, did Sacred Leader die? The sanctuaries were a place for the Sacred Leader to research immortal spirits. The crystallizers later adopted the realm. Why didn’t any other races take over the sanctuaries? Why were the crystallizers the only ones who could? Did the crystallizers know the secrets of the sanctuaries? Maybe. The woman said that the crystallizers were tests and that they were very smart. They must have known a few of Sacred’s secrets, for sure.”\n\nHan Sen thought about this, and then, his eyes brightened. “That should mean that the crystallizers continued Sacred Leader’s research. But what exactly was it that the Sacred Leader researched? Spirits, beast souls, xenogeneics? The crystallizers didn’t seem to know exactly what they were doing. Their bodies were too weak, so they probably wanted to use the sanctuaries to make their bodies stronger. But Sacred Leader’s research couldn’t have been for such a simple purpose.”\n\n“I have learned so much. I now know the beginning and the end of the story. All I am missing are some of the details regarding the middle. And I also know more about The Story of Genes now, so that should come in handy for my practice.” Han Sen felt a lot of relief, and he thought he was close to getting all the answers he needed.\n\nHan Sen looked around until he figured out where he was, and then he started heading back to the white whale. He had to get back to Bao’er.\n\nHan Sen soon realized the Tianxia System was way too big. Sticking to one direction was nearly impossible, and there were clouds everywhere he looked. He couldn’t even see where he was going.\n\nWhile he was trying to decide which way to head, he saw the shape of a few shadows. Several King class people were flying through the clouds.\n\n“Barr!” Han Sen was shocked when he saw this shadow. It was Barr.\n\nBut Barr wasn’t with Dia Robber this time. There were people of many different races with him.\n\n“Han Sen!” When Barr saw Han Sen, he looked ecstatic. Everyone sped up to reach Han Sen.\n\nSeeing their faces, Han Sen immediately knew they were coming after him. There was a ninety percent chance they were after him for the Extreme King’s bounty.\n\nHan Sen hesitated. He activated his Wanjie Rubix Cube and connected his video stream with the Treasure Identifier Elder.\n\n“Han Sen, I have been looking for you for so long!” Barr rushed towards Han Sen, pulled out his knife, and slashed."
}