{
    "chapter": 1948,
    "title": "Soul Armor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1948",
    "text": "Han Sen stopped in his tracks. He couldn’t figure out what had just happened.\n\nThe light spell was stuck to Seven Spirit’s forehead. It shone brightly, and Qing Jun started to scream as it gleamed.\n\n“Who dares to trick me in such a fashion?” Sky God Qing Jun screamed. The gold fire began to lessen, and Han Sen saw a gold shadow writhing around Seven Spirit’s body. It twisted as if it was in agony, which was extremely creepy to watch.\n\nAlthough he did not know what had happened, Han Sen knew his chance to act had come. Rather than continuing to watch the spectacle, he moved forward to swing his Ghost Teeth Knife.\n\nAs the knifelight slashed across Seven Spirit’s body, Qing Jun and Seven Spirit lost control of the four-faced, eightarmed gold Buddha body form. He screamed in rage as Han Sen hit him, but it was useless.\n\nQing Jun’s will was suppressed by the light spell. His scream turned to pain. He had possessed Seven Spirit, yes, but he could no longer exit the body.\n\nSeven Spirit’s will was not strong enough to withstand the rhythm of the music. He could only watch as Han Sen continued to strike his hardy body.\n\nNo matter how strong his body was, though, it could not withstand a thousand hits. Lacerations began to appear across the gold Buddha body. Blood seeped out of the wounds, looking like liquid gold.\n\nHan Sen was cruel. He paid no mind to Qing Jun or Seven Spirit’s cries.\n\n“I will kill you… This has nothing to do with me… Kill you… It controlled me… You are killing a Buddha…” The four mouths spoke different words. Qing Jun and Seven Spirit were talking in tandem.\n\nHan Sen ignored them, though. He continued his rage of slashes.\n\nIf Seven Spirit had been controlled by Qing Jun, then the Buddha hadn’t meant to kill Han Sen. But given how long Seven Spirit had been chasing Han Sen, why hadn’t the Buddha tried to fight off Qing Jun’s control?\n\nWithout a doubt, the Buddha had some reason to hope for Han Sen’s death. It did not matter if Qing Jun had possessed Seven Spirit or not.\n\nSeven Spirit’s roaring echoed across the heavenscape, but his struggles were futile. Han Sen delivered a thousand blows, striking Seven Spirit’s neck over and over. Eventually, he was able to lop the head of four faces off. The gold blood squirted everywhere.\n\n“Marquise-class xenogeneic hunted: Four-Faced Eight-Armed Buddha. Four-Faced Eight-Armed Buddha beast soul obtained. Xenogeneic gene found.”\n\nThat voice sounded inside Han Sen’s head. He was glad he had managed to obtain some sort of reward, following the trial he had just been put through.\n\nSeven Spirit’s xenogeneic body crumpled. The gold flames were not extinguished, though. The light spell was still sticking out of the fiery shadow’s forehead.\n\nPang!\n\nThe light spell suddenly exploded. The gold flames shattered, and Qing Jun’s roaring disappeared along with it. Nothing more remained.\n\n…\n\nAs this was occurring, a ship departed the Buddha Kingdom. A man, dressed in rich clothes, was resting upon a seat. His mouth spoke words only meant for himself. “I can’t believe Qing Jun possessed someone. He had it coming. This damage will put him off for some time. What an *sshole, to think of touching one of the Han family.”\n\n…\n\nHan Sen pulled out a bottle. He collected the blood of the Four-Faced Eight-Armed Buddha. Its blood was the xenogeneic part of its body.\n\nAfter everything was done, he took a look at the beast soul.\n\nViscount-class Four-Faced Eight-Armed Buddha: Soul Armor\n\nHan Sen was shocked. He had seen armor beast souls before, and those were simply titled armor. Han Sen was unsure what soul armor meant. Without hesitation, Han Sen summoned the beast soul. A gold armor suddenly wrapped him up, and he could feel how powerful it was.\n\nIt resembled the gold armor for Geminis, but it looked like ordinary beast soul armor. It didn’t look like anything special.\n\nHan Sen tried to generate power to punch with it, but as soon as he moved, the gold armor began to shine. A Four- Faced Eight-Armed Buddha appeared directly behind him, and when he punched, he did so with the Buddha’s gold light. It had the same power that Seven Spirit had possessed.\n\n“D*mn! This Soul Armor is strong.” Han Sen was so happy, as he had never possessed armor like this before. Wearing the armor granted him the power of a Marquise. And since it was from Seven Spirit, it was even stronger than normal.\n\n“I don’t know if other people can see the Four-Faced Eight-Armed Gold Buddha that appears behind me. If they can, that might be bad,” Han Sen thought to himself as he put the beast soul away. Then he looked over the Heaven.\n\nIn a hall of the Buddha, a candle went out. Burning Lamp Alpha’s eyes widened, and many of the Nobles around him seemed stunned. Burning Lamp Alpha had not shown surprise in more than a thousand years.\n\n“Seven Spirit is dead,” Burning Lamp Alpha spoke slowly, with his face all twisted.\n\n“With Seven Spirit’s power, there is no way Han Sen was able to…” The Buddha were in shock.\n\n“How… Wasn’t Seven Spirit going to get the Knife Child?” He knew he had misspoken when the Buddha King spoke the Buddha catchphrase.\n\n“Whoever killed him must pay!” Burning Lamp Alpha was calm, but his calm was frightening.\n\nSeven Spirit was his first student in a thousand years. Burning Lamp Alpha believed he had what it took to become deified. Now that he had simply died, Burning Lamp Alpha was furious.\n\n“Han Sen… He… He…” A Buddha Duke that was watching over Heaven screamed.\n\n“What happened?” Clear Sea Buddha frowned at the Duke.\n\n“Han Sen has reached the end!” The Buddha Duke looked strange.\n\n“What? He did? I thought he wasn’t on the list.” Clear Sea King did not believe it.\n\n“I don’t know, but he has. Come take a look.” The Duke was having trouble explaining, so he waved at the Buddha mirror and instructed it to reveal Han Sen’s body.\n\nAll the Buddha Kings could clearly see that Han Sen had reached the other end.\n\n“He entered Heaven with Seven Spirit. Now he is making it out, and Seven Spirit is dead. He must have killed him.” Burning Lamp Alpha stood up from his lotus seat. He walked towards the door of Heaven."
}