{
    "chapter": 967,
    "title": "Cocky Little Bear",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_967",
    "text": "Han Sen’s fitness level was just over a thousand. Compared to sacred-blood creatures, which had fitness levels of over two thousand, it was not difficult to understand why slaying such beasts was a trying task.\n\nHan Sen could only use dongxuan movements to help him evade the onslaught of attacks that came his way.\n\nThe scorpion’s fitness level was practically double Han Sen’s, so his ability to threaten the monster was almost non-existent. If his dexterity wasn’t so high, and he couldn’t dodge with such great skill, he’d have been killed with ease.\n\nThe scorpion had opened six of its gene locks, so it was incredibly unlikely that Han Sen could beat it.\n\nHan Sen just thought it was fortunate that the scorpion lacked AOE skills. Had it learnt such attacks, the only thing he could have done was run away.\n\nRoar! The bear was still stood proudly atop the scorpion. Its roar was as if it was saying, “Come fight me!”\n\nAmidst the barrage of pincer-strikes Han Sen was narrowly avoiding, he caught sight of the bear’s smug face. It was at this moment Han Sen’s body exuded a frightening aura.\n\nA white light burst out of him, and it turned him into a bright, holy figure of resplendent light. In this grossly incandescent form, a terrifying power thundered.\n\nBoom!\n\nHan Sen evaded the scorpion’s next attack and set his sights on the white bear.\n\nNot expecting the sudden outburst, the creature terrified. It desired to run.\n\nBut Han Sen wasn’t having it. With his sun-like fist of pure, unbridled power, he threw his knuckles at the bear. When the punch found its target, the bear was sent skimming across the coarse forest floor. It was unable to get up.\n\nHan Sen grabbed the white bear like a hunter grabbing a dead squirrel. With another evasive maneuver around the attacks of the scorpion, Han Sen took off flying into the air.\n\nThe three seconds of super king spirit mode came to an end, and with the bear still firmly in his hands, Han Sen made an airborne return.\n\nThankfully, despite its strength, the scorpion lacked the ability of flight. All it could do was hiss menacingly at Han Sen as it watched him go.\n\n“Where did that smug little bear go, huh? Where’s that cockiness now? Come on, show me!” When Han Sen arrived back at the shelter, he rudely tossed the bear on the ground.\n\nGrrr! Grrr! The white bear was not as remorseful as Han Sen expected, and rather than beg for mercy, it threatened Han Sen with growls.\n\n“Ah, that’s how you want to play it? Let’s see what you’re made of, then!” Han Sen brought out Taia in an effort to kill it.\n\nBut suddenly, the white bear drew out its claws and scratched itself. Blood dribbled down from its body.\n\nHan Sen was surprised by this, unsure of what it was planning to do.\n\nSuddenly, Han Sen felt the forest above tremble as if there was an earthquake. Countless bugs were now swarming towards the shelter, like an aftershock tsunami.\n\nThe bugs could smell the bear’s blood, and they were each brave enough to come in. At the sight of the legion of bugs that now assaulted their shelter, the humans around were afraid, and they scrambled to different corners of the shelter in panic and disarray.\n\n“Get to safety inside the shelter!” Han Sen called out. He grabbed the bear and fell back, further in.\n\nThere were too many bugs to count, and they were all at least mutant class. If it had just been a few, it would have been fine, but now, it was a different ball game.\n\nThe bugs came for the bear, and their numbers continued to grow. They fought and clawed their way through their brethren in an attempt to get to him.\n\nGrrr! The white bear was being provocative, and it seemed to be telling Han Sen that he should have let it go.\n\n“You’re dead meat! No bug can help you; not a single one.” Han Sen grabbed the white bear by the neck again and retreated deeper within.\n\nThis enraged the bear, and so it dragged its paw along its flesh again. After this new self-inflicted lesion, the blood drove the bugs into an even greater frenzy.\n\nThe bugs were everywhere, and they choked the air and sky.\n\nHan Sen then decided to head to the entrance of the shelter, afraid the bugs would continue their assault until they destroyed the underground realm. Ruin to his shelter was the one thing he could not afford.\n\nAnd even if the shelter and the monumental tree above were not destroyed, if many bugs were left to invade the shelter, they’d undoubtedly slay the people that had moved-in to live there.\n\nGrabbing the bear as roughly as he could, Han Sen ran outside and into the forest. The bugs did not relent in their crazed swarming.\n\nGrrr! The bear growled and growled, but that’s all it would do. It was furious at its mistreatment.\n\nBut despite this, Han Sen did not dare hurt the bear at this point in time. The more damaged the bear was and the more it bled, the more rabid the native bugs would become.\n\nUnfortunately for Han Sen, this trial was far from over. Before long, he saw the scorpion coming his way, wishing to rejoin the fray.\n\nWith the situation as messed up as it was, all he wanted to do now was quickly kill the bear and discard its corpse there in the forest so he could run home.\n\nHe’d most likely be able to get away, but he wanted to do this only as an absolute last resort. There’d be no benefit for him in simply killing the bear.\n\nBut more and more bugs came, with many of them being sacred-blood class. They were getting frighteningly close.\n\nAs Han Sen wondered whether or not he should have killed the bear, a familiar voice rang out.\n\n“Daddy! Daddy!”\n\nHan Sen looked back, and he saw Bao’er sucking an empty bottle as she crawled towards him.\n\n“Why are you here?” Han Sen picked Bao’er up.\n\n“I want milk.” Bao’er shook the bottle she had been sucking on, indicating its empty condition.\n\nRoar! Roar! Seeing the vast swathes of bugs continuing to join the pursuit, the bear made more threatening noises.\n\nPang!\n\nBao’er had gotten annoyed, and so she kicked the bear in its face. The power in that kick was a struggle to believe, as blood suddenly spewed out from the bear’s face. The head’s structure was disfigured and crooked, and the teeth were knocked out. They scattered across the forest floor like loose change.\n\nBut when the bugs smelled the bear’s blood, the creatures merely screamed, squealed, and raged even more.\n\n“Ah!”\n\nBao’er was furious. The insects were keeping her from receiving milk, and this displeased her a great amount. Then, she pulled out a small gourd and shouted at the bugs that cloaked the surroundings in their ravenous numbers."
}