{
    "chapter": 2711,
    "title": "You’re Good",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2711",
    "text": "“Do it again,” the bull monster said in a ragged voice. Giant wings spread from the bull monster’s back and its body was covered in blue scales, but the creature stared at Han Sen with childlike intensity.\n\nHan Sen had heard him repeat those three words several times while they gambled. Han Sen had won seven times. By now, the bull monster’s eyes looked as if they were going to burst into flames. Han Sen was worried that the beast might attack him out of frustration.\n\n“How about you shake the coin, and I will guess?” Han Sen suggested, setting the coin down in front of the monster.\n\nWhen the bull monster heard him say this, his bull eyes brightened. He reached out a massive hand, using a power to pull the coin up into his coarse palms.\n\n“You will do the guessing. We are still betting for that shield on your back and the deified geno cores that I lost. You will have to give them back,” the bull monster said to Han Sen while holding that coin.\n\n“Sure. I’m willing to bet it all.” Han Sen blinked and went on to ask, “Brother Bull, what are you going to bet?”\n\nThe bull monster hesitated. It only had seven geno cores, and they had all been lost to Han Sen. It had nothing more to gamble with.\n\nThere were many elite and powerful xenogeneics scattered throughout the universe, but few of them would think of hiding something on purpose. They tended to be amazingly honest.\n\nThe bull monster wasn’t really giving up as much as it might have seemed. It had seven geno cores, but it had only created one of them by itself. The other six had been stolen from other xenogeneics it had killed.\n\n“Stolen” probably wasn’t the right word, though. The bull monster had eaten the bodies of the xenogeneics, and when he ran across their geno cores, he thought they might prove useful. Therefore, he took them. And now, on this day, he had used them for gambling.\n\nHan Sen noticed that the bull monster wasn’t speaking. He suspected that it had nothing left to use as a wager. He was worried that the bull monster might get upset if it really had nothing left to offer. He quickly said, “How about this, Brother Bull? You’re smart and powerful enough to beat all the deifieds you come across. You could probably gather ten shields and 100 geno cores without much difficulty, if you wanted to. How about you do a favor for me as a bet?”\n\n“What favor would that be?” The bull monster was honest, but he wasn’t stupid. He looked slightly warily at Han Sen.\n\n“Actually, the favor wouldn’t really be helping me. I feel bad for you, Brother Bull. It was that godd*mn *sshole that summoned you. He didn’t bring you a sacrifice. He was just playing you. If I see him again, I will try to punish him on your behalf. But I’m so weak… I’m not sure if I can fight him. It would be very embarrassing if I had to ask you to fight him on my behalf,” Han Sen confessed, looking at the bull with embarrassment.\n\nWhen the bull monster heard this, he thought Han Sen was a very nice person. He actually wanted to help him. He looked at Han Sen and nodded. “You’re good.”\n\n“Then it is settled. If I lose, you can have the shield and your geno cores back. And if you lose, when I find that guy again, I will ask you to help me out with him. And you will help me, then and there,” Han Sen explained, carefully confirming their arrangement.\n\n“Sure,” the bull monster said with a nod. Then, he proceeded to shake the coin.\n\nHan Sen watched the way the bull monster shook the coin. He knew that the creature wasn’t very good at gambling.\n\nAfter shaking it for a while, the bull monster held his hand out in front of Han Sen. With an awkward look, he said, “You can guess.”\n\n“Brother Bull, do you know if it is the image or the number?” Han Sen asked with a smile.\n\n“About that…” The bull monster tried to think. He opened his hand and glanced at the coin. Then, with a confident look, he said, “Of course I know what it is. Hurry up and guess.”\n\n“I guess…” Han Sen drew his voice out deliberately. He watched the bull monster’s face. The bull monster looked very nervous, and then he went on to say, “It is the image.”\n\nWhen Han Sen said that, the bull monster’s face collapsed.\n\n“Do it again.” The bull monster gnashed its teeth and started shaking the coin.\n\n“Do it again… Do it again… Do it again…”\n\nAn angry roar echoed through the sky, scarier than the thunder. Han Sen couldn’t even remember how many times he had won by this point. The bull monster probably owed him hundreds of favors by now.\n\nBut Han Sen had to acknowledge that the bull monster was honest. Although it had lost time and time again, it had never tried to kill Han Sen in its rage.\n\nSuddenly, the storm above them lessened and grew visibly weaker. The rage left the bull monster’s face, and it shouted, “Oh no! The God Spirit Storm is going to end. That means I have to go back.”\n\n“Why do you have to go back when the storm recedes?” Han Sen asked with confusion.\n\nMost people knew that the xenogeneics in the god area followed the storms. They came when the storms came, and they vanished when the storms did. But no one seemed to know why creatures could only come and go with the storm.\n\nThe bull monster didn’t answer Han Sen. It hesitated for a bit, then it pulled a purple scale and tossed it to Han Sen. “Use this scale if you ever need help. Putting your power into it will trigger it. I will follow the signal to come and find you.”\n\nAfter that, the bull monster looked at Han Sen’s new heap of geno cores. Then, it turned around and prepared to leave with the fading storm.\n\n“Brother Bull, hang on a sec.” Han Sen stopped the bull monster.\n\n“What now?” the bull monster said, staring balefully at him.\n\nHan Sen grabbed one of the geno cores out of the seven he had received. He threw it to the bull monster and said, “It is fate that you and I were able to meet today. I don’t have anything good to offer you, so you should keep this.”\n\nThe bull monster received the geno core with genuine glee. That geno core was the one the creature had created itself, and it was also the one that the bull monster had been looking at wistfully as it turned to leave.\n\nThe other geno cores were of various elements, so they wouldn’t help the bull monster much. But the geno core that the bull monster had created was very precious to him.\n\n“You really are so very kind.” The bull monster was very touched by this gesture. He had wanted to steal Han Sen’s things, but instead of holding a grudge, Han Sen was actually trying to help him. The entire situation made the bull monster quite emotional. He almost forgot that the geno core had originally belonged to him anyway.\n\n“Brother Bull, you should leave now. When I find that guy, I will summon you so that you may teach him a lesson. I will avenge you.” Han Sen waved his hand and said his goodbyes.\n\nThe bull monster was becoming even more emotional, but the thunder was almost gone. He had no more time to speak. He thought Han Sen was a very good person. If there was a chance, he would definitely help Han Sen in the future.\n\nWhen the bull monster disappeared with the thunderstorm, Han Sen let out a long sigh.\n\n“That was so close. I’m fortunate that he was an honest deified xenogeneic. If he wasn’t, things might have turned out far worse for me. I need to stop being so reckless. Deifieds are deifieds. I cannot underestimate a single one of them.” Han Sen made up his mind. If he saw Bao Lian again, he was going to end their feud. Permanently.\n\nAfter looking down and seeing that Exquisite was still in a coma, Han Sen sent a small jolt of power into her body. It seemed to unlock something inside of her, and Exquisite woke up.\n\nWhen Exquisite woke up, she jumped up. She stared at Han Sen with wide eyes and asked, “Why did you hit me?”\n\n“When did I hit you? You were so exhausted that you fainted,” Han Sen said with a guilty look.\n\n“You…” Exquisite started to reply, but then she realized something was amiss. She looked at the sky overhead and froze. “Where is the God Spirit Storm?”"
}