{
    "chapter": 1845,
    "title": "Strange Mark",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1845",
    "text": "“Don’t look. Return to your homes. No one can leave their rooms; if you do, you will be killed,” Han Sen said. The Barons quickly returned to their shelters as instructed.\n\n“Deep Blue Viscount, can you tell me what hurt him?” Han Sen looked at the gaping hole in Wind Viscount’s head, but he was unable to discern what might have caused it.\n\nDeep Blue Viscount looked weirded out, and he said, “It doesn’t seem as if he was attacked. It looks to me as if he imploded, or rather, exploded from the inside-out.”\n\n“Really? What power could cause something like that?” Han Sen asked.\n\nDeep Blue Viscount fell silent, and he said, “Many people have the power to do this. Some have the ability to invade the bodies of others and destroy their opponents from the inside. It’ll be hard for us to guess who the culprit might be.”\n\nHan Sen nodded and asked, “Do you know of any creatures like that around the base?”\n\nDeep Blue Viscount shook his head. “We haven’t been here for long, so no one has been able to venture out too far. All of our hunting expeditions have taken place around the proximity of the base. I haven’t seen any like that.”\n\nHan Sen did not ask any more questions. He grabbed a flamethrower and incinerated Wind Viscount’s body.\n\nA body that died for no reason could not be brought into the base. Only the gods could tell what might happen.\n\nThe body soon became cinders, but there was something that couldn’t be melted down. Han Sen plucked it out and noticed it was a black steel feather. It was a foot long and very heavy.\n\nHan Sen tried getting others to burn it, but no matter what they tried, it couldn’t be melted down. It wouldn’t even turn red with the heat. It was obviously not an ordinary metal.\n\nHan Sen used a sealed container to store the black feather. Those who had come into contact with the body were forced to undergo a scan and a proper disinfectant cycle, to ensure there would be no further problems.\n\nBut on the second day, something happened inside the base.\n\nThe Barons that had touched the dead body had a weird, egg-shaped symbol on their foreheads. The symbols were black. Han Sen used a tool to scan them, but there was nothing overtly strange about them. They seemed to be ordinary markings.\n\nThe four Barons were terrified. Wind Viscount’s manner of death had been far too strange, and now, this unexplainable happening gave them quite the scare.\n\nHan Sen checked over their bodies thoroughly, but he couldn’t discern anything out of the ordinary. So, Han Sen had them put into isolation. Han Sen also made sure to tell the people that delivered their resources about what was going on. He told them to bring doctors and tools so that they could try to discover what was happening to his people.\n\nIt would take two days for the ship to arrive, and Han Sen hoped nothing would happen in the meantime.\n\n“Do any of you know where Wind Viscount had gone off to?” Han Sen was investigating his death. If he learned how he died, perhaps he could find out what was wrong with the Barons.\n\nOne Baron told Han Sen that he saw Wind Viscount venture into the northern mountains. Wind Viscount had intended to cross them, but the Barons with him did not dare follow. Whatever happened to him was still mostly a mystery.\n\nHan Sen frowned when he heard this. The mountain they referred to was the one the Earl had gone into and never returned.\n\nHan Sen said he would have to put a stop to people venturing off to the north. The Nobles themselves knew how dangerous the north seemed to be, so no one opposed his decision.\n\nWind Viscount had entered the mountains, but died in front of the gate. With the four egg symbols on the foreheads of the Barons, Han Sen didn’t have a good feeling about what was going to happen.\n\nThe Earl had brought many other Earls to help him. And despite that, they had all disappeared. The people in the base would stand a much worse chance of surviving anything that might occur.\n\nHan Sen couldn’t wait much longer, so he contacted Yisha for advice. He wanted to tell her about what was happening, in case the worst happened.\n\nBut Yisha was currently practicing, and he did not know when she would finish. She couldn’t be interrupted, and so Han Sen was unable to get a hold of her.\n\nHan Sen contacted Icebird Duke. Yisha had told him that if she was not around, then he could look for Icebird instead.\n\nIcebird Duke, seeing Han Sen’s number, picked it up. She might not have liked the way Han Sen conducted his affairs, but Yisha had told her to take care of him in the event that he required assistance.\n\n“Icebird Duke, I have a problem. I need to get in touch with the queen, but she is busy. Do you think you can help, instead?” Han Sen asked her.\n\n“The rules of the Rebate dictate that only the master of the planet can contribute to the development of the assigned planet. If outsiders interfere, there is every chance that we will take it back from you.” Icebird Duke did not like Han Sen’s attitude, particularly in the way he kept asking for Queen.\n\n“If this was a normal situation, I wouldn’t come looking for you. Something bad has happened here, and I can’t get to the bottom of it. I really do need your help.” Han Sen said.\n\n“If you don’t think you can resolve the issue, then don’t. If you prefer to, you could always come on back. I can’t help you with anything.” She stopped Han Sen and went on to say, “Think about it. If you do decide to come back, I will send out some ships to come and pick you up.”\n\nAfter hanging up, Icebird Duke spoke to herself. “Of course there will be trouble developing a planet. If you cannot do it, then don’t.”\n\nHan Sen frowned. There was nothing he could do about her, and he did not know when Yisha would be able to return the call. Whenever it was, it would be too late.\n\nHan Sen called up another number. He was contacting Black Steel.\n\nBlack Steel was a strange fellow, but Han Sen figured that he was a reliable sort.\n\nOn Planet Knifegrave, Han Sen had asked him why he blocked the kniferiver. He said he wanted Han Sen to escape. He wanted to provide Han Sen a chance. He figured that was something he owed Han Sen.\n\nHan Sen did not know what Black Steel had been thinking, but it made him feel safe. Han Sen asked him to keep the knifemind thing a secret. No one knew he had a knifemind as wondrous as the one he did, and Black Steel really hadn’t said a word.\n\nHan Sen, unable to find anyone else to help, got in touch with Black Steel. If Black Steel could not help, then he’d have no choice but to evacuate.\n\nHan Sen was not creating drama. It was best to prepare for an event or problem one could not overcome. He didn’t want the women or children that were on the planet to die there.\n\n“What is it?” said Black Steel’s voice, and it sounded exactly the same as the first time they met.\n\n“I have a problem, and I need your help.” Han Sen went on to tell him the entire story.\n\nBlack Steel let Han Sen tell him everything. After a momentary pause, he said, “Don’t leave the base, and keep your eyes on those Barons. And do not touch them, no matter what. I will be there in four and a half hours.”"
}