{
    "chapter": 519,
    "title": "Hunting on the Bottom of the Lake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_519",
    "text": "\"You really dare to fight me?\" Annie was dazed. She did not believe that Han Sen dared to fight her. In terms of real fighting abilities, Han Sen was quite weak compared to her.\n\n\"Yes, but hands only.\" Han Sen smiled.\n\nHan Sen explained himself. What he was talking about was to play red hand. If she were to fight him, Han Sen might not even be able to survive two or three strikes from Annie.\n\n\"Okay.\" After hearing Han Sen's explanation, Annie agreed without hesitation.\n\nThe fact that she was not able to use her strength just now made her feel quite sullen. Although there were many limitations in terms of playing red hands, she could use her own speed and strength to punish Han Sen slightly in order to avenge herself.\n\nAnnie did not believe that she would still lose to Han Sen when she could use her own strength and speed. That could never happen.\n\n\"You made the first move just now. So, it is my turn this time, right?\" Han Sen asked Annie.\n\nShe did not say anything but put her right hand above Han Sen's right hand. She did not believe that Han Sen could beat her with his speed.\n\n\"Did you know why you lost just now?\" Han Sen asked her suddenly.\n\n\"Why... Slap!\" Annie was still preoccupied with the fact that she had lost to Han Sen. When Han Sen mentioned it, she was distracted immediately. When she was about to ask why, Han Sen's hand had already hit hers.\n\n\"You are shameless…\" Annie gritted teeth, wanting to kill Han Sen immediately.\n\n\"The game is all about tricks. If they are not allowed, you should say that earlier. Tell me, are tricks allowed?\" Han Sen asked, smiling.\n\n\"As you… Slap!\" When Annie just said two words, she was hit on her hand again.\n\nAnnie was so pissed that she almost vomited blood. Staring at Han Sen with her eyes wide, she almost looked like a tigress that was about to swallow Han Sen.\n\nHan Sen played red hands with Annie from the very beginning, it would be hard for him to hit her even with his sneak attack skills, considering her reflex and speed as a surpasser.\n\nHowever, because Han Sen had already broken the peace of her mind earlier, she could no longer treated the game normally, which was why he was able to affect her state of mind and hit her unexpectedly.\n\nAt this point, Annie's mind had become a mess. She was watching out for Han Sen at any moment. However, the more she did that, the easier it was for her to be hit.\n\nSlap slap slap!\n\nAny stared her eyes wide, watching Han Sen as if she had seen a ghost. She was both sullen and angry. There was no way she could understand why she would not be able to dodge Han Sen strikes based on her speed.\n\nShe hated Han Sen's shamelessness and wickedness even more, which distracted her each time so much that she could not focus on dodging his strikes.\n\nAs the stone was tossed into a well, there was bound to be ripple.\n\nThe amazing fact about human mind was that sometimes you knew what the right thing to do was, but you could not control your own temper and thoughts.\n\nAnnie knew that she should calm down and stay away from Han Sen's provocation. However, she was so upset at this point that Han Sen smiles made her feel incredibly angry. There was no way she could calm down.\n\nSlap slap slap!\n\nAnnie was hit again and again. She could not tolerate Han Sen's words.\n\nBoom!\n\nAll of a sudden, electricity boomed on Annie's body, turning her into a burning lightbulb. She hit the table with her palm and turned the table into ashes.\n\nHan Sen looked at Annie, appalled. He was terrified. The strength of a surpasser was so scary that it was beyond imagination. If it were him that Annie attacked, Han Sen would probably become ashes as well.\n\nFortunately, it was in the Alliance, so there was no way Annie would lay a finger on him no matter how mad she was.\n\nWatching Annie was so mad that she was shivering and sparkling, Han Sen said with a smile, \"You want to hit me because you lost?\"\n\nStaring Han Sen for a long while, lights disappeared on Annie's body. Without saying anything, she turned around and left. She was afraid that she might not be able to resist the urge to kill Han Sen if she said one more word to him.\n\n\"Asshole…Bastard… Shameless…\" Annie did not go back to her room but went to the virtual camp directly. She vented her madness in the virtual camp like crazy.\n\nSeeing the alloy table that had turned into ashes, Han Sen could not help spitting his tongue. He decided not to provoke that woman killer. If she disregarded anything and hit him, Han Sen could not survive a strike from her at all.\n\n\"Surpasser is so scary. They are not human anymore.\" Although Han Sen said that, he looked forward to becoming a surpasser even more.\n\nAfter eating the entire snake fish king, Han Sen had gained nine sacred geno points, and currently, he had twenty-one sacred geno points already.\n\nWhen Han Sen was trying to find Yi Dongmu to hunt sacred-blood creatures together, he failed to find him.\n\nWithout other sacred-blood creatures to hunt, Han Sen thought of the crab again. Although the shell of the golden crab was hard, Han Sen had practiced the yin force and could penetrate its shell. Maybe he could kill it after all.\n\nThe key was his strength. If he did not have enough strength, that was fine as well. Han Sen decided to dive into the Crystal Palace first, hunt some primitive fish creatures at the bottom of the lake, and fill up his primitive geno points.\n\nHunting fish creatures at the bottom of the lake was much easier than fishing. Han Sen returned to the bottom of the frozen lake again. With the silver eel this time, it was easy for him to come to the Crystal Palace.\n\nThe golden crab climbed out after hearing the noise. When it saw it was Han Sen, it quickly went back to the cabin, disregarding what Han Sen was doing outside. It never went out again.\n\nHan Sen did not provoke the crab but looked at the fish creatures that were swimming at the bottom of the lake. He thought to himself, \"when I have the Crystal Palace to myself, I will never worry about creature resources because I can go to the deep ocean to hunt.\"\n\nSince the Crystal Palace was indestructible, Han Sen was not afraid to encounter scary creatures at the bottom of the sea. He could always hide in the cabin.\n\nThe most important thing at this moment was to control this Crystal Palace. Otherwise, he could go nowhere.\n\nStanding on the deck, Han Sen felt like he was in an aquarium. Above his head, all kinds of fish creatures were swimming around. However, because there was no glass, Han Sen could reach into the water to touch them.\n\nAfter waiting for a while, when seeing a golden anchovy swimming nearby, Han Sen reached out immediately and grabbed it into the shelter.\n\nThe golden anchovy suddenly fell on the floor. Without water, it had lost almost all its abilities to fight. All he could do was to jump and try to go back to the water.\n\nHowever, Han Sen would never give him the opportunity and trampled it to death.\n\n\"Primitive creature golden anchovy killed. Beast soul of golden anchovy gained. Eat its meat to gain 0 to 10 primitive geno points randomly.\""
}