{
    "chapter": 2713,
    "title": "No God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2713",
    "text": "In his absence, the Breakskies had continued their unsuccessful efforts to excavate the mountain. When Han Sen arrived, Horizontal Evil was in the middle of his routine torture, courtesy of the metal pillar. Blood flew from the giant’s chest as the metal pillar spun.\n\nWhen he saw Han Sen, Horizontal Evil frowned. “What took you so long to come back?”\n\n“Something happened in the outside world, and it slowed me down.” Han Sen didn’t explain much. He changed the subject and said, “I can continue our previous discussion if you’d like to talk about the universe.”\n\nBut Horizontal Evil stopped Han Sen from saying anything further. He said, “Listen up. I don’t have much time, and there is something I would like you to do for me. And if you can do it, it will be a great benefit for you, as well.”\n\n“What happened?” Han Sen looked at Horizontal Evil with confusion. The giant seemed very upset. He was acting very differently than he had the last time Han Sen visited.\n\nPreviously, Horizontal Evil was being tortured, but the man was able to keep his cool. Now, he seemed like he was about to have some sort of breakdown.\n\nHe looked as if he was holding it back, but Han Sen could sense that something was on the verge of happening.\n\nHorizontal Evil didn’t answer Han Sen’s question. He raised his head and let his face emerge from the unkempt hair.\n\n“Do you believe God exists in this world?”\n\nIt was a solid face. Although it wasn’t handsome, it was obviously trustworthy. But what Horizontal Evil said gave Han Sen a chill. For Han Sen, that question was one of the most annoying things in existence. He really didn’t even know how to answer.\n\n“Oh. I suppose you have already seen them?” Horizontal Evil was surprised, having guessed this through Han Sen’s reaction to the question.\n\n“Yes. If the gods you are talking about are guys like King Jun, I have seen them. I even fought King Jun once before.” Han Sen briefly told him about his trials against King Jun on Planet Eclipse, then the events after that.\n\nHorizontal Evil heard Han Sen’s tale about killing the Sun Raven in front of King Jun and laughed. “Awesome. This is awesome! I can’t believe you ended up beating King Jun like that… Just this is enough for you and me to become good friends. Good, good, good. I feel safe entrusting this task to you.”\n\n“What is it?” Han Sen asked hesitantly.\n\nInstead of answering, Horizontal Evil continued on his tangent. “In this universe, beings like King Jun exist. To some creatures, they are indeed gods. But to me, they are less than a fart in the wind. Even if they are gods, so what? We, the Breakskies, will still defy and slay the gods. We will make them wet themselves. That is how one lives like a man, after all.”\n\nThe way Horizontal Evil spoke might not have been very polite, but it still excited Han Sen a lot. He agreed with Horizontal Evil’s assessment of how men should behave.\n\nThe giant went on to say, “I will control my fate, and the fate of the Breakskies will be in my hand. No matter whether our opponents be gods or fairies, they will never make the Breakskies concede.”\n\nAlthough Han Sen was still excited, he also felt a tinge of sadness flow through his heart.\n\n“Can you tell me what happened, exactly?” Han Sen couldn’t help but ask.\n\nHorizontal Evil still didn’t answer him. He stared at Han Sen with fire in his eyes. A while later, he said, “This could be the final stand of our race. I shouldn’t be asking this of you, but I have no choice now. And you are a crystallizer. That means we are allies, and therefore, I have to depend on you.”\n\n“This task will be very difficult. It might ruin the entire fate of your race and yourself. After this, you might become an enemy of the gods. Are you afraid?” Horizontal Evil looked at Han Sen with fire in his eyes.\n\n“I might obey God, but I don’t obey self-proclaimed gods like King Jun,” Han Sen answered.\n\n“Haha! Well said. Although you aren’t like me, with disdain for the whole world, at least you are honest.” Horizontal Evil laughed harder than ever.\n\n“If you have some task to ask of me, and it is as dangerous as you say, could you at least explain it?” Han Sen asked Horizontal Evil.\n\nHan Sen wasn’t afraid of being King Jun’s enemy. The gods already hated him, and that wouldn’t change regardless of what Horizontal Evil asked him to do.\n\nIn addition, he now wanted to find out where the gods came from and what was going on with Sacred Leader and Horizontal Evil.\n\nHorizontal Evil’s smile disappeared. He looked at Han Sen and said, “Little Brother, I can tell you that this world doesn’t have a god. The self-proclaimed gods are creatures like you and I. The difference is that we are outside the Geno Hall, and they are inside it.”\n\nWhen Han Sen heard this, he was delighted. He was close to finding out the truth. He didn’t say anything. His eyes widened, begging Horizontal Evil to elaborate. He wanted to hear everything about the gods, so he could learn the truth behind these excruciating mysteries.\n\nHorizontal Evil paused, and then he said, “Although there is just a difference of locale, their powers are indeed greater than ours. Our power can barely damage them, in fact. But there is one power that is the exception to this rule.”\n\n“Super Gene?” Han Sen couldn’t help but ask.\n\nHorizontal Evil thought Han Sen had heard the term through the conversation he last had with King Jun. So, he didn’t think too much about it. He nodded and said, “That is correct. It is Super Gene. Having Super Gene enables you to kill these fake gods.”\n\n“But what is Super Gene?” Han Sen asked.\n\n“There is no answer to what it is.” Horizontal Evil’s answer surprised Han Sen.\n\n“Why is there no answer?” Han Sen asked in confusion.\n\nHorizontal Evil laughed and said, “My good brother took to fighting those gods. We stumbled upon something that was able to hurt them, but hurting them was all we could do. We were never able to kill the gods with it. So, we investigated our discovery and came to the conclusion that it was called Super Gene. We needed our bodies to contain the Super Gene so that we could fight the gods in the Geno Hall and kill them for good.”\n\nBefore Han Sen could put a word in, Horizontal Evil went on to say, “I have yet to succeed. So, I cannot tell you the true nature of Super Gene. But there is something that I can give you. With it, you can begin to unravel the truth for yourself. If you are lucky enough, you might be able to find out what Super Gene truly is. If you aren’t lucky, pass it on to others until someone is finally able to learn what Super Gene really is.”\n\nWhen Han Sen heard this, his body shook. The “good brother” Horizontal Evil mentioned might have been Sacred Leader. Han Sen thought the thing he needed was in Sacred Leader’s hands, but he hadn’t expected Horizontal Evil to actually be in control of the secret. And he was now going to give it to Han Sen."
}