{
    "chapter": 1001,
    "title": "Waterfall on God Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1001",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen chased the ape king, but again, he was unable to keep up. He could have sworn the simian fiend was cheating, and before long, it had completely disappeared from sight.\n\nBut with the king gone, the other monkeys still tried to attack Han Sen. After sealing their seventh sense, he went into hiding.\n\nWhen their sight returned to them, they poked around and looked for Han Sen, but they couldn’t find him. Not too concerned with establishing a manhunt, they just went away.\n\n“I’m going to find you now.” Believing they were headed home, Han Sen decided to follow the monkeys.\n\nAfter ten miles of travel, he saw a grand mountain many of the monkeys were scaling.\n\nHan Sen admired the grandeur of the mountain and was in awe at the spectacle. Its peak was nestled above the clouds, and there was a massive waterfall. It was incredibly beautiful.\n\n“If I had to wager a guess, I’d say the monkey king makes its home here,” Han Sen said to himself, and then thought, “Now I know where you live. If you ever show your face, and if you ever disturb my people again, I will be back. I’ll kill your kids and all your grandkids. We’ll see who’s laughing then.”\n\nHan Sen approached the mountain, and as his sense of scale improved, he got a sense of how truly enormous the mountain really was. He could not even see the peak.\n\nThe silver waterfall came from someplace above the clouds, and it looked like a silver dragon descending from the heavens.\n\n“Strange; I wonder where the water comes from?” Han Sen looked around, and noticed it really was just a single mountain surrounded by the woodlands of Thorn Forest. It was not a mountain range.\n\nA lonely mountain, with a spectacular waterfall such as that, was strange in Han Sen’s eyes.\n\n“Does the water come from the sky?” Han Sen thought, but then quickly disregarded the idea as ludicrous.\n\nHan Sen turned his attention back to the monkeys that scaled the mountain. Curiously, they were all headed for that waterfall, and when they reached it, they went beyond it.\n\nHan Sen’s interest was captured by the sight, and he wanted to see exactly what they were doing and how they were disappearing into the waterfall.\n\nAfter another moment of contemplation, Han Sen decided to check out the waterfall himself. So, he started to scale the mountain, heading there alongside the blue monkeys that still couldn’t notice him.\n\nThe monkeys were unable to beat him in a fight, and even if Han Sen had to take on the ape king, he was confident he could beat it. Therefore, he did not need to fear going after them.\n\nHan Sen wished to see what they were doing behind the waterfall.\n\nUpon reaching it, Han Sen found that there was a cave behind the waterfall. He scanned the entrance and could not see a thing. All traces of the monkeys had vanished.\n\nBao’er herself looked curious, and she asked, “Daddy, where are the monkeys?”\n\n“I’m sure we’ll see them soon enough.” Han Sen walked inside the cave with caution, slightly worried that he was walking into a trap.\n\nBut nothing happened. He walked through the caves for three kilometers, and still, he could not find the monkeys.\n\nThe cave was getting dark, too. Han Sen could no longer see Bao’er’s face, either.\n\nHe had his Dongxuan Aura active, and try as he might to find a creature, there was nothing. There was only the black.\n\nHan Sen kept a hand on the cave wall as he went, and he thought to himself, “What are the monkeys doing down here? Is there a treasure of some value, maybe?”\n\nWith the thought of treasure running through his mind, Han Sen’s excitement for this affair was renewed.\n\nWherever he was headed, there was only one way. The cave’s tunnels were linear, and there were no forks or branching pathways. As such, he did not have to worry about getting lost.\n\nHe walked another ten miles in that place, and he started to wonder whether or not he was going to reach the end. Regardless of where he was, the mountain was far too big for its own good, he thought.\n\nHe suddenly saw a light ahead of him, which brought him a joy that had long since been vanquished. Holding Bao’er tight, he ran towards the light.\n\nIt was an exit, and speeding up, Han Sen ran out. Before him lay a valley.\n\nThere were countless monkeys playing in that valley, and across the verdant greens of that expanse, were gorgeous trees.\n\n“Are they geno plants, I wonder?” Han Sen looked at the trees, and after a brief scan, Han Sen could detect the lifeforce of each. They were indeed all geno plants.\n\nMany of the trees were ripe, and there was much fruit growing across their boughs. The monkeys were gorging themselves on the succulent fruits, even now as he looked on.\n\n“Awesome! So many plants with really high lifeforces; I most certainly hit the jackpot today.” Han Sen wanted to rush forward and claim them for himself, and even Bao’er was squirming with hands outstretched, obviously wanting to eat the fruit.\n\n“Don’t be hasty. We’re still not sure if we can even eat them yet.” Han Sen held Bao’er tight, watching the reactions of the monkeys as they ate the fruit.\n\nThe geno plants did look strange, admittedly. As such, he was a little hesitant to begin eating the fruit their branches offered.\n\nThe geno plants possessed fruit, but that was it. There were no flowers or anything of the sort, which was why Han Sen thought it strange.\n\nHan Sen, with his eyes alone, could see at least a hundred of the geno plants. But none of these plants grew weapons, beast souls, or creatures. Not even spirits.\n\nThere was only fruit. The monkeys weren’t selective of which fruit they wanted, either. They just picked up the fruit nearest to them and kept on eating.\n\nBao’er could not wait any longer, and she escaped Han Sen’s grasp. She crawled to the nearest tree and climbed it. She picked up one of the fruits and ate it."
}