{
    "chapter": 1837,
    "title": "Zero’s Second Evolution",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1837",
    "text": "Zero first generated her white geno armor, then underwent the process a second time. There was no pause between the sequences. Her geno armor simply melted and reshaped itself into a white knife. It looked like a dagger made of bone.\n\nAs Han Sen found himself joyous in the realization that Zero could evolve a second time, her bone knife suddenly cracked. It gave him quite a shock.\n\n“What is this? Why did the geno armament crack, all by itself?” Han Sen did not understand. When he wanted to check on her and see if she was injured in any way, the energy surrounding Zero changed all of a sudden. Her black eyes turned purple, and then that color of purple started to spread.\n\nQuickly, Zero’s hair was overtaken by the purple dye. From her head, two horns protruded.\n\n“Zero! Are you okay?” Han Sen was worried, but fortunately, Zero wasn’t wounded. She had simply turned into her shura-self.\n\nWhen Zero became shura, a substance oozed out of her body. Then, she began generating another geno armor.\n\n“She can generate another geno armor? Aren’t her human and shura bodies one?” Han Sen wondered to himself.\n\nThis was different. Zero’s geno armor had become purple, just like her purple horns. The texture was similar between them both, too.\n\nThe process was a success, just like it was last time. They became geno fluid again, as well, but this time, it did not reshape itself as a knife. It went right into Zero’s body.\n\n“Xenogeneic?” Han Sen was worried. Zero’s situation was a complicated one.\n\nThrough the first process, she became a Noble. This second time, however, she was becoming a xenogeneic. Han Sen did not know how that would ultimately affect her body.\n\nThe purple substance went into Zero’s body, and her whole body showed changes. A purple smoke was emitted, and its cloud quickly obscured Zero. Inside it, he did not know how she might be evolving now.\n\nAs Zero was evolving to become a xenogeneic, far away in space, inside a black hole, there was a man with purple horns practicing. He opened his eyes and looked in the direction of Planet Kate. He looked shocked, and then he frowned.\n\n“Weird. Why did that feeling only last one second? Would any of my heirs like that exist?” The man looked confused, as he couldn’t feel anything anymore.\n\nBut the man cared little for it. With that thought lingering in his mind, he continued his practice.\n\nA man was standing on the roof of Han Sen’s abandoned building, looking up into the sky. He seemed interested in something, and he said, “Interesting. The creatures around that guy are interesting. And he managed to get someone who was able to refine the deified feather. And it wasn’t a Feather. And now, a person has emerged whose power is able to wake up an elder. Luckily, I got here quick and averted the trouble.”\n\nKong Fei had felt it when Little Angel refined the deified feather. So, he teleported there to save Han Sen from a particular crisis.\n\nHan Sen was in the room, waiting for Zero to evolve. Kong Fei was on the roof of the building, drinking alcohol. The space around the building seemed different, but you couldn’t quite put your finger on what that difference was.\n\nHalf an hour later, Zero’s purple mist cleared. Her face did not seem to display much difference, and everything about her was still purple. There was no visible difference now from before she had transformed.\n\nWhen Zero’s purple smoke had faded entirely, she looked like a human again.\n\n“Zero, are you okay?” Han Sen asked, looking at her body.\n\nZero shook her head. She summoned the white knife in her hand. It was the bone knife she had generated.\n\n“The knife is still here.” Han Sen was shocked. He thought the geno armament had shattered after the cracking, but that did not seem to be the case.\n\nZero nodded and shook her head again. She wasn’t really sure what to say.\n\nHan Sen knew she was not hiding anything from him, and that she really did not know how to phrase what she wished to say. So, he said, “We can talk about it later. Let’s go back to the ship for now.”\n\nHan Sen did not bring any more people with him this time. He could bring many more, but he figured that this would be enough for now.\n\nHan Sen did not want to let Zero, Little Angel, and Little Silver leave the building yet, in fear of something happening to them. So Han Sen walked out with them. He walked around town and recruited a few Kate, just in case his companions looked a little too obvious and strange.\n\n“Interesting guy.” The man on the rooftop watched Han Sen leave, then he smiled and jumped back into space.\n\nThe city was in ruins. There were no more people to collect, and after walking around. Han Sen realized there was nothing worth hanging around for.\n\nCities like that, aside from ones where the Kate army had gathered, were notoriously difficult places to find Barons. Even if they had been there when the Feathers fell, they’d have been recruited by others by now. They wouldn’t still be hanging around.\n\nWhen Han Sen’s group arrived at the ship, Han Sen noticed that there was more life gathered around the ship than there was in the rest of the city. Many of the Kate were in front of it, hoping they could get on.\n\nBut Han Sen wanted to recruit Barons only, so they were all stopped.\n\nThe people were begging profusely, right outside the ship, hoping that those onboard would change their minds and consider letting them on.\n\n“Please take me away! I can do anything you want.”\n\n“Please, at least take my child! Only she needs to be on!”\n\n“Didn’t I tell you guys clearly? We are hiring people to develop a harsh planet! Not even Barons might survive there, and you think you guys will?” One of the workers tried to explain the matter to the crowd, but the people outside did not quit their constant begging.\n\nHan Sen frowned as he walked forward. Icebird Duke saw Han Sen had brought two little girls with him, and she frowned. She thought the lady Han Sen had brought was stronger than an ordinary creature. But it was just a Baron, so it was still practically useless.\n\nShe wondered what Han Sen’s true purpose was. His stated reasons had seemed rather flimsy. If Han Sen really wanted to recruit people, he wouldn’t have come here. Now, seeing two pretty ladies, Icebird Duke looked a little upset. She thought he had to be up to something.\n\n“Icebird Duke, did you recruit anyone?” Han Sen asked her.\n\n“We have sixteen so far,” Icebird Duke said.\n\nHan Sen was surprised. He thought it was too many. He hadn’t thought there would be so many Barons there, either."
}