{
    "chapter": 2551,
    "title": "Pulling a Carriage",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2551",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Keep them alive. I have things I need to ask them,” Han Sen said to Elysian Moon, who was on the verge of taking Ji Yang Sheng’s life.\n\nElysian Moon lowered her paper umbrella and looked expressionlessly at Ji Yang Sheng and the others. The three left alive were severely injured. Even from an idle glance, it was clear that they were in bad shape.\n\nBut they were restricted by the Dongxuan Area, so they couldn’t have hoped to flee even if they tried.\n\n“Mr. Ji, what is this doll?” Han Sen looked at Ji Yang Sheng, who was bleeding all over the place.\n\n“Since I’m already in your hands, you can kill me if you want. But I can assure you, I won’t be giving you any information,” Ji Yang Sheng said.\n\nHan Sen smiled. It looked as if the prince wasn’t going to be doing any talking. Otherwise, he would have bargained instead of making heroic claims.\n\nHan Sen waved his hands, and the two half-deified Demons disappeared in a flash of rainbow light. They were reduced to nothing. Not even their bones remained.\n\n“Mr. Ji, tell me where the Demon Doll comes from, and I will let you live,” Han Sen said slowly.\n\nA myriad of emotions passed over Ji Yang Sheng’s face, but this time, he didn’t speak with the certainty he had shown before. After a while, he said, “If I tell you, will you really let me live?”\n\nHan Sen laughed and said, “Mr. Ji, although you are full of yourself, you are a pathetic ant in my eyes. Whether you die or not makes no difference in my life. Ergo, I don’t really care what happens to you.”\n\nJi Yang Sheng gritted his teeth and looked at Han Sen. It looked as if he had just made a big decision, and he said, “Okay, I will tell you about the Demon Doll. But you must promise to let me go.”\n\nHan Sen’s face looked cold. He didn’t say anything. He lifted his hand, summoning a rainbow light.\n\n“Okay, I’ll tell you! I’ll tell you!” Ji Yang Sheng was so shocked.\n\nHe thought Han Sen had made a mistake by killing the other two Demons. Ji Yang Sheng thought that if he was the only one alive, Han Sen wouldn’t kill him if he wished to know the secret of the Demon Doll. Therefore, Han Sen would be forced to bargain.\n\nBut now, he realized Han Sen had the power to kill two half-deifieds with ease. That meant the Demon prince could be killed easily, too. The secrets he held weren’t worth much to Han Sen, in all likelihood.\n\n“Don’t make me think you are lying. Otherwise, even if I don’t want to kill you, I will have to kill you as punishment,” Han Sen said to Ji Yang Sheng, his voice flat.\n\nHan Sen knew Ji Yang Sheng was a worm that only acted bravely. The man might have tried to maintain his image if his subordinates were around, so Han Sen took a shortcut and killed the other Demons before getting down to brass tacks.\n\nAnd now that he was the only one left alive, Ji Yang Sheng seemed a lot more willing to bargain. But even so, his attempts to negotiate were weak. His resolve had crumbled.\n\nIt wasn’t long before Han Sen received the story of the Demon Doll from Ji Yang Sheng.\n\nJi Yang Sheng didn’t know much about the Demon Dolls. All he knew was that they were created by the alpha. They had a strong vitality and a keen proficiency with Sky Demon powers. They were scarier than actual Demons.\n\nBut no one knew how the Demon alpha created the Demon Dolls or what materials were used to make them.\n\nPeople believed the Demon Dolls were crafted from Demon elites, but there weren’t many Demon elites of that level of talent. In addition, no Demon elites were missing from the records. So, that couldn’t have been the truth.\n\nEven the Demon society knew little about the Demon Dolls. Only the core supervisor would know about them. Not many Demons were given a Demon Doll by the alpha to use.\n\nDespite Han Sen’s repeated questions and threats, Ji Yang Sheng hadn’t revealed how the Demon Doll was created. It was probably something only the Demon alpha knew.\n\n“How many Demon Dolls are there?” Han Sen seemed to know his captive wasn’t lying, and so he asked this.\n\n“I’m not sure about that. I know there are at least a dozen. The Demon alpha gave out a few Demon Dolls. There are still a few left in stock. I know of three deified Demon Dolls. The rest are half-deifieds.” Ji Yang Sheng was gushing secrets like a broken faucet in his desire to survive.\n\n“There are three deified Demon Dolls?” Han Sen was shocked. The Demons weren’t considered a big race these days. They weren’t highly ranked among the higher races. Not only did they have deifieds in their midst, but they had three deified Demon Dolls. There could even be more. That was a scary thought.\n\n“It looks like the Demons are stronger than we thought,” Gu Qingcheng said after a moment of thought.\n\nHan Sen was thinking, too. “There sure is something a little sketchy about the Demon alpha. I bet those Demon Dolls are the shura kings that entered the geno universe via the Shura’s Graveyard. That means there is a blood relation between the Demons and the shuras. But why did the Demon alpha turn them into Demon Dolls?”\n\nHan Sen didn’t understand, and so he asked Ji Yang Sheng how one could control a Demon Doll. The man’s explanation was thorough.\n\n“But even if you do know how to control it, you need Sky Demon power to actually do it,” Ji Yang Sheng said. But Han Sen had already activated the purple horn. The Demon Doll began to move. Ji Yang Sheng’s mouth opened wide, and he could no longer speak.\n\n“This Demon Doll seems easy to use.” Han Sen raised the purple horn, which was oozing purple smoke.\n\nAs long as Han Sen had that purple horn, he could use his will to control the Demon Doll. It could act out many commands. The doll was even able to perform simple actions by itself, so it didn’t have to be controlled at all times.\n\n“Mr. Han, I told you everything you asked to know. I didn’t lie once. Can I go now?” Ji Yang Sheng asked Han Sen with sincerity. He looked so scared.\n\n“Who said you could ever leave?” Han Sen smiled.\n\n“You said you would let me live! Are you going to break your promise?” Ji Yang Sheng was shocked, and his face looked very pale.\n\n“I said I would let you live, but I didn’t say I would let you go.” Han Sen waved his hand and said, “You can be in charge of pulling my carriage in the future.”\n\n“Pulling a carriage?” Ji Yang Sheng was confused. He didn’t know what that meant.\n\n…\n\nIn the core area, a few Kings were hunting a xenogeneic. They were just about to kill it when they saw something coming toward them.\n\nThey stared for a long minute, confused, before they understood what they were seeing.\n\nThey saw a Demon coming toward them. There were ropes around the Demon’s shoulders, and he was pulling something like a rickshaw.\n\n“Hey, isn’t that the Demon Ji Yang Sheng? What is he doing?” The Kings looked at the strange sight in shock. Most of them couldn’t speak.\n\nJi Yang Sheng was pulling a bronze carriage. It didn’t have a roof, but there was an umbrella shading the occupants. Inside the carriage were a man and two women. The beautiful women sat on either side of the man, like two wives flanking a king."
}