{
    "chapter": 2469,
    "title": "Inverse Dragon Lando",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2469",
    "text": "“Han Sen, look where you are.” Shadow Ghost raised the Wanjie Rubix Cube that was in his hand. The stream from the Rubix cube was still running. Han Sen could see the video, which showed him caught in the screen of Shadow Ghost’s camera.\n\nHan Sen’s heart leaped at the sight, and so he quickly tried to fly out of the camera’s frame. He kept an eye on the Rubix cube’s stream as he flew, but he soon realized that no matter what direction he flew, there would be no escape from that place. The video stream showed that he was always dead center of the camera’s screen.\n\n“It is useless! In my shadow area, you are just an image. And if I rip this image, your body will be torn just like it,” Shadow Ghost boasted. Then he damaged a corner of the image that showed a bit of Han Sen’s hair.\n\nThe moment the image of Han Sen’s hair was damaged, Han Sen’s actual hair was given a trim. He didn’t know how it had happened, but there was nothing he could do to prevent it.\n\nThe people that were watching the stream felt a chill. They knew Shadow Ghost could enter virtual images, but they didn’t know he had a power like this.\n\nEveryone felt a chill. If Shadow Ghost trapped them in a picture, killing them would be as simple as damaging a camera.\n\nSome of the deified elites who were watching the video nodded in approval. They were impressed with Shadow Ghost’s might.\n\n“Don’t worry. I’m not going to kill you.” Another creepy smile crossed Shadow Ghost’s face. “You’re worth more alive. I’m going to take you with me to the Extreme King. You might be my best chance of becoming deified.”\n\nHan Sen was looking at Shadow Ghost, who was outside the image, with an expressionless face. He said, “Do you really think you can capture me this way?”\n\nShadow Ghost replied with confidence, saying, “My area has no limiting range. Furthermore, you are just a King. Even if you were deified, you couldn’t escape the boundaries of my area.”\n\n“Really?” Han Sen said. His left eye then flashed with a red light, and his body turned into a red shadow.\n\n“Where is he?” Shadow Ghost’s face changed. Han Sen had disappeared from the picture.\n\n“Where is he?” The people who were watching the stream were shocked, too. They hadn’t seen how Han Sen had managed to get out of the picture’s frame.\n\n“Argh!” Shadow Ghost’s sudden scream drew everyone’s attention back to him.\n\nOne of Shadow Ghost’s eyes was bleeding. It seemed as if some scary power had penetrated his eye and sent a jolt of pain straight to his brain.\n\nHan Sen was standing behind Shadow Ghost. His Thunder God Spike was dripping with blood.\n\n“Next time you want to kill me, don’t talk so much crap.” Han Sen swung the Thunder God Spike, flicking away the blood. He took the Wanjie Rubix Cube and flew away without looking back.\n\nShadow Ghost’s body fell through the emptiness of space. It appeared like he had been killed.\n\nEvery noble watching the video stared in mute silence. Shadow Ghost was a nightmarish enemy, but he had been one-hit-killed. The viewers were having difficulty wrapping their heads around the idea.\n\nMost of the Kings, Dukes, and nobles were unable to discern just how Han Sen had managed to kill Shadow Ghost, though. That was what scared the audience the most.\n\nSomeone who had just become a King had managed to kill a half-deified warrior as quickly as they might kill a chicken or a cow. It was hard to believe.\n\nThe video stream suddenly went black. The spectacle was over. Many of the viewers were still reeling from the shock, though. They hadn’t yet figured out how to react.\n\nHan Sen turned off the Wanjie Rubix Cube and flew forward. He wanted to take a look at the items Shadow Ghost and Barr had been carrying, but he didn’t have time.\n\nA scary presence was coming this way. Han Sen could sense that if it wasn’t a deified elite coming for him, then it was a very terrifying half-deified being. It was most likely someone that he couldn’t compete with on his own.\n\nOf course, not long after Han Sen flew away, a shadow appeared where Han Sen had been. That person looked at the dead Shadow Ghost and the frozen Barr. He waved his hand, bringing out a swordlight. He used it to break Han Sen’s ice, freeing Barr and the others.\n\nOnce Barr and Thunder were freed, they caught sight of the new man and began to tremble.\n\n“Lando!” Shadow, from the race of the Storm, screamed. He looked frightened.\n\n“Were you guys fighting Han Sen?” the person called Lando asked, his voice stern.\n\n“Yes,” Shadow answered. He was very scared of Lando, but he still answered truthfully.\n\nAfter hearing Shadow’s answer, Lando chased after Han Sen, his body moving so fast that the space around him seemed to groan.\n\n“I can’t believe Lando is here. No matter how strong Han Sen is, that is one opponent that he won’t be able to escape.” Thunder finished his statement with a very long sigh.\n\n“The traitor that the Dragons hate the most. The Inverse Dragon Lando might not be deified, but he has killed enough of them. And they were deified Dragons, of all things. A guy like him can’t be dealt with by a King.” Shadow’s mood had mellowed somewhat.\n\n“There are many elites in this universe, and there are many half-deified elites. But the scariest half-deified in existence has to be Lando,” Thunder said. After a moment of thought, he went on to say, “Although the half-deifieds of the Extreme King are powerful, this guy could fight an entire generation of them. If I had to pick an enemy, I would prefer to choose a half-deified of the Extreme King over Lando. Lando is just too evil.”\n\nEven Barr looked shaken. He wasn’t scared of anything, and he would go anywhere. But aside from deified elites, there were two people he feared: the Inverse Dragon Lando and Yu Shanxin of Sky Palace.\n\nIf it was anyone else, he’d chase them down to the ends of the universe. Either that or he’d kill the person right where they were. But after seeing Lando, Barr had yet to say a single word. He just watched Lando go after Han Sen. He didn’t dare follow.\n\n“Han Sen is dead,” Barr said to himself. Then, he flew out of the Tianxia System. He no longer planned to chase Han Sen.\n\nHan Sen flew through the clouds at full speed. He kept changing direction, and he erased his scent and trail as he fled. But still, he couldn’t shake the entity chasing him from behind.\n\nHan Sen could also feel that whatever was pursuing him was gaining. The gap between them was closing.\n\nWhen Han Sen finally reached the edge of the purple clouds, he saw someone emerge from the clouds behind it. The being was coming his way, and it was coming fast.\n\n“One of the Dragon?” Han Sen murmured. The man’s Dragon horns were particularly large, but he didn’t have wings. He looked like a Dragon hybrid."
}