{
    "chapter": 2455,
    "title": "The Woman in the Wooden House",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2455",
    "text": "Han Sen was hesitant. He didn’t know if he should stay in the demon spirit’s eyes or jump to the eyes of this woman.\n\nFrom what the woman had said, he could guess that she had been imprisoned in this house by the demon spirit. If Han Sen leaped into her eyes, even if she never discovered his presence, there was a chance he might never leave that place.\n\nBut if he stayed inside the eyes of the demon spirit, who knew how long he would have to remain inside the Sea Demon Car. Twiddling his thumbs in the Sea Demon Car for a few hundred years would be a pretty miserable fate.\n\n“The woman should be easier to deal with than the demon spirit. Even if I’m discovered, it won’t be as difficult to escape.” Han Sen could feel that the demon spirit was on the precipice of leaving. Putting away his hesitation, Han Sen reflected himself into the eyes of the woman before the demon spirit had a chance to break eye contact.\n\nWith the woman’s curses still echoing around him, the demon spirit walked back down the hill away from the house. As he watched the demon spirit’s receding back, Han Sen felt rather glum.\n\n“Finally, back to normal.” With the woman’s vision, Han Sen could finally see colors again. It was a relief to have normal vision after being stuck in the monochromatic eyes of the demon spirit.\n\nWhen the woman saw that the demon spirit had finally left, she stopped swearing. Then, she turned away from the window.\n\nThe woman glanced around, and as she did, Han Sen followed her gaze. The interior of the house was packed with bookshelves, and the bookshelves were all lined with books.\n\nThe woman’s eyes moved too quickly, however, which kept Han Sen from being able to read the titles on the books.\n\nThe woman walked downstairs and left the house. Despite her earlier anger, the woman walked over to the book that the demon spirit had left on the grass and picked it up.\n\nWhen she returned to the house, the woman threw the Shocking World Record of the Extreme King on the floor. She stomped on it many times, discharging some of her leftover anger.\n\nA while later, the woman picked up the Shocking World Record of the Extreme King. She used a cloth to clean it, then placed it on a bookshelf.\n\nThe woman grew restless after that. She stood up and moved back to that same bookshelf, repositioning the Shocking World Record slightly.\n\n“Does this woman have OCD?” Han Sen thought that the woman was a bit weird. There were no other creatures on this mountain, only this one woman living alone in a wooden house. Han Sen wanted to escape her eyes, but it appeared as if doing so would be impossible.\n\n“I don’t know what this woman is capable of. If her power is average, I can just wait until I’m sure that the demon spirit is gone. Then I can race out of her eyes to make an escape.” In preparation for that eventuality, Han Sen paid careful attention to the woman.\n\nThe woman was definitely strange. When she was done fiddling with the book, she went to sit at the window and peer outside. Han Sen realized that the clouds outside the island weren’t white anymore. They were light yellow like butter.\n\nHan Sen was happy. He brought out his Wanjie Rubix Cube and filmed what could be seen from the window. He then sent it to the Treasure Identifier Elder.\n\n“Didn’t you want to capture me and claim the bounty on my head? Come and try it,” Han Sen said to the Rubix cube after he made the film.\n\nAfter the Treasure Identifier Elder received the footage from Han Sen, he edited the clip and began streaming it.\n\nHan Sen didn’t know what effect this play might have, but for now, it was all he could do.\n\nThankfully, the wooden house didn’t have any mirrors or swords. Otherwise, if she looked into a mirror and noticed that her left eye was red, she’d realize there was a problem.\n\nThe woman sat in front of the window for a long time. Han Sen didn’t know what she was thinking about, and he was starting to believe that she’d never move again. But after a while, the woman finally moved.\n\nThe woman sighed deeply. She stood up and moved toward a desk.\n\nThe desk was laden with stacks of books and documents. There were no tools that required electricity, but perhaps that was due to the magnetic storms that plagued the Tianxia System. Electric instruments probably wouldn’t work here anyway.\n\nThe woman’s room was organized with the same fastidious attention to detail as the rest of the house. The items on the table were arranged tidily, and her books and notebooks were all lined up perfectly. All the pens were in the pen cup.\n\nThe woman had serious OCD issues. When she sat down in front of the desk, she picked up the top notebook. She opened the notebook and flipped to an empty page.\n\nAfter a moment of thought, the woman wrote something down on the empty book. She assembled words, numbers, and symbols into a variety of formulas that Han Sen was unable to comprehend.\n\nHan Sen didn’t know what the woman was doing. The woman wrote with repeated breaks for thought. Before long, she picked up a book from the bookshelf. She flipped through it quickly, apparently trying to find something specific.\n\n“Phenomenon? Isn’t that the geno art that is similar to Sky Palace’s Textless Book?” Han Sen thought in surprise. Phenomenon was a secret skill of Sky Palace, as well.\n\nWhat happened next surprised Han Sen even more. The woman kept pulling down and perusing different books, and those books were of the top geno arts exclusive to a variety of different races. Many of them were guarded with the utmost secrecy.\n\nHan Sen saw the Destroyed’s geno art Three-Bodies-in-One Destroyed Chaos Godlight and the Dragon’s Evilbreaker Dragon Presence. Many other famous geno arts that were known across the geno universe were there, as well. There were also many names that Han Sen had never even heard before.\n\n“Who is this woman? And why does she have so many secret geno arts here? Surely the spirit demon didn’t steal them all just for her, right? That should be impossible! Those races wouldn’t hand out their secrets for free. How many elites would really bring their secret geno arts to Tianxia System just to get mugged?” Han Sen couldn’t make sense of the situation.\n\nBut as he watched, Han Sen soon realized what she was doing. She was obviously researching the geno arts. Because he didn’t know what she was writing, though, he couldn’t understand the research she was doing.\n\nIt was like when normal people made use of computer software. Although people might use a program every single day, if they saw a coder working on that same program, they wouldn’t have a clue what they were seeing.\n\nUnless Han Sen could see the geno arts she was researching, he wouldn’t have a single clue to figure out what he was seeing. The symbols and formulas weren’t enough for him to tell what she was working on.\n\n“No, this won’t work… If I keep it complete, no creature will be able to reach the required fitness level. Lowering the fitness requirements will dismantle the skill, so that would be useless… How do I keep it complete and also lower the fitness requirements for practice?” The woman mumbled to herself. She was putting an almost painful level of focus into the problem, but she couldn’t seem to come up with any solutions.\n\nShe grappled with the problem for a while longer, but she still couldn’t figure it out. She walked over to the bookshelf, pulled down the Shocking World Record, and began reading through it."
}