{
    "chapter": 1014,
    "title": "Liu Yuxuan’s Scheme",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1014",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Uncle San and Weiwei, follow me to the shelter,” Liu Yuxuan said, with surprising passion.\n\nHe had not lied when he told them he was quite an important figure in the king spirit shelter. But he had opened eight gene locks, not because he was strong, but rather because the king spirit liked him and helped him a great deal. Over the course of a few years, he had been given over eight hundred spirit genes. It was that generosity that allowed him to open the gene locks. He wasn’t a genius.\n\nOf course, he had not received any king spirit geno points. And that was because he hadn’t signed a contract with the king spirit. He had signed his contract with a subordinate of the king spirit, one that had also opened eight gene locks. But with the spirit itself having only opened eight gene locks, that meant it was the highest Liu Yuxuan could open, as well.\n\nThe king spirit wasn’t very keen on signing contracts with any random human. This king spirit would get their subordinates to do it, and that was what had occurred for Liu Yuxuan.\n\n“Brother Liu, are you certain there is no safe passage for us to leave the mountain?” Lin He asked.\n\nLin He wasn’t willing to violate his own principles by submitting to Liu Yuxuan’s offer, but he felt them waver. When he heard Han Sen speak up for not becoming the slave of a spirit, though, he was firm in his resolve not to go to the king shelter.\n\n“There is no safe route, so don’t throw your life away. Especially on this man’s accord; this guy doesn’t know anything. He’s barely out of his Third God’s Sanctuary nappies!” Liu Yuxuan was staring at Han Sen as he spoke.\n\nIt was obvious to Lin Weiwei that he was indeed an influential figure in the shelter, but he just wanted to flex his importance to impress and seduce her.\n\nIn his shelter, it was unlikely they’d be able to return to the Alliance, as well.\n\nIn the Alliance, he was nothing in the eyes of the Lin family. Here, things were different, and he had a much better chance of wooing her.\n\nHe didn’t care for the wellbeing of the others. More than anything, he just wanted to bring her back to the shelter so he could have her sign a contract with the spirit he knew. Then, no matter what, she’d be unable to escape him.\n\nAnd if he played his cards right, fun with Lin Weiwei wouldn’t be the only thing he could have. He could end up having some of the other humans as subordinates for himself. If they didn’t behave, they’d be killed. Their lives in the Alliance would have already been forfeited, anyway.\n\n“Are you positive there aren’t any safe routes?” Lin Weiwei asked.\n\n“Yes. So, please, don’t do this.” Liu Yuxuan started to act all upset, and went on to say, “The mountain is too dangerous. If you insist on trying to cross its perilous terrain, you really will lose your life. A grizzly death is all that will await you. If you come with me, I can make it so you can get to the Alliance whenever you wish. And if you don’t like the shelter, once you’re in the Alliance, just don’t return.”\n\nLiu Yuxuan was not dumb, and he wouldn’t start an argument with them.\n\nBut in his heart, he thought, “Mwahaha! Once you’re in the shelter with me, you’ll never visit the Alliance again!”\n\nLiu Yuxuan did not start a fight because the eight gene locks he had opened were solely from the spirit genes, and as such, he’d most likely be weaker than some of his opponents when it came to actual battle.\n\nLin He had opened seven gene locks, but they were earned the old-fashioned way. As such, he’d likely wreck the conniving wretch.\n\nThat’s why he was trying to trick them into coming to the shelter. Once they were there, he could do whatever he wished to them.\n\nHearing what Liu Yuxuan had told them, Chen Hu was tempted to go with the man. After all, he was told he could visit the Alliance whenever he wished.\n\nGhost Mountain was a wicked place, and going back to the Alliance with your life was a fair option. And once in the Alliance, the leash of the contract was ineffective. They could just forfeit their lives in the Sanctuary, and live in the Alliance forever.\n\nNot being able to grow stronger was a better choice than being killed.\n\nChen Hu and a few others showed great interest in going, so they asked Liu Yuxuan for many details.\n\n“You see this sacred-blood turtle? The king spirit gave it to me as a gift. He’s a stellar bloke. If he treated humans like thralls, would he have given this to me?” Liu Yuxuan’s words were creamy, and his ploy was more than convincing.\n\nChen Hu then turned to Han Sen and said, “Come on, Brother Han. We should go there together!”\n\nAgain, Han Sen reaffirmed his goal with a shake of his head. “I am leaving this place,” he said.\n\n“Me, too. I’ve come too far to turn back now,” Lin Weiwei said.\n\nChen Hu gritted his teeth and said, “Well, if you guys are going, it’d be unkind of me to remain. We’ve been through a lot together, and on this road, there’ll undoubtedly be more hell to endure. And if that’s the case, I’m going to be right by your side and not miss a second of it.”\n\nThe offer had been very tempting, but when the time to make a decision came, everyone still decided to remain with Han Sen.\n\nLin He said, “Brother Liu, I thank you for the offer, but we decline. The kindness you wish to show us is a testament to your good heart. And if your heart is as good as I have been led to believe, then you will point us to the path of least resistance. Tell us which way will let us leave this mountain the easiest, and we’ll owe you—big time.”\n\nLiu Yuxuan did not expect everyone to end up following Han Sen. He had clearly underestimated his influence.\n\nLiu Yuxuan was fuming on the inside, but he still feigned a weak smile, as if his ulterior motive had not just been foiled. He told them, “I truly admire your courage. Unfortunately, I cannot guide you away from this place entirely. But, I can lead you for three hundred miles, and make sure no harm falls upon you. I will guarantee your safety.”"
}