{
    "chapter": 1111,
    "title": "Squeezing Beast Souls",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1111",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen the super-class mantis fell, all the other mantises that were left on the field scrambled and scurried away. Uncaring for the stragglers, Han Sen returned to the courtyard to examine the blood-egg tree.\n\nHan Sen was not sure if the fruits it bore had matured yet, but he knew whatever he could harvest was different then what he’d usually get. He believed the fist-sized fruit would produce creatures, and weren’t for proper eating.\n\nHan Sen picked one off a branch and crushed it.\n\nThis was what he had done to the Dragon-Blood Fruit, and that was how he received the Dragon-Blood Snakes. The same protocol most likely applied, though he wasn’t sure what manner of beast souls he might get off this tree.\n\nThe blood-eggs looked like real eggs, and when he crushed the shell, a red light shone.\n\nThe red light formed the image of a monkey with wings, and after the brief apparition, disappeared.\n\n“Blood-Demon Fruit has not yet matured; beast soul creation cannot be completed.”\n\nHan Sen heard the announcement and thought to himself, “It’s a beast soul geno tree. I wonder when it’ll finish maturing?”\n\nUnlike the mantises, he wouldn’t have to remain there and wait for it to finish maturing. All he would have to do was fertilize it with his waterdrops.\n\nUnfortunately, he had given most of his waterdrops to Zero, so she could continue growing the Flying Mushroom. He had been in the Third God’s Sanctuary for three years, and in that time, the waterdrops would have most likely been used. Therefore, he thought he’d have to collect more sooner-or-later.\n\nHan Sen then gave up his plans to abandon the barrens and decided to take up residence in the shelter, so he could feed the tree with waterdrops every day.\n\nAfter eight days, the tree fully matured. And when it had, all the egg-fruit fell from their harboring branches.\n\nFollowing that, the tree hastily withered into a dry, sordid husk of what it once was. Over the course of a single day, it became a rotten thing that was barely fit to be used as firewood.\n\nHan Sen counted the Blood-Demon Fruit and came to a tally of seventy-one.\n\nHe gathered them all up in a mound on the floor. He, Queen, and Bao’er all sat next to it.\n\n“Let’s start crushing them. These are yours, these are mine, and these are Bao’er’s.” Han Sen, after proceeding to split the pile of eggs up, quickly got to crushing them.\n\nAfter crushing an egg, the image of a firefly formed inside the red light. It went straight into his Sea of Soul.\n\n“Ordinary-class Blood Firefly beast soul gained.”\n\nHan Sen was surprised, and he gasped to himself, “What is this? I thought it was a monkey with wings. And why is it only ordinary class? Is that what the super creature wanted so much?”\n\nWith a closer examination of the beast soul’s attributes, Han Sen discovered it was a pet-type beast soul with only one gene lock open. It was useless.\n\nBao’er picked up a fruit and crushed it. For her, the image of a red unicorn formed, which disappeared after drifting towards her forehead.\n\nHan Sen was shocked. He only gave a pile to Bao’er for fun, believing he’d still receive whatever she crushed. Aside from humans, only spirits that were owned by humans could own and make use of beast souls. Although rare, he had heard tales of a few creatures possessing the ability, but that was beside the point.\n\nIf Bao’er could accept a beast soul, though, did that mean she was human?\n\nQueen looked at Bao’er strangely after witnessing this, too, but she didn’t say anything.\n\nQueen picked up a Blood-Demon Fruit and crushed it. She was given a four-winged tiger.\n\n“So, what did you guys get?” Han Sen asked.\n\nBao’er did not respond, but Queen told Han Sen, “I received a sacred-blood flying beast soul.”\n\nQueen then summoned the red wings—they looked beautiful on her.\n\nHan Sen did not tell her what he received and just tried to hide his jealousy. Immediately, he proceeded to break another egg.\n\nHe knew it was little more than a lootbox, in which whatever he received was random and purely down to luck.\n\nHe wondered if there was a super beast soul amongst the eggs, but still couldn’t fathom why the mantises wanted the tree and its fruit so much.\n\nWhen the shell shattered in the palm of his hands, the red light took the form of an ant. Then, it entered his Sea of Soul.\n\nHan Sen thought to himself, “Ant beast souls aren’t the worst. If it was an ant-based super armor, that’d be spectacular.”\n\n“Primitive-class Blood-Ant beast soul gained.”\n\nHan Sen didn’t even bother looking at its further statistics, so he just picked up another egg and broke it.\n\n“Ordinary-class Blood-Spider beast soul gained.”\n\nHan Sen crushed another eight, and all he received were either ordinary or primitive beast souls.\n\n“What the f*ck is this? Why am I so unlucky with my drops?” Han Sen fell into a depression.\n\nBao’er crushed her second fruit, and Han Sen watched in awe as a blood-colored dragon twirled in the air. It roared and flew into her forehead.\n\nHan Sen knew that couldn’t have been an ordinary or primitive beast soul, and it was clearly better than anything he was receiving.\n\n“Bao’er, what did you get?” Han Sen asked, looking at Bao’er.\n\nBao’er looked at Han Sen as if she had no clue what he was saying.\n\nQueen crushed three fruit, one-by-one, after each other. Then, she told Han Sen what she had received.\n\n“I got a mutant Blood Wolf, a sacred-blood Three-Eyed Snake, and a mutant Firebird.”\n\n“I don’t believe it.” Han Sen crushed another egg.\n\n“Ordinary-class Blood Turtle beast soul obtained.”\n\nHan Sen’s demeanor was a mixture of depression and anger. Queen was aware of what was going on, and she struggled to hold her laughter. Bao’er broke another fruit, and a grand grizzly bear roared and charged into her forehead.\n\n“Good Bao’er; very good. Hey, how about we swap?” Han Sen then traded some of his fruit with the ones in Bao’er’s pile."
}