{
    "chapter": 982,
    "title": "Tutor Han on Stage",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_982",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHaving dinner with Ji Yanran, Han Sen informed her that he would be teaching students in archery.\n\nAt this, she frowned and said, “If you’re going, that might be a problem.”\n\n“What problem?” Han Sen asked, not understanding how there could be a problem with Qin Xuan’s simple proposition.\n\nJi Yanran smiled and answered, “Being a teacher will aid your reputation in the Special Security Team. And with this title, you can be a deeply respected member. But teachers usually hail from the Martial Hall, and you don’t really fit in with that crowd.”\n\nHan Sen understood what she was implying. It wouldn’t only be that he’d not fit in, he’d most likely be isolated.\n\nStill, he had already thought of this and he was still adamant about tutoring. It was an exciting prospect he was keen to try. He was only a squad leader, so it would be good to achieve a higher rank in the team at large. It couldn’t do any harm.\n\nBesides, Qin Xuan most likely wanted him to gain a higher level in the team. And her plight was not something he could reject.\n\nHan Sen spent most of his days practicing the Dongxuan Sutra and taking care of Bao’er and Zero. Such peaceful periods were a rare occurrence for him.\n\n“Daddy, I want milk,” Bao’er said, as she held the rabbit king in one arm, bottle in the other.\n\nThe rabbit king had tried to resist her hugs before, but Bao’er managed to make quick work of its shield and destroyed it in the blink of an eye.\n\nTo Bao’er, a seven-tier gene lock shield was as stalwart as a flimsy piece of paper.\n\nBut the rabbit king was very tame and it didn’t feel the need to resist her. Unlike her actions with the bear, Bao’er didn’t feel the need to torture the rabbit, either.\n\nAnd speaking of the bear, it was extremely jealous of how the rabbit was treated. It kept wanting Bao’er to pay more loving attention to it, but a session or two of bullying was all it would get.\n\nOnce, when nobody was around, the bear attempted to kill the rabbit king. The rabbit was asleep at the time, but the shield was up, and when the bear attacked, it was unable to break it. It drove the bear insane.\n\nHan Sen, at her request, provided her milk and prepared some food for the pets. Then he went to tend to his garden.\n\nAside from the dead orchid, everything else was growing very well.\n\n“I wonder if that king tree will be able to grow again? I should return there sometime, dig it up and bring it back here. If the waterdrops prove successful in restoring it, I might be able to gain self geno points very quickly.” Han Sen was getting giddy just thinking about it.\n\nHe knew high-tier plants would generally produce fruit only once, but it was worth a shot. And there was, of course, the prospect of it taking a very long time to grow, even if it could grow fruit again.\n\nThose hurdles aside, the king tree occupied Han Sen’s mind a lot. He wanted it badly.\n\nBut first, Han Sen knew he’d have to become stronger before he attempted a retrieval of the tree. Heaven knew what might transpire, if Yaksha still lived there.\n\nWhen he was done in his garden, Han Sen went to check on the people in the eastern side of the shelter. They were doing well for themselves, spending their days hunting creatures and having a merry old time within the safety of the underground shelter.\n\nAfter spending most of the day there, Han Sen decided to return to his home in the Alliance. He went on Skynet and visited a community that was exclusive to members of the Special Security Team.\n\nThere were many students there, all together in one area. When Han Sen entered, there was a teacher performing a lecture on stage. The students were all watching him.\n\nChoosing to listen-in, Han Sen found himself a seat. He was good at fighting, but he wasn’t a master of every combat profession. He understood how valuable it could be to learn and accept wisdom offered by others.\n\nThis teacher was discussing fist skills. The talk provided Han Sen many new ideas to try in the future. He learnt a lot.\n\nThe name of this teacher was Nangong Han, and he was an aged surpasser. He had unlocked four of his gene locks, which was rather high. Few people ever reached the number eight.\n\nHe was an old member of the team, and an accomplished teacher from the Martial Hall.\n\nAnd that was where most teachers came from: the Martial Hall. Many of them were very elderly, and they had quite the reputation.\n\nBut this year, Han Sen would be a teacher. This made the others feel a little uncomfortable.\n\nHe was so young, and he was only a squad leader. He did not come from the Martial Hall, and he did not even have a formal title. They thought the Qin family was trying to weaken the integrity of the Martial Hall.\n\nThis was how Nangong Han viewed matters, as well. And when his eyes fell on Han Sen, he pulled them away quickly to pretend he had not noticed him.\n\n“Fist skills are ripe with possibilities, but its general focuses are on speed, power, and dexterity. You have to be both faster and stronger than your opponent, if you seek victory. All this is not derived from pure muscle strength, however. There are many ways to hone your talents with the fist, but there are skills to make use of, also. A great focus is on reaction speeds, and without great reaction times, any skill you use is useless. Timing is of paramount importance.”\n\nNangong Han then looked at Han Sen and said, “I am going to show you a few moves, driven by fist-geared skills. Perhaps Tutor Han can aid me in my demonstration?”\n\nHan Sen froze, as suddenly, all the students turned to look at him. And then, many clapped."
}