{
    "chapter": 1951,
    "title": "Can You Not Treat Me Like a Monster?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1951",
    "text": "Planet Eclipse.\n\nWang Yuhang was riding his bike across the mountains. He was wearing a pair of eye-catching sunglasses.\n\nLittle Angel and the others were ready to level up, but they had to prepare before becoming Viscounts. So they hadn’t come hunting with him.\n\nWang Yuhang had also eaten enough xenogeneic genes to become a Viscount, but he lacked proper fighting experience, so it would be difficult. He didn’t like sitting around, either, so he had gone out hunting.\n\nNot long after, Wang Yuhang saw a young Kate girl on the trail. She was walking towards the mountains.\n\nWang Yuhang frowned. The little girl had a tiger-pattern of stripes, cat ears, and a cat tail. She was rather cute, but she looked like she was only ten or so. She shouldn’t have been able to fight, so it was strange to see her out there all alone. Wang Yuhang turned toward her.\n\n“What are you doing out here?” he asked the little girl.\n\nThe little girl, seeing him, looked at him queerly. She answered, “I am looking for my mother.”\n\n“Looking for her?” Wang Yuhang was shocked.\n\nThe little girl explained, “My Mom has been out hunting for the past two days, and she has yet to return. So, I am out here looking for her.”\n\n“It has only been two days. She’ll be fine.” Wang Yuhang offered her some comfort.\n\nMany of the mothers in the base had become Barons. They wanted better lives for their children, and so they hunted to supply them with easy points.\n\nThe little girl looked worried, and she shook her head. “Mom said she would return each and every day to check-in. She has always come back on time, except for this time when she hasn’t. She must have stumbled into some sort of danger, and so that is why I have come out here to save her.”\n\n“You’re just a kid, though. What can you do? You should let the good folks at the base help you,” Wang Yuhang said.\n\n“I did tell them, but no one believed me. They told me to wait a few more days. I’m sorry, I have to keep going.” The little girl started walking again, headed deeper into the mountains.\n\nWang Yuhang rode the bike up next to her, smiled, and said, “Are you willing to take a risky ride with me? I can take you on this, if that’s okay with you.”\n\n“Really?” The little girl’s eyes shone brightly.\n\n“Yes; but it depends on whether that’s what you want.” Wang Yuhang smiled.\n\nBefore Wang Yuhang finished talking, the girl had already jumped onto the back of his bike. She held onto Wang Yuhang’s back and said, “Please find my mother! I have no father, so I cannot lose my Mom.”\n\nWang Yuhang smiled and rose into the mountains. He asked, “Do you know where your Mom usually hunts?”\n\n“My mother never hunts too far from home. She stays in the region so she doesn’t have to spend too much time traveling each night,” the little girl quickly said.\n\n“It shouldn’t be hard to find her, then.” Wang Yuhang accelerated along the trail.\n\nAs soon as Wang Yuhang entered the mountains, a xenogeneic began running behind him, digging into the ground with its claws. It chased his bike like a hungry wolf. More and more soon gathered up, until there was a whole group of xenogeneics trailing them. They were all Barons, too.\n\nThe little girl looked frightened, and so she held onto Wang Yuhang. She shivered in fear, and she couldn’t bring herself to look back.\n\n“If you are afraid, I can take you back now,” Wang Yuhang said as he rode.\n\n“No, please take me to my mother. She is in danger. Please!” The little girl was trembling, but she never stopped begging Wang Yuhang to find her mother.\n\n“Okay, then.” Wang Yuhang began working methodically to scour the mountainsides. There were many xenogeneics coming after him, but they were all slower than his bike. They couldn’t hurt him or the little girl.\n\nSometimes, xenogeneics appeared in front of them. But in such instances, Wang Yuhang was able to evade them. The little girl would hold his waist tightly when this occurred, and she almost fell off multiple times. Still, she asked him to keep going in search of her mother.\n\nA few hours later, Wang Yuhang heard the cry of another xenogeneic. He frowned and decided to take a look. He found a group of xenogeneics surrounding a Kate woman. She was fighting one of them.\n\nIt looked like the group was just crowding around her to taunt her. The xenogeneics were enjoying it like some sort of sporting event. Many of them were Viscount class, too, and so they were much stronger than the Kate woman.\n\nIf they wanted the Kate woman dead, she’d have been a pile of bones by now. The woman, instead, was still engaged in battle. She was bleeding a lot, but she wasn’t ready to give up the ghost.\n\nAs Wang Yuhang rode toward her, he could see the will and drive it must have taken for her to keep going. Some of the wounds she had incurred were deep enough to reveal her bones. She should have passed out by now, considering the amount of blood she must have lost.\n\n“Mom!” The little girl squealed, trying to jump off the bike. But Wang Yuhang caught her and pulled her back on. There were many Viscount xenogeneics there. He didn’t have the Marquise armor, so he couldn’t move too rashly.\n\n“We need backup, but it appears to be too late for us to call on others.” Wang Yuhang stroked the little beard on his chin as he thought.\n\nThe woman, seeing the little girl, looked towards them. Her face paled and she screamed, “Run, little Rain! Get out of here!”\n\nThe xenogeneics then noticed Wang Yuhang. They became extremely alert, and their interest in playing with the woman seemed to vanish. One of the xenogeneics moved over to cut the woman’s neck and be done with it.\n\n“No!” The little girl’s eyes opened wide as she screamed.\n\nWang Yuhang’s expression looked strange, but he accelerated towards the woman, swinging his sword as he went. Just as the creature swung its claws toward the woman’s neck, the sword slashed the xenogeneic’s back and made it squeal.\n\nWang Yuhang used the time he had bought to swoop into the crowd. He picked up the woman in one motion as he passed by.\n\nWang Yuhang turned the bike to leave the mountain, but the xenogeneics had already reacted, running towards Wang Yuhang. The Viscount xenogeneics started to glow as they surged forward.\n\nWang Yuhang, still riding the bike, evaded them. The mother and daughter held onto him tightly, but they looked like they were losing hope.\n\nThe crowd behind was approaching fast, and the gang that had chased Wang Yuhang earlier was still waiting just outside the valley. They were like hungry wolves, adamantly blocking his attempt to depart.\n\n“This is why I hate women and kids.” Wang Yuhang sighed. He spun his bike and stopped. The scary xenogeneics from both sides were coming quickly. The mother and daughter held each other, sitting on the bike. They shivered in each other’s arms, with their eyes closed.\n\n“If you can, could you please not treat me like a monster?” Wang Yuhang ignored the xenogeneics. He spoke to the mother and daughter, but his voice was so quiet, they could barely hear him.\n\nBoom!\n\nA noise like a generator sounded. Wang Yuhang’s body brimmed with an unspeakable power. The noise came from his body, but there was no light, smoke, or shadow to see.\n\nBut the power inside him exploded like a volcano. Even his bike seemed to react, releasing clouds of smoke out of the exhaust.\n\nSuddenly, the world quietened down. The xenogeneics that wished to attack Wang Yuhang stopped. They all froze and looked at him strangely.\n\nThe next second, they ran at Wang Yuhang again. But just before they touched him, the two groups collided to kill each other.\n\nBlood and limbs were strewn about everywhere, all across that trail. As the generator noise ran, the two groups fought each other until they all died. Some of them lost their arms, but still they fought on.\n\nThe way they looked at Wang Yuhang was strange. It was like he was the most precious person in the world. Some looked at him like a treasured lover, for whom they would do anything.\n\nMore likely, Wang Yuhang had become their queen. They had to kill their opponents to make themselves the strongest; all so they could make with the queen.\n\nBlood. Blood was everywhere.\n\nA few hundred xenogeneics were forced to kill each other. They did, and they all died. The sole survivor was a Viscount. It was extremely injured, and it ended up crawling towards Wang Yuhang.\n\nCha!\n\nWang Yuhang thrust his hand into its wound and tore out its heart. It was dying, but the look it gave Wang Yuhang was not a look of hate. It was one of pleasure.\n\nThe Kate family held each other. They looked at Wang Yuhang with shock; they had been chilled to the bone. At that moment, he was scarier than the xenogeneics.\n\n“That’s why I like sticking with Han Sen. It is because those monsters make me look like a person. If no one is afraid of me, I feel like a person.” Wang Yuhang spoke quietly to himself, and he looked rather sad."
}