{
    "chapter": 2779,
    "title": "Buried",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2779",
    "text": "Han Sen had noticed the same thing. Violet was the only Flower God they had seen this entire time. The only other people around them were members of other races. Since being in the Space Garden, they had yet to see a single other Flower God.\n\nThis was the home of the Flower Gods. Even if something had happened, they still should have been encountering other members of Violet’s race.\n\nEveryone had warning sirens blaring in their heads. They followed Violet carefully as they flew through the Space Garden, but they didn’t see anything dangerous around.\n\nAnd there was no sign of a battle, either. It looked as if nothing concerning had actually happened.\n\nBut when they reached the highest flower field, what they saw froze them in place.\n\nThey saw many men and women with their bodies buried in the field. Only half their heads were sticking up above the soil. Each of them had a flower on their heads. Some of them were peonies, and some looked like chrysanthemums. Each flower was unique, and they all looked like they were opening in bloom.\n\nClearly, the people who looked like carrots in the flower fields were the missing Flower Gods.\n\n“Violet, what is this?” Bai Wanjie asked Violet.\n\nThe Flower Gods buried in the ground were still alive, but they were as still as half-buried vegetables.\n\nEver so slowly, their lifeforces seemed to be waning.\n\n“I’m not going to lie to you, Mr. Crown Prince. The whole of the Flower Gods, myself excluded, are here,” Violet said as he pointed at the half-buried heads in the field.\n\nBai Wanjie didn’t ask how the Flower Gods had ended up in such a strange situation. Instead, he asked Violet, “Before you left the Space Garden, were they already buried this way?”\n\n“You are very smart, Mr. Crown Prince.” Violet nodded and admitted this to be the case.\n\n“So, when you said that the Flower Gods wanted to become a higher place, it was all a lie? A trick that you used to lure us here?” Bai Wanjie asked, staring at Violet.\n\n“Yes.” Violet nodded again. He clearly didn’t intend to hide anything.\n\nViolet and Bai Wanjie just stared at each other. They didn’t look away. Violet went on to say, “Although I lied about the cause, I truly intend to offer you the prize that I promised. If any of you can save my people, we are willing to sign a contract that will offer up half of the Space Garden.”\n\n“Is that true?” Everyone’s eyes brightened.\n\n“You guys have seen what has happened to the Flower Gods. Do you think we have the gall, let alone the power, to break our promise?” Violet drawled. He wasn’t in a hurry.\n\n“What happened to your people? Can you explain it to us now?” Bai Wanjie looked at the heads protruding from the flower fields.\n\nThe fields were indescribable. Flower Gods were planted in the soil as far as the eye could see. There were millions of them. And with the small flowers rising from each head, they looked so pretty.\n\nIt didn’t matter how pretty they were, though. They were half-buried in the soil, which made the whole scene rather disturbing.\n\nViolet was no longer trying to withhold information. For the first time since they had met him, Violet explained what happened completely.\n\nThe Flower Gods were good at gardening, and they had discovered the Space Garden long ago. It was a suitable place for many xenogeneic plants to grow. They thought they had lucked out, but they soon found out that there was something wrong with the xenogeneic space.\n\nThe leader of the Flower Gods buried himself in the flower fields, just like Han Sen and the others were seeing now.\n\nThe Flower Gods didn’t know why their leader did that, but they eventually figured out what was going on. They needed to appease the garden itself. Every once in a while, they would bring sacrifices to the garden. That way, the garden would no longer mess with their minds. As long as they kept the garden satisfied, it wouldn’t force any of the Flower Gods to bury themselves.\n\nBut as time went by, the Space Garden seemed to become hungrier. It required more xenogeneics to support itself. Two months ago, the sacrifice that they buried in the flower fields was useless. The Flower God leader and many elites suddenly dug holes in the field and buried themselves there.\n\nAside from Violet, every Flower God was now buried there.\n\n“Why didn’t you guys bury yourselves as they did?” asked a small race deified as he looked on Violet with suspicion. Clearly, he didn’t believe the tale that Violet was spinning.\n\n“I don’t know. Only I was okay. I don’t feel any danger. And I don’t know why this happened. That is why I am begging you all to save my people. We will never turn back on our word,” Violet said with a look of seriousness.\n\n“Have you tried digging them out?” a King class elite asked.\n\nThat question was kind of pointless. The Flower Gods had been buried there for a while. Violet must have tried everything already. Violet would only have contacted outside deifieds if he had no other choice. He had exhausted all of his options.\n\n“I can’t dig them up. The soil might seem normal, but it is incredibly durable. You cannot dig through this land, and you might even hurt the people in the soil,” Violet answered.\n\nOne of the elites tried to grab a handful of the soil. The eyes of everyone watching widened. The Kings, and even the deifieds, couldn’t summon enough power to rip out a chunk of that turf.\n\n“What kind of soil is this? Why is it so resilient?” a King class elite asked in shock.\n\n“I don’t know. When they dug the holes to bury themselves, it didn’t seem that difficult. But when I tried digging them out, I couldn’t dislodge even a tiny piece of the ground…” Violet explained the situation to them once.\n\nThe elites tried many tests, but each attempt to crack this puzzle failed. They were unable to free the denizens of the flower fields.\n\nMany of the elites focused on the task with feverish intensity. They thought of all kinds of methods, trying to get the half-buried Flower Gods out. But their efforts accomplished nothing. All of their attempts were fruitless.\n\nOne deified elite even grabbed a Flower God by the head. The Flower God’s neck almost broke, and he still didn’t move an inch.\n\nThe elites were there to save people, not kill them. So, the deified elite stopped trying to yank the head out.\n\n“San Mu, what do you think is going on here?” Xie Qing King turned and asked Han Sen. He didn’t know what to make of the half-buried Flower Gods.\n\n“It’s a bit creepy, to say the least.” Han Sen squinted slightly as he spoke. He was checking out those half-buried Flower Gods, but he seemed to notice something.\n\n“Weird. It’s almost like the entire Space Garden is giving off a lifeforce… What if the Space Garden itself is a giant creature?” When Han Sen came up with an answer, it was something that not even he could believe."
}