{
    "chapter": 2216,
    "title": "Cleaning Job",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2216",
    "text": "Right after Han Sen’s team arrived with the Ice Blue Knights, they were given a priority task to exterminate the xenogeneics that could be found around the base.\n\nThe base had been established there for some time, but xenogeneics emerged constantly from the mountains. Those xenogeneic hordes frequently caused trouble for the base.\n\nHan Sen’s mission was to venture into those mountains and clear the creatures out. There were many bird xenogeneics there, and they bred quickly. Han Sen had to wipe out their homes and destroy whatever eggs he could find. If he didn’t, it’d only be a matter of time before they returned.\n\n…\n\nIn the midst of those mountains, Han Sen was shelling a few boiled bird eggs. He ate them and frowned.\n\nHis group had been in those mountains for half a month, and they killed birds and destroyed or ate bird eggs each and every day. In the beginning, they thought the eggs were delicious, but after half a month with the eggs as their only food, they were growing tired of the taste.\n\nThe Ice Blue Knights had already killed the most powerful xenogeneics, so there were no Kings around. There weren’t even any Dukes. They were mostly finding low-level xenogeneics whose only skill was reproducing quickly, so none of the kills helped Han Sen.\n\nBut the cleaning job did have some benefits. It would earn them points, and those points could be used to redeem items from the vendors in the base. There were geno arts and xenogeneic genes available for redemption.\n\nOf course, to Han Sen, the potential rewards weren’t worth the trouble. The things that he wanted would require a hefty load of points, and it would take a long time doing menial cleaning tasks to amass the necessary amount.\n\nStill, it wasn’t entirely pointless. There were many bird xenogeneics of a variety of different elements on that mountain, and that factoid gave Han Sen an idea.\n\nHan Sen couldn’t use his Sun Raven Gem beast soul, and he needed a fire element bird beast soul as a base. There were many birds there, so if he was able to find a high-class fire bird beast soul, he could combine it with the gold bird beast soul. That might allow him to earn a deified beast soul.\n\nKing class beast souls could survive the merging process with a high success rate, but it would be difficult for Han Sen to kill a King class xenogeneic at his current level of strength. And since it would be hard to find one, too, he’d settle for locating a Duke.\n\nAfter days of constant research, Han Sen found a fire bird xenogeneic that he deemed to be a suitable catch.\n\nThe Ice Blue Knights had a map that marked territories that were known to be particularly dangerous. Lava Valley was one of those locations.\n\nThe valley was one hundred thousand miles long. There was a lava river that flowed through its length, and the walls of the valley held many caves. Fire xenogeneics frequently inhabited such spots.\n\nThe most popular xenogeneics there were the Fire Crows. Fire Crows were pure fire element creatures. They could spit streams of fire at their enemies, and they dined on the fire bugs that lived within the lava river.\n\nThey were small, though. Their bodies were only the length of a man’s finger, and no bigger than a bee. But there were many of them; a small murder of Fire Crows could contain ten thousand of the fiends.\n\nMurders of Fire Crows like that were everywhere across the lava river. A large murder of Fire Crows could contain a whole million of them.\n\nNormal Fire Crows were Barons and Viscounts. They would rarely become Earls, but a few Fire Crow kings could even become Marquises.\n\nBecause there were so many of them, only the kings of large murders could become Dukes.\n\nThe stories said that when the Ice Blue Knights first came, they cleared a large Fire Crow murder that contained over one billion of the feathery creatures. The Fire Crow king of that murder was a genuine King class xenogeneic.\n\nHan Sen believed that combining a Fire Crow beast soul with his Sun Raven beast soul would be successful, but he had no idea what sort of beast soul a Fire Crow would generate.\n\nIt would be perfect if it was a weapon beast soul. He already had a half-deified Demon Bug Bai Sema and a King Galactic Lobster set of armor, so when it came to defense, he was well-equipped. What he needed now was an equal amount of destructive power, which would allow him to slay powerful xenogeneics easily.\n\nIf he had a deified beast soul weapon, that would be absolutely perfect.\n\nBut Lava Valley wasn’t a location that was designated for Han Sen to clear. He didn’t want to go to Lava Valley without clearance and risk crossing a line with the Ice Blue Knights. Disobeying orders and venturing into an area he wasn’t supposed to would be very bad.\n\n“How do I go to Lava Valley legitimately?” Han Sen wondered, annoyed by the wait.\n\nThe Shadow Queen Bee was drinking the yolk out of an egg. She had grown a lot thus far, and she was able to eat many xenogeneics. It wouldn’t take long for her to reach battle mode.\n\nBao’er patted Han Sen on the side and lifted a small device. “Dad, smile!”\n\nHan Sen assumed a victory pose. The device was used for recording. They were tasked with keeping records of every place they visited.\n\nThey also made sure to record the scene that showed them clearing out the xenogeneics. It was the proof they needed to submit to receive their reward points.\n\nEvery team had one member recording a video of their achievements. In Han Sen’s team, Bao’er had gotten the job. She often loved recording things, and she had a lot of fun doing it.\n\n“High class xenogeneics are too rare here. We need to find another location,” Huangfu Jing told Han Sen. She also wasn’t happy being cooped up, and she craved a good challenge.\n\n“I’m trying to think of a way,” Han Sen said, slumping his shoulders.\n\nHan Yan didn’t like it, either. She thought for a moment, then said, “There aren’t even Marquise xenogeneics here. Quite frankly, this is pointless.”\n\nHan Sen started to say something, but all of a sudden, he closed his mouth and looked down into the valley.\n\nThe deepest wall in the deepest recess of the valley was covered in a web of rugged cracks. A purple substance had begun leaking out of those crevices. There was only a small amount at first, but more and more of it seeped out as the seconds ticked by.\n\nWhen Han Sen’s group saw it, they knew immediately that it wasn’t spring water. When they looked closer, they saw that the purple liquid was actually streams of small purple bugs. They were each about the size of a fingernail, and they looked like sawyer beetles. They were purple, with purple horns and a purple antenna.\n\nSoon, the bugs were coming out like a stream of gushing water, and they were flooding into the valley.\n\nHan Sen used his Dongxuan Aura to scan them. He noticed that the bugs were not high level; judging from the life force they exuded, they were no greater than Barons. There was a multitude of them, but even so, they offered no genuine threat.\n\nHan Sen and the others quickly established a plan to clear them. While they were not high-level foes, destroying them would be a good way to earn more points. If they wanted to come crawling out in search of death, Han Sen wouldn’t go easy on them.\n\nBut instead of attacking Han Sen’s group, the bugs streamed around them and left the valley as quickly as possible. They showed no interest in attacking anyone.\n\nSeeing bugs behave like that, it was fair to assume they were running away from something."
}