{
    "chapter": 1880,
    "title": "The Only Way Ou",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1880",
    "text": "Spell’s body moved with the revolver’s recoil. She kept firing her gun without reprieve, as muzzle flashes ignited the end of the barrel with fire. It wasn’t long before all of the Purgatory Beasts before them had been killed.\n\nOthers were coming out of the darkness, headed right for them.\n\nHan Sen felt depressed, but Spell looked as if she was having genuine fun. Spell had infinite ammo, and it was all based on Han Sen’s power. Her shots cost him a lot of his energy. But being able to kill the Purgatory Beasts in exchange for some energy was a more than fair trade.\n\n“Let’s go! I hope Guna and the guys on the ship are okay.” Han Sun hurried Guya on.\n\nWhen Guya heard him calling, it was as if she had snapped out of a daze. She still looked to be in shock. She had never seen a geno armament like Spell before. She couldn’t believe a Baron geno armament had what it took to take down Purgatory Beasts with such ease.\n\nThere was no time for her to dwell on these matters right now, of course. So, she got moving. Wherever she went, the arms disappeared.\n\nSpell kept firing at the Purgatory Beasts that crawled out of the ground along their path. None of those creatures were able to get close.\n\nIcebird Duke looked conflicted with this, as well. This was her first time seeing Han Sen’s geno armament. She had heard Yisha say that his geno armament was something special, but this blew all her expectations out of the water. It was beyond. Spell looked like a living, sentient being. It wasn’t a mere armament.\n\nThe scariest thing about it all was that Icebird Duke’s own powers could not inflict damage on the beasts. But this armament could. That meant Spell’s power had to be something supremely special.\n\n“How many secrets does this guy have? It is no wonder that Queen accepted him as a student. I have clearly underestimated him, and her, too. I always wondered why she accepted someone who initially appeared so useless,” Icebird Duke thought to herself.\n\nThe three of them worked their way down to the south. Luckily, they didn’t have to go very far. And along the way, Spell diligently kept them protected. It wasn’t long before they found themselves standing at the awning of an aircraft.\n\n“Meng’er! Dragon Lady! Little Uncle! Are you guys still there?” Han Sen shouted up at the airship. The airship was coated entirely in darkness, though, and his voice could not carry through the obstructing black. He didn’t get a response.\n\n“It is useless to shout from here. Where’s Guna? I want to see her one last time,” Guya said, as they all boarded the ship.\n\nA while later, many more Purgatory Beasts began to spawn at once. Although Guna had the same powers as her sister, her blood would probably run dry before killing all of them in that wave.\n\nGuya did not have much hope for survival, even still. She expected the worst.\n\nHan Sen pointed in the direction she should go, and Guya took off running. There was not a single person in the airship they could see so far. The crew had probably been consumed by the darkness.\n\nHan Sen was nervous, and he was worried something bad might have happened to Meng’er. He hurried Guya to go faster through the ship.\n\nGuya was heavily injured, though, and she couldn’t go too quickly. She tried going as fast as she could, but eventually, her wounds cracked wider and started to bleed. She had lost a fair amount of blood just dealing with the Purgatory Beasts earlier, so her legs were quivering as she walked. She looked as if she was on the verge of falling over.\n\nThere were more and more Purgatory Beasts around. And while Spell would be able to kill them all, Han Sen found himself getting exhausted.\n\nFinally, Han Sen reached his room. The door was shut, so he felt pretty nervous.\n\nHe had asked the others to watch over Guna during his absence, and he didn’t know if they had done their part. If they were too far from Guna, they’d likely be dead.\n\nTaking a deep breath, Han Sen kicked the door open. Spell raised her guns and aimed into the room.\n\nInside the room, the black-haired lady had her bow drawn to the door.\n\n“Father!” Han Meng’er saw Han Sen, but she did not lower her bow. She fired it.\n\nWhoosh!\n\nThe black arrow brushed right past Han Sen’s face and perforated a Purgatory Beast that had snuck up behind him. Pang! Pang! Pang!\n\nSpell fired her guns at the beasts that were showing up across the room.\n\n“Are you okay?” Han Sen was delighted to see them all safe and sound. He brought Guya into the room.\n\n“Why would you expect us to have any trouble? With Meng’er here, she keeps shooting each and every dog that shows up. She’s having a lot of fun, I think.” Wang Yuhang smiled.\n\n“Guna! Sister!” Guya and Guna embraced each other with a hug.\n\nWhen they came together, the radiance of their glow increased. It prevented the arms from spawning across half of the room.\n\nThe darkness still had Purgatory Beasts prowling within it, though. Guna and Guya’s Gana blood wasn’t as useful as it had been earlier.\n\n“We can save the chit-chat for later. Do you have a way for us to escape Planet Crooked Rock? We’re all in the same airship here; can you tell us how to leave?” Han Sen asked Guya and Guna. Han Sen and Wang Yuhang could easily nip back to the sanctuary, but Dragon Lady and Meng’er had geno armaments. They’d be prohibited from returning by the sanctuary.\n\n“It is impossible! We are not the masters of Purgatory Heaven. We can activate it, maybe, but we cannot control it. It might stop once the entire planet has been consumed,” Guya said.\n\nGuna gritted her teeth. “I might have one way of getting out of this, but I am not sure if it’ll work.”\n\n“Have you noticed that things are going rather badly here? Tell us, already! Even if it doesn’t seem likely that it’ll work, we have to try whatever we can,” Wang Yuhang said.\n\nGuna looked at Guya and said, “Sister? Did you use a spell to activate Purgatory Heaven?”\n\nGuya nodded. She did not know what Guya was going to suggest, either.\n\nAfter that, Guna said, “If you activated the spell, that means we really do have Gana Goddess’ genes. We are of her bloodline.”\n\n“Um, you guys are Gana, so of course you two have the goddess’ blood,” Wang Yuhang said.\n\nGuya shook her head. “Not really. We are an old race. When the Gana lit our lantern in the geno hall, ten thousand of the other lamps had not been ignited yet. There was no need to fight for a position at that point. We had no deified elites at the time. We didn’t get one until later on, and that person came to be known as Gana Goddess. Not all the Gana have the goddess’ blood.”\n\nGuya looked at Guna and said, “It’s useless even if we have the Goddess’ blood, though. It’s so weak, and we are just Viscounts. There is no way we can control Purgatory Heaven.”"
}