{
    "chapter": 3009,
    "title": "Ancient God King Blood",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3009",
    "text": "“Don’t be so worried,” Ancient Origin God coldly said. “I just wanted a drop of his blood. It is not like I was going to put him inside the baby god wok to cook. Why are you being so nervous?”\n\nHan Sen and Dragon Lady felt relieved, but Han Sen was still curious. He looked at Ancient Origin God and asked, “Why do you my blood?”\n\n“If you take the ancient spirit seed, we will require a replacement,” Ancient Origin God said. “Your blood can be that replacement.”\n\nHan Sen frowned and did not say anything in response. The entire universe knew Human King had poured blue blood all over him. The blood in his body was blue. Now, Ancient Origin God wanted a drop of his blood. He did not think it was as simple as Ancient Origin God was making it out to be.\n\nOne drop of blood was not a major loss for Han Sen either. To be able to get the ancient spirit seed in return for a drop of blood was an acceptable exchange.\n\n“OK, I will make the trade,” Han Sen said as he looked at Ancient Origin God. “But there is something I would like you to help me with.”\n\n“I know what you are going to ask about,” Ancient Origin God said. “Give the ancient spirit seed to Dragon Lady, then you may follow me.” After speaking, he walked out of the garden.\n\nHan Sen gave the ancient spirit seed to Dragon Lady and said, “Wait here.”\n\n“I am coming with you,” Dragon Lady said with a frown.\n\n“Do not worry,” Han Sen said with a laugh. “Moment God was unable to do anything to me, so he cannot do anything.”\n\nDragon Lady looked at Ancient Origin God as he departed and said to Han Sen, “He is the king of the Ancient Gods. He is not any weaker than Moment God, so do not be reckless.”\n\nHan Sen replied, “I understand. Just wait for me here.” He passed the ancient spirit seed into Dragon Lady’s arms. The ancient spirit seed was nice and grabbed Dragon Lady’s neck.\n\nAfter he left the underground garden, Han Sen saw Ancient Origin God ahead. He quickly caught up with him.\n\nAncient Origin God kept walking and said, “We Ancient Gods were once the leaders of this world. We ate the livers of dragons and dined on the guts of phoenixes. Everything was our food until Sacred Leader and Sacred appeared. Our people suppressed the sky. We were invincible.”\n\nHan Sen did not know why Ancient Origin God was suddenly talking about all of that. He had heard about it before since the Ancient Gods had a bright history. But that was a long ago and few recalled their past glories.\n\nIt was not just the Ancient God’s era either. Even the Sacred era was only remembered by a few old antiques. Most creatures of the universe did not even know the word “Sacred.” All they knew about were the Very High, Ancient Gods, and Extreme King.\n\nAncient Gods were not as famous as the Ancient Gods of yore, who were able to conquer the universe.\n\nver\n\nAncient Origin God went on to say, “But when Sacred appeared and the God Spirits descended to fight, the Ancient Gods fell. We were not the leaders of the universe anymore. Do you know why the Ancient Gods were made like so?”\n\nHan Sen was quiet a moment before saying, “Ancient Gods breed by the generations. If the Ancient God Origin is not destroyed, the Ancient Gods can carry on. Their powers are not damaged. According to the theory, you guys can be the best. I also think it is weird how Ancient Gods ended up like so.”\n\nAncient Origin God said, “Yes. From back then until now, 3,000 Ancient Gods, not one more and not one less. Even if an Ancient God’s Ancient God Origin was destroyed, they can be reborn as a new Ancient God in God Land. In theory, the Ancient Gods can be in the best condition.” He seemed pretty excited as he spoke. Even the rainbow lights on him looked weird.\n\nAncient Origin God went on to say, “But that is just a theory. In fact, after Sacred appeared, Ancient God’s Ancient Gods have been less.”\n\n“Are you saying Sacred killed Ancient Gods?” Han Sen asked with a frown. “That is not right. Even if they killed Ancient Gods and destroyed their Ancient God Origins, your God Land can create more Ancient Gods. They should not be reduced like that.”\n\nAncient Origin God coldly said, “That is why we feel so weird. Our Ancient Gods are missing. We cannot see them, and we cannot find their dead bodies. In God Land, no Ancient God can respawn. They just vanish from the universe. There were 3,000 Ancient Gods, but now there are only 300 Ancient Gods. Even our God King is gone. He disappeared after the Sacred era.”\n\n“Did that really happen?” Han Sen quietly asked. “If so, it leaves only one possibility. Someone imprisoned these Ancient Gods.”\n\n“That is what we thought too,” Ancient Origin God said with a sigh. “We have scoured the entire universe. No matter whether it was Sacred or Outer Sky, our people’s searches were in vain. We were never able to find anyone. Although we guessed Sacred did something, there has been no evidence to support it. Now, Sacred is destroyed, so it is so difficult to get to the truth.”\n\nHan Sen thought, “Something so evil… There is an 80% to 90% chance it was done by Qin Xiu. Aside from him, who else would have had the means to make the famous Ancient Gods be reduced to this?”\n\nHan Sen did not say that out. He looked at Ancient Origin God and asked, “So, are you not Old God King’s heir?”\n\nAncient Origin God nodded. “After our God King died, our people were forced to pick a new God King. That was my past life. I had no relation to Old God King.”\n\nHan Sen grabbed his jaw as he said to himself, “So, are you saying Dragon Lady…”. “Yes. In her body, there is an Old God King Origin Gene. It exists within her. For some reason, her body has mixed with the genes of another creature. It made her blood very impure.”\n\nAncient Origin God confirmed Han Sen’s guess and added, “Although things are like that, her God King Gene is still complete. It just needs to be activated. I am going to use the Ancient God special food recipe to make Dragon Lady eat many xenogeneic gene essences so she can activate her God King gene. She will then take the seat of the true God King.”\n\nHan Sen frowned after hearing that. The king of the Ancient Gods sounded powerful. Now that he thought about it, the world was in chaos. Demons were dancing everywhere. God Spirits were everywhere. Allowing Dragon Lady to assume responsibilities for an entire race was likely not a good thing. Han Sen stared at Ancient Origin God and asked, “Have you asked for Dragon Lady’s opinion about all this yet?” Ancient Origin God smiled. “Don’t worry, we Ancient Gods no longer have the ambition to rule the universe. We just want to survive. We just want to find out where the missing Ancient Gods went. If Dragon Lady does not want to become God King, we will not force her. If she can continue the God King blood, that would be enough. It does not matter if she becomes a God King or not. She just needs to continue on with our blood, and we need the geno holy fluid.”\n\nHan Sen stared at Ancient Origin God and suddenly asked, “Why do you need my blood?”\n\nAncient Origin God returned Han Sen’s gaze. He coldly said, “Because your blue blood belongs to Sacred Leader. That is the gene power of Sacred. The Ancient Gods used to rule the universe and eat every race. We absorbed the gene essence of every race to reinforce our bodies, but we never had the gene essence of Sacred. With Sacred Leader’s powerful genes, if Dragon Lady can get the help of that gene essence, she will improve even more.”"
}