{
    "chapter": 1030,
    "title": "Daddy Is Popular",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1030",
    "text": "Han Sen, browsing the aisles of the supermarket, held Bao’er in his arms. He had spent so much time in the sanctuary, returning to the conveniences of civilization made for a nice change of pace.\n\nBao’er and Han Sen each had an ice cream, and they were delicious.\n\n“Teacher Qu, Lanxi?” Han Sen caught sight of two people who were familiar to him.\n\nOne of them was a very elegant woman. Her full name was Qu Wange, and she was a lecturer at Saint Paul college. The other woman was Qu Lanxi, who Han Sen had met in the Third God’s Sanctuary.\n\n“Han Sen?” They were both quite surprised.\n\nHan Sen was also surprised, especially at seeing them both together. They seemed rather close with each other.\n\n“You two are good friends?” Han Sen guessed, unsure of the exact nature of their relationship.\n\n“Lanxi is my big sister; I didn’t realize that you knew her.” Qu Wange smiled.\n\n“When I first came to the Third God’s Sanctuary, Lanxi helped me out a lot. I just didn’t expect you both to be sisters.” Han Sen smiled.\n\nQu Lanxi blushed and said, “Are you sure it was I who helped you? It was thanks to you that Chu Ming and I were able to return here.”\n\nQu Wange chimed in to say, “Didn’t you tell me it was San Mu who helped you?”\n\n“I am San Mu.” Han Sen smiled.\n\n“Come to my home for dinner tonight, then. Our parents would really like to meet, greet, and thank the person who saved my sister,” Qu Wange said.\n\n“There is no need for that,” Han Sen said.\n\n“I have wanted to do this for a long time; so, if you really aren’t busy, I would much appreciate it if we could have a get-together,” Qu Lanxi pleaded.\n\n“All right, then.” They had endured many hardships together, so Han Sen wasn’t entirely against joining her for a night.\n\n“Is that your daughter, by the way? She’s cute,” Qu Wange asked.\n\n“Bao’er? No, she’s just a humanoid pet beast soul. I treat her as if she was my daughter, though.” Han Sen had started to use that as an explanation for what Bao’er was, masking her true, enigmatic identity.\n\nIf it became known that Bao’er was a creature of sorts, one that could actually come to the Alliance, people would undoubtedly freak out. A ruckus would ensue, all with Han Sen back in the limelight again.\n\nIf there were other creatures that could come to the Alliance, things would be far more dangerous for humans.\n\nAnd what’s more, he feared Bao’er might be taken away by the government if her nature was exposed. As such, he kept it a secret.\n\n“That must be quite rare.” They looked at Bao’er with much surprise.\n\nBao’er reached out and said, “Beautiful aunties… hug me.”\n\nImmediately, they were both smitten with Bao’er. They did not mind that it was a pet beast soul, as they had been told, and were keen to treat it like any ordinary baby.\n\nWhile Bao’er could be sweet and had the naivety of an actual child, after the time he had spent with her in the sanctuary, Han Sen had come to know that Bao’er had an evil streak within her. She wasn’t entirely innocent.\n\nBao’er could even command Moment Queen to do things for her.\n\nAfter Bao’er’s introduction to Qu Lanxi and Qu Wange, the baby was able to obtain many things Han Sen usually forbade. She had put on a front of being as adorable as possible, getting the two she referred to as aunties to buy her many things. Much of this stuff was just junk food.\n\nHan Sen thought it was a waste, buying her such food. He believed it would be useless for her development.\n\nFurthermore, Han Sen didn’t like spending too much, either. And with Bao’er’s belly being like a black hole, she could eat and eat and never be satisfied. He couldn’t risk spoiling her.\n\nBut on this day, those two girls greatly enjoyed feeding Bao’er whatever she requested.\n\n“Have you been abusing her? Why is she so hungry?” Qu Wange stared at Han Sen with trepidation.\n\nHan Sen shrugged and thought to himself, “It’s all fun, lollipops, and kisses for now. If only you had to take care of her for a few days, you’d understand how difficult she is to take care of.”\n\nAfter their time shopping was over, Qu Wange drove Han Sen and Bao’er to their house.\n\nTheir parents greeted Han Sen very passionately. They were so grateful Han Sen had been able to deliver Qu Lanxi back to the Alliance without harm, after her many-year absence.\n\nWhile Han Sen was in deep discussion with her parents, Qu Lanxi took Bao’er up to her room.\n\n“Bao’er, does this dress look good on me?” Qu Lanxi asked, after placing Bao’er on her bed.\n\n“No. You’re too old,” Bao’er said, with squinted eyes.\n\nQu Lanxi froze, utterly dazed from the response she had received from a baby. Her attitude was most certainly different than when she was around Han Sen. It was as if her cuteness had entirely evaporated.\n\n“You are so old. And to wear such old-fashioned clothes, it’s no wonder you haven’t married yet. You’ll never wed anyone if you carry on like this.” Bao’er spoke with a deep, serious, and rough tone, all while she sucked her dummy.\n\nQu Lanxi had not expected a pet baby to insult her this way.\n\nBao’er placed her little hands below her jaw and said, “Yeah, I don’t think you’ll ever get married. Of course, if you aren’t against the concept, I can get my daddy to be your husband for a temporary period of time. You’ll just have to buy me good stuff for the duration.”\n\nQu Lanxi was still frozen, with her wide eyes staring at Bao’er.\n\nBao’er seemed to be adding something up with her fingers, and eventually, she said, “Daddy is popular, so this is going to cost you at least two hundred ice creams.”\n\nWhen Han Sen was ready to leave, the sisters looked at him strangely. They avoided eye contact and didn’t even bid him goodbye.\n\nBut before they left, Qu Lanxi gave a lot of food to Bao’er.\n\n“Bao’er, did you do something to offend your two aunties?” Han Sen asked.\n\n“I behaved,” Bao’er said, as she munched on jelly.\n\nHan Sen went home to rest for the next two days, but Lin Weiwei sent him a message. It told him that a person had come to the shelter and that he would like to meet Han Sen in the virtual community."
}