{
    "chapter": 1831,
    "title": "Dragon’s Back",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1831",
    "text": "Even the Knife Blank has come out. Is it useful?” Han Sen waved the Knife Blank. It felt good to wield, but it didn’t seem to\n\npossess any strange powers.\n\nBlack Steel looked at the Knife Blank and said, “It fell down like that without fear, so it is indeed something special. It will be a King class if it can become a real knife.”\n\nAfter that, Black Steel ignored Han Sen. He went towards the knife mountain in search of another knife.\n\n“It sounds really good. How might I complete it, then? Your family is one of blacksmiths, right? Couldn’t you help me forge it?” Han Sen asked Black Steel.\n\n“This is a knife growing in Knife Grave. It has life. It isn’t a simple material I can use for forging. I can’t do that,” Black Steel answered.\n\nEver since the twelfth rain fell, the Knife Grave had stopped erupting. There were no more knife rains as a result.\n\nBlack Steel scaled the mountain, and he searched for over six hours. Finally, he found the King class weapon he had been looking for.\n\nAs they fervently searched on the inside, the people on the outside grew increasingly worried. This was especially true of Black Steel’s father, Black-Moon King. Black Steel had been overdue by many hours, and he still hadn’t come out. It made\n\nBlack-Moon King’s forehead sweat profusely.\n\n“I am afraid they will be unable to return. At this time, a fifteenth rain will have come. At that strength, not even a Duke would stand a chance of repelling it”\n\n“They were too greedy. They should have come out by now.”\n\n“Poor Black-Moon King. He only has one son.”\n\nAs everyone discussed the matter, a white light emerged from the pit of the black hole. Two people soon came out, shocking everyone there.\n\nIt was Han Sen and Black Steel. Black-Moon King was made incredibly happy, but only for a single second. Then, so coldly, he asked, “Why are you only conning out now? What did you get?”\n\nBlack Steel and Han Sen were shocked to see so many people had been waiting on them. Black Steel heard Black-Moon King’s question, and so he brought out his new weapon, drew it, and presented it to him. He said, “Please take a look, Father.”\n\nWhen Black-Moon King saw the knife, he froze. He didn’t pick it up, and he had to try to contain his excitement. With forced calmness, he said, “This is your knife. Activate it yourself.”\n\n“Yes.” Black Steel spoke with respect, and then he inserted his power into it.\n\nThe knife Black Steel had brought out looked a little weird. It had been made of bone, from the looks of it. The body of the blade was very straight, but also four feet long. The width of the blade was greater than a man’s hand.\n\nBlack Steel held it with both of his hands. He put his Baron power inside of it, and then the bone knife roared the roar of a dragon.\n\nAnd then, swordlight flashed across the sky like a dragon in flight. It roared and zoomed around.\n\nBuzz! Buzz!\n\nEveryone present, who was carrying a knife, looked down as their weapons made strange noises. All the other knives were responding to the bone knife.\n\n“King class knife?” Everyone was shocked, and Black-Moon King laughed out loud.\n\nHis son had found a King class weapon. In all the time the Rebate had controlled Narrow Moon, such an event had never occurred.\n\nThroughout all those years, with many Rebate and many different races, so many talented people had gone there. And yet, none had ever emerged with a King class weapon. But this time, it had happened. Black-Moon King’s son had done it, and that weapon had accepted his son as its rightful bearer. Black Steel was weak, and he couldn’t use the weapon’s true strength, but as he grew up, it would adjust. They would grow and become more accustomed to one another, until one day, all of its power could be unleashed.\n\nThis was something so many people could only ever dream of accomplishing. Black-Moon King wanted to laugh his head off. He was thinking he’d dream of laughing, too.\n\n“Black Steel, what will you name it?” Black-Moon King asked with a smile.\n\n“I would like to name it Dragon’s Back,” Black Steel said, as he sheathed the weapon.\n\n“Dragon’s Back. Good. Good. Good. Ha! Ha!” Black-Moon King said good three times, and then laughed.\n\n“Black-Moon King, congratulations!” Many other Kings congratulated Black-Moon King.\n\nBringing out a King class weapon, and then getting approved by it, was a grand achievement. It was a big thing for Black- Moon King, and it looked like Black Steel could be a candidate for becoming the master of the Eleventh Star.\n\nEven Moon-Wheel King and Yisha nodded. Black Steel’s luck and growth were good for the future of the Rebate.\n\nAfter a while, people realized another person had emerged from the tunnel.\n\nBlack-Moon King was in a good mood, and so he smiled at Han Sen and said, “Han Sen, what did you bring with you? Let us take a look.”\n\nEveryone looked at Han Sen. He and Black Steel had come out together, so there was a chance he had gotten a King class weapon, as well. The chance of that happening would be slim, though. You would need much luck and travel to find one. You couldn’t get it by just standing there. But the longer you stayed in that land, the higher the chance you would have of being able to find one.\n\nHan Sen didn’t deny what he had earned. He was going to draw it out, as it was a requirement for everyone’s weapon to be registered. Hiding it would be pointless.\n\nBut as he clutched the handle, he felt as if something was wrong.\n\nThe Knife Blank had been like steel. It was really rough, and it felt as if Han Sen was clutching a coarse rod. But the handle Han Sen grabbed now was very delicate. It was like the tusk of an elephant It did not feel like the Knife Blank it had been earlier.\n\nHan Sen frowned and drew it out. It was not the Knife Blank he had seen earlier.\n\nThe knife he was holding gave off a purple mist. It was a scimitar, and it looked like the fang of a devil. The knife looked as if it was something made from solidified bad luck. It looked like your blood would be drained by that knife.\n\nHan Sen turned around and looked. The knife was still on his back. He felt weird and thought, “Oh no! Why is there another knife? Where did this come from? I thought people said only one knife could be carried out. If I knew I could bring more than one, I’d have brought enough for my Mom, Wife, Son, Sister, Grandson, Little Angel, and Xie Qing.”\n\nSeeing Han Sen’s knife, Black-Moon King’s expression became strange. He said, “Han Sen, see if you can activate this power.”\n\nHan Sen nodded, and then he put his strength into the devil-looking fang."
}