{
    "chapter": 1902,
    "title": "Buddha Touching a Flower",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1902",
    "text": "Han Sen stood in front of the testing gold rock, and his mind moved quickly.\n\nNo Flower’s Touching Flower Finger mind was not a King class display, but to young Nobles, it certainly seemed that strong.\n\nTeeth Knife’s knifemind was stronger than No Flower’s, but Han Sen could not use it. If he used all of his power, then he could definitely triumph. But Yisha would become suspicious of him.\n\nEven if he didn’t use Teeth Knife knifemind, Han Sen’s own sword mind was not weak, either. He could easily defeat No Flower with that, too, but it was something Yisha had already seen before. If Han Sen used it, he’d expose the fact he was Dollar to her, and it was highly likely Yisha wouldn’t let him go after that.\n\nFortunately, Han Sen had an alternate plan. Unlimited Sutra had a record of Touching Flower Finger. Although Han Sen had not practiced it yet, he knew what sort of geno art it was.\n\nEvery Buddha knew Touching Flower Finger, and that proved to him it wasn’t a difficult geno art to get to grips with.\n\nNo Flower’s version was so strong because he had been gifted the strength of Wilted’s mind.\n\n“Ancient Devil, it is just as you have said. Show me your power and be sincere about it.” Han Sen placed his will inside Destiny’s Tower. He spoke to Ancient Devil.\n\nAncient Devil smiled and said, “As you wish.”\n\nAfter that, Ancient Devil remained where he sat. He raised up his finger to draw.\n\nAncient Devil was now using Buddha’s Touching Flower Finger. It was different from No Flower’s Touching Flower Finger, which had been altered with Wilted’s mind. When Ancient Devil brought out his finger, it was like a Buddha touching a flower. Everything in the world was inside that finger.\n\nWhen Ancient Devil drew, Han Sen felt his heart connect to him. Han Sen could feel what he felt, and see what he saw.\n\nHan Sen was in sync with Ancient Devil. He brought out his finger and pressed it against the testing gold rock. The movement of the two was perfectly synchronized.\n\nBut Ancient Devil was drawing in the air, as Han Sen’s finger ran across the surface of the stone.\n\n“Hey! It’s Touching Flower Finger. Han Sen is using Touching Flower Finger?”\n\n“It looks that way, but why does he possess the Buddha’s Touching Flower Finger?”\n\n“Touching Flower Finger is not rare, and it is common amongst the Buddha. Many outsiders know how to use it, too, so it’s nothing too surprising. It surely is strange to see him want to copy and write it down, too, immediately after.”\n\n“One flower. One leaf. One world.” Han Sen did not pay heed to what others said about him.\n\nBoom!\n\nWhen the Nobles saw what Han Sen had written, they fell into a stunned silence. Quickly, a cold sweat developed across all their bodies. They were so scared, it was like a curse had been laid upon them. They didn’t move, and all they could do was solemnly stare at Han Sen’s written word.\n\nThere were no petals, falling like No Flower’s. And there was no threat of death or wilting, either.\n\nEven so, everyone felt scared, witnessing what Han Sen had written. It zapped into the deepest recesses of their minds and latched on to them.\n\nSeeing those words was like watching a Buddha stroking flowers without talking. It was like he could see through everything.\n\nHe was smiling as he went, but the smile was worse than the devil’s.\n\nAt least the devil would lure creatures to fall with him, but this Buddha went straight for the darker side of your heart. They couldn’t hide anything. It was like their ugliest, filthiest, and evilest sides were being exposed for all to see.\n\nFacing death required courage. If they fought and failed, their could at least close their eyes and be at peace. But in front of that Touching Flower Buddha, they didn’t have the strength to face it. They felt nasty. They felt as if they were muddied with sin.\n\n“Argh!” One of the young Nobles, with a weak will, started screaming with his eyes closed. It was like he was running from something.\n\nThe Dukes and Marquise were all pale.\n\nNight River King looked at Han Sen, and he too seemed very glum.\n\nIncluding Clear Sea Buddha, all the Buddhas were in utter shock. None of them could summon the strength to say a word.\n\n“Blergh!” A young Noble pulled out his knife and drove it into his own heart. He couldn’t withstand the pressure, and so he decided to kill himself.\n\n“I didn’t kill you! I didn’t steal it! I didn’t do it!” More young people started to scream and run, erupting into a frenzy of madmen. They all kept on talking nonsense.\n\n“Amitabha! Mister Han, please stop! No Flower has lost!” Clear Sea Buddha said the Buddha catchphrase, and the young Nobles woke up from the trance of that flower mind. They all looked pale, as if they had just awoken from the most horrible, lucid nightmare.\n\nHan Sen stopped moving his finger, and he pulled it back slowly. He had only written half of it.\n\nNo one could face that fear.\n\n“A Buddha truly touching the flower is pierced and reflected on people’s minds, yielding only fear. One thought to be a Buddha, and one thought to be a Demon. It is hard to understand that, and Mister Han can practice Touching Flower Finger to this level? The Buddhas can only be ashamed of themselves. Where did you learn this?” Clear Sea Buddha looked at Han Sen with massive shock. He tried to ask as politely as he could, but he had trouble suppressing the shock.\n\nMany people practiced Touching Flower Finger, but very few established a connection with its true meaning.\n\nNo Flower had associated it with wilting, but Han Sen had actually shown the real meaning right here. Ever since the Buddhas had created that technique, fewer than five people had ever achieved what had just been performed.\n\nHan Sen was a Baron and not a Buddha, and yet he could practice Touching Flower Finger to that extent. It was all so difficult to imagine.\n\n“It is a simple finger art, and No Flower explained it well enough. So, I guess I have just learned it. It didn’t feel all too smooth, so I added a few modifications of my own. I apologize if I did not write it down well.” Han Sen smiled.\n\nAfter Han Sen said that, the Buddha stared at him in silence. The Nobles of Narrow Moon almost choked.\n\n“So, he learned some… He modified it… And he says he did not write it down well…”\n\nAll the Nobles felt as if their lives had been wasted. They did not know geno arts could be practiced like that.\n\nYisha and Moon Wheel King looked at Han Sen strangely. Clear Sea King looked shocked. After a while, he said the Buddha catchphrase again. “Amitabha! Mister Han is talented. He is very well suited for the Buddha arts. If you ever come and visit us, I will be eagerly waiting for Han Sen’s Buddha-talk.”\n\nClear Sea Buddha, saying something like that, put another shock upon the assembly of Narrow Moon.\n\n“This is too much!” Han Sen frowned. Ancient Devil’s mind was stronger than he thought. Even the Buddha were shocked by it all"
}