{
    "chapter": 2582,
    "title": "Retreat",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2582",
    "text": "The monster was like a fighting machine. It could rotate 360 degrees in a moment, and it could release tentacles from any part of its body. The tentacles could weave themselves together to create whatever weapon or defense best suited the needs of its fight.\n\nThe scariest thing about it was that the tentacles were deified class. And the whole composition of the beast had a strong life power. No matter how many times it was struck, it could recompose itself. Facing such an opponent, Han Sen and the little red bird weren’t sure what to do.\n\nHan Sen and the bird were attacking the monster together, but they were at a disadvantage.\n\n“Real deified xenogeneics are scary. Those fake deified xenogeneics in the core area are nothing compared to this.” Han Sen was shocked. He couldn’t think of a way in which they could defeat this foe. An idea occurred to him, and he summoned his Six Core Snake Bow. He didn’t have any deified arrows for it, so he had to summon a King class arrow beast soul. He placed the arrow on the Six Core Snake Bow and pulled the string.\n\nWhoosh!\n\nThe moment Han Sen let the arrow fly, the Six Core Snake Bow’s six wheels spun. The arrow was imbued with a strange power, and it immediately disappeared.\n\nWhen the arrow appeared again, it was in front of the monster. It soared right into the eye upon the monster’s forehead.\n\n“The Six Core Snake Bow gives space power to the arrows it shoots!” Han Sen realized with pleasure.\n\nThat meant every arrow the Six Core Snake Bow fired would teleport. That was better than Han Sen’s skill for drilling arrows. When people were shot by an arrow from this bow, they wouldn’t be able to trace its path toward them.\n\nPlus, Han Sen was also able to tell that the arrow could tear through the fabric of space. That was the power the Six Core Snake Bow could imbue upon the projectiles he used with it.\n\nThe King class beast soul arrow received enough of a buff from the Six Core Snake Bow to pierce through the monster’s eye. Half the arrow embedded itself firmly in the eye, and blood sprayed out around it.\n\n“This is a nice bow,” Han Sen thought happily. The bow’s power was perfect for Han Sen.\n\nBut Han Sen didn’t stay happy for long. Tentacles grew from the injured monster’s eye. The tentacles wrapped around the beast soul arrow and removed the power Han Sen had given to the projectile. Then the monster pulled out the beast soul arrow and cracked it.\n\nThat injured eye was covered by tentacles and swiftly healed.\n\n“Is the monster’s entire body made of silk?” Han Sen wondered.\n\nQuickly, Han Sen’s guess was confirmed. He used his Six Core Snake Bow to strike the monster’s body. The same result was achieved. No matter where Han Sen fired, tentacles would appear and patch up the monster in no time at all.\n\n“I believe I can kill you.” Han Sen added his Turtle spell to the arrow in a bid to slow the beast down.\n\nThe Turtle skill was applied to the monster. It managed to make the monster’s body slower, but Han Sen was soon surprised to learn that the monster could shed the parts of its body that contained Turtle. That removed the effects of the spell from the greater mass of the beast.\n\nHan Sen tried to apply the Turtle symbol in many different ways, but ultimately, it was ineffective. The monster was like a gecko that could keep reproducing its tail. This creature could cut off any part of its body to no negative effect.\n\n“This guy is more disgusting than Barr,” Han Sen said.\n\nThe little red bird and Han Sen didn’t know what to do against the monster. The monster kept using its tentacles to form all sorts of different weapons to attack them. Some of its attacks changed weapons unexpectedly at the last moment.\n\nIt could make knives, spears, swords, and sticks. It could also make shields and fists. The monster was like an invincible killing machine. It was giving Han Sen and the little red bird a headache.\n\nGu Qingcheng and the others were helping the white tiger tackle all the smaller snakes, but things weren’t going so well for them either. More and more of those weird snakes slithered up onto the island. Their numbers were growing. Whenever the defenders killed one snake, two more took its place. Half the island was now wholly swarmed by the snakes.\n\nThe white tiger suddenly meowed to the sky. Its cry was directed at Han Sen.\n\nHan Sen didn’t understand what the white tiger wanted. The white tiger jumped and drilled into the ground. When it reappeared, it was one hundred miles away. Then, it called to Han Sen again.\n\nHan Sen now understood. It wanted Han Sen to follow it.\n\nAlthough Han Sen didn’t understand what the white tiger was thinking, he knew that fighting like this was futile. Even if he and the little red bird could survive, Fang Qing Yu and the others would likely be killed.\n\n“Bao’er, you drive! Follow it and let’s go.” Han Sen threw Bao’er into the white whale.\n\nBao’er dropped through the air. When the ground came near, she flipped and landed softly upon the white whale. She hurried inside and fired it up, then piloted it toward the white tiger.\n\nGu Qingcheng and the others fell back to the white whale as well. Han Sen and the little red bird kept fighting as they made their retreat. They wouldn’t allow the monster a chance to attack the white whale.\n\nThe group of snakes was like a black ocean beneath the white whale. They destroyed everything in sight. The fairytale-like mushroom island was turned into a ruined, rocky crag.\n\nHan Sen and the little red bird flew a great distance away from the monster, but it no longer seemed to be going after them. It started to gorge on the mushrooms now that it could do so uninterrupted.\n\nHan Sen and the little red bird no longer provoked it. They flew next to the white whale to protect it. And as they did, they all proceeded to follow the white tiger.\n\nTheir situation was a dire one. Food was now going to be a problem. The scariest thing was that the snakes and the monster were both issues that they had no idea how to solve.\n\nThe white whale flew over the island. As they moved beyond the snakes, they saw the mushroom forest behind them get consumed.\n\nSuddenly, Han Sen’s face grew pale as he looked at one snake among the writhing mass. After eating a lot of mushrooms, its body became larger. It swelled to ten times its previous size, and its body started to grow tentacles. It was like a smaller version of that goliath monster.\n\n“They aren’t snakes. They’re baby versions of that big one,” Han Sen and the others now understood. They looked quite glum.\n\nOne monster was hard enough to deal with. If they all became monsters, it would be disastrous.\n\nAnd as everyone was trying to process the new information, a few more of the snakes grew bigger. They became just like the monster that was covered in tentacles. But their auras didn’t reach the horrifying level of the largest one just yet. They were King class, most likely, and almost as good as a half-deified.\n\n“Is this a joke?” one the pirates mumbled in shock.\n\nNo one answered him, and that was because no one knew what it was.\n\nThe white tiger kept running through the mushroom forest, but if the white whale started to lag, it would stop and roar up at them. It went back to running when they caught up. It was like it was leading them someplace."
}