{
    "chapter": 2624,
    "title": "Entering Core Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2624",
    "text": "Sky Palace Leader said it would take a few days to finish his preparations of sealing the Charming God’s Jian. Han Sen agreed to leave the weapon with him in the meantime. He was the leader of Sky Palace, so it was unlikely that he’d be greedy enough to steal the Charming God’s Jian for himself. Even if he did steal it, though, Han Sen wouldn’t mind. As long as the weapon no longer plagued him with women or returned to him when he tried to get rid of it, he wouldn’t mind anything that would get the item away from him.\n\n“If it can be sealed, I wonder if I can ask Sky Palace Leader to seal Ning Yue’s little green sword as well,” Han Sen thought to himself.\n\nBut Ning Yue’s situation was vastly different from Han Sen’s. After the power of the Charming God’s Jian was sealed, it wouldn’t have any effect on Han Sen’s power.\n\nHan Sen had his super god spirit body. He could remove any abnormal changes that tried to debilitate him. He could get rid of his ears and tail, but Ning Yue’s super god body didn’t do anything like that. He was forever bound to be a weak, little woman.\n\nThe little green sword had affected her leveling. Ning Yue had become lazy, and without the little green sword’s power, she might never level up again.\n\nBack on the little jade island, Han Sen waited a couple more days. The Charming God’s Jian had yet to return, which made him feel quite relieved.\n\nHan Sen didn’t go anywhere for a few more days. He just remained on his little jade island, waiting.\n\nOn the fourth day, a Sky Palace guard requested that Han Sen pay a visit to the leader in his garden. Han Sen was to receive his Charming God’s Jian again.\n\nBut when Han Sen saw the weapon this time, there was a layer of rust on it. The engravings that once adorned it were no longer visible. No one would believe that this rusted chunk of metal was a race weapon.\n\n“The sealing is complete. Unless someone forcibly removes the seal, the jian should no longer affect you, and you will no longer be able to make use of its power,” Sky Palace Leader said in a toneless voice.\n\n“Thank you, Leader!” Han Sen happily proclaimed.\n\n“I have to remind you that you’ll spend three days every month teaching,” Sky Palace Leader smiled.\n\nHan Sen left the garden without mentioning Ning Yue’s little green sword. If people learned that Ning Yue had a race weapon, a lot of greedy eyes would be directed toward her. Ning Yue wasn’t strong enough to repel others from taking her little green sword, so Han Sen thought it would be best to forego that idea. Back on the little jade island, Han Sen used his Dongxuan Sutra to push his self-cogwheel and enter the core hall. In the hall, he used his super god spirit body to remove his fox ears and tail.\n\n“Ah, that feels better.” Han Sen touched his head and felt nothing that didn’t belong there. He let out a sigh of relief.\n\nHe entered the core area under his Dollar persona. This was his first time using his Dollar identity to enter the core area this year.\n\nHan Sen looked around. He didn’t see the small crocodile god or the bronze furnace.\n\n“It has been a whole year. I wonder if they have traveled away from here.” While Han Sen had been under the effects of the Charming God’s Jian, he hadn’t wanted to enter the core area as Dollar. He’d been afraid that someone would figure out that he was Han Sen.\n\nHan Sen considered where he should go for a minute, then he took off. He hadn’t been flying for long when he saw Li Keer coming toward him. Exquisite was accompanying her.\n\n“Dollar, you’re here!” Li Keer looked surprised. She quickly hurried to Han Sen’s side.\n\nShe had waited a whole year to see Dollar again. It had been a painful time for her. If she had known how long it would take, she wouldn’t have gone to all the trouble.\n\n“This might be another encounter of fate. It’s hard to believe we’ve run into each other yet again,” Han Sen said.\n\n“Fate? I’ve been waiting here for you for a whole year!” Li Keer rolled her eyes.\n\n“What?” Han Sen asked with surprise.\n\nLi Keer hesitated, but she had made up her mind. She wasn’t going to let this chance slip by again. If Dollar left again, she had no clue how long she would have to wait next time.\n\n“To be perfectly honest with you, I am a Very High student. My people are recruiting. I hope you can come with me to the Very High. Our people can provide many resources and geno arts to make you deified. You’d only have to work for me for four years,” Li Keer said, speaking loudly and clearly. She wanted to make sure that this chance didn’t go to waste.\n\nHan Sen was stunned. He hadn’t realized that Li Keer wanted to take him to the Very High, too.\n\n“I am sorry, but I’m afraid I must disappoint you. I hate being restricted. I would rather end my life than be contractually bound to anyone or anything.” Han Sen had never had any interest in going to the Very High. He certainly wouldn’t change his mind on Li Keer’s account.\n\nLi Keer was shocked. She couldn’t believe Han Sen had rejected her offer without even thinking it over.\n\n“Please think about it! This isn’t a bad deal for you. My race will provide you with deified resources,” Li Keer pleaded. After spending this long on Dollar, she wouldn’t give up easily.\n\nExquisite looked at Han Sen with surprise. She thought she was unlucky, having two guys reject her. She couldn’t believe Li Keer was experiencing the same thing. “I’m really sorry. I would prefer to remain your friend, and nothing more.” Han Sen tried to soften the blow of his abrupt rejection.\n\nLi Keer understood Han Sen’s line of thinking, but she just shook her head and said nothing. She was disappointed. Anyone who had waited a whole year for that result would be quite upset.\n\n“Did you two see the small crocodile god and bronze furnace?” Han Sen asked, quickly moving on from their previous conversation.\n\n“They should be in that system.” Li Keer pointed in a specific direction for Han Sen, and then hastily departed the core area with Exquisite. She was extremely disappointed.\n\n“Third Sister, have we been too quiet for too long? Have the other races forgotten how powerful the Very High are?” Li Keer looked at Exquisite with sadness.\n\nExquisite shook her head. “Special people just aren’t willing to simply hand themselves and their fate over to others. If you really want Dollar to be your silkworm, you’ll need patience.”\n\nAfter that, Exquisite started to think about Han Sen.Exquisite had grown very troubled lately. She wanted to get closer to Han Sen and establish some sort of a bond with him. That way, she hoped Han Sen would accept her offer and become her silkworm.\n\nBut not even she was able to resist the power of the Charming God’s Jian. So, every time she saw Han Sen, her mind would flood with all kinds of naughty ideas. She worried about acting those out every time she laid eyes on him.\n\n“Third Sister, you seem different. Is Han Sen really so special that he has made you change your tone?” Li Keer looked at Exquisite with wide eyes. She had never imagined that Exquisite would talk about potential silkworms like this. It made Li Keer interested in who Han Sen was.\n\n“Everyone has some kind of flaw, even the very skilled,” Exquisite mumbled. She didn’t even know what she was feeling.\n\nLi Keer looked at Exquisite. Her Third Sister had been acting rather strange lately.\n\n“What kind of man is Han Sen? How can he make Third Sister forget her Very High Forget Love?” Li Keer asked with confusion.\n\nHan Sen didn’t know what Li Keer and Exquisite were talking about. He continued to fly. When he saw the bronze furnace, he was given a fright.\n\nThe bronze furnace was as big as a castle. There had to be tens of millions of weapons inside its blazing fire. God knew how many resources it had gained by following the small crocodile god. It had forged countless weapons."
}