{
    "chapter": 895,
    "title": "Copper Fruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_895",
    "text": "Han Sen wished to explain, but Qu Lanxi had already left the house and headed into the garden to catch up with Chu Ming.\n\nHan Sen merely shook his head and started eating the meat by himself.\n\n\"Coin Toad consumed. You have received one ordinary geno point.\"\n\nAfter finishing his bowl, Han Sen earned three geno points and a filled-up tummy.\n\n\"I'll just leave the other bowls out here for them; they may come back and eat it for lunch, after all.\" Han Sen covered the bowls up and then went outside, heading back towards the river.\n\nHan Sen wanted to take a look at the watervine, and see how its development was faring. He had given it one waterdrop the day before, so that should have provided its growth a few-month's boost.\n\nWhen he arrived, the watervine's copper coins were already the size of eggs. They smelled rather pleasant, despite looking like copper.\n\nThe areas along the vine where the fruit hung were like dry spots. The fruit looked mature, so Han Sen did not delay in his collection of them.\n\nThey felt heavy, like genuine copper coins. As curious as this was, it led Han Sen to being unsure whether or not they were edible.\n\nHe examined the coins for a while, in the hopes of understanding what benefits or boons such a coin-fruit might provide.\n\nNo matter what it was, it had to be something good, at least. It was an ordinary class geno plant that had birthed those things, after all; so, they had to be useful.\n\nHan Sen picked up the three copper coins and put them in his pocket, with plans to examine them more thoroughly later.\n\nHan Sen wanted to collect the lifeforce of the watervine, following his collection of the fruit, but it immediately died and withered away upon the final coin being retrieved.\n\nHan Sen was not a greedy person, so he was happy enough to have simply received those three fruits. After this, he took off in the direction of Qing Ming Shelter.\n\nIt was situated a dozen miles away, and Han Sen caught sight of many creatures along his journey there. They were all owned, however, so they did not attack. They would only attack if their masters commanded them to.\n\nHan Sen saw a castle in the distance, one whose walls had been composed of green cobblestones. When he reached there, and walked inside, he was greeted by the appearance of many creatures and even lesser, squire-class spirits.\n\nThese shelters were different than human shelters, and there were far fewer shops available to peruse. They only had a market to trade goods, and this was a place many hawking creatures came to, presenting the goods they wished to trade.\n\nHan Sen was quite amazed at what he saw, not expecting to ever see creatures able to trade just like humans did.\n\nThere were only creatures in the market, and no spirits. Still, the creatures must have had spirits as masters, and it was their goods they were most likely flogging.\n\nHan Sen was very interested in seeing what was offered, so he walked towards the market. Most of what was on offer were geno seeds and geno fruits. There was the occasional slab of flesh available, too.\n\nHan Sen saw a giant beast that was twice as large as an elephant. This beast did not put anything down to trade, but Han Sen watched in awe as a creature approached and provided the elephant a geno seed. Then, in return, the goliath beast cut itself to provide the seed-giving creature a bucket of its blood.\n\n\"Wow, creatures will even sell their own blood?\" As Han Sen continued to walk, he felt something tug at him. He turned around to see a red monkey pulling him away.\n\n\"What?\" Han Sen frowned.\n\n\"Ooh-ah-ha!\" The red-haired monkey spoke, pointing towards Han Sen's pocket. Then, it revealed its own goods, wishing for a trade.\n\n\"You would like to trade?\" Han Sen asked, bringing out one of the copper fruits.\n\nThe red-haired monkey nodded, and presented one item of its own to Han Sen. Without a delay, the monkey immediately tried to take Han Sen's copper fruit.\n\nHan Sen was quick to pull his hand back, however, and tell the monkey, \"I don't want that thing!\"\n\nThe red-haired monkey quickly put that item away, and then presented something else to Han Sen. Then, the monkey said, \"Ooh-ooh-ahah-ooh-haha!\"\n\n\"I don't want that, either.\" Han Sen had no idea what the items and fruits the monkey was offering were, or what good they posed, but he knew they weren't as valuable as what he was carrying.\n\nThe red-haired monkey then presented two items at once, an offering that was quickly turned down by Han Sen shaking his head. After this latest offer, Han Sen decided to squat and examine the contents of the red monkey's pack.\n\nThe monkey was quiet, watching Han Sen rummage through its goods, but it looked antsy; it was clearly dying for the copper fruit.\n\nThe reason Han Sen wanted to search through the monkey's goods, though, was because of what his scan revealed. Before he bent down to scour the monkey's items, he scanned it and discovered the presence of a special lifeforce.\n\nHan Sen found what he was looking for, and found it to be geno seed that was the size of a singular yellow corn. It was black, however, and it looked dry and shrivelled.\n\nThe geno seed's lifeforce was exuberant and comparable to the lifeforce of the copper fruit. Yet strangely, despite the fact that it was dying, it still possessed such a lifeforce. It was possibly a mutant geno seed.\n\nAfter some careful examination, Han Sen decided to take a look at the monkey's other wares. He picked up different fruits of the monkey and suggested to the hairy merchant, \"How about I take all this, and in exchange, give you one of my copper fruits?\"\n\nHan Sen had quite a few waterdrops on him, by now. And he wanted to grow a higher-tier geno plant with them. But unfortunately, Qing Ming Shelter was only a knight-class shelter. This was the only mutant geno seed he had found, all throughout his search there.\n\nThe red monkey was happy to accept this trade without a single moment of hesitation. When it grabbed the copper fruit from Han Sen, it ate it ravenously in front of him.\n\nAfter munching on the monetary fruit, the copper coin exuded a pleasant fragrance. After some more chewing, the monkey spat out the shell of the fruit.\n\nHan Sen watched this, and as he did, turned around ready to depart. But the monkey was keen for some more, so it grabbed Han Sen and pleaded another trade.\n\n\"I'm done trading.\" There was nothing more from the monkey that attracted Han Sen.\n\nBut the monkey was not willing to give up, and so it tried to steal the two copper fruits Han Sen owned."
}