{
    "chapter": 1168,
    "title": "Level Up",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1168",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe door opened, and Zhang Yuchen walked through.\n\n“Zhang Yuchen, I now have permission to kill you. Do you have any last words?” Qiu Ping showed no reluctance in his confrontation.\n\n“There is nothing more for me to say. I did not do anything, but for the pain you have experienced, I can only provide you my condolence,” Zhang Yuchen answered.\n\n“You don’t think I’ll kill you, do you?” Qiu Ping looked angry.\n\n“When I said I did not do it, I did not do it,” Zhang Yuchen said.\n\nHis complacent attitude fanned the flames of Qiu Ping’s heart and temper. Without further ado, he slashed his sword towards Zhang Yuchen.\n\nZhang Yuchen knew he was going to die, and he did not want to fight the cruel twists of fate that had led him to that moment. He stood there and waited for the blow to strike.\n\nQiu Ping’s blade was brought up to Zhang Yuchen neck, but it did not go any further. The sword nicked a small cut across the skin of his neck, and that was it.\n\n“Let me ask you one more time; do you admit what you did or not?” Qiu Ping asked.\n\n“That spirit spits poison in your ears. Recognize her for the forked tongue she really possesses and wake up!” Zhang Yuchen proclaimed.\n\n“Even now you try to drive a wedge between me and Smoke. D*mn you!” Qiu Ping’s anger only increased, and he was ready to strike his believed nemesis down.\n\nDong!\n\nA hazy longsword flashed before Qiu Ping’s sword, and it shattered.\n\n“If the spirit was unharmed, why kill him? He has suffered down here, in the pits of this miserable place for many years. Isn’t that suffering enough?” Han Sen threw away the sword.\n\nHan Sen’s body was small, but Taia and Phoenix Sword could not shrink with him. As such, he was using a mini beast soul weapon.\n\nHan Sen summoned a primitive class sword to block Qiu Ping’s strike.\n\nHan Sen did not know the truth, as much as Qiu Ping did not either. But he knew Zhang Yuchen did not seem to be the sort to do what the allegations claimed he had.\n\nFurthermore, if Zhang Yuchen was as weak as he believed, it was difficult to imagine that he could force himself on a spirit or even kill her, as the story went.\n\n“Who are you?” Qiu Ping said.\n\nZhang Yuchen quickly said, “Thank you for your help, Brother Han, but this matter concerns the two of us and only the two of us.”\n\nHan Sen said, “I don’t care for the petty reasons of your quarrel, but I do hope Mister Qiu will give me some time.”\n\n“What do you mean? Qiu Ping asked.\n\n“Give me time to prove Zhang Yuchen did not do anything wrong,” Han Sen said.\n\n“And how would you do that?” Qiu Ping said.\n\n“Give me ten days. If I cannot prove his innocence to you in that time, you may do as you please,” Han Sen said.\n\n“Why would I give you ten days?” Qiu Ping looked intimidating.\n\n“The last thing you want is to believe your best friend betrayed you as you are so sure he did. Give me ten days, and faith in your friend will not even be necessary. You will learn, know, and understand that he is a good person. He did not do what you think he did,” Han Sen said.\n\n“That is not enough,” Qiu Ping said.\n\n“Fine. Attack me ten times, one strike for each day. If you cannot kill me, give me the ten days I request,” Han Sen said.\n\n“No! You should not get yourself involved in this,” Zhang Yuchen screamed. He believed Han Sen was new here and was not strong. He wholeheartedly believed Qiu Ping could end Han Sen’s life with a single swing.\n\n“And this is between me and Qiu Ping,” Han Sen said, walking forward to directly face Qiu Ping. “Come on; one strike for one day.”\n\nQiu Ping drew his sword and slashed towards Han Sen. He was so fast, the ten attacks were like one. Everyone expected Han Sen to be cut up and diced like dinner.\n\n“Qiu Ping, come for me! Don’t hurt him,” Zhang Yuchen screamed.\n\nBut Qiu Ping was so fast, his attacks were already over before anyone heard what Zhang Yuchen had to say.\n\nHan Sen’s body had a few marks, and he was bleeding a little.\n\n“I will see you in ten days. No one will be here to save you then.” Qiu Ping returned his sword and left.\n\n“How did you withstand the ten of those attacks. I didn’t even see you dodge them.” Cheng Hu looked at Han Sen with great admiration.\n\nHan Sen looked at his wounds and said, “I didn’t bother dodging.”\n\n“No way! And he didn’t kill you?” Cheng Hu asked, in shock.\n\n“It’s because he is not completely heartless,” Han Sen said.\n\nCheng Hu then said, “But how will you be able to prove Brother Zhang’s innocence in ten days?”\n\n“I will have to find out who is responsible for all this,” Han Sen said.\n\n“You want to find that spirit, don’t you? She is in the highest level of the shelter, inside the palace. You won’t get there,” Cheng Hu said.\n\n“Oh, I’ll get there.” Han Sen spoke with confidence.\n\nHan Sen planned to get there so he could see Sky King, anyway. Helping them at the same time was a good excuse for others to see him ascend the ranks.\n\n“Are you crazy? Not even Qiu Ping himself was able to reach the top! The top levels are occupied by super creatures and king spirits!” Cheng Hu thought Han Sen was insane.\n\nHan Sen just smiled and said, “Qiu Ping’s inability does not mean I can’t. I’ll succeed where he failed.”\n\nAfter that, Han Sen walked towards the third floor.\n\nCheng Hu wished to say something more, but Zhang Yuchen pulled him back.\n\n“Don’t stop me! That guy is nuts. We have to stop him from getting himself killed!” Cheng Hu proclaimed.\n\nZhang Yuchen then said, “Can you not see it? Brother Han is special.”\n\n“How special? He’s just a noob.” It was when he said this that he realized Han Sen might not have been as green as he had been led to believe. After all, how could a newbie withstand Qiu Ping’s attack?\n\n“Wait here, I’ll go have a look,” Cheng Hu said.\n\nZhang Yuchen could not go to the second level, so he was unable to follow."
}