{
    "chapter": 991,
    "title": "Dragon-Blood Ring",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_991",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen saw a red-jade ring drop to the floor. It had been on the man’s finger, but it slipped off when the body withered.\n\nHe was not interested in jewelry, but he gave it a scan to see if it was significant, anyway. It wasn’t, to his knowledge, so Han Sen paid it no mind.\n\nBut when Moment Queen saw the ring, she was shocked. She pretended not to be, though.\n\nHan Sen had never heard of the ring before, but she had.\n\nThe blood-ring was something of much renown.\n\nWhen she was in the Third God’s Sanctuary the first time, Dragon King was incredibly famous. He also had a vast collection of jewelry.\n\nHis most important possession was this ring. He would never be seen without it, and Dragon King had an obsessive compulsion to never let it out of his sight.\n\nPeople said Dragon King synthesized the ring with the horn of a super creature, and he fed the ring with his own blood for many years.\n\nWhile many people had seen the ring, few knew what it did exactly.\n\nThe only time he would remove the ring was to fight a human. And when he set it aside, not even his wives were allowed to touch it.\n\nHe once murdered his favorite wife for touching his ring. When she touched it, she did so by accident, and as a consequence, he broke her spirit stone without remorse.\n\nSome said the ring possessed Dragon King’s second soul, and all his memories were stored there, like a back-up.\n\nIf he ever failed his ascension to the Fourth God’s Sanctuary, he could resurrect himself with this ring.\n\nAlthough it was just a legend, and something unproven, it was still a valuable artifact. It was the most important treasure of the late Dragon King.\n\nMoment Queen wanted the ring for herself, as a sort of memento. If she went to get it, though, Han Sen would believe the ring to have a true worth and keep it for himself.\n\n“Hm, how can I grab the ring? I need to distract him, somehow.” Moment Queen tried to think of a way in which she could draw his attention away from the sight.\n\nAs she contemplated what to do, Han Sen was still observing the body. He circled it slowly, over and over. Despite how much he looked, there did not seem to be anything there of worth. He fancied taking the king’s armor, but after touching it, it started to decompose.\n\nHan Sen scanned the corpse repeatedly, unable to fathom how he might walk away from the venture without a reward.\n\nMoment Queen, just about managing to contain her excitement, said, “That armor is pretty good; you should check it out.”\n\n“The armor is turning into goop. How is that ‘pretty good’?” Han Sen said.\n\nMoment Queen then said, “The reason it decomposes is because of the scales. It decomposes with the body.”\n\n“Okay, and what’s your point? It’s ruined now.” Han Sen frowned.\n\nMoment Queen smiled and said, “You don’t understand. There is one portion of the scales that won’t decompose.”\n\n“Which part would that be?” Han Sen asked with confusion.\n\n“There is a dragon-scale that grows upside down. Even when Dragon King dies, that scale won’t decompose. It will absorb his lifeforce, and thus be quite precious,” Moment Queen explained.\n\n“You’re saying it’s that good? Hm, where is it?” Han Sen said.\n\n“I don’t know. It must be underneath the armor or something; you should take a look,” Moment Queen said.\n\n“Okay, fine. I’ll take a look!” Han Sen then got to it, in search of the mystical dragon-scale Moment Queen had told him about.\n\nWhen Moment Queen saw Han Sen begin to rummage about the body, she coldly smiled and thought to herself, “Consider this a trade for the ring. If I didn’t want this ring so badly, I wouldn’t have told you about the scale, either.”\n\nMoment Queen had not lied about the scale’s existence, but it was an effective way of buying time for herself.\n\nAnd even though she knew, she wasn’t willing to tell him where exactly the scale could be found. If she did, she’d have no time to fetch the ring without attracting his notice.\n\nHan Sen, no longer focusing on her, was keen on pillaging the corpse. The prospect of treasure always demanded his attention. She walked around, as if pretending to be busy elsewhere, all the while eyeing the ring on the ground.\n\nThe dragon-blood ring was near the altar, and as if she was pretending to examine the altar itself, she inched her way closer to the ring.\n\n“Mwahaha, it’s mine! If the legends are true, perhaps I can use the emperor’s help to get rid of this *sshole for good,” Moment Queen thought.\n\nAs Han Sen plundered the body, she did her best to control her heartbeat and act as normal as possible.\n\n“It’s mine!” Seeing the ring so close, Moment Queen was exuberantly joyous. She believed the ring would aid her in escaping Han Sen’s control.\n\nJust as her finger touched the ring, a fat little hand reached out to grab it. Moment Queen froze.\n\n“Ah…” Bao’er looked very curious, holding the ring."
}