{
    "chapter": 1699,
    "title": "Officer From the Past",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1699",
    "text": "“Night, it’s been a long time. It is nice to see you.” The officer smiled. And oh, he was handsome; as handsome as a God. He slowly walked over to Stay Up Late.\n\n“It is good to see you again.” Stay Up Late felt touched.\n\nStay Up Late’s friends and family had died amidst the fighting in the past. Seeing someone he respected alive and in the flesh provided him a joy that went beyond the possibilities of description.\n\n“Night, come with me. The crystallizers are gone. But for as long as you and I are together, the Third Division Special Forces will never die.” The officer looked right at Stay Up Late.\n\nStay Up Late opened his mouth and thought of something. He looked at Yake, and then looked at the officer. His expression was complex. “Officer, did you send him to deal with the Han family?”\n\n“The Han family elder stole from us. We have to take it back. You do not have to concern yourself with these matters,” the officer said.\n\nStay Up Late looked at him strangely, and he said, “Officer, you taught me soldiers are meant to protect. Protect life. Protect the law. Protect the world.”\n\nThe officer quietly responded, “I know what you are trying to say, but the world is not like that anymore. The world is changing, and we must change with it.”\n\n“The crystallizers are destroyed, but the humans and the shura are still here. They have laws and order of their own. It is not our place to tamper with or subvert them.” Stay Up Late still spoke with passion, and he went on to say, “Officer, you taught us all this. Why are you doing what you are doing now?”\n\nThe officer looked at Stay Up Late. “If the things I taught were so useful, the crystallizers wouldn’t have been wiped out. We need more than law; we need repopulation. And so, we have to go out and try.”\n\nStay Up Late looked at the officer, his expression complicated. He wasn’t sure what to say. His officer had changed, and he wasn’t the same person that Stay Up Late used to know and respect. He was like a different man altogether.\n\n“Officer, you claim their elder stole something of yours. Their elder; that implies it was none of their business. Please, let them go,” Stay Up Late pleaded, looking at the officer.\n\nThe officer didn’t say anything, but he seemed hesitant about something.\n\n“Officer, he is our only lead. We need to catch them to draw out Han Jinzhi. You shouldn’t just let them go because of this kid! We have sacrificed many people in this pursuit; we can’t turn back now!” Yake shouted.\n\n“Shut up, I am talking with the officer now.” Stay Up Late stared down at Yake, who was looking like ice. Yake seethed, but he did not speak a word.\n\nThe officer sighed and said, “Fine. Since you say it is so.”\n\nThe officer walked in front of Stay Up Late and patted his shoulder. He said, “Let us take a walk, Night. I have many things to tell you, after all these years that have elapsed.”\n\n“Officer…” Stay Up Late’s eyes turned red and teary. His love and admiration for the officer of the Third Division were back. Pang!\n\nThe next second, the officer’s fist was driven right into Stay Up Late’s belly. The scary palm broke through his armor and went right through his guts.\n\nStay Up Late did not think this would happen, and he was already flying through the air and coughing up blood before he noticed it had occurred. He hit a building and broke it.\n\n“Stay Up Late!” Luo Lan was in shock. The officer was a truly callous man.\n\n“Why?” Stay Up Late stepped out from the ruin and asked the officer, looking up at the sky.\n\nThe officer said coldly, “To secure the future of the crystallizers, there is something I must do. You are the best soldier I ever trained, but even I cannot control you. And there is something you must do, and you must do it for me.”\n\n“You are no longer the officer I once knew.” Stay Up Late’s face was expressionless.\n\n“The world is changing, and so are you. You just haven’t noticed it yet.” The officer was speaking with an icy tone of voice.\n\nHe went on to say, “Zagu, Zach; take Han Sen’s son and the New Community Leader. Take them away.”\n\nTwo metal bodies came forward, approaching the top of the building.\n\n“I’ll go help!” Yake looked coldly at Stay Up Late as he followed Zach to the roof of the building.\n\nStay Up Late clenched his way through the pain, attempting to stop Yake. But the officer went right in front of him.\n\n“Excuse me, officer. But I cannot allow you to take anyone,” Stay Up Late said to the officer, wiping the blood from his lips.\n\n“You are the best crystallizer warrior there is. You do not have to help humans as you are.” The officer did not move.\n\nSeeing Yake was almost at the rooftop, Stay Up Late did not say anything and instead planned to break through the man obstructing him.\n\nThe officer moved and used his fist to stop him, though.\n\n“I am sorry, officer.” Stay Up Late built up power and tried to annihilate the defense before him.\n\nBut Stay Up Late had only just moved when the officer repeatedly punched him backward. Stay Up Late kept trying to go from a different direction, but he couldn’t get past.\n\nPang!\n\nStay Up Late’s chest was delivered another punch by the officer. He stumbled back a few hundred meters and coughed up more blood.\n\n“I taught you, remember? I know exactly what you have learned. And now that you are injured, come back with me and make the crystallizers great again,” the officer said.\n\nStay Up Late did not speak, and he just flew over to the officer. But it looked like he was too late. Yake, Zach, and Zagu were already on the top of the building.\n\n“D*mn you guys! You killed so many of our creatures, you should all die!” Yake looked at them with murderous eyes. He looked at everyone, ignoring Littleflower and Han Yufei. Instead of going for them as he was supposed to, he threw a punch towards Luo Lan.\n\nLuo Lan’s face looked ill, but she knew she’d have to fight back. They wouldn’t be able to do much against such forces, but they had little choice in the matter.\n\nHan Yufei was injured, but he wanted to brawl. But just as he was about to do something, a golden light appeared. It was Bao’er, clad in golden leaves. She punched Yake.\n\nBoom!\n\nTwo scary powers came against each other. Yake looked on in disbelief. His power had been broken, and he had been sent flying again.\n\nBao’er’s face looked murderous as she hung in the air. Her fists were coming down on Yake again —this time on his face."
}