{
    "chapter": 880,
    "title": "I'm Going to Look After You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_880",
    "text": "From inside the silver fox's charred body, a gold light burst forth. The strength of the light gradually increased, and the brighter it got, the darker its body became.\n\nSoon after, the silver fox's body was like smoldering charcoal, with veins of red running along its black body.\n\nSuddenly, dark clouds reappeared, shadowing the land once more. A black bolt of thunder struck the now-black fox.\n\nKatcha!\n\nThe silver fox's body cracked.\n\nKatcha!\n\nAnother black bolt came from the sky, and this happened a multitude of times. After the ninth occurrence, the clouds departed as quickly as they had come.\n\nBoom!\n\nA white lightning cloud then appeared in the sky, erupting with more bolts of thunder. They were all aimed at the silver fox's breaking body.\n\nAfter striking the fox nine more times, this cloud also disappeared from wherever it came from.\n\nAfter that, the same thing happened again and again with six other clouds. Strangely, they were all of a different color. There were green, red, purple, blue, gold, and silver clouds, all in all. Each cloud hit the silver fox with a thunderbolt nine times. And with each strike, the silver fox's body became stronger.\n\nBut then, on the final strike, the silver fox's body was broken into pieces. Its flesh had hardened, only to shatter like bits of glass. Only its skeleton remained.\n\nThe bones were shining with lightning.\n\nBoom!\n\nAnother lightning bolt streaked across the sky. But this was like a pillar, heading directly downwards as if to crush the silver fox's motionless bones.\n\nHowl!\n\nThe silver fox finally made a sound, but beneath the light of that holy pillar, the flesh of its prior composition began to return.\n\nThe howl it made was sad enough to break someone's heart. When the fox first shattered, it did not make a noise, but it did when being reborn—the pain must have been far more excruciating.\n\nMore and more lightning flashed across its rebirthing body, and slowly, the silver fox's new appearance was revealed. It was like a silver lightning fox, and now, it was bearing the crushing weight of the pillar of light.\n\nThe silver lightning of the fox was like a fire, and when the silver fox howled, the fire pushed up against the pillar.\n\nBoom!\n\nThe area was consumed by a grand discharge of electricity. Han Sen and the three-tailed fox had to move a great distance away and watch the transformation from afar.\n\nBoom!\n\nPerhaps it was because there was too much lightning, but half of Thunder Mountain collapsed.\n\nAnd amidst the ruin and rubble, the silver fox howled again. The silver lightning sundered the light pillar and went even further, lighting up the entire sky.\n\nBoom!\n\nThe silver lightning broke the sky, literally cracking it open. Inside the cracks, Han Sen saw many strange things.\n\nHan Sen saw a palace, and strange flora. He even saw a tree with an angel perched on one of its branches.\n\nFrom inside those cracks, a phantom force of pressure burst forth to push him down on the ground. His power still wasn't at a high enough level to resist that pressure.\n\nHowl! The silver fox looked at Han Sen and called out to him. Han Sen looked at the silver fox and their eyes locked onto each other. From what Han Sen could see in the silver fox's eyes, it was conflicted.\n\nHan Sen thought the silver fox was going to summon the gate to the Third God's Sanctuary like the holy rhino or Empty Witch had.\n\nBut it didn't take long for that assumption to change. The silver fox hadn't summoned a spirit; instead, it had forced open a crack between both sanctuaries to force his way beyond.\n\nHowl! The silver fox looked up to the sky and the cracks began to reduce in size. Then, it looked back to Han Sen as if it was going to miss him.\n\n\"Little Silver, go! I'll find you; we'll be together again real soon.\" Han Sen did his best to stand up, but could not. He gathered all the power he could to generate sonic-thunder powers.\n\nBut even with that power, however, he could not make a squeak.\n\nThe silver fox had evolved, and if it remained in the Second God's Sanctuary, its body would be tainted and end up in a far worse state than it currently was. It would have to leave this place before the cracks closed.\n\nAlthough Han Sen wanted to go with it, it was impossible for him to even budge.\n\nHowl! The silver fox yelped in the direction of its master once more, and as it inched itself towards the cracks, it made sure to keep looking back at Han Sen.\n\n\"I will look for you soon, Little Silver. Wait for me!\" Han Sen witnessed the cracks beginning to seal, and so he spoke aloud one last time to the silver fox that looked back at him.\n\nThe silver fox nodded, and then it turned back to face the portal. Its body morphed into silver lightning and was drawn inside.\n\nBoom!\n\nThe crack closed shut, and the pressure that had forced Han Sen to the ground vanished. Still, he did not immediately get back on his feet. His heart had been dealt a blow he had almost never had to deal with.\n\nEver since he watched the birth of Little Silver, he had spent most of his time alongside it. It was a genuine companion, and now that it was gone, it hurt. Han Sen vowed to do whatever it took to find the silver fox again.\n\nBut the Third God's Sanctuary was a massive, sprawling place. It was largely unexplored, and human development was slow there. Unless he was tremendously lucky, Han Sen feared it might take years for the two to reunite.\n\n\"F*ck! I know I shouldn't worry; I'll find him no matter where he ends up. I'll cut down anyone or anything that tries to stop me from reuniting with him.\" Han Sen was going to consider this an oath; a vow he would swear to uphold. Looking up to the sky, he shouted, \"Little Silver, hold on! I'm going to look after you, no matter what it takes!\"\n\nAfter cheering himself up, he returned to the nearest human shelter and went back to the Alliance. In accordance with the contract, he returned half of the Angel Gene Fluid to Angel Gene. He wouldn't play nice with those people, ever.\n\nBut before he hit the road again, he spoke to his mother and informed her of his plan.\n\nHan Sen was going to give her most of his beast souls and the super creatures he had claimed. It would have been even better if she could go to Moment Shelter, for if she did, he could move on to the Third God's Sanctuary without worry.\n\n\"If you visit the Third God's Sanctuary, do not let the spirits know that you have an association with the Luo family,\" Luo Lan said calmly after hearing his plans."
}