{
    "chapter": 2503,
    "title": "Conspiracy?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2503",
    "text": "The Ice Blue Knights watched Han Sen through a camera, their jaws clenched.\n\nHe was like a thief who had run into their house and beaten up their son before proceeding to steal their possessions. After his crimes, instead of running away, he had gone into the backyard for a cup of tea. Wouldn’t that make anyone mad?\n\nThe worst part was that, in order to preserve Bai Wuchang’s life, they had to refrain from doing anything to Han Sen. They had to watch him go for a nice walk on the planet.\n\n“What is he trying to do?” Ice Blue Knight King looked at Han Sen. He couldn’t tell what Han Sen’s true purpose was in coming here.\n\nConsidering the inherent danger in Han Sen’s situation, they all thought it would be best if he left sooner rather than later. No matter how strong Han Sen was, he couldn’t compete against deified elites. If the Extreme King deifieds arrived, he would be in a lot of danger.\n\nBut Han Sen wasn’t running. He was just bumbling around. His actions made Ice Blue Knight King and the other higher-ups very uncertain.\n\nThey sent a video of Han Sen to the Extreme King. The Extreme King’s deified elites were very confused about his purpose there, too. He didn’t know why Han Sen was choosing to hang around this random planet. It was like he was just waiting there for them to grab him.\n\n“A conspiracy. There must be some sort of conspiracy…” Sixth Uncle said, gritting his teeth.\n\nThey believed that Han Sen had some sort of plan that was about to be exposed, but they weren’t sure what it was all about. Everyone thought hard about what was going on, trying to guess what Han Sen was trying to do. But there were too many possibilities. No option seemed more likely than any of the others.\n\n“Let Fourth Uncle and the others go quickly to the systems of chaos. It doesn’t matter what Han Sen is planning; it won’t be a threat to them,” King Bai said coldly.\n\nHis favorite son had been taken by Han Sen, but he didn’t appear too worried. He looked as if nothing had happened, and he was acting like his usual self.\n\n“Father, I beg you to let me take some people to the systems of chaos. We need to capture Han Sen and save Bai Wuchang,” the crown prince bowed and pleaded.\n\nHe and Bai Wuchang came from the same mother, so he was closer to Bai Wuchang than he was to the other royal children. He didn’t make the request to save Bai Wuchang because of the bloodline-connection, though.\n\nAs the son of the same mother, Bai Wuchang was extremely talented, and King Bai loved him. Plus, Bai Wuchang didn’t want the throne. He had done a great deal to make his brother the crown prince.\n\nBy pleading in this way, he would give King Bai the impression that he greatly loved his brother. And there was no reason for him not to go, anyway.\n\nKing Bai still coldly responded, “Our deal with the Meka has reached a critical point. We still need you to follow up. Don’t worry; Fourth Uncle can resolve this. And Miss Mirror is also on her way.”\n\n…\n\nHan Sen held Bao’er as he continued walking across the planet. This planet wasn’t an ideal place for creatures to live. Aside from the base, the rest of the environment was poor. Only a few xenogeneics could live in such conditions.\n\nThat place was similar to a rocky moon. It was full of craters that were the result of many meteor strikes. Many of them were enormous geographical features, whereas others were as small as football fields.\n\nAsteroids near the planet were pulled down by the gravity of the planet. That was why there were always meteors striking the surface.\n\nBut now that the Ice Blue Knights had taken over the planet, many of the larger meteors were eliminated before any harm was dealt. The craters around Han Sen had formed before the Ice Blue Knights took over the planet.\n\nBao’er secretly guided Han Sen. A short while later, Han Sen reached one of the smaller craters. Han Sen looked into the crater, and there was a broken rock at its center.\n\nThe broken rock gleamed slightly in a metallic way. It wasn’t purple like Han Sen had expected, which disappointed him a bit.\n\nBut if Bao’er said there was some treasure available, it had to be something good. Thinking of that improved his mood a little.\n\nIce Blue Knight King and the other knights watching the video feed saw Han Sen walk next to the rocks with much confusion. They were unsure what Han Sen was thinking.\n\nThey kept guessing what Han Sen might be up to, trying to determine what he was planning. But still, they couldn’t unravel whatever he had plotted.\n\nAs they watched intently, Han Sen moved many rocks away. On the camera, they could see that there were many purple mushrooms beneath the rubble.\n\nEveryone was shocked. That planet wasn’t suitable for any form of life, so neither creatures nor plants thrived there. Even ordinary xenogeneics had a hard time on such a planet. Only some xenogeneics adapted for outer space could live there for a while.\n\nBut now, there were looking at a bunch of fist-sized purple mushrooms. It was a very rare sight.\n\nHan Sen, upon seeing the mushrooms, looked very happy.\n\nWhile the knights watching the video feed could only see the purple mushrooms, Han Sen could feel their lifeforce. And he could tell that the purple mushrooms were almost as strong as King class xenogeneics.\n\n“Plant xenogeneics?” Han Sen looked at the purple mushrooms. He counted there to be around seventy of them. Some of them were big, whereas others were small. But they all had King class lifeforces.\n\n“These mushrooms, they cannot be the numbers mentioned by Night River King, can they? Purple mushrooms. Is that what they were? No. Look at these numbers. They should be code for some creature. These cannot be the creatures that the code indicates. These mushrooms should be the items infected by the numbers. So, what is this?” Han Sen looked at them. Aside from the purple mushrooms, there was nothing else around.\n\n“They were always here… where are they?” Han Sen was remembering the contents of Night River King’s diary, but the diary made no explicit mention of where they were exactly.\n\nBao’er looked at the mushrooms, and she seemed ready to start drooling. “Daddy, can I eat them?”\n\n“Can you eat them?” Han Sen reached out his hand and tried to pick up a mushroom. But before he could touch the mushroom, it moved. The umbrella-like cap of the mushroom greatly expanded and then grew smaller, blowing out a haze of purple mist.\n\nHan Sen instantly shielded Bao’er and himself in Jadeskin godlight. He made a wall of ice to shield them from the purple mist that was emitted.\n\nThe purple mist came into contact with the ice wall and corroded it. It happened so fast that the ice wall simply melted into that purple color.\n\nHan Sen’s eyebrows rose. “A very powerful toxic power.”\n\nIce Blue Knight King and the Extreme King’s Sixth Uncle, who were watching the video, were immediately given a shock. They couldn’t tell exactly what the mushrooms were from the video. But now that they were seeing the mushrooms, they were stunned. They knew that these strange things had to be King class plant xenogeneics. The mushrooms had a very strong toxic power. If they didn’t, they wouldn’t have corroded Han Sen’s ice light.\n\n“Bao’er, do you really want to eat one of these? You must be joking.” Han Sen looked at the poisonous purple mushrooms and spoke to Bao’er.\n\n“I’m not talking about the mushrooms. I was talking about that.” Bao’er pointed at something next to the purple mushrooms."
}