{
    "chapter": 2358,
    "title": "Weird Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2358",
    "text": "Normal bullets would face too much resistance when fired underwater. The shot would become weaker the farther it had to travel, and the sea conch would likely notice its approach.\n\nBut Han Sen had his Original Water King Body and sea dragon area. He combined with the sea of Planet Water Zone itself. He used his water powers to create Spell’s ammunition, so the bullet also had water abilities. Rather than being slowed down by the water it passed through, the bullet was actually buffed by the sea. It flew toward the sea conch silently, like a phantom.\n\nBut Han Sen wasn’t firing at the exposed flesh of the creature. He was firing at the conch’s shell.\n\nPang!\n\nThe bullet hit the sea conch’s shell, punching a small hole straight through. The sea conch shook and immediately activated its blue light. The light quickly covered the sea conch’s shell, protecting the small hole.\n\n“So that’s how it works.” Han Sen was happier. He looked at the bullet hole and noticed that some white juice was flowing out of it. Although the wound was very small, it proved that his bullets could pierce through the shell and damage the creature’s body.\n\nNow Han Sen knew for certain that the light made the conch’s shell so hard, not the material of the conch shell itself.\n\nHan Sen’s shot was far weaker than the blood kirin’s attacks, too. But still, his bullets were able to penetrate the conch’s shell. The blood kirin’s claws were only able to leave light scratch marks upon it. It was obvious by now that the difference was because of the blue light area.\n\nHan Sen stayed where he was and lifted his sniper rifle to aim at the sea conch again. He fired a few times, all of his bullets flying true and striking the shell.\n\nNone of those bullets were able to break the conch’s shell, though. Under the glow of the blue light, they left small marks on the surface of the shell.\n\n“When the bullets go through the blue area, they don’t lose speed or power. But when they strike the conch’s shell, they don’t have the impact that they should.” Han Sen looked at the sea conch with interest.\n\nAfter a while, the bullet hole Han Sen had made filled in and disappeared completely. The conch’s recovery power was very strong.\n\n“No wonder Bai Yi left behind a King xenogeneic. He probably couldn’t figure out how to kill it; he didn’t leave it alive because he wanted to.” Han Sen laughed.\n\nSince Bai Yi had been unable to kill it, this was a good opportunity for Han Sen. He and the blood kirin remained in hiding, and he was determined to kill the King class xenogeneic.\n\nHe only had guesses about how to bring the creature down, though. He didn’t have a surefire way of breaking the blue light area, so he planned to wait there until the sea conch relaxed.\n\nThe sea conch had learned from Han Sen’s previous attack, and it didn’t reveal itself so quickly this time. It took a few hours before the sea conch was willing to reveal its flesh once more.\n\nThis time, however, it didn’t deactivate its blue light. It continued using the blue area as it traveled into the deeper recesses of the sea.\n\nHan Sen thought the thing would be heavy and slow, but it ran away like a rabbit. Han Sen watched the small mountain flee into the deep sea, creating eddies and vortexes as it went.\n\nHan Sen used his Purple-Eye Butterfly to keep an eye on the thing as he pursued it, waiting for the moment the creature decided to relax.\n\nNow that the sea conch had been damaged, it was being careful. It was moving fast, and it carefully maintained its King area the entire time.\n\nHan Sen wasn’t in a rush, though. He just continued to follow it. The creature was too big to hide from him easily.\n\nPlus, Han Sen had two water areas. Escaping from him in the water would be practically impossible. Han Sen was very confident in his water-aligned powers.\n\nBut Han Sen noticed that his current confidence had come a little too soon. When the sea conch passed by another underwater mountain, it disappeared.\n\nAfter it climbed behind the mountain, it didn’t re-emerge. Han Sen thought it might have come back to its home, but when he looked around the mountain, he couldn’t find the sea conch anywhere.\n\n“Weird. Where did it go?” Han Sen looked around, but he saw no sign of the creature.\n\nThe gap between the mountains was small, so there was nowhere else for it to go. The sea conch was too big for Han Sen to have missed it if it came out. That was why Han Sen waited near the mountain.\n\nBut there was nothing to see. The sea conch had truly vanished.\n\n“You think you can escape my sight that simply? You are too naive.” Han Sen used his Purple-Eye Butterfly and his Dongxuan Aura to scan for the sea conch’s molecular trail. He found it and began following.\n\nHan Sen quickly realized that there was a small hole in the ground near the mountain. The hole was the size of a man’s fist. The sea conch’s trail disappeared into it. The conch had tricked him.\n\n“That sea conch can change its size? Why didn’t it display that power earlier?” Han Sen wondered.\n\n“Blood kirin, go in and take a look at what it’s doing. But don’t alert it to your presence.” Han Sen wasn’t very good at changing the size of his body, but the blood kirin was a professional. It could change its size effortlessly.\n\nThe blood kirin roared. Its body shook as its bones shrank. It became one size smaller, and then it continued to reduce until the red beast looked like a little toy. Then, it climbed into the hole.\n\nHan Sen waited on the outside. He looked around and examined the trench that led to the hole.\n\nHan Sen had studied the Xuanmen techniques left behind by Mister White. He learned a few of the skills, but they were very simple. He only mastered a couple of their methods of calculation, but if a situation was quite simple, he could use those techniques to provide some insight.\n\nThe underwater mountain was very special. There were many mountains nearby, and they were all connected together. The mountains were shaped like volcanoes with craters at the top, and there were large holes in the peaks.\n\nFrom above, the nine mountains looked like a chain of interlocking rings. Han Sen remembered in the Xuanmen technique that this kind of environment was called the Nine Rings.\n\nIf that sort of landscape was in the Alliance, no one would have dared to live there. Such a place had a lot of bad luck, and people who chose to live there would suffer the consequences.\n\nBut that theory might not have applied to the geno universe. Mister White said the Xuanmen techniques required many improvements for the geno universe. Techniques and powers were different in the sanctuary and the geno universe, and he was interested in researching those differences.\n\nHan Sen was checking out the mountain when a white shadow suddenly appeared from the peaks. It was a big electric eel that was a dozen meters long. As it swam, its white scales sparked with electricity. It looked weirdly pretty.\n\n“Another King class xenogeneic!” Han Sen frowned. This was unexpected."
}