{
    "chapter": 1861,
    "title": "Moon Palace With a Moon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1861",
    "text": "“Hey! What happened? His speed is increasing!” A dozen Viscounts were trying to stop Han Sen, and they had all managed to get very close to him. But now, at that range, they were finding it getting more and more difficult to close the gap.\n\n“He can run even faster than this? Not bad for a Baron, I suppose! But it is naive to think this will be enough to shake off a Viscount.” A Viscount smiled as he accelerated.\n\nThe dozen Viscounts moved as if they were activating jetpacks. Together, they sped up towards Han Sen.\n\n“The distance separating the Barons and Viscounts cannot be closed. The fitness is too much to compensate for. It would be shocking enough for the fastest Baron to have a speed in the five hundred flower range, but even so, the slowest of Viscounts are above one thousand flowers. Skills won’t be enough to close that gap.” The beautiful man smiled.\n\nThe next second, though, the beautiful man was shocked.\n\nWhen the Viscounts started to speed up, Han Sen was able to speed up yet again. He managed to maintain the distance between himself and the others.\n\n“How is it possible for a Baron to run so quickly? Is he really just a Baron?”\n\n“Since when did Queen excel in the teaching of skills that benefit those wishing to flee a fight?”\n\n“This speed is so f*cking fast. Not even Viscounts are able to catch up with him. Still, I wonder how long he can keep that up?”\n\n“This is interesting.”\n\nThe races that watched the Narrow Moon livestream were showing extreme interest. They were no longer complaining that the events were boring.\n\nThe beautiful man was shocked, and he said, “I cannot believe a Baron can possess such speed! It must be some secret technique he has learned!”\n\nThe man with a cow head did not speak. He just kept running.\n\nThis is strange. How is he able to run so fast?” The Viscount behind gritted his teeth. He couldn’t get dose to Han Sen.\n\n“I told you guys it would be beneficial to learn a speed geno art. You guys said the abilities of flight were useless. Now watch me!” A Rebate Viscount that had practiced speed went at an even faster pace. The wind at his back left trails like a blitzing jetpack. His legs looked like a fiery wheel as he left his own group behind to catch up with Han Sen.\n\n“Wind Assault can only be used in a straight line. It cannot be used in the midst of a fight, but this is perfect for it. Han Sen surely can’t outrun this.” The beautiful man smiled.\n\nThe Viscount that had practiced Wind Assault was only ten meters behind Han Sen now. Those watching the livestream were excited that he had almost caught up with Han Sen, then shocked to see Han Sen increase his speed yet again. The Viscount that was using Wind Assault was only ten meters away from Han Sen, and he couldn’t get any closer.\n\n“What is this? Can he not catch up?” The people watching the stream dropped their glasses. They did not expect this could happen.\n\n“A Baron can possess this sort of speed? That is very powerful!”\n\n“This is so fake. A Viscount with Wind Assault cannot catch up with a Baron? There’s a problem somewhere here.” “There is! Normal Viscounts cannot dodge Wind Assault, so how can a Baron outrun it?”\n\n“I will say it has something to do with his shoes. They must be some sort of treasure that imbues incredible speed upon its wearer.”\n\n“It must be. But even so, he is just a Baron. Even with a high tier treasure, he shouldn’t be able to unlock its true power, right?\n\n“Normally, a Baron cannot activate a superior treasure. The strength he would be given would be that of an ordinary Viscount, at best. But this is way too much. If so, I haven’t the faintest clue where it might have come from.”\n\nEveryone was talking about this ravenously. The Moon God Festival had actually become an interesting affair.\n\n“He is cheating! It is no wonder he has managed to achieve this level of speed. But it is useless to cheat before the absolute speed.” The beautiful man felt embarrassed for the presumptuous mistake he had made. He sped up with the desire to stop Han Sen.\n\nThe cow head fellow followed after him. Those two Earls shot past the teams and even accelerated to a speed that surpassed the Viscount with Wind Assault. They were going straight for Han Sen.\n\n“Sh*t! How many people has Queen managed to offend? Even the Earls are mad at me?” Han Sen thought Queen had offended a lot of people, and that was why others kept coming after him.\n\nBut actually, although she did not have many friends, she was an idol for all of the Rebate. She was a popular person when it came to socializing.\n\nHan Sen wasn’t overly concerned, though. He increased his speed, wanting first place more than anything. The rewards wouldn’t be bad, and Han Sen figured he’d be needing it. That was why he was trying to claim it.\n\nThe elders said the reward was a Marquise xenogeneic armorset. That armorset would be incredibly powerful if it was activated. But even if it wasn’t, it would still provide a great boon of defense for any wearer.\n\nAnd on top of that, if he later had no use for the gear, he could just eat it for xenogeneic points. That prize would be valuable no matter how he decided to use it.\n\nThe beautiful man thought he could catch up with Han Sen easily, but after speeding up, Han Sen went even faster. There was nothing he could do to catch up.\n\n“D*mn!” The beautiful man sped up again.\n\nAs his speed increased yet again, so too did Han Sen’s. But the Earl was still unable to close the gap and get close enough to Han Sen.\n\n“Cheating boy! I am going to get you.” The beautiful man gritted his teeth and shone with a bright green light. A green light dragon enveloped his body and came whooshing forward towards Han Sen.\n\nHan Sen increased his speed again, though. And he managed to lose the green light dragon. He was headed straight for Moon Palace. Everyone who was watching the stream had seen the green light dragon pursuing Han Sen, but Han Sen was still able to increase his speed and leave it in the dust.\n\nThe beautiful man was shocked. He could not believe what was happening, so he gave up on the prospect of chasing Han Sen. People stared at the livestream in dumbfounded silence for a moment. An Earl had used all his strength and still failed to catch a Baron.\n\n“D*mn! What are those shoes? They are over-powered!” Someone complimented them.\n\nIcebird Duke was shocked by what she was witnessing, and even Yisha was transfixed by the shoes.\n\nIf the shoes were a King class treasure, a Baron should not have been able to activate them. But adding to that, the shoes themselves didn’t exactly seem to look like one, either.\n\nAll the Nobles were in shock, staring at the rabbit shoes Han Sen was wearing.\n\nHan Sen was so fast, he arrived at the Moon Palace before everyone else. He went inside the gate and saw some strange moonlight from beyond. The moons were rising in the hall.\n\n“I wonder how many moons he can raise in there.” The people who watched the stream glanced away from their monitors and looked up to Narrow Moon. The moons that were rising could be seen just outside."
}