{
    "chapter": 2875,
    "title": "Final Challenge",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2875",
    "text": "A coin was shining on Maha God Elephant’s head. It was like Maha God Elephant was being suppressed by an entire mountain. It was not that fast before, but it was even slower now.\n\nEven with Han Sen’s power magnified to 13, it still wasn’t enough to suppress Maha God Elephant. The god elephant’s tusks were still raised. The beast was trying to skewer Han Sen. “You still won’t concede.” Han Sen laughed. He cast a golden light, which landed on the god elephant. It made the number on the coin on the Maha God Elephant’s forehead increase a bit. It went from 13 to 14. The god elephant’s body became heavier. It was harder for it to walk.\n\n“Let’s see how many numbers it can endure.” Han Sen moved his finger again. A gold light was fired out. It made Maha God Elephant’s forehead increase again.\n\nHan Sen clicked his fingers 10 times. The numbers on the coin increased more and more. Maha God Elephant forced itself to run at Han Sen, but it could not take the pressure of the coins. Before it ran in front of Han Sen, it fell down. It fell from space. It fell onto a planet. It was like an asteroid. It blew a big circular hole in the planet.\n\nThe land was crushed on that planet. A volcanic eruption started everywhere. Fire, light, and dust enveloped the planet.\n\nMaha God Elephant was suppressed on the planet. Its limbs tried using strength to fly. When one of its legs was lifted, the other three legs were still on the ground. The ground broke. The god elephant could not stand. It fell on the floor.\n\nThe god elephant kept struggling, but the suppressive powers of the coin were too much for it to bear. No matter what it tried, it was unable to get up. The rocks beneath its feet kept cracking. Its body started to sink into the ground.\n\nBoom!\n\nThe planet was blown up by the god elephant. The god elephant fell through and out of the planet, making its body continue falling through space. It was getting further and further from Han Sen.\n\n“Roar!” The god elephant madly roared. It stared at Han Sen. In the end, it had no choice but to concede and leave\n\nspace.\n\n“That coin can keep gathering up power, and the power is still there. But this is different from the Saving Power skill.”\n\n“That is Dollar’s true power. He did not need a god personality armament to suppress the true god class Maha God Elephant.”\n\n“What kind of geno art is that? It was used by Dollar, who is butterfly, yet the Maha God Elephant was unable to tackle it.”\n\n“Did you see it? Who said Dollar only depended on law powers or the god personality armament? He did not need those two to suppress a true god.”\n\n“Interesting geno art.” That was God’s comment.\n\nHan Sen’s victory did not generate much excitement. After all, people had seen crazier fights before. His fight was not that exciting. It was just a nice display of Saving Money that incited the curiosity of others.\n\nIt was the last day of the ranked fights. The rankings were pretty much still. Everyone knew about the top 10. Ancient Sacrifice God dropped out of the top 10 due to Sky Palace Leader, but he still had one opportunity for challenge. After the challenge, he ended up back in the top\n\n10.\n\nAt the top of the list, unmoved, was Golden Growler. Very High Leader was second. Demon Alpha was third. Lou Lie was fourth. The xenogeneic called Seeking Perfume Beast was fifth. Sky Palace’s Zhang Xuandao was sixth. Extreme King’s Bai Wuchang was seventh. A xenogeneic called Empty Dragon King was eight. Ancient Sacrifice God had made a comeback to claim ninth. Underworld Ghost was 10th.\n\nUnderworld Ghost was quite strange. He was invisible. No one was able to tell what he looked like, and no one knew what xenogeneic or race he belonged to\n\nThe xenogeneics that challenged him could never see him. Thus, they were beaten.\n\nAs for Bai Wuchang from the Extreme King, Han Sen heard from Bao Ying that he was actually at a level higher than Bai King. He was the generation’s scariest elite from the Bai family.\n\nThe ranked fights were almost done. There could not be any drastic changes. Han Sen was able to calmly wait for the fights to be over before claiming his rewards.\n\nNo. 25 was able to claim a random true god weapon and get four random true god materials. In addition to that, there was a God Spirit stamp. As for what the God Spirit stamp meant or did, Han Sen did not know.\n\n“What does the God Spirit stamp do?” Han Sen asked God.\n\n“You can use it to enter the geno hall’s gate,” God said. “You can enter the geno hall safely one time.” “Can I go to Sky Armor God’s hall?” Han Sen asked.\n\n“Of course,” God said with a nod. “Aside from Sky Armor God’s god temple, can I go anywhere else?” Han Sen asked. Han Sen had Evil Lotus God’s son’s god personality. If he had the chance, Han Sen wanted to get another god personality armament. “No. Each God Spirit stamp only gives you one chance.” God laughed. He pointed at Golden Growler, who was No. 1, and said, “But you can go challenge him. If you beat him and earn the God Spirit seat, you can go anywhere in the geno hall. You will not be restricted.”\n\n“He managed to scare off Very High Leader, so why would I even bother trying?” Han Sen asked with a lift of his lips.\n\nEven if Han Sen could beat him, he did not want to fight Golden Growler.\n\nGod said it like a joke anyway. So, he did not say anything. Everyone thought the geno god list fights were over. There should not have been any more changes, but the people still craved for more.\n\nAfter all, ordinary creatures would never see deified elites in this manner again. Even if they came across them in the wild, they would not dare look at them. They would be too scared to do so.\n\nDuring the geno god list fights, the deified creatures were being killed like dogs. These battles had the kind of excitement ordinary fights never managed to generate. Plus, watching deified elites fight inspired ordinary creatures to grow and better themselves. Just feeling their emotions and the wills of the deified battlers made the lower-level creatures understand something.\n\n“It is over. I wonder when the next geno god list fight will start.”\n\n“I hope I can see it every year.”\n\n“Stop dreaming. Deified elites do not have the time to fight every day. We might not even have one every 100 years. There will probably be a gap that is even greater than the geno being scroll.”\n\nWhile everyone was talking, two names suddenly lit up on the geno god list.\n\n“There is a challenger. At this time, who are the challengers?” Everyone was shocked and happy. They looked at the geno god list and saw Golden Growler’s name light up.\n\n“Holy sh*t! Golden Growler is challenging. He is the first. Who is he challenging?” “Yeah, who is he challenging?”\n\nEveryone was confused. They kept looking at the list trying to find out who Golden Growler sought to challenge.\n\n“Dollar… Golden Growler wants to challenge Dollar.”\n\n“Oh my God! What is Golden Growler doing? Why does he want to challenge Dollar now?”\n\nOn Empty Mountain, the green-haired beast almost passed out in anger. He was stomping his feet. “Little Mountain Leader… What is Little Mountain Leader doing? Why is he challenging him? If Dollar concedes, that means he just gave out first place.”\n\nGod was also surprised. He looked at Golden Growler and then at Han Sen. He looked confused."
}