{
    "chapter": 697,
    "title": "Devil Ant",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_697",
    "text": "Han Sen was alerted by the sound of digging and quickly looked at the canyon wall. The wall was dark green and looked to be really hard. But in the corner of the wall, something had opened a crack. Inside the crack, Han Sen could see the shuffling of a white claw, and the crack began to grow in size.\n\nHan Sen did not know what was behind it, especially here in Devil's Mountain. He did not dare perform reckless deeds in this treacherous place, so he quickly retreated behind a rock to watch it from a safe distance.\n\nThe crack had grown into a tunnel by the time the white claw and a dark green scaled creature emerged. It looked exactly like the wall did.\n\n\"Is that a pangolin?\" Han Sen watched the dark-green creature from behind the rock and thought it looked like a pangolin. But if it was able to dig the dark green cliffside, it was far stronger than the average pangolin.\n\nWhen the dark green pangolin exited the tunnel it had dug, it ran off. Then, he noticed a purple ant, about the size of a fist, come trailing after it.\n\nThere were a number of these ants and their bodies looked like jade. There were about twenty of them, and they seemed to be giving chase to the pangolin.\n\n\"No way! If I recall, pangolins are practically anteaters. Why in the world is this thing getting chased by ants?\" Han Sen was puzzled by the scene.\n\nThe purple ants did not chase the pangolin far, for it seemed as if they weren't very fond of sunlight. When they reached the edge of the shadows, they quit their pursuit and ran back to the hole they had emerged from.\n\nHan Sen pulled out his peacock crossbow that was loaded with a raven feather, took aim, and fired at one of the purple ants. The bolt instantly pierced through its body; after all, it was a berserk super crossbow. With a super bolt, few creatures could ever hope to withstand its power.\n\n\"Sacred-Blood Creature Hunted: Subterranean Devil Ant. The beast soul has not been acquired. Consume its flesh to obtain a random numeric amount of mutant geno points, ranging from zero to ten.\"\n\n\"What? This is a sacred-blood creature?\" Han Sen almost jumped up. There were at least twenty ants that had emerged from the newly-formed tunnel, yet he couldn't believe what he was hearing.\n\nAfter one of the devil ants was killed, the rest of them started going crazy, skittering around in search of the foe that had slain one of them.\n\nBecause Han Sen was quite far away from them, they did not become aware of his presence there. Going unnoticed was a rare opportunity, so he wasn't willing to let this chance pass him by. He brought up the peacock crossbow once more and fired repeatedly. Each bolt found a target, numbering another five kills.\n\nThe sacred-blood announcements continued to ring inside his head, one after another. It almost made Han Sen squeal with excitement. It was true that by eating the same sacred-blood creature multiple times, the amount of sacred geno points he'd get would decrease after each subsequent ant. That didn't really matter, though, due to the fact he only needed another thirty geno points.\n\nThe raven bolts had all been used up, just in time for Han Sen to be spotted by the ants. Frantically, they skittered in his direction. Seeing more than a dozen sacred-blood ants rush towards him in such a manner was a frightening sight.\n\nThe ants were indeed fast, but for a man like Han Sen, they were nothing. He summoned his battle mode little angel.\n\nThe little angel's hand swung her greatsword and diced an ant like a stroke of lightning. Fourteen foes to counter, but before the angel, they were nothing. It only took her a second to slay them all.\n\n\"I'm a handsome man and I collect ants! I hold a big bag and I got the biggest ants!\" Han Sen began singing a favorite song of his, as he picked up the ants and stuffed them into a bag he had brought with him.\n\nHan Sen felt awesome. With twenty sacred-blood ants to dine on, his sacred geno points were sure to max out in no time at all.\n\nBut during his glee, he suddenly heard a rocky explosion interrupt his tune. The canyon wall near the small tunnel erupted into a thick dusty plume that spat out a number of rocks like meteors. A dog-sized, dark-purple ant emerged, screaming with a shrill voice at Han Sen. Then, like a shadow, it sprinted towards Han Sen at a blisteringly fast pace.\n\nHan Sen was shocked. He brought out his Flaming Rex Spike to block the incoming attack, but the little angel dashed in front of him to clash with the giant purple ant on his behalf, greatsword raised.\n\nDong!\n\nThe transparent greatsword struck the dark purple ant's head. The shell did not crack, but the blow let out an amazingly strong force. The little angel's body was knocked backwards into Han Sen and they were both sent flying eight meters backwards into the cliffside wall behind them.\n\nHan Sen spit some blood out. Although the hit was not life-threatening, it made his chest burn something frightful.\n\nThe little angel moved, preparing to strike the dark purple ant again. But this time, the little angel did not strike from the front. She whizzed by the ant from a multitude of directions. Her greatsword was poised to strike, and every dash and direction she went, she hit the ant.\n\nThe giant ant had formidable control of its claws, however, and it managed to block every attack. Each guard would knock the angel backwards. Its strange strength was quite weird.\n\n\"This devil ant king is too powerful. It's far stronger than the little angel. Even her greatsword can't pierce its shell; it cannot be a berserk super creature. Could it?\" Han Sen was shocked, seeing what he was.\n\nBut then again, ants were strange creatures. It was normal for them to lift things that were a hundred times heavier than they themselves were. Ordinary humans could never do something like that.\n\nFor such a big ant, even if it was a normal animal in the Alliance, it would be powerful.\n\nWhile the little angel fought with the devil ant king, Han Sen quickly unlocked his Dongxuan Sutra's gene lock. The Life Aura was activated, and through it, Han Sen was able to observe the energy flow of the devil ant king.\n\n\"This guy is a second generation super creature.\" This brought a modicum of joy to Han Sen, as he tried to learn its energy flow.\n\nAlthough his purpose coming here was not to kill the Subterranean Devil Ant king, that was fine. He wouldn't pass by an opportunity such as this.\n\nThe Subterranean Devil Ant king's life energy flow was complicated. Han Sen could not remember it so soon, so all he could do for the time being was observe for some time and watch the fight unfold.\n\nThe little angel was using her flying abilities, and although she seemed capable of keeping up with it, killing the beast outright was a different matter all together.\n\nHer angel greatsword could not sever its limbs or crack its shell, and without being able to do that, killing it would prove to be of great difficulty.\n\nAfter Han Sen remembered its energy flow, he summoned his Flaming Rex Spike and mustered the energy of the Elephant-Rex Strike. He waited for the right moment to deliver the ant king one massive hit. Even if the strike didn't kill it, it might provide an opening for the little angel to finish it off."
}