{
    "chapter": 1896,
    "title": "The Possibility of Leveling Up",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1896",
    "text": "“I don’t know,” Han Sen said quietly.\n\nYisha sighed and said, “I don’t know if the Red Mist Spring is a good thing or a bad thing, but for you, it might be an opportunity. It’s possible that this spring could make your Spell geno armament level up. It could become a Viscount.”\n\n“That means the Red Mist Spring can level things up?” Han Sen was happy to hear this.\n\nHis Spell geno armament had been difficult to develop. It required an external sort of power for that to occur. If he tried to level it through solo practice, it’d be a slow process. It’d probably take him a hundred years to get it up to Viscount class through training alone.\n\nThat wasn’t about Han Sen performing poorly, though. It was because The Story of Genes was not for humans. It was extremely unlikely that Han Sen had been able to practice it in the first place.\n\n“It’d be better if it was simply a treasure,” Yisha sighed and said. “There is only one way to generate a Red Mist Spring. It has only been created because many creatures have died in this area and remained buried here for billions of years. Changes have occurred beneath the ground, which resulted in the generation of this new substance. The red mist is a sign that the substance has finished formulating, and that it is now available.”\n\nHan Sen waited for a bit, hoping she’d continue speaking.\n\n“This is a substance that comes from the corpses of xenogeneics. Nobles have no use for it, but it is great for ordinary types. Average creatures who touch it can become xenogeneic. If a xenogeneic ate this substance, they’d evolve quickly.” Yisha went on to say, “But your geno armament is special, and I think there is a way in which Spell can absorb it. We can speed up your growth by doing this. If there is enough of the substance, we can level her up to Viscount.”\n\n“What do I do?” Han Sen asked. It was too difficult to level up Spell, and if there was a chance to cut comers here, he didn’t want to let it escape him.\n\n“I have a geno art I believe you should practice. When the Red Mist Spring comes out, you use that skill and transfer the power obtained into Spell. If you do that, she will level up. But this geno art is very difficult to learn, and transferring the spring’s power will be painful. It’s entirely up to you if this is what you want,” Yisha said. She would provide him as much information as she could, but the decision was ultimately up to him.\n\n“Thanks, Queen.” Han Sen accepted the papers she offered him and looked over the geno art that was called Yin Yang Change.\n\n“Don’t forget to go to the event I told you about,” Yisha told Han Sen before she left.\n\nHan Sen confirmed he’d go, despite his total lack of enthusiasm in it. He began practicing Yin Yang Change right away, though.\n\nHan Sen gave it a read-through, and he was immediately taken by surprise. Yin Yang Change was just like Yin Yang Blast. It had simply been developed in a different direction.\n\nYin Yang Blast’s focus was on exchanging power that came against it, in which a power’s direction would be reversed. Yin Yang Change was based on making a power stronger.\n\nWith Yin Yang Blast as a base, he could easily learn how to take advantage of Yin Yang Change. He would only need a bit of practice before using it.\n\nHe didn’t know how Yisha had dealt with Black Cliff. She didn’t mention anything about the man, so he didn’t ask.\n\nBut Yisha hadn’t killed Black Cliff, he knew that. He thought she might have simply sent him back to Black-Moon King.\n\nYisha thought the Red Mist Spring would make itself apparent in around forty days. So, Han Sen had plenty of time to practice.\n\nWang Yuhang went to Han Sen’s room, smiling. “Han Sen, there is a Rebate woman looking for you.”\n\n“Rebate woman? I don’t know any Rebate women.” Han Sen frowned.\n\n“Still pretending? She says you are her teacher, and you two used to be close. You even taught her knife skills.” Wang Yuhang was still smiling.\n\n“No, I never taught any Rebate women. There is a Rebate woman that teaches me, however.” Han Sen was depressed, unable to think who he might have been talking about.\n\n“What Rebate woman has been… teaching you?” Wang Yuhang looked at him with a disgustingly creepy face.\n\n“Knife Queen. Who else?” Han Sen said, then left. He didn’t know who Wang Yuhang was talking about, so he went to take a look.\n\nHe went to a meeting room, and there he found a fifteen-year-old Rebate woman. She had white rabbit ears and a face that was quite chubby. She had big eyes, and she was really cute. Seeing her there, it was tempting to reach out and squeeze her cheeks.\n\nLooking at the Rebate girl made Han Sen think of Wang Mengmeng. They were not of the same race, but they sure looked similar.\n\n“I don’t believe I know you,” Han Sen said, while looking at the lady.\n\n“Master, please allow me to follow and obey you.” The girl immediately kneeled in front of Han Sen and bowed via the Rebate’s typical gesture.\n\n“What is this? Who are you?” Han Sen looked at the lady.\n\n“My name is Qing Li. I am Flower King’s daughter. I really admire Knife Queen, and I wanted to become her student. She, however, did not accept me. So, I will have to ask you to become my teacher, in her stead. That way, I can sort of be Queen’s student!” Qing Li looked rather smug.\n\n“I haven’t made plans to accept any students,” Han Sen said. He was so busy these days that he really didn’t have the time to accept students.\n\nQing Li was Flower King’s daughter. Flower King was at the same level as Yisha. If Qing Li became Han Sen’s student, it would suggest that Flower King was of lower stature than Yisha. If Han Sen actually accepted her, it was highly unlikely that Flower King would agree to it.\n\n“It is too late. I am already following you. From now on, you are my teacher. Queen will become my elder teacher.” Qing Li looked quite excited.\n\n“You are Qing Li, right?” Han Sen was not mad, and he actually smiled at her.\n\n“Yes. And you are my teacher, right? You can call me Little Li.” Qing Li sounded rather sweet.\n\n“Qing Li, I’m not refusing to be your teacher, but if you want to be my student, you are going to have to pass my tests first. Forcing me to become your teacher is useless,” Han Sen said.\n\n“What kind of tests do you want me to perform?” Qing Li asked.\n\n“Why do you want to follow Queen so much?” Han Sen asked.\n\n“It is because Queen is great and her knife skills are the best. She practices the strongest Teeth Knife of the Rebate. I really want to be like her, so that is why I want to obey her,” Qing Li said in explanation.\n\n“So, you simply want to learn Teeth Knife?” Han Sen smiled.\n\n“I guess. But I want to learn it straight from Queen. I don’t care if others teach me,” Qing Li said seriously.\n\n“How about we do a test, and see if you possess the adequate talent to learn it? If you do, I can accept you as my student. Then, you will become Queen’s student’s student,” Han Sen said.\n\n“Really? Then test me! How do we do the test?” Qing Li sounded excited.\n\n“I will write a few words for you, and then you can go practice them. If you can write them down exactly the same, I will take you as my student.” Han Sen said that, and then brought out a wooden board. He used his fingers to write down a few words, and then gave her the board."
}