{
    "chapter": 2432,
    "title": "The Prophecy Comes True",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2432",
    "text": "“This is rather ominous,” Han Sen thought in his heart.\n\nHe quickly reviewed the facts. There was a giant requiem tree inside Du God City. The tree contained a giant requiem egg, and there was a girl frozen within that egg, for some reason. The girl had a Nine-Life Cat tattoo across her entire back. Han Sen’s mind raced for an explanation, but he couldn’t come up with one.\n\nThe sight of a Nine-Life Cat tattoo on a woman’s back was familiar to Han Sen. This girl’s tattoo looked the same as Zero’s. It was exactly the same, in fact, and that was why Han Sen was so shocked.\n\n“Is that girl inside the egg Zero’s sister? But that doesn’t make sense. Du God City fell a billion years ago. How long has Zero been alive? It doesn’t seem as if the two of them could be related. But then, why would they have the same tattoo on their backs? Is it the same organization’s branding? Blood Legion’s symbol is the Nine-Life Cat, but Blood Legion hasn’t been around as long as Du God City, and their history doesn’t reach back to the time before it fell. That godd*mn old cat… He must know all the answers I’m looking for…” Han Sen was giving himself a headache trying to figure all this out. He wanted to lay his hands on that old cat and string it up. He wanted to torture the feline so that he could learn everything it knew.\n\nKatcha!\n\nA snapping sound suddenly came from the egg, pulling Han Sen out of his thoughts. A crack had formed across the golden egg.\n\n“Is that girl still alive?” Han Sen asked in amazement, slowly taking a single step back.\n\nMiss Mirror, Night Wind, and Han Sen all had the same reaction. After falling back a little ways, they stopped. They couldn’t escape now. They hadn’t found a cure for their red eyes, and they were sure to die if they chose to leave.\n\nBut Han Sen was worried about something a little different. Although he also had red eyes that he couldn’t get rid of, he was more afraid that the weird power might be contagious. He didn’t want to risk infecting Bao’er or Ning Yue. That was why he had come here. He wanted to find some way to remove the infectious power, and if this abandoned city didn’t present any answers, he planned to try getting rid of the red eyes with his super god spirit body.\n\nHan Sen had no control over what was occurring, and he couldn’t even tell if it was dangerous or not. He wanted to flee.\n\nBut before he had time to turn and run, he heard a humming tone like the sound one might expect from a viola. The giant egg cracked like glass around the form of the blonde girl, then shattered completely.\n\nSeeing the scattered remains of the egg, Night Wind gnashed his teeth and dropped into a defensive crouch. His dark substance chains then shot out to collect all of the pieces of the egg.\n\nThe egg had disintegrated and fallen to the ground, but the girl still hung in the air. Her body was curled up in fetal position, and an intriguing scent wafted from her. She smelled like the requiem tree egg, but better. One moment Han Sen thought he could barely smell the scent, and the next moment it was almost overpowering.\n\n“I don’t care who or what you are; I have to kill you now!” Dark substance chains circled and writhed around Night Wind’s body, and he sent increasing amounts of power into the hand that wasn’t holding the broken sword. After charging up his strike for a few seconds, he slashed at the girl.\n\nNight Wind had no choice. If he didn’t go forward with this, the red-eye power would drive him insane. The only escape from this fate was to acquire more power.\n\nHis sword of darkness tore through the air toward the sleeping girl.\n\nThe girl’s body looked as if it was shielded by some invisible power. When Night Wind’s dark substance chains got within a foot of the girl, they shattered. His power couldn’t reach her.\n\nNight Wind roared like thunder and prepared to slash with the broken sword instead. His dark substance chains were unable to damage the girl, so he poured all of his strength into the broken sword.\n\nSince the broken sword was able to damage the requiem tree, he believed it should be able to harm the girl’s seemingly delicate skin.\n\nThe blade hissed through the air toward her, and it didn’t explode like the dark substance chain. He slashed downwards, but the sword moved so slowly. It was like the sword was gradually slicing through some invisible substance.\n\nThe sword descended toward the girl’s throat. The blade was going to touch her skin.\n\nAs this occurred, the girl’s eyes moved beneath their eyelids. It seemed as if she was about to wake up. Her blonde hair silently waved and shimmered.\n\nTo Night Wind’s surprise, the girl’s blonde hair rose and wrapped around the blade of the broken sword, stopping the weapon in an instant.\n\nNight Wind stared. The broken sword that could cut through the requiem tree was unable to cut the girl’s hair.\n\nStill gripping the broken sword by its handle, Night Wind used his substance chain in an attempt to pull the broken sword out of the entrapment of the girl’s hair. He tugged at it a few times, but it didn’t budge.\n\nThe girl finally opened her eyes. She had gold irises. She looked expressionlessly at Night Wind. Either that, or she was simply looking forward and he happened to be in the way.\n\nNight Wind was a very decisive individual. When he was unable to pull the sword from her grasp, he abandoned the sword and turned to run.\n\nHan Sen and Miss Mirror had started running as soon as Night Wind attacked the girl.\n\nSpeaking of running, Han Sen was the best at that. He ran faster than Miss Mirror, and that put him in front.\n\nMiss Mirror wasn’t slow, but she was King class. She wouldn’t be as fast as Night Wind anymore, either. Night Wind quick sped by her.\n\nHan Sen used his Dongxuan Area, which allowed him to see everything. Night Wind didn’t slow down. He was headed past Han Sen like he was teleporting.\n\nBut with his expanded vision, Han Sen saw something hit Miss Mirror in her back. She tumbled to the ground with blood bubbling over her lips. And then, all of a sudden, the blonde girl was standing right next to Han Sen. Not even the Dongxuan Area had warned him that she was coming.\n\nPu-cha!\n\nNight Wind had been moving around Han Sen, and when the blonde girl appeared, he almost bumped into her. He raised his arms to defend himself, but it was too late. The blonde girl was holding the broken sword, and she thrust it into Night Wind’s heart with an almost casual motion.\n\nTime stood still. Miss Mirror was on the ground. Han Sen was standing next to the blonde girl, and the blonde girl had stabbed the broken sword into Night Wind’s chest. It was just like the fourth picture.\n\n“Was it really a prophetic drawing?” Han Sen wondered. The only thing he knew for sure was that he would be unable to escape the girl. Not even the deified Night Wind had stood a chance against her speed.\n\nNight Wind had been stabbed, and his face hadn’t changed a bit. He did not have blood ooze from his chest, either. His body simply melted into the darkness and became formless. Then, he went to space.\n\nThe blonde-haired girl was still holding the broken sword in its thrusting position. She did not blink, and she still looked incredibly cold. It was like she had no focus.\n\nBut that broken sword’s symbols had some golden flames on it. The broken sword was burning like a sun. It was shining with a scary, golden light.\n\n“Argh!” Night Wind had become one with the darkness. Not even the broken sword cut hurt him now, but he screamed when the sun-like gold light shined on him.\n\nHis body was fading into the gold light that was like a sun. It only took a second to completely destroy his lifeforce.\n\nHan Sen felt a chill. Night Wind was a deified elite, and he had been killed in moments."
}