{
    "chapter": 1172,
    "title": "First Person Who Dies for You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1172",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen used his Blood-Pulse Sutra to open nine gene locks. He lowered his red body and avoided Dry Bone’s incoming punch.\n\nDry Bone was a strong king spirit, and Han Sen’s fitness wasn’t quite up to the level necessary to reliably defeat the spirit. At the very least, he knew he couldn’t fight him head-on.\n\nUsing his phoenix techniques, Han Sen took off airborne. As he evaded Dry Bone’s subsequent attacks, Han Sen threw in a few hits of his own.\n\nDry Bone was powerful, yes, but his speed and agility weren’t enough to compete with Han Sen and his phoenix techniques. He didn’t relent in his attacks, but each one missed, and that didn’t look likely to change anytime soon.\n\n“I can’t believe humans have come so far and can be that strong.” The surpassers who watched the fight were incredibly excited.\n\nQiu Ping observed Han Sen intently, and he acknowledged no other human had yet to reach a skill level such as that.\n\nThe spirits and creatures were all in shock. Han Sen was a nobody who had come from nowhere.\n\nDry Bone King looked sour, and the flames of his rage were only being fanned with each missed attack. Suddenly, he threw off the chestplate of his armor.\n\nHe placed his left hand inside his ribcage, as if to rummage through a pocket. Then, he pulled out a bone.\n\nIt looked like crystal, but it was clearly bone.\n\nHan Sen saw it, and it made him hesitate to attack.\n\nDry Bone King smiled menacingly as he held the heart-shaped bone in his hand. Then, with his other hand, he knocked it with his fist.\n\nDong!\n\nIt was like he was drumming it, and the acoustics it carried were infused with a strange power. Han Sen tried his best to resist it.\n\nBut the power quickly accelerated and blasted into his heart as if it had locked on like a sentinel beam. He started to feel as if his heart was going to explode due to the sudden influx of that terrifying and malevolent force.\n\nHan Sen was shocked by the quick turn of events. Dry Bone King was huge, and he had initially looked like a lumbering lug that was purely focused on strength. Han Sen never expected him to be so proficient with sonic powers.\n\nDong! Dong! Dong!\n\nDry Bone King was like a Buddha on the battlefield now. He held his wooden fish tight and continued to strike it without pause.\n\nThe strange powers violated Han Sen’s heart and cascaded into it without reprieve. If Han Sen was an ordinary human, his heart would have been incinerated by now.\n\nIf it was an ordinary super creature that was fighting Dry Bone King, their hearts would most likely have been torn in two.\n\nThere was only one thing keeping Han Sen resistant to death, in the face of that vile attack. Dry Bone King’s sonic powers were up against Han Sen’s Heresy Mantra, and Curse of Immortality made Han Sen’s heart stronger than all others.\n\nHan Sen was no stranger to having his heart suffer aberrant rhythms and be put under strain. This may have been worse than it ever had been, but Han Sen had the smidgen of extra resistance necessary to withstand the pain.\n\nHis heart continued to beat, but each thump was like thunder. Blood began to ooze from his mouth.\n\n“Dry Bone King is going all the way. He’s quite the menace, and opponents with weak hearts really don’t stand a chance against him.” Baby Ghost thought Han Sen was a dead man, and it’d only be a matter of time before he fell.\n\nThe audience was in disarray. Dry Bone King’s drumming had affected those in the seats, and sacred-blood creatures and royal spirits began to spill blood of their own. They piled out of the arena in droves to avoid dying.\n\n“King spirits really are in a league of their own. There is no hope for humans to compete against them.” The humans who had fled the arena were all in shock, and they could barely comprehend what they had just witnessed.\n\n“It’s a shame. Han Sen most certainly has the power to compete, and perhaps even slay a super creature, but Dry Bone King has an unfair and wretched power.” Everyone believed Han Sen was extremely unlucky, having to face Dry Bone King of all foes.\n\nQiu Ping had left the hall as well. He could no longer see what was going on, but he could still hear the solemn, heart-killing rhythm in the distance.\n\nThe hearts of the audience that had fled continued to twitch and beat erratically, even as they stood outside the Martial Hall with the doors shut.\n\n“I hope he doesn’t die for me and Yuchen.” Qiu Ping was worried.\n\n“You don’t want him to die?” A female voice sounded behind him.\n\nQiu Ping’s face changed as a female spirit suddenly approached.\n\n“I just think it is a shame for him to die this way. He could do a lot in the service of Mister Immortal,” Qiu Ping said, with a chilling voice.\n\nThe spirit smiled, telling him, “My patience has its limits. If you don’t kill Zhang Yuchen, he will be the first person who dies on your behalf. His blood will be on your hands. And when I’m through with the brat in there, I’ll move on and kill another human. On the account you are unwilling to kill Zhang Yuchen, I will mercilessly slay each and every human in this shelter. One life is all it takes, Qiu Ping. One life can stop the coming slaughter. Do it for the greater good.”\n\nQiu Ping was mortified, but it pained him to know she would do what she had just told him. Her logic was bizarre, but it was not something he could contend with.\n\nHe had delayed this for twenty years, but even he could tell her patience was running far too thin.\n\nMen like Qiu Ping could not make a decision where lives hung in the balance, and at least one had to be sacrificed. If he was unable to kill his best friend, he’d be doing so at the cost of countless more.\n\n“Why me?” Twenty years of contempt had built up inside Qiu Ping’s heart.\n\n“I don’t know. You fit the bill? It doesn’t really matter. Having reasons to do anything is so petty, don’t you think?” The woman looked at him, almost uncaring.\n\nQiu Ping was so angry, he drew his sword and attempted to attack her.\n\nThe skill that had frightened Han Sen had no effect against that callous spirit. She simply deflected it with the greatest of ease.\n\nQiu Ping then pulled out a dagger and tried to stab himself.\n\nIf he did not have what it took to kill another, then the only other solution was to end himself.\n\nThe woman did not try to prevent him, but when the dagger touched his skin, it stopped.\n\nShe then grabbed him and teleported him back to the battleground. She threw him into the audience seats and forced him to watch Han Sen fail and fall. She told him, “This is the first person who will die, all because you are weak.”"
}