{
    "chapter": 2698,
    "title": "Demonic Beast Soul",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2698",
    "text": "“Half an hour has passed. No matter how lucky Han Sen is, he will have been eaten by the Red Blood Demon by this point. Lifting the security now is pointless,” Li Xue Cheng said with a chuckle.\n\n“I hope Exquisite isn’t too upset. I’ll have to think of ways to comfort her; this will surely be an open window of opportunity for me to swoop in and work my wily charms,” Liyu Zhen said, grinning widely.\n\n“In that case, I hope you win the damsel at the end of this tale.” Li Xue Cheng was so happy. It felt like he had been waiting a long time to take out Han Sen. This was ointment to the long string of bad days he had recently suffered.\n\n“Exquisite, let them do it. You don’t know how to lift the restrictions, and you are wasting time,” Open Sky Elder told Exquisite, eyeing her as she reached out to push the button.\n\nWhen Exquisite heard him, she retreated and quickly exclaimed, “Hurry up and lift the security keeping him in!”\n\nRight now, Exquisite was feeling both numb and nauseous on the inside. Even if Han Sen died, she and Li Keer could find another silkworm. It didn’t have to be Han Sen, but for some reason, she didn’t want to entertain the thought of finding someone else. Merely the idea made her feel dismal.\n\n“I’d never find a silkworm like Han Sen again. That’s why I’m feeling like this. It must be. It must be the reason. It must.” Exquisite had realized that her emotions weren’t very rational, and so she was desperately trying to convince herself that they were.\n\nThe two Inspection Department men stepped forward and pushed the button. Open Sky Elder sighed and said, “Han Sen was such a rare genius. It is a shame to learn he has died in a tragedy like this.”\n\nOpen Sky Elder was quite familiar with Jail Demon Hall and the beast it contained, and he knew that being locked inside would have been a death sentence for Han Sen. No matter how strong Han Sen was, he was half-deified, and that was that. Only by depending on the powers of treasures could he manage to fight a deified being. And that was only by a small margin.\n\nAgainst an ordinary deified, Han Sen might have stood a chance. But the Red Blood Demon was far from ordinary. And when it was in its rage mode, even a larva deified might not be able to kill it.\n\nKatcha-cha!\n\nThe restrictions binding the Jail Demon Hall were deactivated. Not willing to wait a second longer, Exquisite rushed inside. She pushed open the door to Jail Demon Hall.\n\nOpen Sky Elder followed with haste, in case the Red Blood Demon tried to rush through the open door and bring harm to the others.\n\nBut when Exquisite pulled the door open, everyone’s mouths gaped at the sight before them.\n\nHan Sen was standing in the middle of the room, one foot propped up atop the Red Blood Demon’s body. He was holding a great bow and using the taut string of the weapon like a saw blade.\n\nThe string slid through the remaining flesh of the Red Blood Demon’s neck. And they watched in awe as the head of the Red Blood Demon dropped to the ground with a wet thud. Exquisite and the others stood completely still. They were so flabbergasted that they barely knew how to react.\n\n“Han Sen… he killed the raging Red Blood Demon…” Exquisite and Li Keer were as shocked as they were happy.\n\nOpen Sky Elder and the two people from the Inspection Department looked at the scene with disbelief. They had a firmer grasp of how strong the Red Blood Demon was. Han Sen was just a half-deified, and he had managed to decapitate it completely. Even if Han Sen had some help from his Apollo Set, this was an unbelievable feat.\n\nLiyu Zhen and Li Xue Cheng, who watched all of this from afar, were just as stunned. Their eyes widened, and Li Xue Cheng screamed aloud, “Impossible! How is that possible?! How could Han Sen have killed the Red Blood Demon… This is impossible…”\n\nHe couldn’t believe what he was seeing. The raging Red Blood Demon had been taken down by a measly half-deified. That was far beyond anyone’s wildest expectations.\n\nWhen Han Sen had sliced off the Red Blood Demon’s head, he heard a familiar voice ring inside his head.\n\n“Mutant deified xenogeneic killed: Red Blood Demon. Xenogeneic gene found. Obtained Red Blood Demon beast soul.”\n\nHan Sen didn’t dare to let his mind dwell on his new acquisition. He threw the beast soul into his Sea of Soul without thinking about it. He had to control his thoughts very carefully to keep Exquisite and Li Keer from noticing that something was amiss.\n\n“Are you okay?” Exquisite asked, hurrying over to Han Sen. Although she could see that Han Sen was fine, she couldn’t keep herself from asking anyway.\n\n“Eh, this is nothing. Just a few wounds and scrapes,” Han Sen answered, gesturing down at himself.\n\n“It is great that you’re okay. We were so worried about you. Why did the Red Blood Demon go into a rage?” Li Keer asked after rushing forward to see him.\n\n“I actually don’t know. As soon as I went inside, the Red Blood Demon just went crazy. Its power exploded to obscene levels with no warning,” Han Sen answered.\n\nBut Han Sen didn’t explain how he had managed to defeat the Red Blood Demon. He just said he had been fortunate, and that he had to use all of his power to win. His victory basically boiled down to luck, though.\n\n“Luck, huh?” Open Sky Elder looked at Han Sen with interest. He wasn’t the sort of person that believed in luck.\n\nThe raging Red Blood Demon wasn’t something that could be overcome through dumb luck, but Open Sky Elder didn’t push the subject any further. He only asked about the raging Red Blood Demon. He needed to figure out why the Red Blood Demon had gone wild.\n\nAfter answering a few more questions, Han Sen left with Exquisite and Li Keer. He finally found some time alone to check out the Red Blood Demon beast soul.\n\nMutant Red Blood Demon beast soul: Demonic beast soul (incomplete)\n\nHan Sen’s eyebrows rose. This was the first time he had seen a Demonic beast soul before. Also, like the Tianxia Peacock King beast soul, the Red Blood Demon beast soul was an incomplete beast soul. He didn’t know what additional strength the complete versions might offer.\n\n“So, what exactly is a demonic beast soul, I wonder?” Han Sen thought as he summoned it.\n\nThe next second, Han Sen felt as if some scary power was washing over him. His entire body brimmed with a blood-red power. Crimson light started to leak out of his skin.\n\nMany substance chains exploded throughout his cells, changing him as they went. Soon, visible changes began to occur across Han Sen’s skin.\n\nUnder the influence of the light and substance chains, Han Sen’s skin hardened like a shell. The red color coming from him looked just like the Red Blood Demon. In a flash, his entire body was encased inside that protective shell. The more Han Sen grew to look like the Red Blood Demon, the more his presence increased. Red substance chains swirled restlessly around him.\n\n“This is like a shapeshifting beast soul, but it is a bit different. Transfusion shapeshifting beast souls transform my body to look like the creatures that the beast souls originally belonged to. This demonic beast soul reinforces my body as well, however. I’m basically half human and half demon,” Han Sen murmured to himself, trying to get a sense for exactly how the beast soul worked. He was very pleased with his prize.\n\nDespite the change in Han Sen’s appearance, the demonic beast soul wouldn’t turn him into a xenogeneic. He would have both the Red Blood Demon’s power and his own human power.\n\n“In demon mode, I would probably have enough power to fight the Red Blood Demon reliably. So even if I ran into the Red Blood Demon again, I wouldn’t have such a hard time.” Han Sen tried to explore the breadth of the beast soul’s power. The demonic power it wielded was greater than Han Sen had expected. He liked it more and more.\n\n“But what does the incomplete part mean? Does that mean the Peacock King beast soul and the Red Blood Demon beast soul can still be upgraded? If so, how do I make them complete beast souls?” Han Sen thought to himself."
}