{
    "chapter": 1034,
    "title": "The Phoenix Descends and the Emperor Dies",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1034",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was shocked. He was a strong man, and he could lift even the heaviest of items. This feather, though, would require a heft far beyond his capabilities. U.pdated b.y\n\nIt was heavier than any metal he had ever known. But not wanting to give up, Han Sen flexed and prepared to give it another go.\n\n“Is this metal? Or is it the actual feather of some bird? Hmm, but if it did belong to a bird, how could such a creature possibly fly with a wing full of them?” As he thought, Han Sen tried dragging it from left to right.\n\nThe feather was almost like a hiltless sword. It made for a supremely sharp blade.\n\nHan Sen brought out a z-steel stone and ran it against the feather. With remarkable ease, the z-steel stone was split in two as if it were made of butter.\n\nEven with Taia, he had to use much strength to cut through things.\n\nWhen Taia was in Han Sen’s hands, it could be used to slay super creatures in the Third God’s Sanctuary.\n\nIf Taia had been wielded by a mere evolver, its use would mean a struggle to kill a measly creature of even the First God’s Sanctuary.\n\nBut without much effort, weight, or force, the feather effortlessly cut the z-steel stone in two. It was like magic.\n\nPerhaps its weight correlated to its strength, and that was why? Either way, it was remarkable.\n\nLooking at the edge of the feather, Han Sen had a sickly feeling. It looked so thin.\n\nGiving the feather another wiggle, he did so with greater care. It was almost frightening how sharp the feather was. It felt as if it had the power to tear through the fabric of space and time.\n\n“This is quite the prize. Since I found this thing up here, on Phoenix Mountain, I will call it the Phoenix Sword.” Han Sen had never been proficient when it came to naming things.\n\nHan Sen brought out his Taia sword. Their lengths were different, but they would make a fine duo. With them, he could practice Double Fly.\n\n“I need to practice Double Fly. If I don’t, it would be a waste of two good swords,” Han Sen told himself.\n\nIf he left the area now, with Phoenix Sword, he’d have been satisfied. He didn’t even care much for finding a way into the shelter, anymore.\n\nBut he had initially ventured to this place in the hopes of rescuing Brother Seven from a callous spirit.\n\nHan Sen left the tree with a renewed vigor for finding an entrance into Phoenix Shelter.\n\nAll of a sudden, though, he was hit with a strange sensation. It felt as if the mountain had been missing something.\n\nGod Mountain’s peaks were like petals, but from where he now stood, he could see that there was something amiss.\n\nHe only noticed what was missing because he was at the highest point. Han Sen did not know much about Feng Shui, so if he had been farther down, he never would have noticed it.\n\nHan Sen packaged the Phoenix Sword, picked up Bao’er, and went towards a parcel of the mountain that lacked the distinct features to have it fit in with the lotus-petal-collage.\n\nIt was situated at around the halfway point of the mountain. Not needing to fly, he just slid his way down.\n\nHe came to a stop on a stone platform, and he turned to look at a copper wall that skirted the back of it.\n\nIt had been dressed in a variety of vines, ones which Han Sen promptly removed, in the hopes the copper wall would be another metaphysical doorframe.\n\nUnfortunately, after pressing against the copper in every way he could, nothing was revealed. It was solid.\n\nHe was stubborn, though. And he kept on feeling the copper wall, determined to find something. Eventually, his hands ran across a strange indent.\n\nIt was like a little slot, and around as thin as Bao’er’s arm.\n\nHe brushed away more of the vines to reveal it as a written character. Removing more of these vines exposed a number of different words that were written in a language Han Sen was unfamiliar with.\n\nHan Sen summoned Thorn Baron, to ask her if it was a language of the spirits.\n\nHer answer was, “Yes, these are spirits words.”\n\n“What do they say?” Han Sen asked.\n\nThorn Baron had a curious, almost perplexed look on her face, and she said, “The phoenix descended on God Mountain and the emperor died.”\n\nHan Sen didn’t really understand, and so he asked Thorn Baron if she understood.\n\nShe told him, “Well, I can read it, but even I am not sure what it all means.”\n\n“Does it say anything else?” There was very little to go on, so he thought there had to be more.\n\nThorn Baron frowned and just said, “The words are strange. They don’t have meaning.”\n\nThorn Baron continued reading the inscribed words, but they made little sense. There was no cohesion or form to what was written. It was all mumbo-jumbo.\n\nThorn Baron then said, “I know what each word means, but it’s all jumbled up like nonsense. There is no meaning to what comes past the first line.”\n\nAs they discussed this, the platform trembled as if an earthquake had just begun."
}