{
    "chapter": 1329,
    "title": "A Killer Opportunity",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1329",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen Three-Eye Emperor and Gu Demon Emperor moved to fight, No God Emperor decided to join in the fray, as well. But he wasn’t going to fight Han Sen’s companions; he was going to assist Ruin Emperor in his duel instead.\n\nNo God Emperor had come to understand Han Sen was a far greater threat to the spirits in the Third God’s Sanctuary than Godslayer Luo had ever been. And he believed him to be far worse than the girl who appeared to be Godslayer Luo’s heir, who was currently doing battle with the Cup Demons.\n\nHan Sen’s powers of time and space were still trapped by Ruin Emperor. So, No God Emperor no longer had to be afraid of a sudden kill by his fearsome Ghost Slash.\n\nDong!\n\nHan Sen used his arms swiftly and effectively to block a surprise attack delivered by the No God Sword. His jade-like arm was delivered a fair scratch.\n\nRuin Emperor threw a punch towards Han Sen’s belly. After deflecting the No God Sword, Han Sen had a short window to execute a dodge. He did so without worry.\n\nHe was exemplary, and if anything, No God Emperor’s decision to help out only made the situation more embarrassing for the spirits. Han Sen was able to deal with the two of them together just fine.\n\nThe spirits were all frozen, watching this. They each welled-up with a mixture of different emotions. No God Emperor and Ruin Emperor, despite working together, were unable to defeat the human emperor. It was a human; it should have been a one-and-done affair.\n\n“That is one powerful human.”\n\n“Ruin Emperor and No God Emperor can’t kill the guy when working together? Is this for real, man? Is that even a human, man? What’s going on, man?”\n\n“I didn’t think it was possible for humans to achieve such power. Since when have they been able to reach such lofty heights of might?”\n\nThe spirits could hardly believe what their eyes were telling them, and it began to change their perception of humans. They weren’t weak if they were given the opportunity to prove themselves and grow.\n\nAnd in the Third God’s Sanctuary, up until now, weak humans were all they ever saw. And seeing such weakness prompted them to keep them down through brutality and slavery.\n\nOnly a few humans had what it took to take on a royal spirit. And fewer still could take on a king class.\n\nHan Sen was now battling with Ruin Emperor and No God Emperor, two of the strongest spirits in the Third God’s Sanctuary, simultaneously. And what’s more, he was showing no sign of losing.\n\n“Oh my days! You’re telling me that pretty boy over there is a human?” Flower Empress exclaimed, almost smitten by the man.\n\n“Although most humans are weak, there is the occasional smattering of strong ones. And more often than not, they can be the falling of small stones that start an avalanche,” East Empress said.\n\n“Have you met or seen any of these other strong humans? What about Godslayer Luo?” Heavenly Empress asked.\n\nEast Empress told her, “No, not Godslayer Luo. There was one I knew, but that was a century ago. That human was able to kill Dark Ghost Beast.”\n\n“A human killed Dark Ghost Beast?” Heavenly Empress and Flower Empress were both shocked, both obviously familiar with the name Dark Ghost Beast. It was a berserk super creature that had opened ten gene locks. The beast was almost as strong as No God Emperor.\n\n“The human dominated the creature…” East Empress said this and trailed off, as if she was plummeting back into a fond reverie of days long gone by.\n\n“What kind of human was he?” Flower Empress asked.\n\nEast Empress responded to her, saying, “I’m not sure. And I’m even less sure of what happened to him or where he went. I recall his name to be God’s Retribution.”\n\nHan Sen wouldn’t be surprised hearing this, for he had encountered him before. He was a member of Blood Legion, with blue blood. It was no surprise, with the strength he demonstrated, that he would be able to kill berserk super creatures.\n\nFlower Empress did not know who he was, though. And so she said, “I’m afraid the only person who might actually be able to defeat Han Sen would be The King.”\n\n“It’s been a long time since we saw him, and I can only suppose he’d be calling himself The Emperor by now. I’m not sure if he has opened ten gene locks. But he did grow in strength very fast, and it wouldn’t surprise me if he had,” Heavenly Empress said.\n\n“Yes, where did he go? I bet you he could beat this Han Sen! I still owe him kisses, too…” Flower Empress said, while spinning on her toes.\n\nHan Sen continued to battle Ruin Emperor and No God Emperor. He realized, as the fight progressed, that it’d be impossible for him to defeat them both by solely relying on Jadeskin.\n\nHan Sen fired up his Dongxuan Sutra instead.\n\nHan Sen realized his Dongxuan Sutra had yet to be trapped, so he could still use it.\n\nFor a fight like this, Han Sen had an inkling that the Dongxuan Sutra was on the precipice of breaking through and having its tenth gene lock open.\n\nHan Sen wasn’t going to squander the opportunity, so he decided to abandon his initial idea of summoning Little Angel and just kept Dongxuan Sutra running while he carried on battling.\n\nThose two emperors were by far the strongest there, and the minor wounds Han Sen was being dealt were starting to add up. Han Sen’s back already had more than a few wounds, and No God Emperor had just delivered another strike there with his No God Sword.\n\nHe had finally started to bleed.\n\nIt wasn’t serious, but Han Sen’s mood shifted. His body was incredibly strong, but it was almost scary, learning Jadeskin could not protect him forever.\n\nBut that wasn’t the primary reason for why his mood changed and the expression on his face differed.\n\nHe felt as if he was teetering on the brink of breaking through. Unfortunately, he kept falling short, and he couldn’t surpass the verge and begin the process that would open his tenth gene lock. It was like he was being held back all that time.\n\nThis latest strike had now changed things, though, and it told him what he needed to do to open the tenth gene lock.\n\n“What is this?” Han Sen thought to himself.\n\n“Do I have to get hurt for the next gene lock?” Han Sen decided to stop dodging and blocking. He stood firm and allowed his body to become recipient to the barrage of attacks that were headed his way.\n\nHan Sen had been using Dongxuan Sutra to dodge, but now he wasn’t. No God Emperor and Ruin Emperor were surprised and a little concerned when they saw the change of attitude."
}