{
    "chapter": 2300,
    "title": "Recruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2300",
    "text": "“This cup of tea for a part of a Duke’s xenogeneic gene. I appreciate the exchange,” Han Sen said politely.\n\nBai Canglang looked surprised. Then he smiled and said, “Good! Good! Good! I like greedy people.”\n\nAfter that, Bai Canglang’s smile disappeared. He looked at Han Sen seriously and said, “I want you. How much are you worth?”\n\n“One hundred King class xenogeneic genes,” Han Sen said.\n\n“Good! That is far cheaper than I expected. You are certainly worth the price,” Bai Canglang answered without hesitation. He nodded vigorously.\n\n“For one year,” Han Sen finished.\n\nBai Canglang looked at Han Sen with shock. One hundred King class xenogeneic genes was not a high price for Prince Fourteen of the Extreme King.\n\nBut one hundred King class xenogeneic genes for a measly year of service from a Duke? That was something that had never happened before. For that price, Prince Fourteen could have bought a lifetime of service from twelve Dukes.\n\n“How much will it cost to buy you permanently?” Bai Canglang asked. His voice was curious, but not angry.\n\n“One hundred King class xenogeneic genes for a year is a fixed price. I offer no sales or bulk rates here. You buy each year, for as long as you want me,” Han Sen said with sincerity.\n\nBai Canglang laughed. He pulled out a tablet and set it down on the table. He said, “I will use this to purchase your services for a hundred years. I am leaving tomorrow. It is your decision whether or not you will choose to accompany us.”\n\nAfter that, Bai Canglang stood up and left. He did not look back.\n\nHan Sen looked at the tablet on the table. It was a green jade tablet that was around the size of a man’s hand. Both sides bore depictions of dragons, and they each looked as if they were clutching a ball between their claws. On both sides of the tablet, the name Canglang was written.\n\n“This is Brother Fourteen’s Royal Guard tablet. You need to be at least King class to be considered one of his Royal Guard,” Bai Wei explained. Although Prince Fourteen had left, she was still standing there, staring at Han Sen.\n\n“I am just a minor Duke. I’m not worth Prince Fourteen bending the rules for, I assure you,” Han Sen said, while playing with the tablet.\n\n“Brother Fourteen came here to recruit your teacher Knife Queen, but she refused. He is now going for the second-best option, which is you. He wants you because you are her student.” Bai Wei paused and then went on to say, “It seems like you have made him angry.”\n\n“There is nothing I can do about that. I won’t agree to a deal just because someone is having a hissy fit.” Han Sen shrugged.\n\nBai Wei suddenly reached her hand out to Han Sen. “Give it to me.”\n\n“What?” Han Sen asked, pretending to be surprised.\n\n“Don’t give me that. Hand over the Undying Bird Nest,” Bai Wei grunted.\n\n“You can’t take it away. Why should I give it back?” Han Sen felt sick. The bird’s nest had been destroyed by the little red bird, so there was nothing to return.\n\n“Whether I take it or leave it is my decision. And I’m telling you to give it back.” Bai Wei’s voice was cold.\n\n“I would like to return it, but the item broke the last time I used it.” Han Sen opened his hands with the confession, looking apologetic.\n\nHan Sen didn’t think he could hide the fact that the bird’s nest was gone, so he had no choice but to admit the truth.\n\nWhen Bai Wei heard his apology, she laughed. She smiled at him and said, “I’d expect a better excuse from a thief. You know, the Bai family is not one you can so easily shrug off and ignore.”\n\nBai Wei didn’t believe for a second that the Undying Bird Nest, which was a deified item, had been broken. Not even a deified elite could break it.\n\n“It is true! I’m not lying.” Han Sen looked at her very earnestly, forcing an innocent expression onto his face.\n\nBai Wei sneered and rolled her eyes. She wasn’t happy to hear about this.\n\n“Fine! If you do not want to return it, pay back your debt by being my Royal Guard.” Bai Wei poured herself a cup of tea, as if she was some sort of repo woman.\n\n“Ten years.” Han Sen gritted his teeth as if he had just made a big decision.\n\nBai Wei smiled clearly. She had a sip of tea before saying flatly, “Serving me is just a way of paying interest on the loan. When you return the Undying Bird Nest, then you can go. I will do nothing to stop you.”\n\n“How does that work?” Han Sen blinked.\n\nBai Wei smiled. “Give me the Undying Bird Nest or be my Royal Guard. The choice is yours to make. I do not like forcing people into doing something they do not wish to do.”\n\nHe couldn’t refuse both options. The nest was gone, but if he refused to go with them, he’d be forced to fight them. That was also beyond his abilities.\n\nBai Wei sighed and said, “Actually, you have no choice. Brother Fourteen won’t give up easily. I bet that if you don’t become my Royal Guard, he will do everything he can to bring you in close to him. His purpose, ultimately, is your teacher Knife Queen, mind. You will be used as a pawn or a tool to get to her.”\n\nAfter pausing, Bai Wei went on to say, “At least my desire for your service is genuine. I really just want you and not your teacher.”\n\n“It looks like I have no alternatives here.” Han Sen gave Bai Wei the tablet. “Help me return this to Prince Fourteen, then.”\n\nBai Wei wanted him, and Bai Canglang was incredibly annoying. Han Sen would opt for Bai Wei if it meant he didn’t have to deal with the irritating prince.\n\nBai Wei took the tablet, then glanced around the garden. “Where are your sister and daughter? They can come, too. I do not mind bringing on more people. Although they cannot be Royal Guards, I can promise you that they will be treated well.”\n\n“They say thank you, but no thank you,” Han Sen answered immediately, turning down Bai Wei’s offer. The Extreme King trip would be a dangerous voyage. It was a good opportunity, but Han Sen didn’t want to expose Han Meng’er and the others to unnecessary risks. He was only going to bring Bao’er, the blood kirin, and the little red bird.\n\nBai Wei did not say anything. She pulled a tablet out of her pocket and gave it to Han Sen.\n\nIt was a white tablet adorned with flowers the color of blood. The name Wei was written across it in a simple script. The tablet was a little plain, but strikingly delicate, too.\n\nHan Sen knew that it was Bai Wei’s Royal Guard tablet. He took it and twirled it through his fingers. “What does the Royal Guard of a queen need to do, exactly? I won’t be entertaining you everywhere we go or taking care of your day-to-day needs, will I?”\n\nBai Wei rubbed her nose and said, “You think that members of the royal family spend their days lazing around? There are many members of the Extreme King royal family. If we want resources, we have to fight for them ourselves. Otherwise, even a royal could end up worse than an Extreme King noble.”\n\n“Are things really that competitive?” Han Sen asked skeptically.\n\nBai Wei said, “Father believes in survival of the fittest. That is what he taught us when we were young. We receive basically the same treatment as the other Extreme King nobles. We might have a few extra resources, but not much. If we want more, we need to prove ourselves worthy of it. If you do not work hard, you will end up worse than a commoner. It’s challenging, but we are fairly rewarded for our efforts. You will get a share of everything that you earn under my employ. How much you gain just depends on how much you are willing to help.”"
}