{
    "chapter": 2720,
    "title": "Star Gauge Mirror",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2720",
    "text": "Her eyes brightened with interest.\n\nEmpty God’s lips curled up at the corners. He looked cocky as he said, “Do you want it? Just say you want it and it is yours.”\n\n“Really?” Bao’er looked surprised. She gazed at Empty God with disbelief.\n\n“Of course. As long as you say what you want, a cute little girl like you can have anything you’ve ever dreamed of,” Empty God said chivalrously, his voice smooth and coaxing.\n\n“You’re a great guy!” Bao’er said with excitement.\n\nEmpty God laughed. He held the gem in front of Bao’er and smiled. “Just say you want it, and this gem will then belong to you.”\n\nBao’er looked longingly at the gem, and her hands slowly reached out for the gem.\n\nEmpty God hid a snide smile as he thought to himself, “Female creatures are all alike. They are just like those ugly dragons. No matter how old they are, they love all things shiny.”\n\nBut Bao’er suddenly pulled her hand back. With a look of disappointment, she said, “I actually don’t want it.”\n\n“What? Why do you suddenly not want it?” Empty God asked in surprise. He had been caught off guard when the girl changed her mind.\n\n“Mom says that I can’t take gifts from strangers.” Bao’er’s face looked very serious when she said this, but her eyes were still locked on the gem. It looked as if she was struggling to keep herself from reaching out and taking it.\n\n“I see,” Empty God said with a smile. “You can’t accept things from strangers, of course. But I’m not a stranger. I’m a good friend of your father. You can take something from me because of that, can’t you?”\n\n“You are a good friend of my father?” Bao’er asked, her eyebrows rising.\n\n“Yes. We are very, very good friends.” When Empty God said that, the words he spoke were stressed. Each word was pronounced heavier than the last.\n\n“If you are Dad’s good friend, then we really aren’t strangers!” Bao’er said happily.\n\n“Of course we aren’t!” Empty God said with a shake of his head.\n\n“Thank you, Uncle. In that case, I’m going to take the gem.” Bao’er reached out her hand to grab the gem in Empty God’s hands.\n\nAs she reached toward it, Empty God wasn’t sure if he should let it go or continue holding onto it. Bao’er hadn’t declared her wish yet. If she took it now, Empty God wouldn’t receive anything in return.\n\nEmpty God didn’t respond, and Bao’er stared at him with confusion. She said, “Uncle, do you not want to give me the gem? If that is so, then that is fine. Mom told me not to steal other people’s items, anyway.”\n\nBao’er’s words might have been gracious, but her face was filled with disdain. She thought Empty God was very cheap by not giving her the gem.\n\n“Ahem, ahem. You still haven’t told me whether or not you want it,” Empty God said. He was looking a bit uncomfortable now.\n\n“Uncle, this gem is obviously important to you. You should keep it for yourself.” With those words, Bao’er lowered her hand and turned around to leave.\n\nAlthough she didn’t say anything more, she had a look of scorn as she turned away. It made Empty God feel more depressed than he had in a long time.\n\nHe was Empty God, but he was despised by a child.\n\n“Don’t go, Bao’er! Your uncle was planning on giving you this gem as a gift. I wasn’t in my right mind. You should take it from me now.” Empty God didn’t really care about the gem, and giving it to Bao’er might allow him to gain her trust. He wasn’t going to let her run off so easily.\n\n“You are really going to give it to me? Aren’t you going to miss it?” Bao’er looked wonderingly up at Empty God.\n\n“To me, this gem is just a measly rock. It is worthless compared to the other things in my possession.” Empty God placed the gem in Bao’er’s hands.\n\n“Thank you, Uncle. You are a good guy.” Bao’er held the gem and smiled.\n\n“I’m glad you like it.” Empty God smiled, but on the inside, he was thinking, “I was worried you wouldn’t take it. Now that you’ve fallen into the habit of taking things that I offer, this should be easy.”\n\nBao’er really liked the gem. She focused her attention on it carefully as she played with it.\n\nEmpty God reached into his pocket and brought out another gem that was even bigger and prettier than the first. He said, “Bao’er, do you not think this gem is even prettier? Would you like it?”\n\nBao’er looked at the gem in Empty God’s hand. It was as large as a man’s fist. She blinked at the sight of it and said, “It is way too big. I’d feel rather snobby if I had it. I like this one more.”\n\nAfter that, Bao’er went back to playing with the gem in her hands, completely ignoring Empty God.\n\nEmpty God felt depressed. He had assumed that offering a bigger and prettier gem would get Bao’er to put blind faith in him. Instead, however, the gem had led to his abandonment.\n\n“It looks like using gems to attract Bao’er will no longer work.” Empty God rolled his eyes and came up with something new.\n\n“Bao’er, look at this.” Empty God stepped over to Bao’er and pulled out something to show her.\n\nBao’er was sitting atop the Star Fruit, but she raised her head to take a look. Empty God was holding an old bronze mirror. The mirror was only ten centimeters long, and it looked very delicate.\n\nThe front was smooth and glossy. On the back of the mirror, lines spread from the center of the mirror to its edges, like a sundial or a compass. Strange symbols were etched in each space between the lines.\n\n“What is this?” Bao’er asked Empty God with curiosity. The man was holding the mysterious mirror out so that she could see it.\n\n“This is the Star Gauge Mirror. It is a true god-class treasure. This device will allow you to see the past and the future,” Empty God said, lavishing praises on the old mirror he was now presenting. Although he was embellishing what it was capable of, the mirror really was quite special. Empty God had wanted the mirror badly, and it had taken him a lot of time and effort to get his hands on it.\n\nEmpty God and King Jun called themselves God, but they couldn’t make something out of nothing. Everything that they could use or control already existed in the universe in some form. They couldn’t just magically conjure up any item they wanted.\n\nThat Star Gauge Mirror was a precious treasure that had come from a true god elite who had lived a billion years ago. Empty God had struggled to lure that true god elite for hundreds of years before the elite fell into his trap. The elite made a wish, and Empty God stole the elite’s lifespan. He also gained control of the Star Gauge Mirror.\n\nEmpty God was very proud of what he had accomplished. There had been another God that was also trying to trick the true god, but he had failed. Empty God had claimed the victory and the treasure. So, even though the mirror might have been useless, he still carried it around with him. Now, it presented a perfect opportunity to trick Bao’er.\n\n“Is the mirror really that powerful?” Bao’er asked in disbelief.\n\n“Of course, it is. Just watch it,” Empty God said. His hands pressed against the Star Gauge Mirror, manipulating the symbols on the back.\n\nA flickering light appeared on the surface of the old mirror. After a while, the light resolved into a slightly unsteady image, like a show playing on an old TV.\n\nThe Star Tree stood in the center of the image. There were a bunch of Star Beetles swarming over the tree like an ocean wave. Han Sen was fighting those Star Beetles.\n\nUpon closer inspection, Bao’er realized that it was an image of Han Sen participating in the test at the Star Tree."
}