{
    "chapter": 2638,
    "title": "Demon Abyss Beast King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2638",
    "text": "“Yu Kun has practiced the Deep Abyss Demon Spell. If he gets the Demon Abyss Beast King’s deified gene, he can become deified. But the fact that he has managed to secure Han Sen’s assistance is surprising,” Zuo Yu said emotionlessly.\n\n“I have heard he gave Han Sen the Wood Spirit Rhino in exchange for his services. That is why Han Sen agreed to help,” the Sky Palace student said.\n\n“I see. Then, it makes sense,” Zuo Yu nodded.\n\n“Mr. Zuo Yu, Yu Kun is still under suspicion. Should we prohibit Han Sen from helping him slay the Demon Abyss Beast King?” Zuo Yu shook his head. “No. Han Sen is like a son to the leader. If he is willing to help Yu Kun, Sky Palace Leader must have given his approval. We will take the backseat and observe for a while.”\n\nAfter a pause, Zuo Yu said, “Go and find Shiya. Tell her to prepare. She will be going to the Demon Abyss on a trip with me.”\n\n“You are going to the Demon Abyss yourself?” the student asked with shock.\n\n“We do not understand our target yet. This will be a fine opportunity to learn more about Han Sen and Yu Kun,” Zuo Yu said coldly.\n\nAs Han Sen and Yu Kun traveled toward Demon Abyss, Yu Kun seemed very relaxed. Aside from Han Sen, he hadn’t hired anyone else to help with the hunt.\n\nHan Sen had accepted payment for the job, so there was nothing else he could do. He had no choice but to help the man.\n\nAfter making his agreement with Yu Kun, Han Sen had received a detailed synopsis of the Demon Abyss Beast King from Sky Palace Leader. The file contained essentially the same information that Yu Kun had already given him. Han Sen had a seventy percent chance of killing this beast.\n\nOf course, there was always the chance that the Demon Abyss Beast King would be stronger than the reports stated. It could have evolved, too. So, Han Sen had to be very careful when calculating his odds. There was a lot to account for.\n\nThe Demon Abyss was a giant hole in space with a massive star inside it. Space seemed to have collapsed under the weight of the enormous star, but then the star had reached an odd state of equilibrium instead of exploding as stars usually did under such conditions.\n\nThe space hole contained many xenogeneics. Sky Palace students often enjoyed hunting there, but ordinary students wouldn’t venture too far into the Demon Abyss. They could always hunt the low-level xenogeneics that remained on the outskirts, which would be far safer for the students than heading to the interior of the space hole.\n\nWhen the nearby Sky Palace students saw Han Sen and Yu Kun approaching, they all came forward to bow. It was mainly a show of respect for Han Sen. They only called Yu Kun “uncle” because formality required them to.\n\nHan Sen observed their faces, guessing they must have known about Yu Kun and the allegations.\n\nYu Kun didn’t pay any attention to their barely-veiled disdain, though. With Han Sen, he pushed on deeper into the Demon Abyss. He avoided the larger groups of xenogeneics, obviously not wanting to waste time on low-rank creatures.\n\nHan Sen followed Yu Kun through the Demon Abyss for two whole days before they reached their destination. There, they saw the Demon Abyss Beast King talked about in legends.\n\nThere had been videos of the creature in the file that Han Sen had received, but there was a big difference between seeing a creature on a video and in real life. The sight of the beast was astounding.\n\nIt had a scorpion body and a dragon head. Dragon wings spread from the creature’s back, and it was covered in blue scales. The head had eight pairs of draconic eyes. So, there were sixteen eyes in total. Its body was one hundred meters tall. Even the sight of the creature was horrible and disturbing. It was sleeping on one of the walls in the Demon Abyss. It was like a drowsing demon.\n\nHan Sen summoned his peacock king’s soul robe and his Six Core Snake Bow. Then, he turned to Yu Kun.\n\n“Let’s put our plan into action.”\n\n“Sure,” Yu Kun said with a nod. He pulled out his blade. His weapon was a black ring blade that was close to thirty centimeters wide. It looked incredibly sharp. It was a very rare and weird weapon.\n\nHan Sen drew the string on his bow, but before he could release it, the Demon Abyss Beast King woke up. Its sixteen eyes peered at Han Sen.\n\nHan Sen didn’t hesitate. He fired at the Demon Abyss Beast King, sending an arrow imbued with rainbow light soaring through space. It flew straight toward one of the Demon Abyss Beast King’s eyes.\n\nBut just as the arrow approached, the Demon Abyss Beast King’s eye opened like a black hole. The arrow disappeared into the black hole, then vanished. The Demon Abyss Beast King was not injured.\n\nThe Demon Abyss Beast King screamed weirdly. It flapped its wings, making its body shine with a shimmering blue light. As it flew, the creature’s wings looked strangely beautiful against the background of the Demon Abyss. A writhing substance chain emerged from the creature and came flying toward Han Sen.\n\nHan Sen drew his bow and fired again and again, sending many rainbow light arrows at the Demon Abyss Beast King. The Demon Abyss Beast King didn’t care. Han Sen aimed at several different places across the creature’s body, but wherever his arrows landed, a black hole manifested. The arrows flew into them and disappeared. None of them could deal a speck of damage to the Demon Abyss Beast King’s body.\n\nBoom!\n\nThe Demon Abyss Beast King opened its mouth. Suddenly, a blue flood poured out of it like a volcano erupting. It was headed straight for Han Sen.\n\nHan Sen’s body flashed away quickly to avoid that flooding blue substance chain. He didn’t retreat, though. He continued to fire his arrows, getting closer and closer to the Demon Abyss Beast King.\n\nHan Sen was like a surfer riding a tsunami that would end the world. The sky was full of blue energy, but it didn’t hurt him. That primitive class Demon Abyss Beast King couldn’t do anything to harm him.\n\nFrom some distance away, a Sky man and woman watched the unfolding battle.\n\n“What powerful movements!” the woman said, complimenting Han Sen’s efforts. “His movement isn’t the truly impressive thing,” replied Zuo Yu. He shook his head and said, “The remarkable thing is his ability to judge and analyze details. His body responds with perfect precision.”\n\n“Precision?” Shiya frowned.\n\n“You can see him falling back on the left. Before he fell back to the left, though, his body leaned right. And while leaning seventy degrees to the right, he fired three arrows. He did it all at the same time. He misled the Demon Abyss Beast King, tempting the creature into spitting its demon stream to the right. That, in turn, forced the Demon Abyss Beast King to go right. It gives him the space to go left. So, he has the time to move to a more advantageous position for his next attack. Details like that are in every single move. If this guy isn’t just insanely OCD, then he is a born fighter,” Zuo Yu said.\n\nShiya looked at Zuo Yu, suddenly unnerved. Han Sen’s skills didn’t look very special, at all. But when she paid attention to the minuscule motions of Han Sen’s body, it was just as Zuo Yu had said. He was moving with amazing precision and planning. Shiya had formed her impression of Han Sen when she saw him fight Exquisite. Those cruel, overbearing, and violent attacks were seared into Shiya’s analysis of who Han Sen was. She considered him a violent man, and so she hadn’t taken the time to look for any finesse in his attacks. Now that she could see it clearly, she was shocked. The way he was fighting now was totally different than the techniques he had employed against Exquisite. It was hard to believe this fighting style belonged to the same person."
}