{
    "chapter": 2603,
    "title": "Eleven Armor Talent?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2603",
    "text": "Exquisite and Bixi were so shocked. A ten armor talent was the highest that a creature of the universe could achieve. Although legends said that a sacred eleventh armor talent did exist, that would be something reserved for mythical beings like God.\n\nEveryone knew of the Very High Alpha, the Ancient God King, and the Sacred Leader. They were mythical figures who fought legendary battles in ancient times. They breached the geno hall and became known throughout the annals of history. There were many others, too, whose legends were passed down through the history of the universe.\n\nBut legends were just legends. No one knew if they had ever even been tested by a God Spirit Touch. Exquisite and Bixi, who were both born in the Very High, had never seen an eleven armor talent before.\n\nBut now, the God Spirit Touch was still moving. It looked as if it was actually going to shed its eleventh layer of shell.\n\n“Is this crystallizer man as strong as the Very High Alpha, the Ancient God King, and the Sacred Leader?” Exquisite was in shock. Even with her personality, she couldn’t keep her eyes from growing wide. She looked at Han Sen and the moving God Spirit Touch in disbelief.\n\nThe Sky Palace students were quiet, too. They thought something had to be wrong. They had been mocking Exquisite and Bixi only a moment before, but now they too were thinking these results were a little too ridiculous.\n\nIt was fair to admit that the Very High were the strongest race. Their talent was top dog, and even Bixi and Exquisite had a nine armor talent. But Han Sen had received ten, and the process still wasn’t over.\n\n“Teacher Han’s talent is a little too much,” the Sky Palace students thought in shock.\n\nThe students of Sky Palace always knew Han Sen had absurd talents, but it was too shocking to consider that his talent might have actually exceeded those of the Very High. They almost couldn’t believe it.\n\nAfter all, the crystallizers of the universe were famous for their technology. Their gene evolution was known to be poor. This was their weakest aspect, and right now, it was trampling the Very High. It was pretty ridiculous. Under the weight of every pair of eyes at the meeting, the beetle that looked around the size of a nail continued to shake. Its body contorted, twisted, and spun with its mouth open. And then, a smaller bug emerged.\n\nThat bug was only the size of a grain of rice. It was oval in shape, and it didn’t look like a God Spirit Touch anymore.\n\nBefore, whenever it shook off one of the initial ten layers, it still looked like a ladybug. But this grain-sized creature was like a silkworm. It was oval in its shape. It looked cute, and it was quite fat.\n\nEveryone was looking at the bug in shock. Even Bixi and Exquisite looked stunned. They owned the God Spirit Touch, but this was the first time they had ever seen the God Spirit Touch behave this way. They had never seen it remove its eleventh shell before.\n\n“Does he really have an eleven armor talent?” Exquisite looked at Han Sen and the God Spirit Touch with a queer stare. Her eyes kept twitching as thoughts ran through her mind.\n\nHan Sen looked at the God Spirit Touch on the table. He kept thinking, “Weird. When Glasses tested me, it just told me that my genes were unstable. I was unable to get a result. How can this bug keep peeling away its layers? If Exquisite and Bixi are correct about its accuracy, then that means my talent is awesome.”\n\nBut Han Sen didn’t feel as if his talents were strong. At least, that was the way he felt when he practiced with The Story of Genes. Whenever he had to work with that, he felt practically useless. His ability to continue leveling up was completely dependent on resources.\n\nAs Han Sen was thinking, the God Spirit Touch moved. It shook and shivered frantically, as it moved toward Han Sen.\n\nBixi and Exquisite were shocked about this, too. The God Spirit Touch was just a xenogeneic Bixi had captured. Although it was half-deified, it wasn’t deified yet. It couldn’t fight. Due to the fact that it was very sensitive to the genes in one’s blood, it was a very rare xenogeneic.\n\nUsually, any Very High that encountered a God Spirit Touch would try to claim and tame it with secret skills. The God Spirit Touch was loyal until its master died. Only then would it try to find another master.\n\nIf Bixi didn’t give a command, the God Spirit Touch wouldn’t move. But right now, although Bixi hadn’t given a single order, the little creature started moving over toward Han Sen. This shocked Bixi.\n\nBixi’s heart jumped. He tried to call the God Spirit Touch back, but it ignored his command. It kept crawling over to Han Sen, and that gave Bixi a shock.\n\n“What is going on?” Bixi looked dumbfounded. He couldn’t understand this, and he looked at Han Sen and the God Spirit Touch with a befuddled expression.\n\nThe God Spirit Touch was a half-deified xenogeneic, but its power wasn’t like that of an ordinary xenogeneic. Its body wasn’t strong. It had the toughness of a half-deified, but not the attack power. It couldn’t even fly.\n\nIn space, it could float. But on land, it could only crawl.\n\nHan Sen saw it climb over to the edge of the table. Then, it fell off. Han Sen caught the little creature in his hand.\n\nThe moment Han Sen touched the God Spirit Touch, he felt its will enter his brain. His mind was full of messages that begged him.\n\nIt wasn’t a language, just an overwhelming sense of desire. Han Sen was able to understand it was begging.\n\n“I beg you… help me evolve…” That was what it meant. The little creature’s mind was full of sincere begging.“How can I help you evolve? You want more of my blood?” Han Sen wondered aloud. He didn’t know how to help the God Spirit Touch exactly.\n\n“I beg you… help me evolve…” The God Spirit Touch kept sending him this message. “It looks like this guy isn’t so smart after all,” Han Sen thought.\n\nBut Han Sen realized it might not have wanted blood. There were still traces of blood on the tip of Han Sen’s finger, but the God Spirit Touch wasn’t interested in it. It kept sending its pleading message.\n\n“If it doesn’t want my blood, then the only way I can help it is with my Blood-Pulse Sutra. But my body has yet to recover. I don’t have much energy, and so, my Blood-Pulse Sutra is weaker than usual. I don’t know if it will work on him,” Han Sen thought to himself.\n\nHe cast his Blood-Pulse Sutra. He made his self-cogwheel connect with the God Spirit Touch’s self-cogwheel. And then, they spun.\n\nHan Sen wanted to see what the God Spirit Touch wanted.\n\nBefore, when Han Sen used his Blood-Pulse Sutra, it was difficult. Whether he was using it on Lando, Barr, or Gu Qingcheng and Elysian Moon, it had cost Han Sen all his strength to push their cogwheels.\n\nBut this time, Han Sen only had to use a small amount of power to push the self-cogwheel of the God Spirit Touch. It spun quickly."
}