{
    "chapter": 2715,
    "title": "Gru’s Invitation",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2715",
    "text": "Suddenly, Han Sen’s eyes brightened with a thought. “I don’t have access to the creatures of the sanctuary, but there are xenogeneics within range. If I grab one and use it to test the crystal, it might yield the same results.”\n\nOnce Han Sen decided what to do, he didn’t have to go far to test his theory. He would just grab a King class Star Beetle from the Star Tree.\n\nHan Sen arrived at the Star Tree a short time later, but after half a day of searching, he failed to find a single Star Beetle. Since Star Beetles were no longer an option, Han Sen tried to decide where else he might look.\n\n“It looks like the Star Beetles aren’t back yet,” he murmured to himself. “I guess I will forget about continuing my search for them.”\n\nHan Sen jerked his head up as he noticed a presence approaching the Star Tree. When the distant figure drew closer, he recognized that it was Gru from the Extreme King.\n\n“This is the Star Tree. Without the leader’s permission, you cannot enter here,” Han Sen said, blocking Gru’s passage.\n\nIn fact, Han Sen didn’t actually have to warn the man. There was a seal around the Star Tree already. If any creature entered the area without permission, an alarm would be triggered.\n\n“I was looking for you at Underworld Lake,” Gru answered. “I couldn’t find you there, so I thought you might be here. It looks like I was correct.”\n\n“Why have you come looking for me?” Han Sen asked, keeping his face carefully neutral.\n\nThere was a deep-seated grudge between him and the Extreme King. If an Extreme King like Gru had come looking for him, that was reason enough for him to be wary.\n\nGru smiled. “Please don’t misunderstand me. I mean no harm. My people do have a grudge with you, but not all of us think it is a matter that must be resolved with bloodshed.”\n\nHan Sen knew instantly what Gru meant. There were many factions within the Extreme King. The strongest faction was the Bai family—the group led by King Bai. There was also the Bao faction, which Han Sen had recently become familiar with. They were from King Bao’s bloodline. Although they were no longer true royalty, the Bao family still had a lot of influence over the hearts and minds of the Extreme King. There were other groups in addition to those two noble factions, as well. The political situation within the Extreme King was quite complicated, and being an outsider, Han Sen had never been able to fully grasp the way things worked there.\n\nHan Sen didn’t know which faction Gru belonged to, but it sounded as if his party had little interest in troubling Han Sen. Or at the very least, they weren’t interested in actively starting a conflict.\n\n“What is it, then?” Han Sen had almost killed Gru in the silkworm bout. He didn’t think Gru would be generous enough to forget about all that and come over for a nice conversation.\n\nGru looked serious as he said, “I have found a lone primitive deified. I’m not confident in my ability to kill it by myself, so I was hoping we could kill it together.”\n\n“That doesn’t sound like a good idea,” Han Sen said after some hesitation.\n\nThere was absolutely no trust between the two men. And on top of that, they had been enemies the last time they met. Even if they were friendly with each other, it was always difficult for two people to decide how to split the loot obtained from slaying a deified creature.\n\nGru could see what Han Sen was worrying about, and so he said, “You might not believe me, but I truly mean you no harm. I actually admire you, truth be told. That’s why I am inviting you to slay a xenogeneic with me. I can’t do it myself, and I would like to see your knife skills again. I want to learn from you. In regards to the loot, that’s no cause for concern. Whatever rewards we obtain, we can split them evenly between us. Half and half.”\n\nHan Sen gazed at Gru without speaking. He was still hesitating.\n\nThere were outliers like Gru among the Extreme King, people who truly weren’t bothered by who Han Sen was or the things he had done. However, Han Sen had no way of finding out if Gru truly felt that way. This might be some secret ploy for revenge. If he went with Gru, he might be walking into a trap. After spending some more time thinking about it, Han Sen decided to reject Gru’s offer. “I’m sorry, but I have other things to do. I can’t go and hunt xenogeneics with you.”\n\nGru looked disappointed, but he understood what Han Sen was worried about. He nodded and said, “Then I won’t try to force you to join me. If you decide that you want to hunt a xenogeneic, you can always come and find me.”\n\nAfter watching Gru take his leave, Han Sen pulled out a map of Outer Sky. The entirety of Outer Sky was far too large to be represented by such a small map, so only a small part of the domain had been drawn. It included the living quarters of the Very High, the Star Tree, and Underworld Lake. Those were places Han Sen was already familiar with.\n\nThere were some markings on it that Han Sen had never visited, though. They referred to places where scary xenogeneics could be found.\n\nHan Sen examined the map for a while. He found a place close to the Star Tree that was called Full Moon River. He decided to go there to grab a King class xenogeneic to test the black crystal.\n\nHe had briefly considered swallowing the black crystal to test it on himself, but he had quickly concluded taking such a rash action would be foolish.\n\nThere were many scary xenogeneics in Outer Sky, but places that were close to the living spaces of the Very High only had xenogeneics that were King class and below. Full Moon River was one such place. There were no deifieds there, but the river region did contain many Kings. One of them would be perfect for Han Sen to capture and use as a test subject.\n\nHan Sen flew in over Full Moon River, examining the area from high in the sky. The nearby terrain rolled in a series of low-lying hills that spread far away from the river.\n\nHan Sen had only just arrived at the Full Moon River when he saw a rhino xenogeneic standing atop a cliff. The snow-white creature was staring down the ravine. Han Sen couldn’t tell what it was looking for.\n\nHan Sen followed the beast’s gaze, but there were only clouds down below. They were too thick for anything to be seen through them.\n\nWhile Han Sen was wondering what was going on, he saw some movement within the clouds. A new xenogeneic, which looked like some strange hybrid of a fish and a snake, flew out of the clouds.\n\nThe xenogeneic was like a giant snake with horns on its head. It didn’t have any claws, but wings spread from its back. It was a very odd-looking creature. When it flew out of the clouds, it screamed at the rhino that was on the cliff.\n\nThe rhino and the flying snake were soon fighting on the cliffside. Han Sen could see that neither of them was very strong. They were just second or third tier Kings. This fight wouldn’t be very interesting to watch. He planned to wait until one was injured before he picked one and conducted his test.\n\nBut after Han Sen watched them for a while, he was given a shock.\n\nThe rhino’s skin was super thick, and it had the power to petrify. It was so hard that it was like nothing Han Sen had ever seen at that level. But the weird snake’s area power was also a surprise.\n\nThe weird snake was also white. Its body wasn’t made out of the jade-like material that composed the rhino, but it glowed with some sort of blurry light. The light formed a large seal around it.\n\nWithin that seal, regardless of how much damage the rhino dealt to it, the snake could heal all wounds. In fact, its injuries closed so quickly that Han Sen could barely track the healing power with his eyes.\n\n“There is an area power that heals?” Han Sen murmured to himself. That sort of area power was rare.\n\n“Han Sen, why are you here?” Han Sen was continuing to focus on the fight when, out of the corner of his eye, he saw someone flying toward him. The figure was waving to him from afar. It was Gru, whom he had just turned away earlier.\n\n“I’m here on business. Why are you here?” Han Sen asked.\n\n“The deified xenogeneic I mentioned is around here. Since you said you were busy, I thought I would go and try to take it down myself. I didn’t expect to meet you here, though. What a coincidence.” Gru smiled."
}