{
    "chapter": 2936,
    "title": "Three Questions",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2936",
    "text": "The scariest thing was that Han Sen slowly noticed that his own eyes were shutting too. It was as if he was becoming extremely tired. He was not able to open his eyes anymore. No matter how much he struggled and tried to open his eyes, nothing seemed to work. His eyelids refused to open. They just wanted to close.\n\n“Stop resisting! It is useless. The sword lights of the nine-eyed sword can rob the vision of every being in this universe. When facing the nine-eyed sword, no creature has an eye.” Nine Thousand King raised his nine-eyed sword. He looked evil as he said, “It is not just that either. When you see the eyes on the nine-eyed sword, you are almost dead!”\n\nAs Han Sen listened to Nine Thousand King’s voice, he was still unable to open his eyes. They were closing completely. He felt as if something was moving in his eyes. It felt as if it was going to blow up his eyeballs and emerge.\n\n“Argh!” Yang Yun Sheng screamed. He held his eyes and screamed like crazy. Somehow, his eyes exploded. They had become two, gaping and bloody holes.\n\n“I gave you the chance to leave, but you did not want to!” Nine Thousand King coldly looked at Yang Yun Sheng. He then turned his gaze toward Han Sen. He was hoping to see the moment Han Sen’s eyes exploded.\n\nHan Sen felt like all of the blood in his body going toward his eyes, preparing to pop them out. He knew the nine-eyed sword was weird, but he had no idea he was actually being dealt damage by it.\n\nThe big goldfish and small goldfish kept their eyes closed. Their eyes were swollen like balloons with a maximum amount of air put into them. They were going to blow up any second.\n\nAlthough Han Sen could not see, in the Dongxuan Sutra, he still felt everything. The only person who had not been affected was Bao’er, who happened to be wearing her sunglasses.\n\nNine Thousand King coldly looked at Han Sen. He was waiting for Han Sen’s eyes to explode.\n\nThe nine-eyed sword power not only exploded eyes. When the eyes exploded, all blood and the lifeforce would seep out of that wound until the person was a dried husk. The person would be dead.\n\nFeeling that his eyes about to blow up, Han Sen suddenly pulled the string of the Dog Crow Bow. He fired an arrow at the nine-eyed sword.\n\nNine Thousand King immediately saw his action. He swung his nine-eyed sword at the teeth arrow that was coming toward him.\n\nThe Dog Crow Bow was very famous, but that was only when it was in Crow Sky Dog’s hands. In ordinary people’s hands, Nine Thousand King did not really care.\n\nNine Thousand King knew Crow Sky Dog very well. He knew the Dog Crow Bow’s power very well too.\n\nDong!\n\nIt traveled through space. The teeth arrow behaved as it teleported. The nine-eyed sword slashed it away. It did not harm Nine Thousand King in the least.\n\nIn the next second, Han Sen’s body weirdly appeared behind Nine Thousand King. He swung his knife toward Nine Thousand King.\n\nNine Thousand King’s expression changed. Han Sen teleported quickly, faster than he could have possibly imagined. It was too late for him to evade, so he waved the nine-eyed sword to block Han Sen’s knife.\n\n“How is that possible?” When the knife and sword collided, his nine-eyed sword was broken by Han Sen. The nine-eyed sword was dead, and the lights were extinguished.\n\nWhen the nine-eyed sword was broken, Han Sen’s knife light was still going toward Nine Thousand King’s back.\n\nDong!\n\nA metallic sound rang out. Han Sen had cut open the gold robe. Inside the gold robe, there was a dark green armor.\n\nHan Sen’s slash was able to break the nine-eyed sword, but it did not leave a mark on the dark green armor.\n\nNine Thousand King waved his right arm. It struck Han Sen’s cause karma knife. It made Han Sen and his knife fly back.\n\nHan Sen’s body hit the pillar of the pavilion. The stone pillar looked ordinary. Once he hit it, Han Sen was unable to break it. He bounced back onto the floor. Blood was pouring out of his mouth. The blood inside his chest was thrashing around like a stormy sea.\n\n“God personality armament?” Han Sen stood back up. He stared at the dark green armor inside the gold robe.\n\n“You have good eyesight.” Nine Thousand King ripped off his gold robe. He revealed the splendor of his dark green armor. Aside from his head and neck, every inch of him was covered in the dark green armor.\n\nThe dark green armor was tightly wound around the body. It looked very powerful. There was a small gap on the plate of the armor. Han Sen looked closer. He saw a closed eye. It made people feel a chill.\n\n“This is the god personality armament Thousand Eye Battle Armor. This nine-eyed sword was just one of the toys I built to try and copy the Thousand Eye Battle Armor. The power it has is not half as strong as the Thousand Eye Battle Armor.” Nine Thousand King looked very menacing as he said, “Since you have seen my Thousand Eye Battle Armor, I will not let you live anymore. It is too late now, even if you want to live and leave.”\n\nHan Sen did not budge an inch. He held the cause karma knife and coldly said, “You can put your god personality armament Thousand Eye Battle Armor to the test. See if it can kill me.”\n\nNine Thousand King frowned. He looked at the god list fights before. He knew the power of the cause karma knife. He had learned the power of the cause karma knife.\n\nThe nine-eyed sword’s damage to Han Sen had been completely absorbed. The cause karma knife was much stronger than Nine Thousand King had imagined.\n\n“If I cannot kill him with one hit, it will be annoying to have him use the cause karma knife power,” Nine Thousand King thought.\n\nHan Sen suddenly said, “Nine Thousand King, what you want is the item in the pavilion. We don’t have to keep fighting. If you can answer me a few questions, I can give you the treasure inside this pavilion.”\n\n“Are you serious?” Nine Thousand King looked at Han Sen with curiosity. He had not expected Han Sen to say something like that.\n\n“I am serious,” Han Sen said. “If you cannot answer me, then it does not count.”\n\n“If you deliberately give me questions that I don’t know the answer to, how am I supposed to answer you?” Nine Thousand King coldly laughed.\n\n“If you are here for the treasure in the pavilion, you must know what it is,” Han Sen said.\n\n“If I answer the question, will you give me the item?” Nine Thousand King did not answer the question. He coldly smiled at Han Sen.\n\n“That is one of the questions. I will only ask you a few questions.” Han Sen did not hesitate. He spoke straightforwardly.\n\n“What questions? Let me hear them first.” Nine Thousand King’s eyes shone. He was not in a rush.\n\n“That was the first question. I have four other questions to ask. Who is the lady depicted in the statue? What is her relationship with Sacred Leader? How many elites are there in Sacred, and where are they?” Han Sen asked all he wanted to know."
}