{
    "chapter": 2513,
    "title": "Gold Armor General",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2513",
    "text": "Bai Wan Jie thought about it for a moment. He seemed to realize why Dragon One and Dia Robber hadn’t hired the Royal Knights.\n\nBai Wan Jie looked at Han Sen, smiled, and said, “I recommend you think about it before you take on this job. Otherwise, you might die without even realizing what happened.”\n\nHan Sen was also wondering why Dragon One and Dia Robber had selected him over the Extreme King crown prince and the Royal Knights. Han Sen couldn’t understand what his would-be employers were thinking.\n\nSeeing Han Sen worry over their decision, Dia Robber said, “Dear Dollar, please don’t misunderstand. We mean no harm to you. We haven’t hired the crown prince because he wouldn’t accept our offer even if we were to hire him.”\n\nHan Sen looked at Bai Wan Jie. The man laughed and said, “If you guys are really going to go after Gold Armor General, then you are correct. I wouldn’t dare take on this task. That isn’t a matter of business; anyone who takes on the Gold Armor General has a death wish. The Extreme King have many King class elites, but we cannot just send them to their demise.”\n\n“Right. We are going to kill the Gold Armor General.” Dragon One looked at Han Sen and went on to say, “Gold Armor General is a very scary being. He is one of the top deified core xenogeneics in the core area. Although we have made extensive preparations, our chances of success are still low. Are you still willing to accept this quest?”\n\n“Well, you wouldn’t be hiring me if the success rate was high.” Han Sen smirked slightly.\n\nUpon hearing his answer, Dragon One and Dia Robber laughed happily. Clearly, Han Sen was accepting their deal.\n\nBai Wan Jie’s face didn’t change, and he said, “My friends, I’m afraid you have no idea what Gold Armor General truly is. Although the xenogeneic deifieds of the core area are weaker, they still have substance chains. They are like cripples compared to the deified xenogeneics of the outside world, but even so, these creatures are not something a King or a half-deified being can challenge. You especially cannot challenge a deified core xenogeneic. Their powers are far beyond yours. That Gold Armor General is one such being. Once upon a time, someone gathered up twenty half-deifieds to hunt him down. In the end, almost half of the team was killed. Are you sure you want to invest so much in this attempt?”\n\nAfter that, Bai Wan Jie looked directly at Dia Robber and Dragon One, and said, “If you guys really want to kill the Gold Armor General, the Extreme King can actually accept this job. But the price has to be measured differently. If you guys are still interested, perhaps we can find a place to discuss this.”\n\n“The crown prince is confident in his ability to take down the Gold Armor General?” Dragon One and Dia Robber’s bodies were shaking. They couldn’t believe what they were hearing, and so they stared at Bai Wan Jie.\n\nBai Wan Jie looked confident, and he smiled. “If we royal knights are unable to slay the Gold Armor General, I can assure you that no one else in the core area can kill it. Why don’t you guys think about this?”\n\nDragon One and Dia Robber looked conflicted. Although they were well-prepared, they still lacked confidence in their abilities to take down the Gold Armor General. If they had been confident, they wouldn’t have hired Han Sen.\n\nBut seeing Bai Wan Jie’s self-assurance, they knew that he must have some way to kill Ghost Armor General. If they didn’t hire Bai Wan Jie, he would probably hire others to kill it.\n\nIf they did hire Bai Wan Jie, given the arrogance of the Extreme King, he would probably demand far more than one thousand King class core genes. They were pretty sure the crown prince would want the Gold Armor General’s xenogeneic gene as well.\n\nDragon One and Dia Robber glanced at each other, then turned back to Han Sen. “Brother Dollar, now that you understand, are you still willing to accept our request?”\n\n“As long as you pay the agreed-upon price, then yes,” Han Sen said simply.\n\nHe didn’t have to guarantee that he would kill the proposed enemy. All he had to do was ensure that he would try his best. Even if he was unable to kill their target, he would be receiving five hundred King class xenogeneic genes.\n\nWith Han Sen’s power, it didn’t matter how strong the Gold Armor General was. Han Sen’s life wouldn’t be in danger. Plus, Han Sen knew that the core area’s deified xenogeneics were weaker than the ones in the outside world.\n\n“In that case, please come to our base for a more in-depth discussion.” Dragon One and Dia Robber said goodbye to Bai Wan Jie. Then, they left with Han Sen.\n\n“Dragon One and Dia Robber have some kind of plan, do they? They really can’t expect Dollar to kill the Gold Armor General, right?” Seeing the three of them leave, Bai Wan Jie frowned.\n\nHan Sen followed Dragon One and Dia Robber to their base. When he reached the case that the Dragon and the Destroyed were sharing, he could tell that they really were co-operating.\n\nDia Robber and Dragon One signed a contract with Han Sen, and then they read the details out to Han Sen.\n\nOriginally, Gold Armor General’s system had been home to multiple Armor General deified xenogeneics. Steel, Bronze, and Silver Armor Generals had lived there as well, and all three of them had been deified. But those three deified xenogeneics had been slain by the attacks of other races. The Dragons themselves had killed Steel Armor General and Silver Armor General.\n\nThey had paid a heavy price to kill those deifieds. That was especially true when it came to killing the Steel Armor General. They had lost many King class Dragons, and they had been forced to hire many half-deifieds of different races too. While they succeeded in killing Steel Armor General, it had been very expensive.\n\nBut for the Dragon, it was all worth it.\n\nAfter they earned the xenogeneic genes of the Silver Armor General and the Steel Armor General, they discovered something shocking. The xenogeneic genes of the two deifieds could work in conjunction, which led to some surprising developments.\n\nAfter this discovery, the Dragons spent a lot of time and power to find and gain control of the Bronze Armor General’s xenogeneic gene. Once they brought that third item into their treasury, they were only missing the Gold Armor General.\n\nMany attempts had been made to bring down the Gold Armor General, and not just by the Dragons. Other races had attempted to kill the Gold Armor General, but they all failed. Steel, Bronze, Silver; each general had been stronger than the last. The Gold Armor General’s power was very close to the power of a real xenogeneic deified of the outside world. It had very scary defensive properties, and so it had proven extremely difficult to kill.\n\nThe other races had essentially given up, but the Dragons didn’t want to throw in the towel. Without the Gold Armor General’s xenogeneic gene, the genes of the three other generals were an incomplete set. It lowered the value of their collection.\n\nSo, the Dragons wanted to kill the Gold Armor General. They had spent a long time preparing for this offensive, and they had a plan to take down the Gold Armor General. Still, they knew their chances of success were low. But when Dragon One found Han Sen, he realized the plan might work. That was why he wanted to do this.\n\nDia Robber had agreed to help the Dragons because he had xenogeneics of his own that he couldn’t kill. He needed the power of the Dragons, and this was a fine chance to see the full extent of Han Sen’s abilities.\n\nIf Han Sen could help the Dragons slay the Gold Armor General, then Dia Robber would also hire him to help slay xenogeneics in the future."
}