{
    "chapter": 2218,
    "title": "Ghost Bone Town",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2218",
    "text": "Sacred had been the strongest faction in the entire universe, at one point in time. It had maintained that lofty position for a while, too.\n\nNow there were the Very High, the Ancient God, and the Extreme King. That trio composed the best of the best. But back then, only Sacred had enough power to govern the entire universe.\n\nThe Sacred leader was the strongest of all, and his ten generals were the strongest elites in existence.\n\nThe ruins that Bai Wenxuan and his teammates found had text that read “Ghost Bone Town,” and there was a statue there of the general himself. They assumed, reasonably enough, that the town had belonged to General Ghost Bone.\n\n“Did General Ghost Bone leave this ruin behind? Even if he did, there was no reason for the Ice Blue Knights to kill you. Who led the Ice Blue Knights back then?” Han Sen asked, while Bao’er stopped filming Bai Wenxuan.\n\nHan Sen had spent some time investigating Sacred after the incident with the Purple-Eye Butterfly, but the events had taken place too long ago, and much of what happened was erased or lost to the annals of time. There wasn’t much about them left to learn. The pieces of information Han Sen had discovered were either unhelpful generalizations or seemingly unbelievable legends, the credibility of which he couldn’t entirely rely on.\n\nGeneral Ghost Bone was one of the ten generals of Sacred. Han Sen knew that he had been very fond of killing. He was the captain of Sacred’s Sacred Blood army. He led his Sacred Blood army to kill everything and everyone, and over the course of time, he racked up a kill count of many billions. Merely mentioning his name was enough to strike fear into the hearts of the residents of the geno universe back then.\n\nJust like the other generals, though, General Ghost Bone disappeared after the fall of Sacred. It was unknown whether he died or became something similar to Purple-Eye Butterfly.\n\nBut Han Sen didn’t believe the Ice Blue Knights would kill the back-up knights just because they had stumbled across an old relic that was associated with General Ghost Bone.\n\nIf they had already explored the ruins and perhaps found something, it might make sense to kill them then. But they had just arrived before the complex of ruins. They hadn’t explored the place yet, so killing them made little sense.\n\nHan Sen settled on two possible explanations for this. The first possibility was that Bai Wenxuan was lying. The other possibility was that the man’s team didn’t need to explore any further, as they had actually already found something they shouldn’t have.\n\n“I hadn’t been with the Ice Blue Knights for long. I only know Inspector Edward; I didn’t know anyone else. But I think they all listened to him,” Bai Wenxuan said.\n\nHan Sen frowned. Inspectors were men who watched the knights. They couldn’t control the knights, but they could observe them and make reports directly to the Extreme King higher-ups. The inspectors were like eyes for the leaders of the Extreme King.\n\nOrdinarily, inspectors didn’t need to fight. And if they were participating in a mission, they were not designated leaders. They wouldn’t give orders. They could only observe and inspect. They had no authority.\n\nJudging from what Bai Wenxuan said, this inspector didn’t behave like one should have. If Bai Wenxuan wasn’t lying, then something must have happened that he had missed.\n\n“Take me to the ruins,” Han Sen said to Bai Wenxuan.\n\n“But…” Bai Wenxuan hesitated.\n\n“Either you take us to the ruins, or we take you to the Ice Blue Knights. Prove to me that you’re telling the truth. The choice, however, is entirely up to you,” Han Sen said calmly.\n\nAccording to Bai Wenxuan, when his team discovered the ruins, the Ice Blue Knight Kings had been outside of the systems of chaos. If what he was saying was the truth, perhaps Inspector Edward was looking to take something from the ruins for himself.\n\nHan Sen was curious about what might have been there, if Inspector Edward wanted it badly enough to kill everyone for it.\n\nHan Sen was very interested in any matters pertaining to Sacred.\n\nBai Wenxuan was just a Marquise. He was an Extreme King, but he was no greater than the average citizen. If he had been someone special, he wouldn’t have been a back-up knight.\n\nFor a Marquise of a higher race, his power was rather good. But compared to Han Sen, he was far inferior.\n\nSo, Han Sen demonstrated his power to the man. And then, the man obeyed. He agreed to take Han Sen’s group to the ruins.\n\nBut Bai Wenxuan had gotten lost while he was escaping through the subterranean labyrinth. In that tangled knot of underground tunnels, it took him a long time to find his way.\n\nHan Sen couldn’t travel across the surface, because his team wasn’t in charge of clearing other regions. If the knights found out they were going to the desert, it’d be considered a failure of their duty. And there was every chance that the knights would believe that they were spies belonging to another race.\n\nAlthough their path wandered a little, their direction was ultimately correct, and after a day of travel, Han Sen and his crew came to an underground water system.\n\nBefore they went into the river, there was a splash. A giant snake that was as thick as a barrel came slithering out. It huffed a haze of green smoke right at them.\n\n“Duke class Yin River Snake!” Bai Wenxuan shouted. He turned around with the intent to flee.\n\nHuangfu Jing grabbed him by his shirt and pulled him back, though. As she did, Han Meng’er fired her arrow. A black light appeared, and it tore through the green smoke and took the creature’s entire head off. The Yin River Snake’s giant body collapsed on the bank of the underground river.\n\nBai Wenxuan stared. He turned to Han Meng’er with a blank expression. “Who… who are you people?”\n\nA Marquise back-up had just killed a Duke Yin River Snake in one blow. People like that were supposed to be fully-fledged members of the knights. Plus, Han Sen was saying he wanted to go to the ruins. Surely they couldn’t have been back-up knights.\n\n“Do you know Mister White?” Han Sen asked with a squint of his eyes.\n\n“You mean Advisor White? You are acquainted with Advisor White?” Bai Wenxuan looked surprisingly happy.\n\n“Look, you might have a chance to live here. Taking you back to the Extreme Kings won’t be difficult.” Han Sen pretended to be mysterious. He patted the man’s shoulders, and then stopped talking.\n\nBai Wenxuan knew now that Han Sen and his people belonged to Mister White, in some capacity. And that helped boost his confidence and desire to help.\n\nThere were many underwater xenogeneics they encountered, but none of them were King class. They were mostly either Marquises or Dukes. Han Meng’er was able to kill every one before anyone else had a chance to.\n\n“I remember this place… Turn at this stone, and we will be close to the pool. Swim down that pool, and there will be a path that leads us to the well.” Bai Wenxuan pointed at a strange rock as he spoke.\n\nNot long after, Han Sen came across the pool that the man had mentioned. Han Sen led the way, and then, everyone dove in to reach the underwater passage.\n\nShortly after, Han Sen’s head broke the water’s surface inside a well. He hid there, but sneakily had a look around. He looked quite surprised by what he saw.\n\n“A Nine-Life Cat?” Han Sen was very surprised. He hadn’t expected to find a statue of the Nine-Life Cat there, as well."
}