{
    "chapter": 1826,
    "title": "Can’t Bully People",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1826",
    "text": "Black Steel didn’t hesitate. He grabbed Han Sen’s hand and lowered himself down.\n\nHan Sen grabbed the nearest blade and let Black Steel dangle slowly downwards.\n\nBlack Steel’s fingers were so close to the prize he wanted: the horse knife. His forehead dripped with sweat, knowing that he was making a risky move. If they did something to detonate the grave, they would die right then and there.\n\nBlack Steel’s hands weren’t shaking, though. He got close to the horse knife that was still half within the juice. And very carefully, he drew the knife out.\n\nHe moved with precision, bringing the knife out slowly to avoid creating waves. It took him an entire minute to remove it fully.\n\nSuddenly, a drop of sweat dripped off of Black Steel’s face. It fell into the steel juice, and then, shaa! White smoke billowed up.\n\nThe steel juice bubbled. The knives began to rattle and shake. They were pointing at the pair, freezing them in place.\n\nAfter a while, the knives and the steel juice settled down again.\n\nBlack Steel put the knife away and nodded up at Han Sen.\n\nHan Sen acknowledged Black Steel’s signal and then slowly pulled him up. He brought him back to the wall of knives they had come down from.\n\nBlack Steel was now carrying his new knife, which was slung across his back. He signaled Han Sen, and then they climbed back out of the volcano. They did so in tandem, as quietly as they could.\n\nWhen they both climbed out of the Knife Grave, Black Steel looked relieved. His clothes were soaking wet. The stunt they had performed was too dangerous, and he had very nearly been killed.\n\nBlack Steel looked at Han Sen. He noticed Han Sen standing comfortably beside him, as if he was entirely unshaken. Like he wasn’t bothered by the risk they had just taken. His forehead was dry and without sweat, like nothing at all had just happened.\n\n“I don’t know if he is ignorant or arrogant,” Black Steel thought to himself. Regardless, his view of Han Sen was starting to change.\n\n“You own half of this knife, so we should talk about how best we split it.” When they were down off the mountain, Black Steel pointed at the knife and said this.\n\n“I don’t need it. Consider that my service fee, paid in full. When I need to identify one for myself later, perhaps you can help me with that” Han Sen smiled.\n\n“Do you know what knife this is?” Black Steel asked.\n\nHan Sen shook his head. “What is it?”\n\nThe weapon lacked an energy signature, and with Han Sen not being an expert, he could not discern the level of the blade. “This is an Earl weapon,” Black Steel said.\n\n“An Earl? I thought it might be higher. I need one that is at least a Duke. You can help me find one like that, okay? With a bit of luck and a sprinkle of hope, it’ll be a King. It’d be even better if it was deified.” Han Sen looked grossly dismayed, and he didn’t seem to think much of an Earl knife.\n\nBlack Steel slung the knife back over his shoulder and just ignored Han Sen. He found a place in the foothills to sit down, where they could wait for the next round of rain.\n\nIt took a long time for it to come, but it looked set to begin again soon. While they were talking, a loud noise sounded. The Knife Grave erupted and a pillar was fired into the sky. Then, the rain of knives began to fall.\n\nBlack Steel took out his horse knife and chucked a Baron class knife to Han Sen. Han Sen’s Baron weapon swiftly rose to knock away the knives that were falling from the sky.\n\nThat round was mainly about using ordinary weapons. So ordinary, not even Baron weapons were necessary. They got through it with ease.\n\n“Why don’t we enter the Knife Grave again? Perhaps a high-tier weapon might now be found,” Han Sen suggested.\n\nBlack Steel shook his head and said. “After the second wave, many of the weapons on the walls are Baron. Their power will be stronger. If you touch them, they’ll immediately start rioting. Unless you can fly in and out, you won’t be able to get back down there.”\n\nHan Sen looked disappointed, and he gave up on the idea of heading back.\n\nTogether, they both endured another two washes of knife rain. After the fifth storm, Black Steel decided to head to the mountain and take a look. He looked at the knives in the mountain, and then returned.\n\n“Little Black, does your family have a deified knife? Does anyone have deified treasure in Narrow Moon?” Han Sen asked, curious what the young man would answer.\n\nBlack Steel just ignored him. The best way to deal with Han Sen, he had now figured, was keeping quiet.\n\nAfter five waves of rain, it would still be difficult to find another Earl weapon. If their luck wasn’t too poor, they could at least find a Viscount weapon. Black Steel wanted to find a Viscount weapon right now.\n\nThey walked around for a bit before stumbling across three others who were also in the pursuit of another weapon. Those three saw Han Sen and Black Steel, and decided to come over to greet them.\n\n“Black Steel, why are you with him?” A Rebate with gold ears looked at Han Sen and then frowned at Black Steel.\n\n“I stand with whoever I choose to,” Black Steel said coldly.\n\nThe woman looked a little p*ssed after the rebuttal, and a Rebate man that was beside her said, “Black Steel, don’t be so arrogant! You are only the son of Black-Moon King. If you are as good as you pose yourself to be, how come Knife Queen did not accept you as a student, instead of this useless outsider?”\n\nA strange-looking outsider laughed and said, “He couldn’t become Queen’s student, but he can be friends with the student himself! Ha. Maybe when he gets close, he thinks Queen will soften, and then accept him as the next student.”\n\nBlack Steel pulled out his knife and swung it with rage.\n\nThe outsider raised his knife and fought back. But he only had a Baron weapon, and it was quickly shattered by the horse knife.\n\nTo the outsider’s shock, he was then cut in half. His blood spread across the ground.\n\n“That… is that an Earl’s weapon?” The man and woman trembled. They looked right at Black Steel’s horse knife.\n\nThe man yelled at Black Steel and said, “Black Steel, are you really killing people here! Do you think you can do anything you please?”\n\n“Whoever insults Queen will die,” Black Steel said icily, not even looking at them.\n\nThe man and the woman were still reeling from shock. It was supposed to only have been a bit of chit-chat. If this event went public, it’d be a death wish. But if people knew it was the outsider who had insulted Queen, they would think Black Steel had performed a good kill.\n\n“Huh.” The man hummed and did not say anything. He looked at Han Sen and said, “The student that Queen accepted must be decent. I want to learn from you.”\n\nThe man no longer dared to provoke Black Steel, who had an Earl weapon. So, he was going to take out his angst on Han Sen.\n\n“You own half of this knife,” Black Steel said, before tossing the horse knife to Han Sen.\n\nThe man was angered by this, and he said, “Black Steel! You…”\n\nHan Sen threw the knife back to Black Steel and smiled. “I am Knife Queen’s student. Using this would be bullying, so instead, I’ll use this.”\n\nAfter that, Han Sen picked up a random knife off the ground. It was ordinary, and didn’t even have a rank."
}