{
    "chapter": 2487,
    "title": "Piece of Cloud",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2487",
    "text": "Han Sen and Lando searched in a circular pattern, but they had yet to find the white whale. Han Sen was sick with worry.\n\nRight now, Han Sen wished he had practiced one of Mister White’s skills. That way, he could calculate where Bao’er had gone. Even just a direction would do. Right now, anything was better than running around like a headless chicken.\n\nWhile the Tianxia Unicorn soared through the clouds, they saw a person slowly start to appear. It was Meng Lie, a close relative of the Extreme King’s ruler.\n\n“Han Sen, we meet again.”\n\nMeng Lie had escaped while the woman of Two World Mountain stole his Extreme Purple Demon Dragon. Han Sen thought that the man had already departed the Tianxia System.\n\n“You should go,” Lando said to Han Sen as he stared grimly at Meng Lie.\n\nHan Sen didn’t say a word; he just ran. Lando had told him to go because he wasn’t confident in his ability to stop Meng Lie. If Han Sen stayed, he would become a burden to Lando. If Lando was alone, he could escape if he was unable to defeat Meng Lie.\n\nMeng Lie started chase Han Sen, but Lando stopped him on the Tianxia Unicorn. Meng Lie’s eyes narrowed.\n\n“Lando, do you really want to become an enemy of the Extreme King?”\n\n“I told him I would take him out of this place alive,” Lando said emotionlessly. “This is what I must do.”\n\n“Huh. In that case, we’ll see if you have what it takes.” Meng Lie’s expression was icy. His body transformed into a gold giant as he threw a slap in Lando’s direction. The slap seemed to cover the sky itself.\n\nHan Sen felt the power like a giant shockwave coming after him. He flew faster.\n\nLuckily, the power of the shockwave had mostly dispersed by the time it reached Han Sen. He used the momentum of the shockwave to boost his own speed, and he vanished quickly into the clouds.\n\n“How long am I going to have to live my days like this? After I find Bao’er, I will have to go to Sky Palace. I hope the Sky can at least keep me safe for a while. I need someone to protect me from the Extreme King until I become deified,” Han Sen thought to himself. Then, he felt depressed. “The Blood-Pulse Sutra’s King area is too strange. It can only push the self-cogwheels of others, and I can’t seem to use it on my own geno arts. I want to enhance my bloodline!”\n\nHan Sen didn’t know what direction he should go to find Bao’er, and he had to stay away from the fight between Lando and Meng Lie.\n\nNot long after, Han Sen reached the zone where many seas of clouds connected. In front of him was a sea of creamy white clouds. Each cloud looked like milk floating in the air.\n\nHan Sen flew toward it without hesitation. When he tried to fly into one of the clouds, though, it was like jumping into a bean bag. Instead of letting him through, it caught him and bounced him back.\n\nHan Sen was shocked. The clouds of the Tianxia System were thick, but they weren’t nearly thick enough to stop him. Only cloud beasts were actually solid.\n\nBut Han Sen was so fast and so strong that if he hit a cloud beast, it would be torn apart. But the creamy white cloud was totally fine, and it had bounced him back.\n\n“Have I run into a high-class cloud beast?” Han Sen was shocked. He looked at the cloud in alarm.\n\nBut the cloud didn’t respond. It just floated where it was, looking exactly like all the other nearby clouds.\n\nHan Sen couldn’t see anything particularly special about the cloud. He hesitated at first, but he did decide to fly around the cloud to inspect it more carefully. He also reached out his hand to touch it.\n\nThe cloud was very soft. When Han Sen touched it, it dented inwards. But when Han Sen had crashed into it at full-speed earlier, the cloud felt very tough. It had been like a beef tendon.\n\nBut no matter how much Han Sen poked it, the cloud didn’t react. It was like a dead object.\n\n“This cloud looks like a non-newtonian fluid.” Han Sen brushed away the clouds around it, and he found out that the strange cloud was only twenty meters wide. Aside from the fact that it lacked a lifeforce and possessed non-newtonian features, there was nothing special about the cloud.\n\n“Why is there a cloud like this out here in the middle of nowhere?” Han Sen was confused. He looked at the nearby clouds for a while. He reached his hand into the cloud and pushed his whole body into it slowly.\n\nWhen he was outside it, Han Sen couldn’t see a single thing with his Purple-Eye Butterfly. So, he went in and had a proper look.\n\nHan Sen’s body moved slowly. If he crept forward at a snail’s pace, the cloud wouldn’t offer much in the way of resistance.\n\nAfter walking seven or eight meters inside, Han Sen suddenly felt as if the space before him was empty. His hand just went right through.\n\n“There’s something here.” Han Sen felt so happy. This cloud was twenty meters wide, and he had only walked seven or eight meters. Despite that, something was stopping him. It had to mean that there was a pocket of space inside.\n\nHan Sen carefully stepped through. And soon enough, he reached the cloud’s interior space. He looked around and realized he was now in a three-meter-wide space. Within that empty area, he found a plant.\n\nIt looked like a spider plant. The green leaves reached out, and they looked quite lovely.\n\n“Weird! Why is there a plant here? I thought there were only cloud beasts in the Tianxia System, and that there weren’t any plants,” Han Sen thought in surprise. He kept observing the plant.\n\nThe spider plant was as beautiful as green jade. The leaves were one foot long, and they were shaped like swords. It looked like an art-piece carved from the best jade one could find. Its lifeforce was so strong, though, that no one would believe it to be an inanimate object.\n\nFrom what Han Sen could tell, the Tianxia System didn’t have the correct conditions for plant life and normal creatures to thrive. Real plants couldn’t exist here, and yet, there was a spider plant right in front of him. It certainly wasn’t what Han Sen had expected to find when he entered the cloud.\n\n“Did some other people come here and leave it in the Tianxia System?” As Han Sen was thinking, a white cloud began to bubble up out of the spider plant. It rose like a bubble of milk, then went to join the clouds outside.\n\n“It looks like these clouds actually come from this spider plant. That means the plant is actually native to the Tianxia System.” Han Sen was shocked.\n\nAs the spider plant released more clouds, Han Sen reached out and grabbed it. But when he touched it, it was just like the cloud that surrounded it. The plant was so delicate that it seemed like only a light grip would crush it.\n\nBut if he used strength, the plant would grow rigid and resilient.\n\n“What kind of plant is this?” As Han Sen curiously examined the spider plant, he saw that there was a white fire in the middle of the plant."
}