{
    "chapter": 3033,
    "title": "Dollar's First Year",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3033",
    "text": "Han Sen wanted to kill Qin Xiu, but Qin Xiu’s spirit body was extraordinarily tough. Even by using Super Spank at max power, in a short time, he was unable to destroy Qin Xiu’s spirit body. Qin Xiu pulled Han Sen into the crack in time and space. Wan’er, who was next to them, fell inside as well. The three of them kept falling through that weird crack in time and space.\n\nHan Sen noticed his Super God Spirit mode could not stop the weird power of that tunnel. His body was being dissolved.\n\nWhat shocked Han Sen was the fact Qin Xiu did not seem to be affected by the power of the tunnel. He was not dissolving at all.\n\nWan’er’s golden power could not withstand the reverse tunnel’s weird power. Her body was dissolving too, but at a rate that was faster than Han Sen.\n\n“Of course, The Story of Genes you possess did not succeed. Otherwise, you would not be dissolving in the reverse tunnel’s power.” Qin Xiu let Han Sen go and held onto Wan’er as he spoke.\n\nHan Sen was shocked. This was his last chance to beat him. Qin Xiu was not affected by the reverse tunnel’s power, but Han Sen was affected. If Qin Xiu kept pushing him into the space tunnel, even if Han Sen could kill him, they would die together.\n\n“Remember the promise you made to me,” Qin Xiu said as he stroked Wan’er’s hair and kissed her cheek. “You will take care of Wan’er. No matter what, ensure she lives happily.”\n\nWith that kiss, the red light of Qin Xiu’s body entered Wan’er. The red light enshrouded Wan’er and kept her inside it. Outside of her body, a red layer stopped the reverse tunnel’s power from destroying her.\n\nBecause of the great loss of power, Qin Xiu’s body grew dim. He appeared and disappeared. His body’s holy light was dissolved by the reverse tunnel. His was becoming dimmer.\n\nHe placed his hands forward and put Wan’er in front of Han Sen. Han Sen collected Wan’er. Qin Xiu smiled at him, but that smile only made people feel sad.\n\n“Go back. Go back to your world. Take Wan’er and live. Perhaps that would be best for her. What has been missed is missed. I cannot try to reclaim it. I, Qin Xiu, cannot go against the sky.”\n\nAfter that, Qin Xiu’s body possessed a red light. His whole body burned with fire. He turned into a red power. He wrapped up Han Sen and Wan’er and pushed back toward the reverse tunnel’s entrance.\n\nAs they got close to the reverse tunnel’s entrance, Qin Xiu’s red fire grew weaker. He used all of his life to become as powerful as possible. When the red fire was extinguished, it would be the official end of Qin Xiu’s life.\n\nSeeing the entrance of the reverse tunnel, Qin Xiu’s red light was already gone. Han Sen used his own power to get out of there.\n\nWhen Han Sen was ready to go out, the Sea of Souls suddenly emitted the sounds of something crying. The very dead crystal armor automatically ran out of the Sea of Souls and wrapped up Han Sen’s body.\n\nWhat shocked Han Sen more was that when the black crystal armor was around his body, it went against things. It pulled his body deeper into the reverse tunnel.\n\n“What are you doing?” Han Sen kept using his power like mad. He wanted to change his course and leave the reverse tunnel, but it was not working. The black crystal kept pulling him down deeper.\n\nNo one answered him. The black crystal armor was silent. It just kept forcing Han Sen to sink deeper. The reverse tunnel’s armor was unable to break the black crystal armor.\n\nInside the reverse tunnel, a weird power surging through the black crystal armor. It kept going into Han Sen’s body. It made his body exhibit weird changes. Han Sen was not sure if the changes were good or bad. With his power, he was not able to stop that power from changing his body.\n\nWan’er had the power Qin Xiu gave her for protection. She did not have changes like that.\n\nThe reverse tunnel was like a bottomless abyss. While Han Sen and Wan’er were sinking, everything seemed to empty. It was like their bodies were consumed by emptiness.\n\nThe first year of the universe’s Dollar calendar.\n\nIn this year, Human Alpha Dollar beat the world’s attempted destroyer and saved the geno universe and its countless denizens. To remember Dollar, who died with the destroyer, that year was named Dollar year one. The new calendar of the universe was started.\n\nHumans and spirits were now members of the geno universe. Countless human elites and spirit elites were from Space Garden and Sacred. It enabled humans and spirits to become important figures in the universe.\n\nWang Yuhang went into the laboratory and asked Xie Qing King, “Brother King, how is your research going? Is there a way for us to access the antimaterial world?”\n\n“No, the power of the antimaterial world is too weird,” Xie Qing King said. “We tried to go through the antimaterial world via Mirror Lake, but no substance was able to endure the antimaterial world’s power.”\n\nQin Xuan arrived holding a record. “For the past two years, we have tried every way we can to open the antimaterial tunnel. Nothing we have tried has succeeded. The tests fail and fail. We have to find another way.”\n\n“The geno hall’s God must know how to access the antimaterial world, but he will not tell us,” Wang Yuhang sadly said.\n\n“It’s fine,” Qin Xuan said with certainty. “We know that Han Sen is not dead. If he made it through, it must be possible for us to make it through as well.”\n\n“Yes, we must find a way to go,” Wang Yuhang said while waving his fists. “We cannot let little San Mu own the antimaterial world alone.”\n\nZero came from a tunnel, frowned, and asked, “Have you seen Bao’er?”\n\n“No, it seems like it has been a while since we last saw her,” Xie Qing King said. “Perhaps she took Little Six and Little Nine to hunt with\n\nher.”\n\nWang Yuhang lifted his lips and said, “Don’t worry. Nothing will happen to her in Space Garden. If someone seeks to do something bad to her, whoever it is must be really dumb.”\n\nAt the same time, in a mountain in Space Garden that was inhabited by nobody, Bao’er was standing atop a weird bronze item. She looked at the bronze item. The bronze item was Han Sen’s Four Sheep Cube.\n\nNext to Bao’er was a fortune-telling old man who was holding a flag. The words “Counting all the destinies” were on the flag. It was just those four big words.\n\nBao’er blinked. She stared at the fortune-telling old man and asked, “Can this thing really take me to my father?” “Of course. I swear to God and hope to die that I would not lie about this.” The fortune-telling old man swore to God."
}