{
    "chapter": 2519,
    "title": "Killing a Deified",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2519",
    "text": "Han Sen squinted. Instead of falling back, he concentrated on the Gold Armor General in front of him, with his Purple-Eye Butterfly spinning like mad.\n\nHe had known before he approached that there was something wrong. Although the Gold Armor General had been frozen by the Dragon blood Evilbreaker power, Han Sen’s Dongxuan Area showed him that its self cogwheel was still spinning slowly. The beast hadn’t been captured.\n\nBut even so, Han Sen didn’t want to retreat. He went after the Gold Armor General anyway. Everyone was watching as the scary gold greatsword came down, its buzzing, saw-like swordlight tearing through everything there was. It instantly landed on Dollar’s head.\n\nThere was nowhere to run. From what they could see, even if Dollar tried to teleport away, he stood no chance of surviving that strike. Dollar’s teleportation speed was too slow, anyway.\n\nBut Han Sen didn’t plan on dodging. A white light glowed from his eyes, and his body turned into a shadow in front of everyone. He was like a god hanging in space.\n\nThe gold greatsword’s power was sufficient to break a planet in two, but when it landed on him, it went right through. It was like his body didn’t exist. His existence was nothing more than a shadow.\n\n“Is that a shadow or a clone?” People wondered in shock.\n\nBut a second later, the people watching the battle became even more astounded. The gold greatsword was slashing through Dollar’s body with god-like power. Dollar seemed insubstantial, but his shadow-like form was still clutching the Dragon Tattoo Tooth Dagger. The dagger struck at the Gold Armor General’s left eye.\n\nThe dagger shone brightly. It pierced through the crystal wall shielding the eye and went right into the eyeball. Gold blood came gushing out of it.\n\nEveryone was shocked. They couldn’t believe their own eyes.\n\n“Impossible… If this was just a shadow or a doppelganger, it couldn’t keep attacking… and it couldn’t wield power like this…” Bai Wan Jie was shocked, as well.\n\nThe woman in yellow squinted. She looked at Han Sen and whispered to herself, “It looks kind of like the Extreme King’s Ghost King Body, but it is different. What kind of power is this?”\n\nThe two half-deifieds who used Mirror Doppelganger and Ghost Shadow were frozen. They knew that what they were seeing wasn’t something similar to their powers; otherwise, Han Sen wouldn’t have been able to attack in his current form.\n\nUnless this was Dollar’s real body, he wouldn’t have been able to use the Dragon Tattoo Tooth Dagger to perforate the Gold Armor General’s eyes.\n\nIf this was Dollar’s real body, though, it meant that the Gold Armor General’s power was unable to land on him. That was unbelievable.\n\nDragon One was as shocked as he was delighted. His plan had failed. They were on the cusp of losing everything. The five hundred King class xenogeneic genes and the money he had spent to hire the aid of a few other races would have also cost his people an arm and a leg.\n\nBut things had taken a drastic turn. Dollar was facing the Gold Armor General alone, and he had managed to pierce one of its eyes. On top of that, he was still safe.\n\n“This guy is too scary.” Dia Robber looked gloomy. He stared at Dollar.\n\nThe Gold Armor General roared in response to its injury. While it roared, the pipes on its body kept spitting streams of gold fire. The creature swung its saw greatsword wildly, wanting to kill Han Sen.\n\nAnd yet Han Sen just stood there, taking each strike without making an effort to evade them. Han Sen thrust the Dragon Tattoo Tooth Dagger the moment the gold greatsword went right through him. Even space shuddered and cracked under the power of the Gold Armor General’s mighty strike, but Han Sen’s body remained perfectly intact. The dagger in his hand punched a hole in the Gold Armor General’s other eye.\n\nEveryone was petrified when they saw the Gold Armor General swinging his greatsword like crazy. He was smashing the planets all around, breaking them in a frenzy. And yet, despite all that, he was unable to deliver any damage to Han Sen.\n\nDollar looked like some kind of god as he stood before the Gold Armor General. He was able to ignore that scary gold greatsword and the swordlights that it unleashed, focusing purely on stabbing the Gold Armor General’s eye repeatedly. The Gold Armor General’s eyes kept bleeding. Even the brain juice behind it was starting to leak out in a steady stream.\n\nNo one dared to believe what their eyes were telling them. A King class was killing the Gold Armor General in front of them. The Gold Armor General was enraged, and yet it was helpless. It roared hopelessly, unleashing frightening powers. But before that man who was like a god, all its attempts to fight back were for naught. It kept getting stabbed in the eye, over and over.\n\nDollar worked methodically, as if he wasn’t stabbing a scary deified xenogeneic. Rather, he looked like he was just repeatedly prodding a lifeless slab of pork.\n\nAs he stared, Dragon One’s mask of cool detachment slipped from his face. He had no idea how to react to what was happening, and it almost slipped his mind that he had to perform the final killing strike after Dollar blinded both of the Gold Armor General’s eyes.\n\nIt wasn’t as if he had forgotten his role in all this. It was just that Dollar really had surprised him. If it wasn’t for the fact that deified elites couldn’t enter the core area, he would have easily believed that Dollar was actually an incredible elite who had simply disguised his power.\n\nIt wasn’t just Dragon One who was shocked, either. Everyone stared at the battle in silent awe. Even the Extreme King crown prince Bai Wan Jie, who had seen many incredible things, had his mouth wide open in the shock.\n\nThe yellow-clothed woman was astonished, too. Her pink lips opened. She could barely believe that the Gold Armor General was being stabbed in such a fashion.\n\nHan Sen didn’t have the power to destroy or kill a deified xenogeneic on his own, but with the Dragon Tattoo Tooth Dagger, killing a deified xenogeneic would be possible. It was still a very difficult task, but this deified had a well-defined weakness. That convergence of factors gave Han Sen a very good chance of killing it.\n\nBut after he stabbed it a dozen times, the Gold Armor General still wasn’t dead yet. The presence emitted by its body had grown even fiercer.\n\n“Is that enough?” Han Sen turned around and asked Dragon One.\n\nDragon One was in awe, and he acted as if he had just woken up. He quickly pulled out an item and aimed it at the Gold Armor General. Then, he shouted to Han Sen, “Quickly, get out there!”\n\n“It is fine. Just attack!” Han Sen said simply.\n\nDragon One didn’t hesitate. Dollar wasn’t concerned about the Gold Armor General’s attacks, so there wasn’t much need to concern himself with whatever was coming next.\n\nWith that thought, Dragon One activated the item in his hand. A dragon’s roar came from his hand, then transformed into a dragon shadow that raged toward the Gold Armor General. It went into the ruined eye sockets of the Gold Armor General, which were still bleeding.\n\nBoom!\n\nWhen the dragon shadow came back out of the Gold Armor General’s eyes, it did so with a scary explosion. The blood-like fire came surging out of the eyes like an erupting volcano.\n\nThe scary red flames fountained into Han Sen. But even so, they went right through Han Sen. They couldn’t affect him.\n\nThe Gold Armor General had taken their attack, and under its force, its head was reduced to little more than mud. But it still shook and moan. Even that attack wasn’t enough to kill it.\n\nHan Sen swung his dagger to end the last of its life force. The fire of their enemy’s life was extinguished."
}