{
    "chapter": 1291,
    "title": "Night Treasure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1291",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“It sounds like quite the fruit,” Han Sen said with a smile.\n\n“If you were an emperor who had not opened ten gene locks, you wouldn’t get invited. Oh, what I wouldn’t give to try it out myself,” Baby Ghost said.\n\n“I’m afraid I’d be killed before my lips ever touched the skin of the fruit,” Han Sen said.\n\nIt was obvious Han Sen’s invitation was not one of simple courtesy; Lotus Empress had, after all, marked him back in the Second God’s Sanctuary. He was a human with only nine gene locks open, so that alone was enough for the sirens in his head to start wailing.\n\nWhile Han Sen thought about what he should do, the item given to him by Lotus Empress lit up. A video played before him, like some botanical hologram. Han Sen watched it intently, and recognized the figure in the image before him as Lotus Empress herself.\n\n“This is just a recording. I am concerned that you will not attend, and if you are not planning to, I would like to assuage your fears and tell you something.”\n\nUnderstanding it was a simple video, Han Sen did not respond.\n\nLotus Empress went on to say, “I would like to make a deal. You are strong, there is no doubt about that; but you cannot open ten gene locks. If you attend, you can come speak with me. I will elucidate the reasons why. One way or another, however, we will meet again. If you do not show up at the Holy Baby Fruit event, I will be paying you a visit instead.”\n\nAfter that, the video disappeared.\n\n“There’s a proper reason why I can’t open ten gene locks?” Han Sen frowned at the thought.\n\nHan Sen thought she could have been bluffing, enticing him to come, but then again, it made sense.\n\nHe hadn’t had the ninth gene lock for the Dongxuan Sutra and Jadeskin open for long, but Blood-Pulse Sutra’s ninth gene lock was opened years ago, and it had yet to improve. There had to be some sort of issue prohibiting his advancement.\n\nWith his talent, and the geno treasures he possessed, it only seemed natural that he’d have gone further by now. The fact he hadn’t was plain weird.\n\nPerhaps there was truth to her words, and just maybe, she’d be able to help him.\n\nSaint Fan Emperor was dead, but Han Sen wished he could ask him a thing or two about why he had been chosen. So, curious about this entire thing, Han Sen decided to scope the event out. He wasn’t afraid.\n\nBut just in case, Han Sen decided to bring along his most trusted companions. His OG—his old guard—was to come along, in the event that a conflict arose. With them there, he’d feel a lot more secure, and if things turned sour, the chances of flight were much higher. With the silver fox by his side, in particular, there was no danger on the road there. And Han Sen even had the invitation from the Lotus Empress on full display.\n\nIt would take a long time to get where they had to go, and in the midst of their journey, Empty Witch appeared out of nowhere. She came and pledged her desire to escort Han Sen and his fellows the rest of the way.\n\nEvil Lotus Shelter had been constructed on an island, situated in the middle of a vast lake. There were many lotuses around it.\n\nIts construct was quite different from other shelters Han Sen had been to, such as Blood River Shelter. It was also far prettier and a whole lot grander than the likes of Saint Fan Shelter.\n\nHan Sen did not bring Bao’er, which disappointed Empty Witch once again.\n\nAside from that, the journey was uneventful. When they arrived, they were led into the gardens without a problem. They were to wait on the green for the event to begin.\n\nHan Sen and the silver fox had to live in the garden for a while, but the entire time they were there, they could not see Lotus Empress.\n\nHan Sen asked Empty Witch about her perpetual absence, and he was told that Lotus Empress was in the middle of practice, and that she’d only reveal herself when the fruit was ripe.\n\nSince the trip had gone so smoothly, Han Sen had made good time. He had traveled so quickly, he had arrived ten days early. Empty Witch suggested Han Sen bring the rest of his companions to observe a curiosity of the shelter.\n\n“What strange thing do you want us to see?” Han Sen asked.\n\n“This is Evil Lotus Shelter now, but this was where Night Empress was born. This is the site where she became a demi-god, as well. She left a luminous stone behind when she left,” Empty Witch explained.\n\n“And what is so fascinating about a stone that glows?” Han Sen asked.\n\nEven in the Alliance, glowing rocks were nothing special.\n\nEmpty Witch rolled her eyes and pleaded, “This is not a normal stone! This is a geno treasure, as a matter of fact. She cherished it, and wanted nothing more than to bring it to the Fourth God’s Sanctuary. Unfortunately, it could not withstand the fires of The Ten Steps of the Holy Door, and it rolled back and fell to where it now still lies.”\n\n“It fell into the lake and became the Luminous Stone that we now know it as. Unfortunately, the flames did a number on it, and the power it once possessed has waned. Many emperors see it and become inspired; if it wasn’t for the Holy Spirit, I wouldn’t have brought you.”\n\n“I’ll give it a look, then.” Han Sen followed after Empty Witch, alongside the silver fox.\n\nBefore he reached there, however, Han Sen felt something vibrate inside his pocket. It was the jue, and Han Sen had no idea why it was behaving so strangely.\n\nHan Sen knew it was an item from the Fourth God’s Sanctuary, and it could trigger the demi-god altar. It could also bring demi-gods back into the Third God’s Sanctuary.\n\nNow that the jue was shaking, Han Sen thought, “Is it setting up a demi-god altar?”"
}