{
    "chapter": 2232,
    "title": "Metal Statue",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2232",
    "text": "While searching, Han Sen found a territory belonging to the Finger Fire Crow. There was at least fifty thousand of them, so it took them a few hours to get rid of them all. They also found a lot of Fire Crow eggs in the caves that were located there.\n\nBecause there were so many Fire Crow eggs and the little Fire Crow’s levels were low, they were pointless to haul back, so they decided to destroy them. It was to prevent them from hatching and one day forming another murder of pesky Fire Crows.\n\nWhile they handled the Fire Crows, Han Sen decided to put a few of them in his bird nest. He wanted to see if it would have any effect.\n\nOne hour later, the Fire Crow eggs inside the nest hatched and broke. It resulted in there being a few Fire Crows in the nest.\n\n“D*mn! This bird nest’s power is to hatch eggs?” Han Sen’s face changed.\n\nTo confirm that this was indeed the bird nest’s power, Han Sen conducted a few tests. He quickly found out what the bird nest did. It looked as if the Undying Bird Nest could speed up the incubation period for an egg and make them hatch faster. Han Sen managed to find and try out a few different eggs by putting them in the nest. They all hatched within a short period of time, so it couldn’t have been a coincidence.\n\nThinking of the Way of Life and Death, Han Sen acknowledged that it could not have been a coincidence. The little Fire Crows that hatched were stronger than the average Fire Crow. They seemed to be much stronger, but once they had fully hatched, the bird nest stopped its effect on the Fire Crows. It did not make them grow any faster after hatching.\n\nHan Sen only knew that the nest sped up the hatching speed and made the creatures birthed from it stronger. It did nothing more beyond that, but Han Sen still tried to examine and determine whether or not it did something else.\n\nHan Sen was doing all this behind Bai Wei’s back. She had no clue what the bird nest did.\n\n“This thing really is a bird nest.” After Han Sen learned what it did, Han Sen looked at it strangely. If that was all it did, then it did not help Han Sen much. What he needed right now was a battle mode treasure.\n\nBut Han Sen recalled the little red bird in the Alliance’s warehouse. Han Sen wondered if the bird nest could work to make it hatch faster. It had eaten the Sun Gold Bird baby, so if it finished evolving, it should be useful. But Bai Wei was in the team currently, and Han Sen did not have the time to bring the egg of the little red bird back from the Alliance. He could only find out when he returned.\n\nAfter finishing up with the Fire Crow eggs, Han Sen continued onward. While he was moving, he suddenly felt something. It prompted him to shout out, “Use the Bai Sema!”\n\nHan Meng’er immediately used the blue-gold Demon Bug King Bai Sema to shield everyone inside it. While the Bai Sema was up, a scary power suddenly struck its surface.\n\n“Night River King.” When Han Sen saw the black river-like attack, he knew exactly who had come for him.\n\nThe black water broke, and from it a shadow emerged. It was Night River King. He was standing atop a swirl of black river water. He coldly looked at Han Sen inside the Bai Sema. “Han Sen, today you will die.”\n\n“Night River King, has coming to the Ice Blue System driven you nuts? You cannot break my Bai Sema, so how do you hope to kill me?” Han Sen wanted to provoke Night River King. He knew Night River King was not stupid, though. If he had come for him again, he must have something prepared and planned.\n\nNight River King grunted. He did not want to waste time talking to Han Sen. He did not have much time, so he needed to kill Han Sen and leave the place quickly. He needed to remain hidden from the sight of Ice Blue Knight King’s people. He also needed to avoid leaving behind any evidence just in case the people of Extreme King picked up on something that could lead to him.\n\nNight River King was confident he would be able to kill Han Sen and the others. He was only worried about the Demon Bug Bai Sema. Without that, he could kill the Marquises it housed with ease.\n\nNo matter how strong the Marquise was, they could never hope to defeat a King. Not even ten Lone Bamboos would be enough. The power gap was simply too large.\n\nThe ambush failed, but that did not make Night River King hesitate. He brought out the little metal figurine Edward had given him. This was his trump card and what he put his faith in. This is what he hoped to break the Demon Bug King Bai Sema with.\n\nThe little statue was one foot tall, and it was gold. It was like a little warrior garbed in golden armor.\n\n“Ancient Warrior Statue!” Bai Wei saw Night River King hold the statue, and when she did, her face changed.\n\n“What is it?” Han Sen looked at Bai Wei. He knew it had to be something special, so he felt compelled to ask.\n\n“That is a statue that belongs to Ancient God. If I am correct in my assertion, that is Ancient God’s Ancient Warrior Statue,” Bai Wei immediately explained.\n\n“What does it do?” When Han Sen spoke, Night River King’s Ancient Warrior Statue began to glow with a scary light. It looked as if it had been activated some way, and then a golden power wrapped up Night River King’s body. Quickly, Night River King’s body was clad in golden armor. He became much stronger to a wholly terrifying level.\n\n“Legends say Ancient God Kings are born deified. They have a special power, and it enables them to put their power inside a statue. They can give these out to the creatures that are loyal to them. If others make use of it, they temporarily borrow the power of that Ancient God.”\n\nBai Wei’s face looked glum. Han Sen and everyone’s face changed. The Ancient Gods were born deified, and by having that statue, Night River King had their power. That meant he had the power of a deified being.\n\n“Die, Han Sen!” Night River King’s body was wrapped up by the Ancient Warrior Statue’s own golden armor. He himself looked like a golden warrior. He felt as if he had the power to tear the skies apart. It felt as if a random punch would be enough to collapse the entire universe.\n\nSuch a power gave Night River King all this confidence, but even so, he did not wish to dawdle and squander time. He gathered up power in his Moon Wheel Blade and slashed toward the blue-gold Demon Bug King Bai Sema.\n\nIt was a different power to the power wielded by the ordinary Night River King. With the power boost given to him by Ancient Warrior armor, his black water powers became gold as well.\n\nThe River Night Beast god power was like a giant golden wheel. It headed for the blue-gold Demon Bug King Bai Sema. That golden wheel spun as if it could break space and annihilate the dimension.\n\nHan Sen did not have the opportunity to dodge, though. The power coming was strong, and it greatly exceeded the might of an average King class citizen. Not even someone half-deified could fight it.\n\n“Oh no.” Bai Wei’s face turned grey before the scary power they could not hope to escape. The golden wheel, which could break space, was about to hit the Bai Sema, and when it hit the blue shield, it indeed broke open the Bai Sema. It was not getting any weaker, either, and as it proceeded, it was going to split the entire Bai Sema in half."
}