{
    "chapter": 1920,
    "title": "Empty Mouth, White Teeth",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1920",
    "text": "Sword Know’s swordlight became a star in the sky. It descended like a meteor shower, drenching Han Sen’s entire body in the starry swordlight. From the other side, the Tego Earl was like a tiger. His punch leaped forward like a beast, with Han Sen as its prey.\n\nHan Sen was under fire from both sides. He couldn’t speed up, and neither could he hope to evade. He didn’t want to leave the spring’s eye, either. With his immobility, he had to stop the spring water the moment it appeared. If the droplets made it past him, he wouldn’t stand any chance of retrieving them.\n\nBut there was a chance that the red beam was harmful, so he couldn’t stand directly over the spout. Even if he could, he knew Sword Know and the others wouldn’t let him stay there.\n\nRebecca and the other Earls did not fight alongside Sword Know and Tego Earl. They believed Han Sen’s power might have been the equivalent of an Earl, but his skill most certainly wasn’t. Furthermore, his movement had been restricted until he was slower than a Baron. He’d be lucky not to get killed by those two Earls.\n\nHan Sen wasn’t disheartened by those odds, though. He put the springwater into his mouth, while his other hand wielded Ghost Teeth Knife. He spun it in a circle.\n\nSword Know’s starry swordlight impacted the twirling knife and vanished into the blurring circle.\n\nOn the other side, the Tego Earl’s fist was falling towards Han Sen. Han Sen moved his hand and pulled the knife circle closer. The starry swordlight emerged from the knife circle, prepped to strike the fist.\n\nBoom!\n\nThe swordlight and the fistlight shattered, creating a large shockwave. Sword Know and the Tego stumbled back. Han Sen, on the other hand, was unharmed. He remained standing exactly where he had been.\n\nEveryone was frozen. No one had expected this result.\n\n“Empty Mouth, White Teeth! That is the hardest technique of Teeth Knife. It can exchange black and white, yin and yang. Even the few Dukes that have practiced Teeth Knife would not dare risk using this. No one dares to use it because success is not guaranteed. Han Sen has just used it, though, and he did succeed!” Rebecca stared at the scene in disbelief.\n\nRebecca wasn’t the only one thinking this way, either. Flower King and Moon Wheel King were in just as much shock.\n\nEmpty Mouth, White Teeth was not difficult to practice, but it was extremely difficult to use in combat. The user had to have true understanding of their own power and their enemy’s power as well. They had to know a lot, too. If they didn’t, they’d only end up bringing harm upon themselves.\n\nOut of all the Rebate, the only one who could use this ability in combat was Knife Queen.\n\nA few of the Dukes that had practiced Teeth Knife had given it a try in the past, but they all failed. And since a miss in combat could result in death, few others were keen on trying it.\n\nAmidst everyone’s shock, the spring’s eye gleamed with another red light. Another orb of spring water was shooting out.\n\nHan Sen reached out his hand and grabbed the droplet. It was really pleasing to see him do this, like watching someone catch a fly with chopsticks.\n\n“I have to get him away from the spring’s eye!” Rebecca turned into a light, and she shot towards Han Sen.\n\nSword Know and the Tego Earl were running towards Han Sen, too. They wanted to get him away from the spring; they’d kill him if they had to.\n\nDu Lishe and the other Viscounts were still dealing with the xenogeneics. Du Lishe was still a little weak, though, and Moon Wheel King had not permitted her to become an Earl there. So, she did not go to the red mist spring’s eye. Still, she was able to keep an eye on the situation unfolding there.\n\nHan Sen had taken all the spring water alone, and he had managed to do it while beating back the Tego Earl and Sword Know. Needless to say, she was surprised. But when Rebecca decided to join the two attacking Han Sen, what happened next made Du Lishe believe she was dreaming.\n\nThe purple-black Ghost Teeth Knife moved in the same way Han Sen did. It was difficult to predict. He was fighting back the Earls, and despite Rebecca joining in to help, they could still not remove him from the spring’s eye.\n\nThe scariest thing about all this was that when Han Sen and Rebecca were fighting, Han Sen wasn’t looking at the spring’s eye. But when a red orb flew out, Han Sen would lean in and grab it really quick. He was faster than lightning, and in a flash, he’d have put it in his mouth.\n\nNot only Du Lishe was shocked by this. Rebecca, the other Earls, and all the Kings that were observing the events were in shock.\n\nHan Sen’s Teeth Knife was like a raging beast. His skills were very serious, and he looked like a champion. The Teeth Knife skill was helping Han Sen a lot right now. He was surrounded, but even so, he never slipped up once. He wasn’t even rushed or panicked, and his performance was flawless.\n\nDespite the difficulty of performing Empty Mouth, White Teeth in combat, Han Sen used it twenty times without fail. Now they knew that Han Sen was really like Knife Queen. He could use the ability in combat, to a degree that exceeded the chance of being a lucky fluke.\n\nBoom!\n\nAs the observers watched the fight, Han Sen and his knife seemed to merge. Han Sen was Han Sen, and Ghost Teeth Knife was Ghost Teeth Knife, but now they were combined. They were one, like an evil-looking beast with a grin. It gave people the willies.\n\n“Teeth Knife knifemind!” Suddenly, Night River King let out a scream.\n\nYes, it was a Teeth Knife knifemind: the purest example of one, actually. And it was coming from a Baron.\n\nMoon Wheel King and the others were speechless. Even with their years of experience, they had no idea how Han Sen could practice Teeth Knife knifemind in such a small amount of time.\n\nBut this was the Rebate’s Teeth Knife. It was something most Rebate could not practice. Han Sen was just an outsider, and he had learned it all within a month. Moon Wheel King and the rest wouldn’t have believed it if they weren’t there to see it themselves.\n\n“Is he a knife skill genius?” The Kings looked at him with complicated expressions.\n\nRebecca was shocked, too. The scariest thing was that Han Sen’s knifemind was gradually increasing."
}