{
    "chapter": 2199,
    "title": "Blood Scorpion Jade Drum",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2199",
    "text": "Han Sen carefully examined the red patterns that adorned the Jade Drum and realized that they formed the shape of a scorpion. In all, it was around the size of a man’s hand. It was red like jade, and it contrasted sharply with the white surface of the Drum. The pattern didn’t look as if it had been engraved into the item, though. It looked as if an actual scorpion lived beneath the Drum’s surface.\n\nHuangfu Jing looked at the Blood Scorpion Jade Drum. She blurted in surprise, “I have heard that the Jade Drum is the best Drum you can find. But this one has a scorpion pattern on it. Maybe this is even better? It could be a King class Jade Drum that just so happens to be born this way.”\n\nHan Sen nodded. He was very happy about this find. Normal Jade Drums could reach the class of King. But if this one was born a King, it might eventually reach a deified status. Even if that wasn’t possible, it could surely become half-deified.\n\nThere were many races that were considered to be higher races. Usually, that claim depended on having one half-deified elite to maintain their position.\n\nHan Sen stopped talking. He gripped his Ghost Teeth Knife and returned to digging out the Blood Scorpion Jade Drum. He had only gone there to help out Huangfu Jing, and he never expected to get something so nice for himself.\n\n“Good people receive good rewards. I need to do more nice things, then, huh?” Han Sen mumbled as he kept digging through the stone.\n\nThe rock was too hard, though. Han Sen had to exhaust a lot of his energy, and he was breaking his hands in his attempt to dig out the Blood Scorpion Jade Drum.\n\nThis Drum was a little smaller than the other Jade Drums they had collected. It was only the size of two adult fists. Both of its sides showed that red scorpion symbol, and it looked as if there was a red scorpion alive inside it.\n\nThe side of the Drum was inscribed with a number of additional red symbols. Again, they were different than anything that might appear on an ordinary Jade Drum.\n\nHan Sen lifted it in his hands, and he was delighted. He gathered up power and hit the Jade Drum.\n\nPat!\n\nWhat was emitted was not the sound of a drum. Han Sen hit the Drum, and the Drum actually ricocheted the power back towards Han Sen. It put him in immediate pain.\n\n“It doesn’t work!” Han Sen wasn’t about to give up that easily, though. To gain the Drum’s approval, Han Sen had to display his power for it.\n\nHan Sen gathered up his Jadeskin power and struck the surface of the Drum again.\n\nPat!\n\nThe Drum didn’t move or release any real sound. There was just the dull thud of Han Sen’s hand striking something solid.\n\nHan Sen did not want to give up. He used all his power to hit the Jade Drum. He tried to hit it, poke it, and slap it. But that Jade Drum seemed like it was muted. It wouldn’t work for him, no matter what he tried.\n\nNow Han Sen was feeling depressed. If he wanted to take the Jade Drum back with him, he’d need to gain its approval. If he didn’t earn its approval, the Thousand Treasures wouldn’t let him take it away with him.\n\nPang!\n\nA big explosion sounded in Han Sen’s ear. It almost made him collapse. He turned around to see Bao’er laying into the Jade Drum.\n\nDong! Dong! Dong! Dong! Dong! Dong! Dong! Dong!\n\nBao’er was having a lot of fun playing with it. She even played a song called General.\n\nShe might have been having a lot of fun, but Han Sen and Huangfu Jing weren’t. They were struggling not to vomit. Han Sen quickly picked up Bao’er and put the Drum away.\n\n“Bao’er, play this one, as well.” Han Sen moved Bao’er the Blood Scorpion Jade Drum, while he himself moved to the white Jade Drum to see if he could play that.\n\n“The Blood Scorpion Jade Drum might be too high level. This Jade Drum looks good, at least. It could be a Duke. And there’s always the chance it might be King class,” Han Sen thought. He doubted that Bao’er would succeed. But if she did, that would be fine.\n\nHan Sen had confidence. When he patted the drum, though, he felt a pain.\n\nPat!\n\nAfter that little sound, the white Jade Drum made no more noise. He gathered up more and more power, and he kept hitting it.\n\nAnd despite his continued pounding, the white Jade Drum made no noise for him no matter what he did.\n\nHan Sen was left clutching the white Jade Drum with feelings of depression. Then, he thought to himself, “Bao’er played the General song. Does claiming the drum require you to use a sonic power?”\n\nThe theory intrigued him. He tried to remember a particular song, and then he used his fist like a hammer and followed the melody of that song while he hit the Drum.\n\nDong! Dong! Dong! Dong! Dong! Dong!\n\nHe repeated the General, which Bao’er had played earlier, but not to the same quality. Han Sen played it so badly that his hands ended up getting swollen. But again, the white Jade Drum made no additional sound. All that was heard was the pounding of his fists.\n\n“Do I have bad rhythm? There is no way I cannot earn its approval. Especially since this is my luck I’m talking about it. Let me try another song.” Han Sen quickly tried a different song. And then, he focused all his power back into his fists.\n\nDong! Dong! Dong! Dong!\n\nThe sound of striking steel was heard. After a few more tries, Han Sen’s hands felt like they were on the verge of breaking. If that happened, he’d be disabled.\n\nHan Sen was rubbing his fists in a bout of fierce depression. But all of a sudden, he heard the sound of a drum. As the noise rolled over him, it felt as if a steel rod had been shoved down through the top of his head and out his butthole.\n\nPang!\n\nHan Sen fell down onto the ground, coughing up blood. His head was buzzing as if something was grinding it. His organs were all damaged. His body was stronger than a pure Dragon’s, but not even he could stand the strength of that Drum sound.\n\nHuangfu Jing wasn’t doing much better. Blood was leaking past her lips in thin trails.\n\nBao’er was shocked, and she immediately let go of the Jade Drum she was holding. She went over to Han Sen and held his head. She shouted at him. She had just randomly struck the Blood Scorpion Jade Drum because she was bored. She never expected it to injure Han Sen and Huangfu Jing.\n\n“Bao’er, are you trying to kill your Daddy?!” Han Sen pulled himself off the ground with immense pain in his head. He couldn’t think straight.\n\n“Sorry, Dad! I just randomly hit it.” Bao’er said innocently.\n\n“Luckily, your strike was light. If you had used more strength, we’d be dead right now!” Han Sen said, while picking up Huangfu Jing.\n\nIt was fortunate their injuries weren’t lasting. They recovered with their geno arts, but they had realized just how scary that Blood Scorpion Jade Drum was.\n\n“I’ll take you guys back for now, then return here myself. There has to be some way that I can make a noise with this thing.” Han Sen reached out his hand and pointed at the Blood Scorpion Jade Drum. Han Sen summoned his Destiny’s Tower from his Sea of Soul and tried putting the Drum in there for future investigation.\n\nBecause each person could only take one Drum out, and only Huangfu Jing and Bao’er having been accepted by a Drum, there was one left over. So, Han Sen had to hide it.\n\nBut when Destiny’s Tower covered the Drum, the Drum suddenly made a noise and flashed brightly. A sonic force pressed against Destiny’s Tower, pushing it back into Han Sen’s Sea of Soul.\n\n“D*mn! It won’t go in?” Han Sen’s face changed, and blood dripped from the corner of his mouth. He looked at the Blood Scorpion Jade Drum in shock."
}