{
    "chapter": 2458,
    "title": "Crystallizer Creator",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2458",
    "text": "Han Sen had the strong urge to use his super god spirit power to escape the falling net, but ultimately, he chose not to. Instead, he allowed himself to be captured by the crystal net.\n\n“Who are you? How are you using abilities that should belong only to the Blood Eye Evil God?” the woman asked Han Sen, who was now trapped on the ground like a fish in a net.\n\n“I am Prince Sixteen of the Extreme King. My name is Bai Yi. I gained the Blood Evil Eye powers by accident.” Before Han Sen could finish, the woman’s face hardened. She tightened the crystal net that snared him, dragging Han Sen up into the air.\n\n“How dare you lie to me! You are a crystallizer that has disguised themselves as one of the Extreme King. Blood Evil Eye is Blood Eye Evil God’s geno art. It should be impossible to wield unless you have the Blood Eye Evil God’s genes. Do you think I’m stupid?” the woman demanded. She gestured furiously at Han Sen.\n\nA substance chain appeared, and it lashed Han Sen. The whip cut so deeply into Han Sen’s flesh that bone was visible through the wound.\n\n“If you already knew I was a crystallizer, why didn’t you just say so?” Han Sen thought, grinding his teeth. Out loud, he said, “I’m a crystallizer, but I’m a mixed breed. My body has a little of the Extreme King’s blood in it, and I also have some of the Blood Eye Evil God’s blood…”\n\nWhoosh.\n\nBefore Han Sen could finish, the woman lashed him again. Her eyes looked like they were trying to bore holes into Han Sen. “Mixed, my *ss. Is being a crystallizer not good enough for you? Why would you submit yourself to that slave race? And Blood Eye Evil God’s blood? Tell me, how did THAT work out?”\n\nThe woman was so angry that she kept whipping Han Sen’s body.\n\nHan Sen swore to himself that he would never provoke another female researcher. Her temper was really bad.\n\nBut Han Sen realized something. When he saw how angry the woman had become because he pretended to be an Extreme King, he hastily said, “Lady, you are a crystallizer too, yes? Do you know Left Crazy? Left Crazy and I are best friends.”\n\n“You know Left Crazy?” The woman was both surprised and confused, and both emotions showed clearly on her face.\n\n“I know him. And we are very close. I learned a geno art from him,” Han Sen said hurriedly when he confirmed that Left Crazy’s name carried some weight with this woman.\n\nThe woman wasn’t interested in what Han Sen was saying, though. She looked at him with disdain. “Left Crazy is too nice. You are a crystallizer. Even if you were his enemy, he would still be willing to teach you if you were willing to learn. Learning geno arts from him doesn’t mean that you’re actually close to him.”\n\nAlthough she said that, the woman still relented and put away her crystal net. She freed Han Sen from his bindings.\n\n“What is your name, lady? Do you know Left Crazy, as well?” Han Sen asked the woman as he stood up and brushed the dust off of himself.\n\nThe woman really was a crystallizer, which surprised Han Sen. According to what Han Sen had learned thus far, the crystallizers appeared sometime after Sacred had been destroyed. The crystallizers never had a deified in their ranks, either.\n\nThat woman had conducted research alongside Sacred Leader, though. That must have meant she was a powerful figure in the era of Sacred’s reign.\n\nThe woman ignored Han Sen’s inquiry. She looked at him and said, “You are of the crystallizer blood, but how are your body’s genes able to evolve so fast?”\n\n“My genes are fast?” Han Sen asked, feigning ignorance.\n\nThe woman looked at Han Sen with a frown. She said to herself, “This shouldn’t be. My crystallizers finished their tests as a failure. Their fitness was weak, and only their intelligence was at a passable level. How could this one have evolved so fast?”\n\nWhen Han Sen heard that, he was surprised. He looked at the woman and asked, “You created the crystallizers?”\n\nThe woman shook her head. “Not exactly. The crystallizers already existed, but I used Sacred’s resources to modify the genes of the crystallizers. I sped up the progress of their evolution. It was not much of a success, but it worked out better than I had expected. Their fitness and evolution progress were bad, but they were very intelligent. They made perfect assistants for my work. And Left Crazy was one of them.”\n\nAfter that, the woman walked back toward the wooden house.\n\nBecause the woman had stopped threatening Han Sen, he no longer wanted to leave. He wanted to learn as many secrets as he could, straight from this horse’s mouth.\n\nBased on the woman’s story, it was clear she had once been a prestigious person in Sacred. She must have been the head of a research department or something like that. She must have known a lot.\n\n“That means you created The Story of Genes?” Han Sen asked as he reached the door.\n\n“Half of it. Sacred Leader and I built The Story of Genes together, but it failed.” The woman looked at Han Sen and went on to say, “Left Crazy showed you The Story of Genes?”\n\nHan Sen nodded. But he didn’t tell her that he practiced The Story of Genes. If she found out that he had studied The Story of Genes, he was worried that she might decide she needed to dissect him and analyze the pieces.\n\n“Stop there,” the woman said sternly as Han Sen was about to step into the house.\n\n“You stand outside. Don’t track dirt into my house,” the woman continued, sending a cold glance toward Han Sen.\n\nHan Sen knew that the woman meant no harm. She was just a very hygienic woman with a bad case of OCD. He didn’t mind her brusqueness. He stood outside the door and said, “What did you do during your time researching The Story of Genes with Sacred Leader? I have heard that it is related to Super Gene?”\n\nThe woman went into the house and grabbed a shovel. She came out and started to fix the ground where Han Sen had disturbed the grass while fighting.\n\n“You. Start floating. Don’t touch anything here,” the woman said. She then sprayed Han Sen with a perfume.\n\nHan Sen made himself float as the woman commanded. He wanted to learn about the relationship between The Story of Genes and Super Gene, and also their relation to the sanctuaries.\n\nThe woman kept cleaning where Han Sen had walked, and she said, “We researched The Story of Genes so that creatures could learn to use Super Gene. Did Left Crazy not teach you that?”\n\n“No. He only told me that the requirements of The Story of Genes hadn’t been fulfilled, and thus, there were limits to what he could investigate.” Han Sen kept trying to get her to tell him more.\n\nThe woman really didn’t mind the bean-spilling, so she went on to say, “I cannot believe Left Crazy is still researching The Story of Genes. He was right, though. There are requirements for The Story of Genes that were never fulfilled. Even now, it is a failed research project.”\n\n“What is Super Gene? What is Super Gene used for?” Han Sen asked, trying not to let his voice betray how badly he wanted this answer.\n\nThe woman looked at Han Sen with an odd expression. As she stared, she asked, “Do you believe God exists?”\n\n“Why am I being asked this crappy question again?” Han Sen wondered, annoyed. This was a question he couldn’t care less about answering.\n\nHan Sen sighed and said, “I’ve met a couple of guys who called themselves Gods. But I don’t know if they were real gods.”\n\n“Those gods you met, did they claim to be able to fulfill your wishes?” The woman squinted at Han Sen.\n\nHan Sen’s heart jumped. He had gotten to the crux of the issue already, and so he quickly answered, “Yes.”"
}