{
    "chapter": 1140,
    "title": "Sonic Battle Beast",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1140",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen stared at the shadow in the tree with shock.\n\nAfter his vision focused to see it clearly, he noticed it was a slender woman. She looked light and brisk, as her garments waved in a subterranean breeze.\n\nThe woman was incredibly beautiful, so much so, she appeared angelic. She sat on the branch of the tree without shoes, like an art piece.\n\n“Is that a spirit or a humanoid creature?” Han Sen wondered, as he was somehow unable to detect the power within her.\n\nAs Han Sen observed her, the woman turned her head to look at him. Then, she smiled.\n\nHan Sen was still a distance away from the Mother Tree, but for the woman to notice him and smile made him feel good. He was still a noticeable fella.\n\n“The consequence of being so handsome…” Han Sen ran his fingers through his hair and then patted down his clothes. He bared his teeth to present what he believed to be a charismatic smile.\n\nOf course, he still knew he should exercise caution. He remained vigilant, beneath his awkward facade of the suave explorer he was putting on. She was the only one that dared approach the tree, let alone sit on it. It was a clear indicator of how powerful she might have been.\n\nThe lady looked surprised when she saw Han Sen smile in response.\n\n“Do you know her?” Queen asked, as she looked in the direction of that woman.\n\nHan Sen shook his head, saying, “Not at all. I don’t even know if she is a spirit, humanoid creature, or an actual human. She seems pleasant enough, though.”\n\nQueen wished to continue the dialogue and say something more, but all of a sudden, a large noise sounded. The red toads began to croak at a deafening volume, like an amphibian choir. The red toad up front, the king, had a frighteningly large belly, and when it croaked, it was like thunder.\n\nThe toad king approached the tree, while everything else in the vicinity did nothing and just watched.\n\nThe toad king was looking at the lady in the branches, seemingly making the noise towards her. Then, it inflated its vocal sac.\n\nThe lady saw it and smiled, then she pulled a white flute from out of nowhere.\n\nShe placed her lips on the flute and began to play. A strange and harmonic tune gently graced the cavern.\n\nHan Sen was shocked. He thought the lady possessed sonic powers.\n\nHan Sen quickly used his dongxuan aura to hide the senses of as many of the creatures in the vicinity as he could.\n\nHan Sen was so surprised, for as she played, the notes of her melody appeared physical. He never thought music could literally be seen. The notes came out of her flute, rose, then fell gracefully down like feathers.\n\nQueen was just as shocked as Han Sen, to see this woman literally blow notes out of her flute.\n\nAnd the surprise became only greater when the notes touched the ground. They did not fade away. Instead, they remained. And then, their shapes twirled and twisted into that of a snake. After that, the snake slithered over towards the toads.\n\nA scary fight began. And as the snake battled with the toad king, it showed no weakness. It wasn’t going to lose to the red croaker.\n\nAs they fought, the red toad spat out crimson blades towards the snake in an attempt to slice it up. But the snake was too quick and cunning for such simplistic techniques, as it was able to curl to deflect and roll to evade.\n\nThe two were fighting fiercely, as all the other creatures in the vicinity looked on without care.\n\nHan Sen was shocked. Even a single note from that flute was capable of beating a super creature.\n\nHe was made quickly aware the woman was not someone to be trifled with. As far as he was concerned, she was the master of all sonic powers; whoever—or whatever—she was.\n\n“I can’t believe sonic powers can be used in such a fashion.” Queen was in utter disbelief.\n\nAs the two creatures fought, they both did combat with care and grace. Neither of them wanted to accidentally deal damage to the tree.\n\nThe red lights the toad cast were useless, and nothing it could do damaged the snake. The snake eventually wrapped itself around the toad to choke it, and then, with its mouth wide open, sought to swallow the wretch.\n\nPang!\n\nBut as this occurred, the vocal sac of the toad exploded, and a stinky fluid drenched the snake. Evidently, it was a corrosive substance, and the snake melted into nothing.\n\nWhen the sac exploded, though, the toad’s body looked slumped and knackered. It may have defeated the snake, but it was at a great expense of strength and effort. Not wanting to provoke the lady anymore, it slinked back closer to its toad friends.\n\nSuddenly, a new foe emerged from a nearby crevice. It looked very powerful.\n\nHan Sen looked at it, and he was in awe of its yellow hair, big eyes, and long tail. It looked like a squirrel, but it was bigger than a tiger.\n\nIt shone with a gold light, and it ran with an incredibly quick pace. The rock rats in its path could not do anything and were gruesomely squished underfoot before they even knew what was happening.\n\nThe rat king took notice of this and appeared to be quite angry at the act. But it remained still and did not do anything in response.\n\nThe big-eyed fiend ran up to the tree and made a barking noise at the lady.\n\nThe lady looked moody and annoyed by the second intrusion, so she summoned a lute. She held it softly and strummed a magical melody, where each note came together to build a big, golden bird."
}