{
    "chapter": 1209,
    "title": "Trapped",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1209",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhat emerged from the white ball was a creature, one that was as small as a snowball. It was a furry little thing, and it wasn’t too different from a Pomeranian puppy, in terms of its appearance.\n\nThe plush snowball looked at Han Sen and barked with a rage. Woof! Woof! Woof!\n\nHan Sen and Bao’er looked at each other, and then looked back at the creature. With a sudden awkward smile, they ran towards it to feign friendliness.\n\nIt seemed as if the white ball was indeed an egg, and it had given birth to the creature. And if that was the case, the creature wouldn’t be too strong to resist a quick kill.\n\nHan Sen leaped forward to grab it with all his strength.\n\nThe snowball did not attempt to move at first, though. It did not seem afraid of Han Sen and Bao’er’s sudden approach. But seeing the looming hands jerk forward to try to grab it, the creature howled and made its coat of fur shine with a bright white light that flashbanged the two.\n\nThen, it felt as if they both walked into something plush. It was directly in front of them, and Han Sen could not push it away.\n\nAnd when he fell backwards in response, he felt something else barring his passage. All of a sudden, he started to spin and whirl as if he had been thrown into an active washing machine.\n\n“Holy smokes!” Han Sen understood what had happened. He and Bao’er had switched place with the fluffy fiend, and it was them who were now stuck inside a white ball.\n\nOf course, Han Sen was much taller, and the white ball was much larger to accommodate his size.\n\nPang! Pang! Pang!\n\nHan Sen struck the plush flesh of its composure with Taia, but he could not break through. His hits were met with the same reactions as before, and he’d bounce away each time.\n\n“Stop! Stop! Stop!” Han Sen held Bao’er and told her to stop moving and jumping about, as he was starting to feel dizzy.\n\n“So, this is the white ball? And it can trap others inside, can it?” Han Sen pondered his predicament and tried to think of a way in which he might escape the trap.\n\nHan Sen heard barking outside, and then, the ball started to roll. It was a movement influenced by an exterior force. The snowball was kicking the white ball.\n\nPang!\n\nEventually, they rolled into something hard. But they quickly resumed rolling again. They went all about the place as if they were inside a pinball machine, and Han Sen got so dizzy and off-balance, he wanted to throw up.\n\n“You think this is a ball for your own enjoyment?!” Han Sen shouted. Then he summoned a heap of coins, which filled up half the ball.\n\nWhen the snowball tried to kick the ball again, it didn’t work.\n\nHan Sen and his stomach felt much relief. His fitness aided his fortitude and balance, and his ability to withstand dizziness was supremely high. And yet, even so, that was a rollercoaster for his organs. It was an insufferable torment.\n\nBao’er waved her fists next, trying to punch the ball. But her delicate hands were thrown back each time, due to the sturdy-but-plush material that composed the shell.\n\n“Fortunately, being inside the white ball isn’t helping us deal damage to it. At least, I am not physically hurt.” Han Sen took solace in that one fact.\n\nSuddenly, the ball began to spin again. Han Sen tried to use the tumbler theory to help stabilize the ball’s motion, but it seemed the snowball was aware of what Han Sen was trying to do. The blighter kept on pushing the ball.\n\nAnd in response, the ball rolled as it had earlier. Nothing Han Sen could do seemed to stop it, and so he had to think of a way in which he might get out. A difficult task, given the mind-rattling circumstances.\n\nA coin with the number nine could not break the ball, and neither could any move he tried to perform with his Phoenix Sword.\n\nRegardless of past failures, Han Sen thought it best to try Saving Money again, but with even more power. He wondered if, from the inside, he could shoot and break it.\n\nSo, Han Sen performed it. The number on the summoned coin began to rise without issue.\n\n“I just need more numbers to break it, surely,” Han Sen thought to himself.\n\nBao’er was in support of Han Sen’s decision, so she took a step back and waited for Han Sen to perform the move. She was eager to be released and free, so she could beat up the troublesome snowball.\n\nThe snowball then started pushing the ball again, pushing up towards the purple light. The creature didn’t physically shove the ball, though. It was as if the ball had a mind of its own, one that made sure to walk forward and follow the snowball.\n\nA little while later, snowball brought it over to a cliffside. It was going to drop the ball and watch it fall.\n\nAt the bottom of the cliff was a pool, and a fierce creature lurked in its depths.\n\nThe fall would be a long one, as the height they were at was not trivial. If you were to stand there and look down, you wouldn’t even be able to tell what the creature in the pool looked like. All you’d see was a dark shadow beneath the water.\n\nThe snowball approached the cliff and then looked down with much excitement.\n\nIt kicked a couple of rocks down to amp up the anticipation. When the rocks hit the water, bubbles and steam arose as the stones were melted. The snowball fell back a bit, allowing the ball to roll forward and tumble off the cliff. It then began its descent down towards the pool.\n\nThe snowball wagged its tail and paws, as if it was saying farewell to the ball’s occupants.\n\nInside the ball, Han Sen’s coin had reached the brightness of a star. The number read sixteen, and Han Sen’s entire body gleamed with a red power. Even Han Sen had trouble containing all that power. It may have all resided in the coin, but it was the body that was spent.\n\nIf the coin’s power was too much, Han Sen’s body would feel a strain and pressure to maintain the figure of power.\n\n“Sixteen? That should do it!” Han Sen gave the coin one last glance before firing it. Then, he let it loose.\n\nThere were already a lot of coins on the bottom of the ball, so by firing this, Han Sen thought he could break the ball."
}