{
    "chapter": 3042,
    "title": "God Pulse Weird Scene",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3042",
    "text": "Han Sen’s power was nothing Mister Yang could compete with. He tried to control his own power, but it was similar to a digging machine. The little shovel was really fast as it dug out a trench. The purple liquid inside the trench was funneled out.\n\nIt was weird. It was unknown what the purple liquid was. After it was drained, it immediately vaporized not long after it flowed away.\n\nSmoke arose around the dig site. It was blown away by the winds that scoured the fields.\n\nMister Yang did not dare get close, but he really did not dare leave either. He stopped and watched the sight from afar. He just prayed nothing bad happened to Han Sen.\n\nIt was fine for Han Sen to die, but without Han Sen’s protection, he would be in grave trouble.\n\nThere was every chance Peaceful was still looking for him, and Shibo’s family might not be so forgiving of him either.\n\n“What kind of crime did I commit in my last life to meet this goddamned thing I’ve following around right now?” Mister Yang’s heart was wrought with sadness.\n\nHan Sen dug a trench and drained the water, but the purple spring’s liquid was still coming out. It was not slowing down either. He had to jump into the water to start digging. Mister Yang watched Han Sen dive into the spring water. It made his face fill with black lines. His eyes kept twitching as he said, “Death wish… This guy has a death wish…”\n\nHan Sen stood inside the spring water. He felt that the purple spring water was a bit cool. It was like he had been rubbed with alcohol.\n\nStill, that thing vaporized faster than alcohol did. Although the purple liquid kept coming out, it did not create a lot of water. Han Sen was still inside the hole. It did not even surpass his knees.\n\nHan Sen saw Mister Yang had not departed and was instead just watching from afar. He shouted at him, “Old Yang, how deep is the gene egg?”\n\nEarlier, Mister Yang had said the gene egg was very weak before it hatched. He was worried about whether or not he had broken the gene egg.\n\nMister Yang’s eyes twitched. He answered, “From my previous estimation, it should only be half a foot away. If there is an evil spirit spring down there, what I predicted must be wrong. It is hard to calculate its depth. It will not be any further than nine feet though.”\n\nWhen Han Sen heard Mister Yang say that, he plunged his shovel into the spring. It went into the soil. A scary power went with it. He slashed a nine-foot-deep trench inside the hole.\n\nHan Sen was not able to use his Dongxuan Aura, so he could not scan what was down there. He still had the power to control things and cut a hole in the ground that was nine feet deep. He should have been able to measure that right.\n\nWhen the big trench was cut out, the evil spirit spring, which was only as thick as a baby’s arm, suddenly burst open like a volcano erupting. It was 30 feet high and made Han Sen all wet.\n\nRoar!\n\nMister Yang was far away. He watched the spring water explode. He saw a purple light shadow arise. It was blurry, but it looked like a scary big beast. The big beast’s light shadow roared and turned into purple air that disappeared into space. It was like the night in the sky was dyed purple.\n\n“This is… This is… God pulse weird scene… Ancient evil beast…” Mister Yang was so shocked that he fell on his bottom. His eyes opened wide. He started at the space as if he had just seen a ghost.\n\nHan Sen saw the weird scene flash in front of him. He also heard a beast roar, but he did not care much about that.\n\nEarlier, the evil spirit spring water exploded. It was like it exhausted the remainder of the purple water. Now, there was no longer any more liquid. It quickly died down and stopped spilling. The purple liquid that spilled out earlier was quickly vaporized. Within a few seconds, there was no more liquid on the floor. There was some purple air surrounding him. It was like it was there, but it was not there. After the sun shined on it, though, it was gone.\n\nHe dug three feet and felt like the things he touched with his fingers were different. He felt happy. “Maybe I have found it!”\n\nHan Sen quickly used his hands to dig the soil. There was a black metal object visible down below. He thought it was the gene egg. As he kept on digging, he soon found out that it was not the gene egg.\n\n“What is this thing?” Han Sen was suspicious about the item he unearthed.\n\nAlthough he did not understand gene eggs, he knew that the thing in front of him was not a gene egg. Whose gene egg would have grown like a big stick?\n\nThe stuff in front of him was a black metal pillar. The pillar’s top was about the size of a bowl. Han Sen dug down three feet. The rest of it was still in the soil. He did not know how deep it went.\n\nThe part that was showing looked black. It had some carvings with languages and symbols Han Sen did not understand. It looked like an iron pipe with lots of scripture scrawled upon it.\n\nHan Sen looked at Mister Yang from far away and said, “Old Yang, come and take a look at what this is. How did I dig up an iron pipe at a land pulse?”\n\nMister Yang seemed to be really scared. When he heard what Han Sen said, his body shook. He got up off the ground and ran over to the trench. He bent down and looked.\n\nAfter taking a look, Mister Yang’s face looked even paler. It looked as if he had lost his soul. He mumbled, “It is over. It is all over… We are in big trouble…”\n\n“It looks like you know what this thing is. Since I’ve dug it up, why don’t you go ahead and tell me what this thing is?” Han Sen was getting very interested in the item.\n\nHan Sen was a very curious person. If he wasn’t, he wouldn’t have made it to where he was. Mister Yang looked as if the sky had fallen on him. The more he became curious, the more he wanted to figure out what was going on.\n\n“It is no wonder… It is no wonder I was not able to tell there was an evil spirit spring here. This place has an item that can suppress pulses. We have just suffered eight lifetimes of bad luck. If I had known there was a pulse suppression item, I would have never tried to dig up a gene egg here.” Mister Yang was regretful. His belly started to churn.\n\n“Old Yang, if you keep talking like that, I am going to stick this iron pipe into your body.” Han Sen looked at Mister Yang with an unfriendly look.\n\nAlthough he was polite, he did not like people talking like that. He had encountered too many overly scared people.\n\nSeeing Han Sen’s cold eyes, Mister Yang felt a chill come on. He quickly said, “Please do not mind me, Mister. It was me talking a bit excitedly. This iron pipe should be a pulse suppression item. The elites use it to suppress land pulses.”\n\n“Why do they suppress land pulses?” Seeing Mister Yang finally start talking, Han Sen’s expression looked a bit friendlier. Mister Yang sighed and said, “The land pulse has a very evil gene race. When the elites found it, they did not want the gene race in the land pulse to ever be born. Of course, they did not have the power to destroy it. Therefore, they used an item to suppress the land pulse and ensure no one else would come to make the gene race be born.”"
}