{
    "chapter": 1854,
    "title": "Walking Out of the Hall",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1854",
    "text": "Xie Qing King stopped just short of the entrance and spoke aloud to Han Sen. “Do you really have a way? If you don’t, I’ll pull you out of there!”\n\n“Don’t worry. I have a way,” Han Sen said calmly.\n\n“Han Sen, give him your sacrifice and make the wish! Do you want to die?” Captain Wood said, with a frown.\n\n“He is your god, Rebate. He is not the god of the crystallizers. Who said I absolutely must make a wish with him?” Han Sen mocked the scenario.\n\n“It looks like you really don’t want to live.” Captain Wood looked rather gloomy.\n\nIt didn’t matter to him if Han Sen wanted to live or die, but he was on Planet Eclipse. If Han Sen randomly died there, under his supervision, he couldn’t rightly explain to Queen what had transpired.\n\n“Skygod, I am not making a wish. And I will not hand over the feather. Even if you kill me or torture me, you won’t obtain it. So, come on! Give me what you’ve got,” Han Sen said, then continued walking toward the door.\n\nSun Skygod did not say a word. Han Sen’s body was growing old very quickly, though. His face had wrinkled, and his hair had gone white.\n\n“Even if you do not want to use the Raven feather to save your people, aren’t you interested in something for yourself? How about immortality? If you make a wish, you can live forever! Or you can become the king of some land, if you so choose. I can grant you anything you want, right here, right now.” Sun Skygod finally broke his silence.\n\nHan Sen did not respond. He continued walking away. He couldn’t leave, so he just kept on going.\n\n“Has someone you love died? If you make a wish, I can bring them back for you.” Sun Skygod offered more, seeing Han Sen’s continued disinterest.\n\nHan Sen didn’t say anything to him, though. He just kept on going, as if he hadn’t heard a thing.\n\n“If you want to become Narrow Moon’s absolute master, you only have to ask that of me.” Sun Skygod’s offerings were becoming grander as time went on. If this continued, it wouldn’t be long before Han Sen found himself in the seat of the creator.\n\nHan Sen remained unfazed and uncaring. He kept on walking. He walked in the direction of the door that could never be reached.\n\nNot long after, Han Sen’s hair had all turned white. His face was covered in wrinkles. He was like a dying old man. He was really old at this point.\n\nLittle Silver, who had been sitting on Han Sen’s shoulder the whole time, was old, too. His silver hair had turned white, and it looked as if he was going to die of old age.\n\n“What? Are you not going to help him?” a Marquise mocked.\n\nXie Qing King said coldly, “He said he has a way out of there.”\n\nThe Marquise lifted his top lip, thinking Xie Qing King was merely too scared to go to Han Sen’s aid. The others thought the same, as well. They could see him standing on the precipice, only watching Han Sen and refusing to step inside.\n\nSuddenly, the purple-bronze door shut. And then, you could not see what was beyond there. This also meant Han Sen was now hidden from sight.\n\n“It looks like Skygod is angry. Han Sen is most likely dead now. We should go, Master.” Captain Wood was speaking to Black Steel.\n\nBlack Steel frowned and looked at the solemn door that had closed. He said, “Okay, let’s leave.”\n\n“What are you two doing there? Why are you not leaving?” a Marquise asked Xie Qing King and Gu Qingcheng.\n\n“We are waiting for Han Sen,” Xie Qing King coldly said.\n\n“Earlier, you two were afraid to step inside. Stop pretending about this nonsense.” The Marquise lifted his lip.\n\n“Let them stay,” Black Steel said. Then, he signaled for the rest of the team to depart. Then, he murmured to Xie Qing King, “Tell Han Sen that I’m sorry. I will leave much of the lotus in the base.”\n\n“Okay.” Xie Qing King affirmed he would.\n\nWhen Captain Wood took the others to the place’s exit, Xie Qing King spoke again. He said, “Is Han Sen really going to be fine?”\n\n“I thought you were confident he would be.” Gu Qingcheng looked at the door before them and spoke carelessly.\n\n“I am, but that Skygod is a dodgy fellow. I am afraid Han Sen will walk out as an old man.” Xie Qing King slumped his shoulders.\n\nGu Qingcheng understood what he was getting at, but she did not respond to him.\n\nA lot of time passed, and after an hour, the purple-bronze door opened. Han Sen came out alongside Little Silver.\n\nHan Sen had not become an old man, and he was as young as he had been when he first entered the hall. He had not been injured, either.\n\nLittle Silver was fine, too. And he had his old silver fur that was radiant and shiny.\n\n“Did you make a wish?” Gu Qingcheng spoke to Han Sen, looking real dim.\n\nHan Sen shook his head and pulled out a box. He smiled and said, “The item Skygod wanted is still in here. Even if I make a wish, he won’t listen.”\n\n“Why would he let you go unharmed, if you didn’t make one?” Xie Qing King asked with much curiosity.\n\n“I was fine the whole time. Him speeding up time was merely an illusion.” Han Sen smiled.\n\n“It was an illusion? That means he wasn’t real, and all his power was merely for show?” Xie Qing King said.\n\n“He doesn’t have all the powers he pretended to have, but at least his space powers were legit. Even though he is not really all-powerful, he is still at a deified level. Even if we have to fight him eventually, we cannot deal with him now.” Han Sen shook his head.\n\n“Why did he not kill you and just take the feather?” Xie Qing King could not believe that things had worked out this way.\n\nHan Sen did not answer Xie Qing King, though. He just looked at Gu Qingcheng and asked, “That Sun Skygod, was he the same god as the one you met?”\n\nGu Qingcheng shook her head. “I don’t think so. This one gave me a completely different feeling to the one I previously met. That being said, there appears to be a thread connecting them somehow. Maybe. I can’t quite put my finger on it.”\n\n“Maybe they are both of the same kind? They must both have a limitation of some sort. They cannot just kill people.” Han Sen did not continue with that train of questions, though. He just looked around and asked, “Captain Wood and the others have left?”\n\n“As soon as the door shut, they took their leave. Black Steel told us he would leave some of the lotus roots for us at the base,” Xie Qing King answered.\n\n“I am afraid they might not even be able to leave the palace. As far as I know, those who make wishes don’t meet a fond fate. Let’s go. I hope we can catch up with them.” Han Sen took off power walking.\n\n“I don’t understand! How did you know all that was an illusion?” Gu Qingcheng asked, matching Han Sen’s speed. She had no idea it was all a trick.\n\nHan Sen did not answer. He patted his shoulder and Little Invisible revealed itself. Han Sen smiled. “If that power was real, he should have aged, too.”"
}