{
    "chapter": 1120,
    "title": "Beast Vine",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1120",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe clouds only remained open for a second, but in that time, Han Sen was able to discern that the vines were not growing from the mountaintop. They were actually the appendages of a monster.\n\nIn the space of that brief look, the image of the monstrosity was seared into Han Sen’s mind. The vines had a mind of their own, but they grew out of a living creature. This was something he had seen before.\n\nThe gourd Bao’er came from had brown upon vines that had writhed around the ancient bones of creatures. The vines were almost completely similar.\n\nThe only difference was the absence of a gourd on the vine.\n\n“That vine can’t be a relative of Bao’er’s, can it?” Han Sen wasn’t so sure whether or not these things could bear gourds. Perhaps it one day would grow one.\n\nBut there had to be some connection between the vine and Bao’er. If there wasn’t, she wouldn’t behave in the manner she currently had been.\n\nDuring Han Sen’s thought, the fish king blitzed through the pain it had endured and dove through the clouds with its tail, breaking it like a thick mucus to provide passage. Once it was through, it went for the vine.\n\nThe purple light shone again, but it was not like a blade. It created a swarm of purple bees that rushed to surround the fish king.\n\nBao’er finally moved. She slapped her gourd, which allowed it to suck and ingest all the purple bees.\n\nPang!\n\nThe fish king’s body was sent crashing down the mountainside. But it was not content to stay there. It jumped up and headed for the vines, again, as if it were in a desperate rush.\n\nIt looked as if the fish was hungry to consume the vine, but before it could, the monster stood up. Its hideous head knocked the fish king away, making it bleed even more.\n\nRoar!\n\nThe monster let out a fearsome roar as it raced towards the fish king with its vines lashing wildly.\n\nThe fish king shone gold and was unfazed by its gruesome foe. Quickly, it went to clash with the fell beast.\n\nA purple and gold light mixed together in mid-air.\n\nHan Sen flew up above the clouds to watch the fight unfold. Even with super king spirit mode, Han Sen did not believe he was a match for either of the creatures. For now, he was content to just watch.\n\nHan Sen noticed the monster was different from the skeleton of the one in the Second God’s Sanctuary, where Bao’er’s gourd had grown.\n\nAlthough only the bones had remained, he could immediately tell.\n\nThis monster was like a ghost with horns. Its body shape, he could tell, was different from the one in the Second God’s Sanctuary.\n\n“Does Bao’er have something to do with these vines?” Han Sen watched the vines with ardent curiosity. The vines were quite frightening. They were like tentacles, growing from the raging monster that fought with the fish. But Han Sen could not see any fruit or gourds growing from them.\n\nPerhaps the vine fed on the monster’s energy, or empowered it. If it was just the monster fighting the fish, it would have been killed.\n\nThe monster’s vines kept hitting the fish. Their brutal powers were proving too much for the fish, though, and it was clearly going to be the loser in this battle. Despite having been ravaged and despite oozing gallons of blood, the fish was not willing to give up. It did not relent in its combat.\n\nThe fish king was getting weaker and weaker, and eventually, the vines managed to grip the fish and begin strangling it. The fish was made unable to move.\n\nThe beast’s horns managed to skewer the fish, and with the fish drained of its health, it was tossed crudely down to the lake below.\n\nThe lake turned completely red after this happened. And unlike before, it did not immediately spring back into action. After a while, it slowly resurfaced.\n\nIt wasn’t dead yet, but the light was dim and fleeting.\n\nThe wounds across its body were massive, and most of its body had been stripped of scales and flesh. Much of its skeleton was exposed. The fish struggled to regain its composure. It tried jumping up, but it got no further than a height of ten meters, before falling back down.\n\nBao’er looked at the sky, looking as if she did not wish to give up just yet.\n\nHan Sen, seeing the fish king die, went to pick up Bao’er.\n\nAfter the fight, Bao’er did not appear to have suffered a single scratch. Perhaps the vine did not want to injure her; he did not know.\n\n“Bao’er; what do you want up there?” Han Sen hoped she would answer his question.\n\nBao’er continued looking up at the mountain, and said, “Dad, I want vine.”\n\n“For what purpose?” Han Sen asked.\n\n“I just want it,” Bao’er said.\n\nHan Sen kept asking her for more details, but she did not elaborate. He suspected she didn’t even know herself, but there was some phantom urge compelling her to go.\n\nHan Sen stopped asking, but resolved to finish the fish king off. He grabbed his Phoenix Sword and readied himself to plunge it deep into the creature. It was a super creature, one that might have opened ten of its gene locks.\n\nIt was dying, and now was his opportunity.\n\n“Don’t kill it,” Bao’er said.\n\n“Why?” Han Sen was confused, as she had never stopped him in such a way before.\n\nBao’er looked back to the mountain, saying, “It is not our enemy. We need its help.”"
}