{
    "chapter": 69,
    "title": "White Underwear Flag",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_69",
    "text": "Lu Weinan was sick of eating the meat of poisonous-clawed beast these days. Relying on his mutant iron-feathered bird beast soul, he flew into Dark Swamp to hunt mutant creatures and only killed this one poisonous-clawed beast in days.\n\nThis beast was larger than a cow, and he had been eating its meat for more than half a month and still had a thigh left. He had only gained five mutant geno points from it so far.\n\nJust now, he had gained one mutant geno point already by eating just a piece of meat from the pot. He suddenly understood why Han Sen didn’t want to trade—although both were mutant creatures, the thigh he had was worth much less than what was in Han Sen’s pot.\n\nLu Weinan looked at the pot of meat eagerly and then his eye fell on Han Sen. A knife in hand, he blew a whistle. The iron-feathered bird beat its wings and hovered over his head.\n\n\"Do you want to trade, or let me beat you up before I eat your stuff?\" Lu Weinan was ready to dine and dash. There was no one in Dark Swamp and no one would even know if he killed Han Sen. Since he had the iron-feathered bird mount, no one would be his match here.\n\n\"F*#k off,\" Han Sen said quietly.\n\n\"You asked for this,\" Humiliated, Lu Weinan yelled and hacked his knife at Han Sen. Although he had gained the beast soul of mutant iron-feathered bird, he apparently didn’t have the same luck in beast soul weapons—his knife was one with 5 percent Z-steel.\n\nHan Sen was wearing sacred-blood armor so he was not afraid of such weapon. He didn’t even shapeshift into the bloody slayer, but just summoned his mutant sawfish spear and wielded it at Lu’s knife.\n\nCrack!\n\nThe sawfish spear cut the knife off as if it were made of tofu and continued to stab at Lu.\n\n\"S*#t!\" thought Lu Weinan. He twisted his feet like a snake and barely escaped Han Sen’s attack.\n\nWithout a pause, Lu Weinan quickly ran back with strange but smooth body positions. Han Sen missed several stabs in a row and Lu swiftly jumped on the back of his bird mount and rose in the air.\n\n\"How dare you challenge me? I’ll just kill you,\" said Lu Weinan triumphantly, taking his bow and arrow to shoot at Han Sen who was on the ground.\n\nWings suddenly grew from Han Sen’s back and he rose in the air higher and faster than the iron-feathered bird.\n\n\"Damn...\" Lu Weinan was dumbfounded. How could he know this guy could also fly and even had wings instead of a mount?\n\nSubconsciously, Lu Weinan ordered the iron-feathered bird to go higher.\n\nEven if what Han Sen had were mutant beast soul wings, he wouldn’t be able to fly too fast or too high. The iron-feathered bird should be able to get rid of him.\n\nBut soon Lu Weinan found himself completely wrong, his enemy could fly not only very high, but also very fast, catching up with him in the blink of an eye.\n\n\"Who is this monster? His wings couldn’t be sacred-blood, right?\" Lu Weinan almost burst into tears.\n\nHe didn’t expect his enemy to be so strong. With his wings and his golden armor and spear, Han Sen looked more like an angel than a human.\n\nHaving caught up with Lu Weinan, Han Sen poked the spear at him. All Lu wanted do was to knock his own head on a wall. Why on earth did he try to escape on the back of the iron-feathered bird? Now he couldn’t even use his body positions. Sitting on the bird, he had nowhere to hide. If he moved around, he would fall.\n\nWhoosh!\n\nThe spear was poked into Lu Weinan's butt, leaving a long wound—Lu’s soft armor didn’t stop the spearhead at all.\n\n\"Brother...Brother...Calm down...This is just a misunderstanding!\" Lu Weinan shouted hurriedly.\n\nHan Sen ignored him and stabbed at him again, making a symmetrical wound on the other side of his butt. Blood started to ooze from the wounds.\n\n\"Big brother, uncle, I was wrong. Stop poking or I will die. I surrender,\" Lu Weinan screamed while begging for mercy.\n\nHan Sen ignored him and kept poking. Lu Weinan saw the horrifying and shining gold spear and cried, \"Big brother, please slow down. We are both men. It will do you no good if you kill me. You see I have a flying mount, which will be of some use to you if you need me to run some errands for you...Ouch...\"\n\nLu Weinan was stabbed again and his face had turned pale. He was bleeding too much and he would die before long. He looked down at himself and saw he was wearing black all over. Lu reached into his clothes and ripped off his white underwear stained with blood. Waving his underwear in one hand, he cried, \"Big brother, don’t poke! I surrender. We can have a discussion. Isn’t it true that we have a policy in the Alliance to offer good treatment to the captives?\"\n\nHan Sen was silent all the time. Lu Weinan thought Han Sen couldn’t hear him because the wind was too loud in flying. That’s why he thought of the universal way of surrender, to wave a white flag.\n\nHan Sen saw Lu Weinan waving his ripped underwear and almost laughed out loud. \"Fly back,\" He held his laughter back and ordered.\n\nLu Weinan was suddenly overjoyed, and quickly ordered the mutant iron-feathered bird to go back where he met Han Sen.\n\nWhen they were back to the place where the fire was made, the pot of meat was still there. Lu Weinan fell to the ground and screamed as he pulled the wounds on his buttocks.\n\n\"So, tell me, how are you going to compensate me for my loss?\" Han Sen smiled and looked at Lu Weinan who was covering his ass with both hands.\n\nLu Weinan’s face suddenly went stiff, \"Big brother, I’ll give you whatever you want, except for this iron-feathered bird. You can take your pick.\" He summoned several beast souls and said bitterly, \"These are all I have. Please forgive me.\"\n\nHan Sen checked the seven or eight beast souls summoned by Lu Weinan and there was even a mutant beast soul. He knew Lu was definitely holding back. But since Lu had summoned a mutant beast soul, it meant that he would like to give away the mutant beast soul for his life. At the same time, he was using this beast soul to decline Han Sen’s asking for the iron-feathered bird before Han Sen even asked. He was depending on the bird to survive here and wouldn’t give it up for the world.\n\n\"That mutant beast soul. And you, before I leave Dark Swamp, you have to follow my command.\" Han Sen thought this kid could be of some use, also Han Sen didn’t want him to wander alone. If Lu found the forest first and killed the mutant black stingers, Han Sen’s ultimate purpose of this trip would be defeated."
}