{
    "chapter": 2940,
    "title": "Han Yu Fei",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2940",
    "text": "There was another reason he remembered. It was because the woman had the same surname as him. It was Han, so that was another major point as to why he recalled the name.\n\n“Which race was Han Yufei? What was her position in Sacred?” Han Sen asked.\n\nNine Thousand King shook his head and said, “I don’t know. No one knew what race Han Yufei belonged to. She was a very mysterious woman. Even Sacred Leader treated her extra nice. He did everything she told him to do. The leader had many secret experiments going on. That woman was in charge of many of them. The legends claim that Han Yufei researched the leader’s Sacred power and discovered a way to break it. But that is just a legend. There is no knowing if it is true. Even if it is true, it will not help out the situation as it stands. We cannot locate Han Yufei from here.”\n\n“What does Han Yufei look like?” When Han Sen heard Nine Thousand King’s description, his heart jumped. “This Han Yufei sounds so familiar. Could she be the woman trapped in Two Worlds Mountain?”\n\nHan Sen thought that had to be correct. The woman on Two Worlds Mountain had researched with Sacred Leader, but she was trapped on Two Worlds Mountain. She was unable to die. The crime on the scroll was kind of hinting at something similar.\n\n“I do not know. Aside from Sacred Leader and a few core people, no one was able to see her true face. She usually wore some weird mask. Even a true god class see-through geno art could not enable you to see what was behind the mask. Aside from Sacred Leader, who had seen her face, the most likely person who would have also seen her face was probably the general Purple Fight. Sacred Leader let Purple Fight protect Han Yufei.” Nine Thousand King stopped talking. He looked grumpy again. He said, “It is useless to talk about all this now. Don’t you have a geno art that can downgrade a true god? Can you use this geno art to break the Sacred power?”\n\nHan Sen shook his head and said, “My power only works on creatures. The holy garden is not a creature, so my geno art will not work.”\n\nIt was not that Xuan Yellow Sutra was completely useless. Even if it was useful, Han Sen would not break the restrictions on the holy garden. He wanted to unearth more secrets from Nine Thousand King.\n\nHan Sen did not know if Nine Thousand King really did not know much or if he was simply too scared to blab about everything, but Han Sen had been unable to learn anything more useful from him.\n\nYang Yun Sheng’s eyes had managed to get a bit better. Han Sen saw the holes in his eyes, which looked like bloody pits, and thought, “It looks like the time and space loop only affects the items that are already in the garden. Outsiders like us are not affected by the time and space loop. At least our bodies did not go back to how they used to be.”\n\n“As for the meat we ate… The deified genes are all gone. That means if things are removed from here, they will be recovered.” Han Sen looked at Wan’er’s statue. “If this was built for Wan’er, and she used to live here, perhaps she knows how to leave.”\n\nHan Sen did not plan on waking up Wan’er. He watched Nine Thousand King on the sly.\n\nNine Thousand King was walking around looking all grumpy. He rushed out of the front door and came back in via the back door. The holy garden was like a scary prison. It was a prison there were never going to be released from.\n\nSuddenly, Nine Thousand King was standing in the pavilion. He stared at the pot. He screamed as he stared at Wan’er’s statue.\n\n“Have you found something?” Han Sen quickly ran over. He looked at Nine Thousand King. He saw the statue was still the same. There were not any visible changes.\n\nHan Sen had been investigating that statue for a long time. He had not seen anything special about it.\n\nNine Thousand King looked very excited. He pointed at the statue and said, “This statue… This statue could be the key to overcoming the holy garden’s restrictions.”\n\n“What makes you think that way?” Han Sen did not understand.\n\n“This statue is wrapped up in clothes. I did not notice them before. Now that I have taken a proper look, I can see her connected to the entire pavilion. And this statue… This statue…” Nine Thousand King was too excited to say anything more.\n\n“What about the statue?” Han Sen asked.\n\n“If I am correct, this jade statue is made from the Holy Kirin’s horns. This is not a statue. This is a true god weapon.” Nine Thousand King looked surprised and went on to say, “In this holy garden, everything else can be normal. The flowers, grass, trees, and wood can be normal. Only this statue is a true god item. It could be the restriction of the garden itself.”\n\nWhat Nine Thousand King said made some sense, but Han Sen did not agree with the theory.\n\nAccording to what Nine Thousand King said, Sacred Leader was very nice to Wan’er. If things were that way, why would he make a statue of Wan’er and allow others to touch her?\n\nIf it was Han Sen, he would never make a statue of Bao’er or Ling’er to be a trap.\n\nNine Thousand King did not care. He thought the statue was the crux of their issues. He thought it was what was creating the restrictions. He did not dare touch the jade statue. He turned around and looked at Yang Yun Sheng and said, “You! Move this statue.”\n\n“You can kill a soldier, but you cannot humiliate them. Kill me if you want. There is no way am I going to scout ahead for you.” Yang Yun Sheng stood his ground. His body had power. He was planning on fighting Nine Thousand King.\n\n“That is not your choice to make.” Nine Thousand King coldly laughed. The eye on the dark green armor was opening. It was like a monster full of eyes. It was releasing some weird eye light.\n\nYang Yun Sheng was blinded. When the weird light shone on him, it was like he lost his soul. His power was gone. He walked toward the statue in the pavilion.\n\nHan Sen frowned, but he did not stop this from happening. Yang Yun Sheng was not his friend, and he hated the Extreme King. There was no reason for him to save his life.\n\nHan Sen thought, “Although Bai King gave me many benefits, he almost killed me. I am being nice enough by not seeking vengeance on the Extreme King, so I’m not saving Yang Yun Sheng.” He just stood there and watched Yang Yun Sheng walk up to the statue and almost touch it.\n\nHan Sen had not touched the statue before. Nine Thousand King was scared of Sacred Leader, so he had not touched it either. Yang Yun Sheng was going to be the first person to touch the statue.\n\nWhen Yang Yun Sheng’s finger touched the clothes on the statue, he suddenly heard Yang Yun Sheng scream. It was like his entire body was pushed away by some strange power. He flew upside down and hit the holy garden’s wall. He coughed up blood.\n\n“Useless crap!” When he saw that, Nine Thousand King’s face changed. He was definitely not going to touch the statue now. He looked at Han Sen and Bao’er. He then looked at the big goldfish. He said to Han Sen saying, “Since we are in the same boat, use your pet to try. It is the only way.”\n\n“Try it yourself,” Han Sen coldly said. “I don’t think the statue is the cause of the restrictions.”"
}