{
    "chapter": 2357,
    "title": "Killing Underwater Xenogeneics",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2357",
    "text": "Because Han Sen was uncertain of Miss Mirror’s ultimate goal, he didn’t dare take any obvious risks. He remained on Planet Water Zone and spent his time hunting down Duke xenogeneics. He wanted to fill up his Duke genes.\n\nHan Sen found a few Duke xenogeneics, killed them, and consumed their Duke genes. Their xenogeneic genes increased his Duke gene tally by one point each, so leveling up was a very slow process. It wasn’t as fast as eating one King xenogeneic gene to claim ten Duke gene points.\n\nHe didn’t want to cause much of a ruckus. He needed to be patient and slowly trawl through Planet Water Zone in the hunt for Duke xenogeneics.\n\n“What is this?” Han Sen came across a little mountain moving across the bottom of the sea. It slid forward at a very slow pace, but Han Sen could tell that it really was moving.\n\nWhen Han Sen rode the blood kirin down to get a better look, he realized that it wasn’t actually a mountain. It was a conch. The shell was one hundred meters tall. It was black and greyish, and it looked like stone from a distance.\n\nBeneath the conch, the white skirt of the conch was revealed. It was slowly flapping and moving across the sand.\n\nFeeling Han Sen and the blood kirin draw near, the mountainous conch moved its flesh and released a blue light. It covered an area of one thousand meters, cloaking Han Sen and the blood kirin at the same time.\n\nThe blood kirin was angered. His blood air exploded out from him as he thundered toward the sea conch.\n\nHan Sen didn’t know what the sea conch’s area did. It didn’t seem to affect Han Sen directly. The blood kirin soon came before the sea conch, though, with that blood air swirling all around him.\n\nThe sea conch retreated back into its shell as the blood kirin’s claws skittered across the hard surface of the shell, leaving some scratch marks across it.\n\nThe blood kirin roared in fury. It kept swinging its claws at the conch, trying to break through the shell. But despite its strength, the blood kirin couldn’t leave behind anything more than light scratches. The conch shell was one hundred meters tall, so those scratches were inconsequential.\n\n“A King class xenogeneic?” Han Sen was delighted by this discovery. If its shell was that sturdy, the creature must have been King class. A weak King class, judging by its fleshy body, but a King class nonetheless.\n\nThe blood kirin continued striking the shell, but each blow left less and less of a mark. It was rather confusing to Han Sen.\n\nHan Sen pulled out his Ghost Teeth Knife and swiped across the shell. It did nothing, and his performance paled in comparison to the blood kirin’s.\n\nHan Sen frowned. He pulled out his Thunder God Spike, summoned its lightning, then thrust it toward the sea conch’s shell. He wanted to paralyze the beast. After that, he could flip it on its back and slay it from below.\n\nBut the creature’s shell seemed to insulate it perfectly from the lightning of the Thunder God Spike. That made Han Sen raise an eyebrow. “This guy’s shell is really hard. But it is so big. I bet it would make an amazing armor.”\n\nThe shell was far too large to be used for a single set of armor. Still, it would make an excellent construction material for something larger.\n\nBefore Han Sen could make something out of it, though, he first had to kill it. He tried all sorts of different powers, but his strongest attack could only deliver a mark that was a few inches across. It had no effect on the sea conch.\n\n“Let’s flip it!” Han Sen called to the blood kirin. Gathering their strength, they turned the sea conch over. After flipping it, though, they realized it was sealed on the bottom. There was no way in. The opening was blocked by the same material that composed the rest of the shell.\n\nAs they looked over the creature again, Han Sen and the blood kirin realized that the marks they had left on its shell had vanished. Their efforts had been wasted.\n\n“This isn’t right. This guy probably has a third-tier area. How else could the conch shell be so hard? Even the blood kirin, with an attack at full power, only leaves a small mark…” Han Sen looked around at the blue lights of the area that was all around. “How does this conch have such a powerful king area?”\n\nThey had been there for a long time, but the blue light hadn’t done any damage to Han Sen or the blood kirin. It certainly wasn’t meant as an attack.\n\n“Is this a weakening area, perhaps?” Han Sen considered the possibility, but it didn’t seem quite right.\n\nIf it was a weakening area, he should have been able to feel his own power losing strength. Han Sen wasn’t sensing any energy drain, though; his body was full of vigor.\n\n“If it isn’t a weakening type, then could it be a cell-strengthening type? Does the blue light increase the shell’s strength?” Han Sen stroked his jaw as he thought about this, but he ultimately discarded this idea as well.\n\nIf it was a cell-strengthening area, the sea conch wouldn’t have needed to release the light into such a large area. The wider the area, the more spread out the power would be. The cell-strengthening area would only be required around the shell itself. Why would the creature need to extend its reach so far?\n\n“If it isn’t a weakening or a cell-strengthening area, what is it?” Han Sen stared at the sea conch as he mulled over the conundrum.\n\nThe blood kirin had a short temper, and its inability to damage the sea conch’s shell was making the blood kirin more and more furious. It kept trying to bite the shell, but nothing worked. The marks they left were becoming lighter and lighter.\n\n“Hang on… The blood kirin’s power hasn’t weakened. In fact, his anger has made him even stronger. Why are his scratch marks becoming lighter?” Han Sen stared at the scratch marks on the conch shell. After a while, his eyes sparkled. “Is his area power…”\n\nHan Sen swam next to the conch shell and stroked the scratch marks across its surface. The blood kirin stopped attacking.\n\nNot long after, the scratch marks were gone. The healing unfolded before their eyes.\n\nIf even a top-class half-deified creature like the blood kirin couldn’t break the conch’s shell, then the shell was unbelievably hard.\n\nHan Sen didn’t think that the strength was coming from the material of the shell, though. The conch shell was very hard, but its incredible resistance was because of the creature’s King area.\n\nHan Sen didn’t know if his guess was correct, so after a moment of thought, he took the blood kirin and left. They departed the sea conch’s area of blue light.\n\nThe sea conch behaved as if it knew what they were doing. It spread the blue light further, but the max range was two thousand meters. It couldn’t extend the light beyond that.\n\nWhen Han Sen and the blood kirin got far enough away that the sea conch couldn’t feel their presence, they hid behind a big rock, Han Sen used his Purple-Eye Butterfly to observe the sea conch in the distance.\n\nThe sea conch waited there for a while. It must have been almost half an hour before the creature emerged from the shell to look around. After a while, when it didn’t see Han Sen and the blood kirin in the vicinity, it shut off its blue light.\n\nUpon seeing that, Han Sen summoned Spell. He turned her into a sniper rifle and took aim at the sea conch.\n\nPang!\n\nWithout hesitation, Han Sen squeezed the trigger. The bullet fired out of the barrel and broke through the water. It was silently headed for the sea conch."
}