{
    "chapter": 2412,
    "title": "Fighting Face to Face",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2412",
    "text": "Move Mountain Area was practically invincible, but Han Sen felt as if he was going to reach the end of his tether soon.\n\nThere was no problem with the way Move Mountain Area functioned, but there was a limit to the amount of power that the Donxguan Armor could support. So much power was being funneled into the armor that it was starting to produce cracking sounds, like breaking glass.\n\nThe Dongxuan Armor was only on its first tier. Although it was the best when compared to others of the same level, that level was simply to low for this situation. The fact that it had endured this long was amazing.\n\n“If Dongxuan Armor can level up to its ninth tier and be reset, then the combination of Move Mountain Area and the Dongxuan Area will make fighting a deified xenogeneic face-to-face quite feasible,” Han Sen thought to himself.\n\nBoom!\n\nAs Han Sen was thinking, the core furnace was opening to absorb as much universal energy as it could. The furnace’s fire flared up brightly.\n\nThe furnace itself seemed to be changing under the heat. The copper had become semi-transparent, and it glowed with the wavering light of its flames. It looked both very weird and very beautiful.\n\nFire spewed out of it as the fifth fire area poured forth. The greenish fireball became solid like water as it wrapped over the Swords from the Furnace.\n\nMany swords absorbed that fifth fire area power. The swords looked like perfect glass now. They moved like they had been possessed by sword spirits, and dangerous shadows traveled behind them.\n\n“Five fire areas? This is very nearly a substance chain power… The core furnace is cheating…” Dragon One and Dia Robber were both in shock. Their bodies were trembling with intimidation from the sight of all those swords.\n\nThey weren’t scared for their own lives, of course, but the sight of all that power caused a gut reaction that neither of them had expected. Even from this distance, they could feel the dangerous heat of the coming attack.\n\nLuckily, Dragon One and Dia Robber were top Kings. These wisps of sword air would have already forced ordinary Kings down onto their knees.\n\n“Maybe after this fight, that core furnace will become deified,” Dragon One murmured, his eyes locked on the furnace.\n\n“Can Dollar withstand it?” Dia Robber looked into space. The stream of swords was pointing at Han Sen. The cold sweat running off of the Destroyed had soaked his clothing.\n\nHan Sen could see that the Swords from the Furnace were all aiming at him, but he wasn’t afraid. He complimented them quietly, saying, “Such a powerful xenogeneic… What a shame.”\n\nAs he spoke to himself, Han Sen stretched out a hand. His thumb and middle-finger came together, and a coin appeared between them.\n\nHan Sen couldn’t move. Move Mountain Area’s buffing had made the Dongxuan Armor too heavy. In addition, the Dongxuan Armor had reached max capacity. If it absorbed any more power, it was sure to blow up.\n\nSo, now, Han Sen had to fight face to face. He had no choice.\n\n“He has to fight?” Upon seeing Han Sen’s plan, Dragon One and Dia Robber looked unsettled.\n\nA first-tier King was going to fight the almost-deified furnace. The likelihood of death was very high.\n\nThey could see Han Sen’s situation and hear his armor creaking. There were some small marks starting to appear across it. Clearly, it couldn’t endure the suppression of that scary power for much longer. They thought Han Sen was fighting now because he had no other choice.\n\nA first-tier King should have had no chance at all against that enormous storm of swords.\n\nHan Sen didn’t agree, though. The Swords from the Furnace were scary. Even Move Mountain Area and his Dongxuan Armor couldn’t bear them. But the incredible power that had built up within his armor was something that Han Sen could now use.\n\n“Come on! Let the world know the power of Collecting Taxes!” Han Sen growled under his breath. He held the coin tightly between his fingers.\n\nBuzz!\n\nThe coin moaned, and the numbers upon its surface jumped up quickly.\n\nOne… two… ten… fifty…\n\nThe numbers upon the coin blurred as they raced upward. The wave of swords gathered, preparing to head for Han Sen and his coin.\n\nHan Sen’s coin had two skills: Saving Money and Collecting Taxes. Saving Money could stack up his own power to attack. Collecting Taxes came from Han Sen’s Coin geno core. Rather than using Han Sen’s own power, that skill depended on external powers.\n\nWithin a certain radius, all creatures with power would sacrifice their own energy to fuel the skill. The stronger the creatures were, the more taxes were collected.\n\nEach and every Sword from the Furnace was wretchedly strong. They were half-deified, almost fully deified. There were many of them, too.\n\nEvery sword surrendered a small amount of power, and Han Sen collected their taxes. An unnerving amount of power gathered on Han Sen’s single coin. That coin’s power increased to such a level that Han Sen almost couldn’t control it.\n\nWhen the furnace groaned, countless swords received their fire buff. That put them on the move. The stream of swords looked like a tsunami descending on Han Sen. Their power blanketed everything as if they were about to rip space itself apart.\n\nDragon One and Dia Robber started to fall back. The stream of swords was too frightening. After that hit, the furnace was sure to become deified. Once that happened, they would have no hope of escaping.\n\nDing!\n\nHan Sen finally fired his coin at the smithy furnace. It flew toward the furnace in a streak of gold light.\n\nThat coin’s power was beyond Han Sen’s control, and he had no choice but to fire it. If he hadn’t, it would have exploded and taken him with it. As the coin flew, the numbers continued to increase, gathering power from the area all around it.\n\nThe coin’s light, compared to the numerous sword lights, was tiny. Its tiny gleam was nothing outstanding.\n\nBut when the Swords from the Furnace came into contact with the coin, they broke. They were as weak as soap bubbles, and the gold light continued toward the copper furnace.\n\nDragon One and Dia Robber were falling back. They saw Han Sen fire his coin, but due to the heavy sword stream, they couldn’t keep track of the small gold light.\n\nThe scary stream of swords approached Han Sen’s body, and the coin came into contact with the copper furnace. Then, it produced a crunchy metal noise.\n\nIt wasn’t loud, but it was oddly clear amidst the thunderous noise of the raucous swords. Dragon One and Dia Robber turned back to look, their eyes finding the giant furnace.\n\nThey saw the coin planted on the furnace. Then, in the next second, the coin was actually inside the furnace. And then the construct was shrinking."
}