{
    "chapter": 2290,
    "title": "Four Symbols Seal",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2290",
    "text": "The light symbol hummed on Han Sen’s hand like an energy converter. When Han Sen sent power into the light symbol, his energy was transformed into sealing power.\n\nGreen Dragon, White Tiger, Red Bird, and Black Turtle. Four beasts made up the symbols, and Han Sen was represented by the Red Bird. As his power flowed into the symbol, the symbol swirled around in his hand like a flaming bird.\n\nMister White stepped in front of one xenogeneic clone and directed Han Sen, Crime, and the blood kirin to stand on either side of and behind the creature.\n\nThis was a powerful seal that normally required many people to do what they were attempting to. It wouldn’t be an easy task in the midst of combat, that was for sure. Usually, a person would use this technique to seal a creature that was already under their control. The technique took far too long to be useful in a fight.\n\nFortunately, the xenogeneic clone wasn’t going to attack them during their free day. It stood there, unmoving, increasing their chances of sealing it successfully.\n\nThe first attempt went smoothly. Han Sen and the others surrounded the xenogeneic from four different directions. They weren’t attacked, and the xenogeneic simply stood there looking at them.\n\nMister White waved at Han Sen and the others, indicating they should rest a little. It was still early in the day, after all. If they fully committed to the sealing right then, they’d be wasting some of their strength. They needed to seal the creature at the last moment possible in order to save every smidgen of energy they had.\n\nAfter a minute of thought, Han Sen said, “Since they aren’t attacking us now, why don’t we at least try the sealing to see if it works?”\n\n“You don’t trust Mister White? Even if the seal doesn’t work, do you have another way out of this?” Crime asked in a cold voice.\n\n“There is nothing wrong with giving it a try,” Han Sen responded flatly.\n\nMister White nodded. “Okay, then let us try. It will be a useful practice run.”\n\nFollowing Mister White’s command, Han Sen and the others cast the Four Symbols Seal. The symbol of the red bird shivered on Han Sen’s hand. He felt a connection form between the bird and Mister White’s white tiger, Crime’s black turtle, and the green dragon that hovered around the blood kirin’s claws.\n\nAll those powers were transferred, and the Four Symbols Seal’s light became stronger. The connection between them strengthened.\n\nThe four powers supported each other, and as the light rose, four giant shadows formed into a bai sema that trapped the creature inside.\n\nThe xenogeneic found itself confined within the bai sema. Its eyes flashed, and the enemy started to move.\n\n“Oh no! It is going to attack us. Seal the bai sema now!” Mister White shouted loudly.\n\nThe four of them quickly finished casting the Four Symbols Seal. The shadows of the green dragon, the white tiger, the red bird, and the black turtle were cast onto the xenogeneic’s body. The shadows bound the xenogeneic.\n\nThe xenogeneic kept moving as Han Sen and the others continued casting their seal. The four shadows kept seething across the xenogeneic. The xenogeneic tried to fight back, but it couldn’t break the seal.\n\nCrime looked ill, and he said, “I told you to trust Mister White, but you just had to try it! Now we’ve wasted so much more of our power.”\n\n“What’s done is done. We will just have to hold the seal and keep it going for the next ten days,” Mister White said firmly, putting an end to Crime’s complaining.\n\nHan Sen shrugged slightly and remained silent. He had known this was a possibility, but he thought they should give it a try anyway.\n\nAttempting the seal now would only anger one xenogeneic. If it failed, only one powerful creature would be trying to kill them. But if they failed closer to the end of the first day, they might end up being attacked by whole groups of the monsters.\n\nSo, Han Sen would rather spend a bit more energy now than risk everything later on.\n\nAside from the struggling xenogeneic in the seal, the other xenogeneics just maintained their stances and their expressionless stares. When Han Sen’s group confirmed that they weren’t going to be attacked by the monsters around them, they felt greatly relieved.\n\nThe xenogeneic kept struggling. Although its power was sealed, it still had a deified body. Han Sen and the others had to use all their power to hold the seal against the raw, physical strength of the creature’s thrashing.\n\nMister White and the blood kirin were half-deified, so they had an easier time. Crime was a top dog of the Kings, so he was holding up well, too.\n\nBut Han Sen had only just become a Duke. He hadn’t been a Duke for very long, so his power was lacking in comparison to the others. He had to use all of his strength just to keep the red bird’s symbol of light up.\n\nMister White looked at Han Sen and said, “A Duke’s element is separate from your original body’s astral body and celestial body. Your original body is your own genes taking the form of an element. At that stage, you must use your own power to fight. At the second stage, your astral body needs to rely on the planet beneath you. Planetary powers can be used to aid the elements of your body. For instance, a water element Duke will perform much better on a water-based planet.”\n\nAfter pausing, Mister White continued to say, “The celestial body you can access in the third stage is also known as your universal body. That body can use the power of the universe. As long as it is not separated from the universe for some reason, it has access to practically unlimited power.”\n\nHan Sen understood what Mister White was talking about, but he had only just become a Duke. He only had his original body, so he couldn’t make use of any external powers.\n\nPlus, even if he did gain a celestial body, he knew that Holy Town was separated from the outside world. He couldn’t access any power that was outside the town.\n\nMister White knew what Han Sen was thinking, and so he smiled. “Judging by the way you use your body, you must still be at the first stage. You only have your original body. I have an original body geno art that might be able to help you. Perhaps you could learn it in order to ascend more easily.”\n\n“If you are really willing to teach me, I would be very grateful.” Han Sen was surprised. He hadn’t expected Mister White to volunteer to teach him a geno art, and he wasn’t sure what the sudden offer meant.\n\n“Mister White, why do you care about him!” Crime exclaimed unhappily.\n\nMister White smiled. “We are cooperating to maintain the seal, aren’t we? We are all in this together. Han Sen is of a lower level than us, so he will have a hard time over the course of the next ten days. If anything happens to him, we will all be destroyed. I am only doing this for myself.”\n\nAfter Mister White said that, Crime fell silent.\n\nMister White paused for a moment before speaking. “My geno art isn’t very impressive. I made it myself, and I never did think up a name for it. It hasn’t been presented anywhere. I’ll explain it as best I can, and if you think it helps, you can use it. If it doesn’t, that’s okay.”\n\n“Please tell me,” Han Sen said.\n\nIn a quiet voice, Mister White gave a straightforward explanation of the geno art. Crime and the blood kirin focused on his words as well.\n\nCrime listened seriously. Just like Mister White said, his geno art seemed rather simple. Even so, it was obviously quite special. Despite its simplicity, it was incredibly difficult to understand.\n\n“Mister White, your geno art is so complicated. I am afraid he won’t be able to understand it,” Crime said after hearing Mister White’s geno art."
}