{
    "chapter": 2170,
    "title": "You Passed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2170",
    "text": "Han Sen squinted his eyes. That scary presence carried enough overwhelming force to sunder the sturdiest stone. It rolled over the region like a wave.\n\nThe man was approaching, and he was terrifying. Han Sen felt as if the sky itself had changed color. The man’s presence battered him over and over, like a ceaseless tide.\n\n“Who are you?” Han Sen stood and squinted, peering at the oncoming form. The wind was tugging his clothes back, making them ripple in the gusts.\n\nBut Han Sen stood strong. He held his position as if that power did not exist, at all.\n\nThe person walked onwards without saying a word. And with every step the form took, it sounded like rocks were being broken underfoot.\n\nDong!\n\nA very light footstep then took its place, reverberating through Han Sen’s ear. But it had the impact of an explosion inside Han Sen’s head. It made Han Sen squint his eyes even harder.\n\nDong! Dong! Dong! Dong!\n\nThe shadow approached, closer and closer. The footsteps were like a chain of explosions, going off inside Han Sen’s head, one after the next. And along with all that, the person’s presence was becoming scarier was every step.\n\nHan Sen looked at the body, and he noticed that they were both of a similar height. But in Han Sen’s eyes, the person seemed greater than him. He got the sense that the other person was a god that towered over him, making him feel small and insignificant in comparison.\n\nHan Sen knew that this had to be an illusion. But even so, if this person could use their powers to such a degree, it was unlikely that an ordinary person could fight against it.\n\n“Since when does an elite like this exist within the race of the Rebate?” Han Sen was confused by this presence.\n\nThe body and its presence were scary, to say the least. But its lifeforce certainly wasn’t King class. It was a Duke, at the most. Still, Han Sen couldn’t think of anyone else across the entirety of Narrow Moon that carried an aura such as that, especially as a Duke.\n\nThe person continued approaching, but try as they might to subdue Han Sen with fear, the attempt failed. Han Sen did not move. The person eventually stopped walking at a distance of ten steps away from Han Sen. She stood where she was and just looked at him.\n\nNow Han Sen could tell that the person was actually a woman. She was clad in black armor and also a helmet. Her face would have been revealed, had it not been for the face mask she wore. The features of her face were covered, save for the beautiful golden eyes that gleamed from her mask. But it was evident how fit the woman was based on the curves that the armor revealed.\n\nShe was as tall as Han Sen, and so her longs were very attractive.\n\nBut Han Sen’s gaze wasn’t drawn to her eyes or her legs. He was actually looking at her left hand.\n\nHer right hand was covered in a black gauntlet, revealing only the length of her fingers. Her left hand, however, was bare. The skin of her hands was pure white, her fingers were slender, and her delicate nails were like crystal gemstones.\n\nBut Han Sen was not merely admiring the prettiness of it. He looked there because of the power that swirled in her palm. It was a power he could not accurately describe.\n\nWith no shocking godlight or scary flames, the hand suddenly closed into an elegant fist and shot toward Han Sen. Han Sen’s eyes locked onto the fist that was headed his way.\n\nAnd as the fist traveled to Han Sen, he quivered. He did not shudder in fear, though; his twitch was him activating all the power inside him.\n\nHan Sen’s body gave that single shiver, and all of his power surged up, ready to be unleashed.\n\nThe pressure he felt from that incoming punch prompted Han Sen to gather up all the power he could. Standing before the black-armored woman, he felt a grave sense of danger.\n\nHan Sen had no intention of dodging, though. When the punch was swung, it felt as if the entirety of that pocket of space was filled up by it. That fist was everywhere, and it seemed as if there was no place for him to run to, even if he wanted to do so.\n\nNaturally, Han Sen was not actually planning to hide. He clenched his right hand into a fist, filled it with the gathered power of his trembling body, then sent a return punch at the woman.\n\nThe fires that carried the fist were very demonic. They were tinged with scary Teeth powers, and they came right at the woman’s fist.\n\nThe fists came against each other, and the power inside Han Sen’s fist shattered. The jade fist had collided with Han Sen’s own with tremendous force.\n\nBoom!\n\nHan Sen felt the unstoppable powers coming from that jade fist. It was like a supernova, and the unleashed force hurled Han Sen away.\n\nHan Sen used his legs to cleave a trench through the stones and the earth, trying to stabilize himself. But the power that sent him flying was too great. He tore through the ground for a few hundred meters before crashing into a stone wall that exploded on impact.\n\nAnd while the wall might have been destroyed, Han Sen was still standing. His right hand was injured, and his bones were cracked, though.\n\n“Who are you?” Han Sen asked the woman again.\n\nThe woman’s fist was so strange. It felt like something entirely indestructible. Even someone as strong as Han Sen could not withstand the force it unleashed.\n\nAnd after Han Sen had taken that punch, he knew for certain that the frightening, black-armored woman was actually a Marquise just like he was.\n\nThat surprised Han Sen more than anything. With this power she wielded, there was every possibility that she was even stronger than Lone Bamboo. That scary punching power was a testament to that.\n\nHan Sen thought he might have to retaliate with Break Six Skies. That could be the only way to combat her fist effectively.\n\n“You can withstand my Extreme King Final Punch? It is no wonder you are regarded as being as good as Lone Bamboo. You have passed.” The woman’s golden eyes peered at Han Sen. Her voice was icy, but also very seductive. “I will give you a chance to join the knights.”\n\n“You are of the Extreme King?” Han Sen looked at the woman while he spoke.\n\nYes,” the woman answered.\n\n“Did you come all the way over here just to cause me trouble?” Han Sen asked.\n\nThe woman replied in a toneless voice, “I was here to deliver a recruitment paper for Yisha. I was going to leave, but I heard that you were in the vicinity. So, I came to take a look at the individual who is said to be as strong as Lone Bamboo himself. You have most certainly passed, and so, I extend you an invitation to join the knights.”\n\n“I’m sorry, but I’ve made no plans to abandon Narrow Moon.” Han Sen was on high alert as he spoke. He was prepared for the possibility that the woman might attack again.\n\nBut the woman wasn’t planning to. When Han Sen declined, she turned around and left.\n\nHan Sen watched her fit body as she walked away, her long blonde hair rippling behind her. But the sight was tinged with sorrow, as if to tell Han Sen that he had no idea what he had just missed out on.\n\n“What an arrogant woman,” Han Sen thought to himself."
}