{
    "chapter": 1231,
    "title": "Mystic Well",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1231",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nEveryone was talking about the subject, but no real results were coming of the discussions.\n\nAssaulting Saint Fan Shelter pre-emptively would have to be done differently than their attack on Thunder Hell Shelter. Saint Fan Shelter was a mysterious construct, and it was encircled by a moat. The Night Cloak could not be used to breach the place without being seen.\n\nNo one knew where the spirit hall was, either, so it’d probably be quite difficult to locate in the midst of an attack.\n\nAfter fighting Thunder Hell Emperor, Han Sen had learned a thing or two about proper Emperor behavior, though. For one, he now knew they were willing to kill themselves quickly, and they’d respawn at an alarmingly fast rate. Whatever Han Sen and his companions chose to do, trying to conquer a shelter such as that was going to prove tough.\n\nBut the talks were interrupted by the sudden sound of an explosion that rattled the entire shelter, causing the ground to cough up plumes of dust. Han Sen’s face changed immediately, and so he ran to the source of the sound with the others in tow.\n\nHan Sen came before a well in the garden, which was cascading water. It had flooded the ground of the garden, and it was one foot deep already.\n\nBao’er was near the well, with Snowball quivering behind her.\n\n“Are you okay?” Han Sen asked the baby, but she seemed to be totally fine.\n\n“I’m good,” Bao’er said.\n\n“What happened here?” Han Sen asked, indicating to the water that was flooding the place.\n\nBao’er pointed at Snowball and said, “I threw him in the well. Big boom. He flies out!”\n\n“Is that true?” Han Sen asked Snowball.\n\nSnowball nodded gently.\n\nHan Sen tried peering into the well, but he could see nothing in its depths. All that seemed to be there was water.\n\nHan Sen picked up Snowball and dropped him in the well again.\n\nSnowball summoned the white ball to protect himself and fell inside.\n\nPang!\n\nWhile Snowball was sinking down into the dark depths of the well, there was another sudden explosion. In response, Snowball was fired back out of the well like a cannonball. The garden was flooded even more, following this.\n\nSnowball quickly ran back over to Bao’er and hid behind her. It looked to be absolutely terrified.\n\n“Well, well, well; this sure is one peculiar well.” Han Sen tried looking down into the well again, and he did not see any clues that might explain what had occurred. The well had seemingly spat out Snowball by its own volition.\n\n“Let me take a look,” Water Fairy said, as she hovered near the well.\n\n“Okay, but be careful.” Han Sen nodded. She was a water super creature, so if anything else was going to plunge into the aquatic mystery, there was none more suited to do so than her.\n\n“Oh, you care for my wellbeing? Thank you!” Water Fairy smiled at Han Sen and then dove into the well.\n\nThe Water Fairy did not create another explosion, and she was able to blend in with the rest of the water that filled the well.\n\nHan Sen watched her go, relieved that what happened to Snowball did not happen to her. Han Sen stood on the well looking down, but eventually, he lost sight of her and could not see what was going on at the bottom.\n\nAll of a sudden, the sound of thunder boomed. Han Sen quickly fell back, but he was surprised to see nothing actually happen this time.\n\nHan Sen inched his way back to the well and saw the water begin to bubble, as if it were coming to a boil.\n\n“Where did that thunder noise come from?” Ghost Eye asked, as he too approached the well.\n\nThe thunder sounded again, but this time continuously, and slowly, the volume grew and grew. Inside the well, there was no lightning or anything. The water was only moving a little, so where it might have come from was difficult to discern.\n\n“Is there a place below the well, perhaps?” Han Sen frowned as he mulled the curiosity.\n\nXie Qing King now came near, in his flip-flops. He prepared to dive in after Water Fairy, saying, “Let this seaworthy hombre take a look.”\n\n“No, you don’t have to. Let’s wait and see if Water Fairy returns.” Han Sen wasn’t sure what was down there, and if there was a trap, it’d be silly to send his troops in one after one.\n\n“Nothing in the Third God’s Sanctuary can stop a dude like me. Come on, son; you know I’m unstoppable. You’re saying a well can get the better of me?” Xie Qing King scoffed at the desire for safety, and he looked ready to jump in.\n\nSplash!\n\nThe sudden sound shocked them all, and it was Water Fairy who had come back out.\n\n“Are you okay?” Han Sen swiftly asked her.\n\nWater Fairy, after regaining her balance, said, “I’m fine, but I did stumble across something interesting down there.”\n\n“Well, you had my curiosity. Now, you have my attention,” Xie Qing King said, as if speaking to the actual stone of the well.\n\nWater Fairy directed her gaze to Han Sen, saying, “It would be better if you followed me.”\n\n“Okay, then. Let’s go take a look,” Han Sen said, leaning over the side of the well.\n\nBefore going in, Water Fairy said, “This water is Sky Pure Water. If anything dirty or pure goes inside, it’ll be rejected like filth. Like that mangy mutt you’ve adopted. But for yourself, don’t worry; I can protect you and let you in.”\n\nWater Fairy then turned her attention to the rest of the crowd and said, “Don’t come in after us, okay? If you do, you will hurt master and I.”\n\nAfter that, Water Fairy became a floating spring of water. It circled around Han Sen and grabbed him tight, then it picked him up and brought him into the well.\n\nHan Sen began to descend through the water of the well, and the further he went down, the wider the structure of the well became. Before long, Han Sen noticed he was at a depth of one thousand meters.\n\nAnd then, suddenly, Han Sen saw something bright in front of him."
}