{
    "chapter": 1268,
    "title": "Pinecone",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1268",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThere was a green pinecone in the fish king’s head. It was half-embedded, and it shone an ominous green like a third eye. The light pulsated, and when the pinecone lit up, it caused the fish king’s body to twitch.\n\nThe fish did not look like it had been dealt a grievous blow, but it seemed to be incapacitated. The fish was submitting to the water, and it was sinking fast.\n\n“Is that what the fruit spat out? It knocked him unconscious,” Han Sen thought, as he swam towards the fish, clutching Taia.\n\nThe fish king was unable to move, so Han Sen sought to remove the pinecone with his sword.\n\nDong!\n\nTaia hit the pinecone but was unsuccessful in damaging it. Han Sen stabbed it a few more times, but it proved to be far sturdier than he imagined.\n\n“I’ll dig it out then!” Han Sen opened the nine gene locks of the Blood-Pulse Sutra, and it made Taia glow a spooky red.\n\nThen, Han Sen skirted the placement of the pinecone with Taia. He had to plunge the sword fairly deep, and he could hear the cracking of the fish king’s bones as he went.\n\nThe fish king looked to be in pain following Han Sen’s treatment, but it did not do anything to stop him. It was, of course, much better for Han Sen if the fish king did not struggle.\n\nHan Sen pulled Taia back and saw the precise area of the head that had connected with the pinecone. In that spot, there were several white lines drawn across the green item and the creature; they looked like veins.\n\nHan Sen started cutting the lines, and he was able to slice them with ease. Apparently, they were far weaker than the pinecone itself.\n\nWhen they broke, the pinecone and the fish king shook. The glow of the pinecone became dimmer, too, and it looked to have been weakened.\n\nHan Sen continued to cut every vein he could find in a bid to free the pinecone from the fish king’s forehead.\n\nBut the fish king’s skull was no laughing matter. It was rock hard, and doing so was rather difficult for Han Sen.\n\nWhen he was about halfway done, his peaceful work seemed likely to get disrupted. The serpent creatures had reared their ugly heads and were on their way.\n\n“That quick?” Han Sen knew the empress would soon arrive.\n\nThen, Han Sen hid behind the large body of the fish king and watched as the woman glided through the water on her throne.\n\nHe noticed it was just her there, and that she had come alone.\n\nHan Sen thought he might stand a chance, if he battled her and her alone.\n\nHan Sen looked at the empress and then looked at the embedded pinecone and how far he had to go. He chose not to hesitate and activated his super king spirit mode, then he stabbed the fish king’s forehead.\n\nTaia plunged a deep, searing pain into the fish king’s head.\n\nThe empress was coming from a different direction, so she couldn’t see Han Sen do this. Then, she commanded the serpents to begin consuming the fish king.\n\nHan Sen hurried with the deed, noticing their hungry maws open and come for the fish.\n\nDong!\n\nHan Sen managed to dig the pinecone out from its head, but a lot of blood came out as well. The fish king woke up and immediately swung its body around in a spin, blasting both Han Sen and the serpents away.\n\nThe empress was shocked by its sudden revitalization, as she knew full well the fruit had sprayed it.\n\nHan Sen had made sure to simulate the fish king’s energy, so the empress could not suspect there had been someone else there, and that they had freed the fish from its incapacitated state.\n\nThe fish king, when it was awake, saw the serpents and the empress that wished it devoured. It doused them in a bright golden light.\n\nThe golden light was like a laser, and Han Sen watched as it went towards the empress.\n\nThe empress did not even blink as one of the snakes pushed the throne away, out of the line of fire.\n\nPang!\n\nThe serpent’s tail was then hit by the gold light, and it caused the entire lake to blow up in utter chaos.\n\nHan Sen had already exited super king spirit mode by this stage, and he was out of the lake, safe and sound up in the air.\n\nHe landed in the forest and made his lifeforce replicate that of another plant.\n\nHorrible noises continued to emerge from the tumultuous lake, and the waters thrashed so wildly, it might as well have been raining for all those in its proximity.\n\nHan Sen hid inside the forest, allowing himself to get wet.\n\nBy now, the human had climbed up halfway. Yaksha, however, was at the peak after a brief flight up. Yaksha’s body was exuding a black gas, and his wings weren’t that far off a devil’s.\n\nThe fruit noticed Yaksha reaching for it, and it managed to pump out another cloud of gas. It hit Yaksha directly in his forehead.\n\nYaksha was shocked, as he had not expected it to be able to spray twice. Fortunately, he had come prepared. As soon as his eyes caught sight of an aqua light, he dashed away from the fruit.\n\nBut the light wasn’t keen to let Yaksha slip away, and it bent its course mid-air, turning around to strike Yaksha in the back of his head. Then, the conniving spirit began to plummet all the way down the cliff."
}