{
    "chapter": 3014,
    "title": "A Lead on Sacred Leader",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3014",
    "text": "“Of course, this is right.” After one hour, Han Yufei looked very excited. She stared at the data board with an enthralled glow. Han Sen was depressed, so he asked, “What is the situation now? Is there a way to take the blue blood power out of my body?”\n\n“Answer a few of my questions first.” Han Yufei did not wait for Han Sen to agree. She immediately asked, “You come from the sanctuaries, right?”\n\n“Yes, that’s right.” Han Sen nodded. There was no real point in hiding it now.\n\nHan Yufei looked at Han Sen with interest as she asked, “You are a mix of crystallizer and Sacred Leader’s blood, aren’t you?”\n\n“I don’t know.” Although Han Sen agreed with the assessment, it was not something he could believe in 100%.\n\n“Yes, you are,” Han Yufei told Han Sen with absolute certainty.\n\nHan Sen did not understand and asked, “How can you be so sure?”\n\nHan Yufei coldly said, “Because it was me who was in charge of Sacred Leader’s research into the blood. Only I researched Sacred blood, and only my assistant saw some. Without that information, no race’s blood can be combined Sacred Leader’s blood.”\n\n“Your assistant… Crystallizer…” Han Sen suddenly noticed something. Han Yufei once told him that after the crystallizers had their genes modified, they would become more intelligent. So, Han Yufei and Sacred Leader hired them as test assistants.\n\n“Yes. It was a crystallizer. If you are a crystallizer and you can combine with blue blood, it is without a doubt that you are a crystallizer mix that contains Sacred Leader’s blood. Because the research was not a total success, combining with Sacred Leader’s blood was very weak. It did not affect the natural blood of a crystallizer. People would not be able to tell, so they would just assume you to be a crystallizer.”\n\nHan Yufei paused and smiled before saying, “I cannot believe Left Crazy was that smart. He only saw that little bit of information, yet he was able to do this. It must have been very hard for them.”\n\n“Even if I am a mix of crystallizer and Sacred, what is the connection with Nine-Life Cat?” Han Sen asked. “Nine-Life Cat, Ghost Car, Phoenix, and Holy Kirin were the four holy beasts of Sacred. In fact, they were important research for Sacred Leader. It is different from researching with Super Gene. The research on the four holy beasts was about making the creatures of the universe holy spirits and turning them into new creatures that could rival God Spirits. Only Holy Kirin was a success. The other three holy beasts were not a success. That was especially true with the Nine-Life Cat. There was some problem in the process.”\n\nUl\n\nSpeaking of that, Han Yufei looked solemn. She went silent and did not continue speaking. “Was there a problem?” Han Sen’s expression showed that he was in a rush. He had been chasing this for many years, and he was finally on the cusp of learning the truth. His desire for finding this out was something no one could understand.\n\n“I don’t know.” Han Yufei’s answer almost made Han Sen jump.\n\n“How could you not know?” Han Sen’s eyes opened wide. He stared at Han Yufei.\n\n“I really don’t know. The process of making a holy spirit was dangerous. In the test, Nine-Life Cat was injected with too much spirit. His spirit could not take it, so he broke. Therefore, he died. His body had no lifeforce. After that, Sacred Leader took Nine-Life Cat’s body away.”\n\nAfter saying that, Han Yufei looked at Han Sen. “I only found out from you now that Nine-Life Cat did not die, and his blood is close to blue blood. That should be impossible.”\n\nHan Sen had a strange expression. He had many thoughts swirling through his head, but he screamed, “What you are saying is that Nine-Life Cat was revived because of Sacred Leader! Does that mean Nine-Life Cat is…”\n\nBefore Han Sen said anything else, he thought that possibility was too shocking.\n\nHan Yufei nodded and said, “From what I guess, there are two possibilities. One is that it is just as you say. Perhaps Sacred Leader used Nine-Life Cat’s body to conduct more tests, and Nine-Life Cat became a vessel for him. The other possibility is that Sacred Leader used his blood. He gave it to Nine-Life Cat and then, somehow, Nine-Life Cat was revived as a new type of species. Only that could explain why the Nine-Life Cat’s gene power is so similar to Sacred Leader’s blue blood. That is why Nine-Life Cat’s power can combat blue blood power. Only Sacred power can restrict Sacred.”\n\n“Which do you think is the likelier result?” Han Sen looked weird. He thought about the demon lady before she died. She told him to be wary of Old Cat. Now, that was starting to seem very interesting.\n\n“I don’t know.” Han Yufei turned off the machine and let Han Sen exit the chamber.\n\nHan Sen stretched his body as he asked, “Is there a way to erase the blue blood inside me?”\n\n“The genes are combined, so it is impossible to erase it now,” Han Yufei excitedly said. “Why would you want to get rid of it? If it is just blue blood power, that would be very bad. But your body has Nine-Life Cat’s mutated blue blood genes. These mutated blue blood genes will not be destroyed by the rules of the universe. You just need to combine the two powers into one. Then, you can perfectly get a hold of it and will be a Sacred Leader that will not be destroyed by the rules of the universe. You can achieve more than what Sacred Leader did. By then, you would not need the Super Gene to kill God Spirits.”\n\n“Why would I want to kill God Spirits?” Han Sen asked with a frown.\n\nHan Sen had tried to be a God Spirit. Although God Spirits were a bit dangerous, it was not like they had to be destroyed.\n\nRegarding the harm, when every race was making themselves stronger, the crimes they committed were worse than the God Spirits. The harm they caused was greater than anything the God Spirits did.\n\nUnless he was born an enemy of the God Spirits, he really did not see the point in killing God Spirits.\n\nHan Yufei looked at Han Sen weirdly. After a while, she sighed. “You still don’t understand the God Spirits and what they are. If you understood, you would feel the same way.” “You can make me understand.” Han Sen looked at Han Yufei with eyes that were on fire.\n\n“It is hard to explain so suddenly.” Han Yufei clearly did not want to answer that question. She changed the subject and said, “You should stay here. I will find a way for you to control the blue blood power. As for the removal of the blue blood, I do not think I can do that.”\n\n“After successfully combining with it, can I use the old geno arts I have?” Han Sen asked.\n\n“Impossible,” Han Yufei said. “Sacred blood’s gene power is too powerful. Even if you did not get destroyed, you could not run it with other geno arts. You can only use this power, but that is enough.”\n\nHan Sen had an odd expression as he asked, “Are you sure that after having Sacred blood power, I cannot use other powers?”\n\n“Of course. I thought you have experienced this,” Han Yufei said.\n\n“By the way, I am very interested in learning more about Han Jinzhi. Tell me more about him.” Han Yufei squinted her eyes.\n\n“Sure. As a trade, I want to know what God Spirits are,” Han Sen calmly said.\n\nHan Yufei looked at Han Sen seriously for a while and said, “Sure. I can try to explain, but I cannot promise that you will understand.”"
}