{
    "chapter": 171,
    "title": "I’m Ji Yanran’s Boyfriend",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_171",
    "text": "\"Sweetie, are you waiting for someone?\" Qu Lili suddenly asked.\n\n\"No,\" Ji Yanran replied absentmindedly.\n\n\"Then why do you keeping looking at the door?\" asked Qu Lili , puzzled.\n\nJi Yanran suddenly blushed and withdrew her gaze in panic. She bowed her head to eat and replied, \"I did not.\"\n\n\"Sweetie, you are a bit weird today.\" Qu Lili looked her up and down.\n\n\"The genius is here!\" someone whispered. Qu Lili quickly looked to the door, and saw Han Sen and Zhang Yang entering the cafeteria.\n\nQu Lili suddenly looked at Ji Yanran with disbelief. \"Sweetie, you were waiting for him, right? How did you know he would come here? Tell me.\"\n\n\"Stop it. I was not waiting for him, and how would I know he’d be here?\" Ji Yanran covered her own panic by taking a sip of her juice.\n\nWhen Qu Lili had thought of more to ask, Han Sen and Zhang Yang had carried their trays to the girls’ table and asked with a smile, \"Sisters, can we sit here?\"\n\n\"Of course.\" Qu Lili looked at Ji Yanran who kept drinking her juice, and looked back at Han Sen. She had understood something.\n\n\"The genius is sitting with Ji Yanran. Is there something going on between them?\"\n\n\"Shut up. How long has he been here? I have never seen them walking together either.\"\n\n\"But it seems that their relationship is unusual.\"\n\n...\n\nJi Yanran now regretted coming to the cafeteria. It was a rushed decision and she was less mad at Han Sen since he had come over. However, the concerning eyes on her was almost burning a hole in her face. All she could do was drinking her juice.\n\n\"Hi Han Sen, my name is Qu Lili, warship command major. This is my roommate Ji Yanran. You should have heard of her.\" Qu Lili smiled and reached out a hand.\n\n\"Hello, I am in the Archery Department. And I am Ji Yanran’s boyfriend.\" Han Sen shook her hand friendly.\n\nJi Yanran suddenly choked on her juice and everyone who heard that was appalled.\n\nHan Sen said that naturally, while it was quite an arrogant remark in the ears of others. No one had dared to claim to be Ji’s boyfriend.\n\n\"The genius is just different.\"\n\n\"S*#t! Is he for real?\"\n\n\"They are really together? This is too fast. He has only been here for a few months.\"\n\n\"There goes our campus belle.\"\n\n\"But he would be the only one who deserves her anyway.\"\n\n...\n\nGossip filled the cafeteria as people whispered and sent pictures to the campus community.\n\n\"The Genius's Girlfriend Exposed,\" \"You Would Not Believe Who She Is,\" \"Campus Belle Taken,\" … a variety of different titles and videos filled the community in a sudden.\n\nAt this time, Qu Lili was looking at Han Sen, stunned. Although she thought there was something going on, she did not expect him to admit being her boyfriend. Based on her understanding of Ji Yanran, her roommate would never let this happen.\n\nQu Lili even forgot to release Han Sen’s hand and stammered, \"You are her… boyfriend?\"\n\n\"What is this nonsense? You think someone like you can be our president's boyfriend? I will kick your ass right now if you keep talking this way,\" shouted Monkey among a group of men who had come over to this table. Li Yufeng was also among them, looking gloomy.\n\n\"Why can’t I?\" Han Sen asked evenly, looking at the emotional crowd.\n\n\"Our president has said before, whoever wants to be her boyfriend has to beat her at Hand of God. Can you?\" Monkey asked coldly.\n\n\"That is easy,\" Han Sen said casually.\n\nStaring at Han Sen, Li Yufeng suddenly said, \"Now you have to beat me before you could pursue Yanran.\"\n\nLi Yufeng knew that with Han Sen's warframe skills, this guy must have fast hands, and gave Han Sen a bigger challenge.\n\n\"Now isn’t that even easier?\" Han Sen laughed.\n\n\"What did you say?\" Monkey and the rest were furious.\n\nLi Yufeng stopped them, and threw a fiery gaze at Han Sen. \"Then we will have one match. If you lose, do not let me see you around her again.\"\n\n\"Is that necessary? You have lost already.\" Han Sen smiled.\n\n\"Damn, say it if you do not dare to game,\" ridiculed Monkey, thinking that Han Sen got cold feet.\n\nHis friends were all helping him ridicule Han Sen, and Li Yufeng looked at Han Sen with disdain. \"If you dare not fight me, then stay away from her.\"\n\nAt this time, Qu Lili was suddenly enlightened and stood up. With both of her hands on the table and her eyes fixed on Han Sen, she almost shouted, \"Are you Ji Yanran’s boyfriend?\"\n\nThe onlookers were shocked by Qu Lili. They all felt that Qu Lili was making a big deal out of nothing, since Han Sen just said he was.\n\nBut Qu Lili quickly changed her way of asking, \"Are you My-girlfriend-is-Ji-Yanran?\"\n\nAll of a sudden, everyone opened their mouths wide. They did not expect that this was the guy who had beaten Li Yufeng by 20 points on the Battlenet.\n\nNow that Han Sen had personally admitted that he was Ji Yanran’s boyfriend, was it not the most plausible theory that he was behind that ID?\n\n\"That's my Battlenet ID,\" Han Sen replied casually.\n\nLi Yufeng, Monkey and the rest all went pale. They could not believe this. If Han Sen was really My-girlfriend-is-Ji-Yanran, then there was no need for another match indeed.\n\n\"No wonder the genius said he had won already. So he is My-girlfriend-is-Ji-Yanran!\"\n\n\"The genius is out of this world! I thought he was good at warframes, but he is better at black and white boxing. Now he is even better at Hand of God and has beaten Li Yufeng by 20 points.\"\n\n\"Great God, he is one of a kind!\""
}