{
    "chapter": 1954,
    "title": "Endorsement",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1954",
    "text": "Han Sen planned to see what they were up to, but after walking a couple blocks down the street, Clear Sea King and the others dipped into a giant building with Meka guards. The place was private, so Han Sen couldn’t just wander in. He asked around and came to know that it was a house belonging to a King-class Meka.\n\nHan Sen couldn’t find out any more than that, as there was no reliable source of information. Han Sen waited outside for a while, but they still hadn’t emerged after some time, so he surmised that they had to be staying there.\n\nHan Sen couldn’t do anything reckless on a planet belonging to the Meka, so he decided to leave. As he turned around, a naughty little mink leaped out of his pocket and started to scuttle down the street.\n\nHan Sen immediately grabbed the other six while chasing after the escapee. He called out its name, “Little Seven, don’t run! Come back!”\n\nHan Sen was bad at naming names, so he named them sequentially from one to seven. They went by their numbers.\n\nLittle Seven was the naughtiest and grumpiest of the bunch. Not even Han Sen could bring him to heel. Even so, all seven little minks regarded Han Sen as their master. And even if they did run off, they’d always come scurrying back when they got bored.\n\nHan Sen kept shouting after it, as he ran.\n\nHan Sen did not want to force the mink back, though. He let it run and followed it. The place belonged to the Meka, so no one would care too much if a Meka was found poking about.\n\nLittle Seven was interested in something, that much was certain. He wasn’t running around aimlessly. He ducked into a building and hurried upstairs.\n\nHan Sen followed, and he noticed it was a large mall. The shopkeepers were all outsiders, too. He followed Little Seven to the second floor, then into a particular shop. He heard some noises coming from the back.\n\nWhen Han Sen approached, the little mink was wearing his xenogeneic gene battle body. The red armor wrapped up the little creature’s body.\n\nThe little mink was still just a Baron, so it was very small. Due to this, it couldn’t generate much juice. The battle body was simple, and when the mink generated more materials, the battle body would improve.\n\nLittle Seven was running around the shop, munching on a mouthful of chestnuts. The shopkeeper kept trying to chase Little Seven away, but the mink was small and nimble. It could run around and quickly grab items from the shelves.\n\nLittle Seven was eating everything it could reach. The other six smelled the food and wanted to come out. Han Sen managed to push them down and seal his pockets, though. He didn’t need them adding to the trouble.\n\nThe Kate shopkeeper soon looked ready to cry. Soon, two Meka guards jumped at Little Seven, but because of how fast and nimble he was, he was able to dodge them. By doing so, he managed to steal another two pieces of food.\n\nThe Meka guards were Viscount class, but not even they could catch Little Seven, who was merely a Baron.\n\nHan Sen moved and grabbed Little Seven, then pulled the mink away from their attacks. He quickly said, “I am so sorry!\n\nI will reimburse you for the losses incurred.”\n\n“No! If you misbehave here, you must be investigated,” one of the Meka said.\n\n“I am sorry, but he is just a child. Please give him another chance, and I will pay twice the amount owed,” Han Sen said quickly. He presented Little Seven and said to it, “Come on now and apologize.”\n\nLittle Seven had done wrong, though. Han Sen wasn’t going to needlessly spoil the thing.\n\nLittle Seven bowed and lowered its head. Then, it made some tzi tzi noises, as if it was apologizing.\n\n“We can talk about the payment later, but you have to follow us. Otherwise, we cannot report to the shopkeeper,” the Meka security guard said.\n\nAs Han Sen wondered what he should do, someone shouted from the shop. “Hang on!”\n\nHan Sen looked to where the call came from, and he saw a Feather emerging from the back of the store. He ran in front of the Meka guard and spoke with him. Then the guard left the shop.\n\n“Thanks; I will be reimbursing you for the losses incurred,” Han Sen said, as he saw the Feather approach.\n\n“Not too much inventory was lost; do not worry! If you are able to, though, could we talk inside?” the Feather said, while looking at Little Seven in Han Sen’s hand.\n\nHan Sen was confused, but he still nodded and followed the Feather to the back of the shop. He was behaving like an officer.\n\nThe Feather closed the door, and then looked at Han Sen and Little Seven, and said, “My name is Mach. What is your name?”\n\n“My name is Dollar, from the race of humans,” Han Sen answered.\n\nMach repeated Han Sen’s name, then thought of something. He asked, “What is your association with this Meka?”\n\n“I am it’s guardian, sort of,” Han Sen answered.\n\nAfter hearing Han Sen, Mach’s eyes gleamed brightly. He said, “Does that mean you can command it?”\n\n“What does that mean?” Han Sen frowned.\n\nMach worried that Han Sen might misunderstand his intentions, so he quickly explained, “If you can command it, I would like to invite it to endorse my shop.”\n\n“An endorsement?” Han Sen never thought something like would happen.\n\n“It’s like this…” Mach explained.\n\nMach’s store sold xenogeneic fruit. For the Meka, the fruit could replace gathering actual xenogeneic genes. After the Meka ate them, they could release materials for the xenogeneic gene battle bodies.\n\nBut the fruits weren’t popular. Not many of the Meka knew about them, so the sales had been quite slow. Mach was not a rich fellow, and he couldn’t afford big advertisements, so he hadn’t found a way to market his wares.\n\nLittle Seven’s performance surprised Mach. He thought this could be his chance.\n\nLittle Seven could endorse the food for him by participating in the Meka’s battle body races. If Little Seven was able to get a good score in the Baron tier, and did so by advertising the goods he had just eaten, the xenogeneic gene battle body would be better than any other advertisement.\n\nLittle Seven would need to get a very good score, but after Mach saw Little Seven’s performance, he thought the little mink could achieve first place."
}