{
    "chapter": 2491,
    "title": "Tianxia’s Seven Gods",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2491",
    "text": "The longer he fought, the more confused Meng Lie became. Even if an ordinary deified xenogeneic wasn’t very smart, it would still know to retreat when it was losing a fight. It wouldn’t just relentlessly continue to attack a more powerful opponent.\n\nBut that kirin wanted a fight to the death no matter what. It didn’t care for its life, which made it surprisingly difficult to counter. But the thing that concerned Meng Lie the most was the idea that someone was orchestrating all this. If that mysterious person could control deified xenogeneics, Meng Lie didn’t want to imagine how strong they might be.\n\n“I have to take Han Sen back to the Extreme King, and I have to do it fast.” Meng Lie made his mind up. A gold substance chain exploded in a blinding burst of light. It was like a golden god tearing through space. Cloud airs and deified blood sprayed everywhere.\n\nBecause of the amount of raw power being exchanged, Han Sen couldn’t get close to the fight. After ten hours, Han Sen heard the sound of something screaming, then silence. He turned as the headless body of the kirin slowly fell through the clouds.\n\nThen, Meng Lie was coming toward him. The man’s hands were clutching the kirin’s severed head. Meng Lie was injured, too, though. His golden god body was bleeding profusely, and one of his wounds was deep enough to show bone. He was quite damaged.\n\nHan Sen felt it was a shame that he hadn’t been able to get the last hit in on the kirin, but he had managed to kill many King class xenogeneics during that time. He was slowly filling up his King class gene tallies, at least.\n\nHan Sen and Meng Lie kept traveling. Han Sen killed so many clouds beasts, but everywhere they went, even more of the crazed creatures showed up. Even Meng Lie, who was doing most of the killing, was getting tired hands.\n\n“If I find out who is behind all this, I’m going to skin them alive,” Meng Lie cursed in exhausted frustration.\n\nIn the past, xenogeneics never came close to Meng Lie. They wouldn’t dare to show themselves before him. Right now, though, even Barons and Viscounts were willing to attack him. He killed them, but it was infuriating that he even had to.\n\nThey kept on fighting. The clouds looked like pools of blood in their wake. Meng Lie grabbed Han Sen and quickly outran the pursuing xenogeneics. He felt sick from the massive amount of killing he had done. He didn’t want to kill anymore.\n\nAfter traveling one hundred thousand miles, they saw another deified xenogeneic coming for them. It appeared right in Meng Lie’s path.\n\nHan Sen saw a huge, rainbow-colored bird that resembled a peacock. It was soaring through the clouds. Just the sensation of its presence would be enough to make most people cower in fear.\n\n“The Tianxia Peacock King! Who the hell could control the Tianxia Peacock King?” Meng Lie whispered, his face going pale.\n\n“Is he strong?” Han Sen asked.\n\n“It is the fourth of Tianxia’s seven gods. The Tianxia Unicorn is at last place on that roster. So, what do you think?” Meng Lie looked sick. Clearly, he wasn’t confident that he could defeat the Tianxia Peacock King in battle.\n\nHan Sen looked at the Tianxia Peacock King in shock. It fanned its beautiful feathers, raising them in a semicircle behind it.\n\nImages that looked like eyes stared out of the peacock’s fanned feathers. All the colors of the rainbow glowed inside those eyes. They became rainbow godlights that suddenly drenched the entire sea of clouds in a rainbow godlight.\n\nThe moment the rainbow godlight appeared, Han Sen watched the light fall to touch his body. And when it happened, his armor, skin, and hair started to look like dust. He was too stunned to move.\n\nHan Sen’s Jadeskin was unable to block the rainbow godlights’ power. Han Sen looked over at Meng Lie and saw that he, too, was melting into dust.\n\nWith a teeth-rattling roar, Meng Lie became that gold giant again. He grabbed Han Sen so that the gold color could spread across his body as well. The color dyed Han Sen’s entire form.\n\nWhen Han Sen looked closer, he could see that the layer of gold was made of intricate substance chains. But even that layer of protection started to degrade under the power of the rainbow godlight. Meng Lie’s gold body clearly couldn’t withstand the Tianxia Peacock King’s rainbow godlight.\n\n“You need to leave now.” Meng Lie threw Han Sen away, then started running toward the Tianxia Peacock King.\n\nHan Sen used the momentum of Meng Lie’s throw to escape the rainbow godlights’ area of effect. The Tianxia Peacock King, meanwhile, was occupied by Meng Lie and therefore couldn’t give chase.\n\n“F*ck! Even the terrifying Tianxia Peacock King was drawn toward me. I can’t keep this thing,” Han Sen thought. He pulled the cloud out of Destiny’s Tower, tossed it to the side, and flew away.\n\nThat thing had even managed to attract the Tianxia Peacock King. If Han Sen continued carrying it, it would only be a matter of time before he attracted the rest of the Tianxia gods.\n\nThe Tianxia Unicorn, at the end of the roster, was already so strong. The fourth rank god, the Tianxia Peacock King, must have been exceptionally scary. Even Meng Lie didn’t underestimate a foe like that. If an enemy of a higher level came, they’d be killed in no time at all.\n\nAfter Han Sen ditched the cloud, he turned back. He went in a different direction so he could escape Meng Lie.\n\nAfter flying for a while, Han Sen felt a weird prickling sensation across the back of his neck. He turned around and saw the cloud chasing him.\n\n“Oh sh*t! Why are you following me?” Han Sen’s eyes almost popped out of his skull. The thing hadn’t stayed where he put it.\n\nThe cloud didn’t answer Han Sen. It just flew over to him and floated nearby. It didn’t seem to want to hurt him, though.\n\n“I’m afraid of you.” Han Sen thought it was best to stay away from the strange cloud. He accelerated away, using his phoenix techniques as he fled.\n\nWhile that creamy cloud looked very slow, it somehow managed to keep up with Han Sen. No matter how many times Han Sen changed direction, he couldn’t shake it off.\n\nHan Sen tried to punch it and send it flying away, but that didn’t work for crap. The more strength he put into the blow, the faster the cloud would follow him. And when his punch landed on the cloud, it would become really thick and withstand all the force.\n\nAfter a short while of running, he met another group of cloud beasts. They were drawn to the cloud following Han Sen.\n\nFortunately, these cloud beasts were quite low-level. They were most Viscounts and Earls. Han Sen got rid of them easily.\n\n“If you bring me another deified, I will be very dead.” There was nothing Han Sen could do to get rid of the cloud. He felt like crying.\n\nBut then Han Sen thought about it. The cloud’s area of effect was limited. If he didn’t run, no more powerful cloud beasts would show up.\n\nThinking of that, Han Sen stopped running. He stopped right where he was and glared at the cloud. He said to it, “I’m warning you. Don’t follow me anymore. Otherwise, I will kill you.”\n\nHan Sen was trying to scare the black cricket or spider plant on the inside, as it was obvious that one of those two was behind the drama.\n\n“You really think I can’t kill you?” Han Sen demanded angrily when the cloud didn’t react. He walked straight up to the occupants of the cloud."
}