{
    "chapter": 170,
    "title": "Knocking Out the Chosen",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_170",
    "text": "\"Yanran, go to the campus community site!\" Qu Lili suddenly poked Ji Yanran with a finger and whispered.\n\n\"Stop it. We are in class.\" Ji Yanran was not in a good mood since she had not seen Han Sen for days.\n\n\"Have you heard that Yu Mingzhi and Tang Zhenliu have come to our school to do teaching demonstrations?\" continued Qu Lili, excited.\n\n\"Yeah, but I am not interested in the idols,\" replied Ji Yanran, absent-minded.\n\n\"When Yu Mingzhi demonstrated black and white boxing, he picked our genius to spar with him and got his ass kicked three times in a row.\"\n\n\"Genius? Which genius? Ouyang Xiaosan?\" Ji Yanran asked after.looking blank for a moment.\n\n\"Nope, I am talking about the genius,\" Qu Lili said solemnly.\n\n\"Which genius?\" Ji Yanran did not follow.\n\n\"Who can it be? The one who killed it at the warframe game. He is the only genius on campus.\" Qu Lili rolled her eyes at Ji.\n\n\"Han Sen?\" Ji Yanran winced, and then quickly turned on her comlink and entered the live broadcast of Professor Yan’s class.\n\nThe moment she entered the live session, she saw Yu Zhiming throwing a punch at Han Sen, who then stopped Yu’s fist with one hand.\n\n\"So confident! Our genius is so awesome. But Yu is too weak. If my Tang Zhenliu is against him, then it will be even better to watch,\" Qu Lili said excitedly. She was a fan of Tang’s, and that was why she was paying attention to this class in the first place. After a while, she added, \"Why do I think the genius looks familiar? I must have seen him somewhere.\"\n\n\"You have seen him during the Starry Cup,\" Ji Yanran blushed and said quickly.\n\n\"I think it is somewhere else…\" Qu Lili was slightly puzzled, but soon threw the thought aside. \"Here goes Yu Mingzhi again.\"\n\nJi Yanran was secretly relieved. Fortunately, it was dark that night in front of the dorm building. Qu Lili did not see clearly Han Sen’s face and was scared away by Han Sen’s bluff.\n\nWatching Han Sen from her comlink set Ji Yanran’s teeth on edge. \"Well, Han Sen, you are showing off in martial arts class now. Which girl are you trying to hook up with now?\"\n\nJi Yanran looked at the old professor who was lecturing in her class and sneaked out of the classroom when he was not paying attention.\n\n\"Sweetie, where are you going?\" Qu Lili looked at her, surprised.\n\nJi Yanran waved her hand and gestured Qu to be silent before she quickly left for Professor Yan’s classroom.\n\nShe was going to find that bastard Han Sen, and forbid him to fool another girl.\n\nBut when she came to Professor Yan's classroom, the corridor was so crowded with people that she could see nothing. Ji Yanran had to continue to watch her comlink and wait for Han Sen to come out.\n\n\"Han Sen has made a perfect demonstration of black and white boxing...\" Professor Yan had been committed to teaching and made a great analysis of the performance of Han Sen.\n\nYu Mingzhi did not believe he was simply weaker, and tried three times with white fist, each easily blocked by Han Sen with a single hand. Yu’s face was the color of pig liver in the end and Professor Yan had to declare an end to the black and white boxing demonstration.\n\nYu Mingzhi's face was almost blue. He wanted to show his skills off at Blackhawk and had been humiliated big time. As the Chosen, it was such a disgrace to be beaten by a military school student, especially in such shameful manner.\n\nThe worst part for Yu was that Han Sen was only following Professor Yan's instructions from the beginning to end, and showed no pride after winning. It was as if Yu Zhiming was a nobody, and beating him was not worth celebrating.\n\n\"Sen, I did not expect you are so good at black and white boxing too. When we go back...\" Zhang Yang stopped when thinking of the mysterious afternoon in Room 304, and gave up the thought eventually.\n\nThe rest of the class was somehow awkward. Yu Mingzhi was restless with his face dark. The students kept glancing at Han Sen. Although no one was whispering in class, the online community was bombarded.\n\n\"The genius beat the Chosen.\"\n\n\"Three punches knocked a Chosen out.\"\n\n\"Ha-ha, a genius from Blackhawk! Great at both warframe and black and white boxing.\"\n\n\"I want to see a fight between Han Sen and Tang Zhenliu. Not sure who would be better.\"\n\n\"Is that still worth asking? Of course it is Han Sen.\"\n\n\"Not necessarily, Tang is much better than Yu Mingzhi. Tang has been the Chosen for years and will soon go to Second God’s Sanctuary.\"\n\n\"Makes sense. Tang’s only two matches in the unevolved would be Dollar and Lin Feng.\"\n\n\"Tang is great, but we have a genius here. I do think he could fight Tang.\"\n\n\"I am afraid there is no chance for us to see that. Our genius did not want to go up, and Yu Mingzhi had to make him. Tang would not do such a thing.\"\n\n\"It's a pity that we could not see them fight.\"\n\nReading the comment in the campus community, Ji Yanran couldn’t help smiling when seeing others praise Han Sen, as if she was praised herself.\n\nAfter Professor Yan’s class, Ji Yanran saw many students hovering over Han Sen and decided not to join them.\n\nJi Yanran checked the time and turned toward the cafeteria. She knew for sure that around this time, Han Sen would go to the cafeteria where there were their favorite juices.\n\nJi Yiran did not go far before she was stopped Qu Lili who had run over. \"Sweetie, did you go and check on our genius in the middle of our class?\"\n\n\"Who said I went to see him?\" Ji Yanran curled her lips and said with shame.\n\n\"Why else would you skip the class?\" Qu Lili asked, puzzled.\n\n\"To eat!\" Ji Yanran said and walked toward the cafeteria.\n\nQu Lili followed her to the cafeteria. Ji Yanran deliberately sat in plain sight, and thought with venom, \"If that bastard does not take the initiative to come over, I will not forgive him.\""
}