{
    "chapter": 1165,
    "title": "Sky Tree",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1165",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“I have only just arrived. This is my first time doing this,” Han Sen said.\n\n“You’ll need to put your back into it and work hard. There may be no guards here, but you have a quota of ten walnut powder sacks a day. If you don’t meet that quota, they’ll bump you back down a level. Then, you’ll have to do the test all over again,” the man explained.\n\n“What use is the powder for?” Han Sen asked, as he began to work.\n\n“Those of us down here don’t have a clue. But it’s a material that’s wanted by the big cheese, and since we’re required to produce it, we don’t question it any further.” The man briefly paused, look around, and then spoke again in a quieter tone. “You didn’t hear this from me, got it? But… rumors say that Immortal Emperor, the big boss of this place, uses it to craft what has been dubbed Immortal Pills.”\n\n“What are they for? Do they make him immortal?” Han Sen inquisitively asked.\n\nThe man laughed and balked. “Spirits are immortal already! Immortal Pills, however, are said to grant spirits access to the Fourth God’s Sanctuary. They were created by Immortal Emperor, so naturally, they were only named after him.”\n\nThe man then stopped chatting, so he could focus on working the stone mill and grinding the walnuts.\n\nHan Sen didn’t push very hard. He casually worked the mill while his mind relaxed to ponder the nature of Immortal Emperor.\n\n“He needs all this labor for the production of these Immortal Pills?” Han Sen did not believe eating the pills would allow one to ascend and become a demi-god.\n\nHe believed this due to his experience with Xiang Yin. To ascend, you had to literally ascend an excruciatingly painful staircase. Walnuts wouldn’t allow you to skip that, and Han Sen believed the best they could do was make a person temporarily stronger to weather the cleansing fires a little better.\n\nBy the time the day was done, Han Sen had created twenty sacks of walnut powder. When the spirits came to take them, they provided him with two drops of lifewater.\n\n“You’re good. You’ve only just arrived and you’ve already produced twenty sacks-worth,” the man, receiving his lifewater, said to Han Sen.\n\nThe man had produced fifteen sacks, but that only granted him one drop of lifewater. The additional five, however, would count for the next day of work. If he did another fifteen the next day, he’d receive two lifewater drops.\n\nHan Sen spoke to the man briefly, but then fled the shelter, exiting via the tree hole he had entered from. He wanted to spend time researching the effects of the lifewater.\n\nHan Sen returned to his own shelter, and on the third day, his body returned to its ordinary size.\n\nAnd while Han Sen may have been ordinary, the drop of lifewater he had received was still as small as it used to be. The vial of liquid was so small, it couldn’t even be classified as a drop. It was almost invisible to the naked eye.\n\nHan Sen summoned Moment Queen and Dragon King and asked them about Immortal Emperor, to see what they knew. They both claimed not to know who he was, but Dragon King told Han Sen that it was most likely a fake emperor.\n\n“Why would you say he is fake?” Han Sen asked.\n\n“Emperor is a title, not a self-given name. It is bestowed upon a spirit by other spirits in recognition of their greatness. If he is not widely recognized, how can he be an emperor?” Dragon King explained his reasoning.\n\n“What you say makes sense, but what if he does have the strength of an emperor? What if he does, and he just maintains a low profile and keeps to himself?” Han Sen asked.\n\n“Impossible. The actual body of an emperor is not much stronger than that of a king spirit, but it provides the emperors a higher chance of opening ten gene locks. Unlocking your tenth gene lock, however, requires many resources. Do you think this fellow could obtain all the resources he would need silently, without others becoming aware?” Dragon King said.\n\n“I suppose you may be right. He doesn’t have many resources, actually. Plus, out here in the normal-sized world, he only commands a tree.” Han Sen agreed with Dragon King, hearing it put like that.\n\nHan Sen then showed Dragon King the lifewater he had received, and to this, Dragon King said, “Holy smoke! Lifewater, you say? This is a skydrop! You’ve met Sky King.”\n\n“Who? Sky King? Skydrop? This is lifewater.” Han Sen was confused.\n\n“Immortal Emperor must be that *sshole Sky King. Just when I thought he couldn’t stoop any lower, the guy goes and proclaims himself to be an emperor!” Dragon King almost looked amused.\n\n“Who is he?” Han Sen asked.\n\nDragon King explained, “He is another one of the eight generals. I’m surprised he didn’t meet a grizzly end yet. And now he’s moved on to call himself Immortal Emperor? It makes me shudder.”\n\nHan Sen believed Dragon King must have held some sort of grudge against Sky King to possess such a strong reaction, so he said, “It has been a long time, you know. Are you sure there wasn’t a chance for him to level up and become an emperor?”\n\nDragon King looked at Han Sen with disdain and said, “My *ss! He used to be an emperor. He became too big for his breeches, so you know what he did? He challenged Ancient Devil Emperor himself. And of course, Ancient Devil defeated him. But he was taken in as a general. During their battle, though, Sky King was injured quite badly. His wounds were so grievous, they knocked him down a peg. He became a king spirit, as a result. He’ll always have to remain so, as well. He’ll never be an emperor, ever again.”\n\nHan Sen then told Dragon King about the laboring, and what was whispered about the Immortal Pills.\n\nHan Sen asked, “If he is indeed Sky King, might it be possible he has found a way to recover? Is that why he hides atop the shelter inside the tree hole?”\n\nDragon King frowned and said, “Ancient Devil said he cannot be healed. Not now, not ever. But Sky King, he’s as slippery as an eel. It wouldn’t wholly surprise me if he truly did find a way to recover. Might I ask, is that shelter a black and red walnut tree?”\n\nDragon King stared at Han Sen with a queer look.\n\nHan Sen confirmed his suspicion and described the tree in further detail. He also went on to explain how the interior looked.\n\nDragon King squealed, and said, “Oh, no! That really must be the Sky Tree! This is what he owned during his time as an emperor. It should have been destroyed, after the battle. It’s growing again? But if it’s growing, there must have been a lifeforce on it.”\n\nDragon King suddenly widened his eyes, and he said, “Haha! I know! This is what Sky King wants… This is a good chance…”"
}