{
    "chapter": 2438,
    "title": "Jadeskin Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2438",
    "text": "“I am giving you one last chance,” Miss Mirror said, her voice as harsh as a winter wind.\n\nShe didn’t want to kill Han Sen. After all, he was the master of the Mirror Spirit Eye Ring. Killing him would deal a lot of damage to the Mirror Spirit Eye Ring, which would affect Miss Mirror herself very severely.\n\nBut although she really didn’t want to risk damaging the ring, she wanted to kill Lady Wan’er even more. If Han Sen refused to walk away, then she needed to beat Han Sen badly enough that he was no longer in any condition to protect the girl.\n\n“If the last picture is true, will it be me and Han Sen in front of that statue with a thousand hands and a thousand eyes?” Miss Mirror wondered.\n\n“My Lady, you overestimate your Mirror Area’s power.” Twin trails of blood streaked over Han Sen’s cheeks as he held Lady Wan’er. He looked very calm.\n\n“Right,” Miss Mirror snapped, looking a bit angry. She had never been this patient with anyone before. If another person had tested her temper like this, even if they were deified, she would have struck them down.\n\nShe kept enduring Han Sen’s stubbornness and rudeness, but he obviously didn’t appreciate that she was going easy on him. It was very frustrating for Miss Mirror. She used her sword to slash at the mirror.\n\nHan Sen moved the moment Miss Mirror swung the broken sword. Her broken sword entered the mirror, but it couldn’t hurt Han Sen this time.\n\n“Your Mirror Area can assault my shadow within the mirror you create. Since that shadow is linked to my real body, you can hurt me. But that all depends on you being able to touch my shadow. My shadow in the mirror, however, moves with me. I can control it, allowing it to dodge your broken sword,” Han Sen said.\n\n“You are smart. You have learned much about my Mirror Area in such a short amount of time,” Miss Mirror complimented him. Her face remained impassive. “But even if you do know that, so what? The mirror world is the opposite of our world. You can control your shadow, but it won’t move as naturally as your own body, because every move you make in this world will be reversed in the mirror. And on top of that, you have been blinded. You cannot see your shadow in the mirror, so how do you expect that you will be able to dodge me?”\n\n“Try to attack me again, and you will see for yourself how well I can still dodge.” Han Sen’s composed expression hadn’t changed.\n\nClearly, Miss Mirror wasn’t fond of Han Sen’s attitude. She slashed her sword in the direction of the mirror with one of her rainbows.\n\nThe power of the attack headed for Han Sen’s shadow in the mirror. Han Sen needed to control his movement, guiding his shadow around the incoming attack.\n\nHan Sen’s shadow responded instantly to his every movement, but the reversal of the mirror made it very difficult to control.\n\nNormal people used mirrors to do their makeup or brush their hair. When performing a task that required a person to make extremely precise movements, people who weren’t very experienced with working in mirrors would often make mistakes. Han Sen wasn’t doing anything as simple as brushing his hair, though; he was using a mirror to fight for his life.\n\nHan Sen had to control his reflection to avoid Miss Mirror’s scary attacks. It would be a difficult task at the best of times, and doing so while blinded and injured would be nearly impossible.\n\nBut Miss Mirror, despite running her sword skills at full power, was failing to inflict any more damage on Han Sen’s reflection. She couldn’t land a single strike.\n\n“How is he doing this?” Miss Mirror wondered, her shock etched deep into her face.\n\nShe knew how hard this had to be, especially since Han Sen had only just become a King. She would never have expected that Han Sen would be able to neutralize her sword skills. After all, she had the experience of a deified. She wasn’t some ordinary King class enemy to him.\n\nNow Han Sen could fight her face to face, and he could control the shadow in the mirror with unbelievable proficiency. She missed each and every attack.\n\nThrough all of this, though, the most amazing thing was that Han Sen was blind. It was hard to imagine how strong his other senses must be to accomplish a feat such as this.\n\nMiss Mirror couldn’t hurt his reflection, and so her sword stopped moving.\n\n“My Lady, it looks like you cannot hurt me,” Han Sen said.\n\nMiss Mirror was no longer angry. She had underestimated Han Sen, who was a King. She never thought Han Sen would become an actual threat to her.\n\nBut now, Han Sen’s performance had revealed him as just that: an enemy who could rival her power. He wasn’t just some random King she could slay on a whim.\n\n“You are very strong. A leftover of the crystallizers is this capable? That is incredibly rare. If it was possible to avoid being your enemy, I would choose to do so,” Miss Mirror said, looking at Han Sen with newfound respect.\n\n“I don’t want to be your enemy, either. Why don’t we re-establish our bonds of cooperation and work to rid ourselves of the red-eye plague?” Han Sen smiled.\n\n“We will, of course. But she must die first,” Miss Mirror said. The muscles in her jaw tightened, and a weird light shimmered. A scary Mirror Area appeared.\n\nHan Sen immediately realized he was now trapped in a mirror maze. Mirrors appeared everywhere he looked. Even the ground and the sky above were just mirror images.\n\nHan Sen’s reflection was in every mirror, as if thousands of Han Sen’s were there. The mirrors reflected each other, creating reflections of Han Sen that stretched back into infinity.\n\nHan Sen’s face changed. Since there were so many reflections, Miss Mirror could strike him with far greater ease now. Han Sen needed to stop her from hitting any one of those reflections. Defending himself had become a much more difficult task now.\n\nAnd it would be even harder to break the old mirrors now, too. He didn’t know if those old mirrors could be broken, but even if they could break, the mirrors would only shatter and create countless more reflections in the shards. Han Sen would be in even more danger, then.\n\n“Still confident that you can dodge my attacks?” Miss Mirror asked as she hung in the center of the Mirror Area.\n\n“Let’s give it a try. Maybe I can make it work.” Han Sen shrugged.\n\n“You are so stubborn,” Miss Mirror grunted. With a swing of the broken sword, sword rainbows came to life and went flying at Han Sen through the mirrors.\n\nThere were too many reflections in the mirrors, and Miss Mirror continued to attack without pause or hesitation. Countless reflections would be involved in every single evasion that was required.\n\nHan Sen’s heart leaped. He summoned Jadeskin and channeled as much power into it as he could. His body became icy jade. His mind opened, and his Jadeskin Area appeared.\n\nHis expression focused, Han Sen jumped, and all of his reflections avoided the incoming sword strike. At the same time, his Jadeskin Area covered all of the old mirrors. Frost spread over the surface of every single mirror.\n\n“That’s useless! Your reflections in the ice are susceptible to my strikes, so I can still use them to kill you.” Miss Mirror slashed towards one of the frozen-over mirrors.\n\n“The ice won’t work? It looks like this is it, then.” Han Sen sighed. Han Sen withdrew his Jadeskin Area, pulling it all back into his body.\n\nMiss Mirror’s sword came for one of Han Sen’s reflections again, but this time, Han Sen didn’t dodge.\n\nDong! Dong! Dong!\n\nMiss Mirror’s sword struck all of Han Sen’s reflections, but Han Sen just stood where he was. He wasn’t bleeding, and not a single wound appeared across his body. It was like he was a jade statue, resolute and still.\n\n“Not even dust will tarnish my Jadeskin, Miss Mirror. My body is my body. It is mine alone, and nothing in this world will change that. Even if you break all my reflections, you cannot hurt me.” Han Sen held Lady Wan’er while he spoke, his voice frosty."
}