{
    "chapter": 2958,
    "title": "What Do You Want?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2958",
    "text": "Ancient Abyss Grandmaster was waiting for Auntie Mei and the others to get rid of Han Sen in the astral instrument’s realm. Not long later, he saw the zone disappear. With its removal, a body fell out.\n\nWhen he had a closer look, Ancient Abyss Grandmaster was shocked. He could not believe what he was seeing.\n\nHan Sen was holding the astral instrument. He was standing in the hall. Old Vulture, the eyeless beast, and Auntie Mei were bloody and lying on the floor. They all looked terribly injured.\n\nThis was very shocking. Ancient Abyss Grandmaster did not say anything. He wanted to leave the hall and escape into the darkness.\n\n“Grandmaster, are you going to leave without saying goodbye?” Han Sen suddenly appeared in front of Ancient Abyss Grandmaster. He prohibited Ancient Abyss Grandmaster from following the path he had chosen to depart by.\n\nAncient Abyss Grandmaster knew it was futile to say anything. He had to go through this to live. He shook his body. Suddenly, eight of his clones appeared. They went in eight different directions.\n\nHan Sen was shocked. He could not tell which one was the true Ancient Abyss Grandmaster. The eight clones shared the same presence as Ancient Abyss Grandmaster. All of them looked as if they shared the same body.\n\n“Grandmaster, there is no rush to leave,” Han Sen coldly said. His body flashed. He took out his cause karma knife. He slashed out eight knife lights. They were slashing toward Grandmaster’s eight clones.\n\nThe knife was still the same knife. The knife skill was still the same knife skill. Because Han Sen’s true god power made him much stronger than before, he could slash eight times. Eight knife lights almost slashed eight clones instantly.\n\nSeven clones were destroyed. Only one clone had a turtle shield that blocked Han Sen’s strike.\n\nThe teeth power hit the turtle shield. It created a deep mark. It almost broke the shield. The powerful strength hit the shield, and Ancient Abyss Grandmaster went flying. He was spilling blood.\n\nKatcha!\n\nThe turtle shield was cut in half. Although one slash did not break it, with the teeth power’s ripping power, the turtle shield had been broken.\n\nAncient Abyss Grandmaster was in space. He dropped the broken turtle shield and quickly went flying into the darkness. He was like lightning or a weird bird. He used a borrowing strength skill. Han Sen’s slash power became the fuel for his escape.\n\n“Very good Ancient Abyss Grandmaster.” Han Sen had to compliment him. After all, Ancient Abyss Grandmaster was a worthy grandmaster for the Extreme King.\n\n“If you seek to leave this place now, you have underestimated me.” Han Sen used the astral instrument that he had just recently possessed. Suddenly, the sky was full of starlight. He put Ancient Abyss Grandmaster into its realm.\n\n“Grandmaster, thank you for your astral instrument. If you didn’t do this, you could have escaped.” Han Sen looked at Ancient Abyss Grandmaster and smiled.\n\nAncient Abyss Grandmaster had a wry smile as he said, “If I knew you were this strong, you could have easily dealt with the fish bird and eyeless demon. Then, I would not have had to do what I did.”\n\n“So what are you planning to do now?” Han Sen smiled.\n\nUpon hearing him, Ancient Abyss Grandmaster looked at him in shock and asked, “Does that mean you are not going to kill me?”\n\n“That is what you need to ask yourself,” Han Sen coldly said.\n\n“What do you want?” Ancient Abyss Grandmaster quietly asked.\n\n“You and everything you know.” Han Sen had a lot of questions about the Extreme King. The most likely people that could answer him were either the grandmaster or Bai King.\n\n“I do not know much. I just do everything the king commands me to do.” While he was talking, Ancient Abyss Grandmaster’s hands suddenly flipped. A weird coin appeared in his hands. When he flipped his hands, the coin twisted space and dropped his body in space.\n\n“See you later, Brother Han!” Ancient Abyss Grandmaster’s voice came from that space as his body vanished.\n\n“Did I approve of your departure?” Han Sen saw Ancient Abyss Grandmaster disappear in space, so he summoned his pistols and fired at the twisted space.\n\nPang!\n\nThe space exploded. That twisted space was frozen. Ancient Abyss Grandmaster was stuck in space. He could not totally go into space, but he could not drop out of the space either. He could no longer do anything. He was stuck inside that portal.\n\nAncient Abyss Grandmaster’s expression changed. He had a true god ying-yang space coin. It was able to locate a direction. He needed to use the ying-yang space coin to teleport wherever he chose.\n\nUnfortunately, using the ying-yang space coin took time. He spoke to Han Sen so he could set it up.\n\nWhen the ying-yang space coin activated, even the space powers and time powers could not stop sending him back. Yet Han Sen’s power froze the entire portal. It was hard to imagine.\n\nAncient Abyss Grandmaster knew he was unable to run, so he immediately said, “Ask me whatever it is you wish to know. If I know, I will tell you everything.”\n\n“Grandmaster is so smart. You have so many tricks. I will not dare to ask you stuff here.” Han Sen raised his hand. A metal tower appeared. Ancient Abyss Grandmaster was stuck with Forever Solid power. He was about to be taken into Destiny’s Tower.\n\nAncient Abyss Grandmaster wanted to fight back, but Han Sen shot him once more. He could not move, so he was sucked into Destiny’s Tower.\n\nSeeing Ancient Abyss Grandmaster trapped on the seventh floor of Destiny’s Tower, Han Sen put away the astral instrument and returned to the holy palace’s plaza.\n\nOld Vulture, the eyeless big beast, and Auntie Mei were in front of the hall. They looked at Han Sen weirdly.\n\nHan Sen was in a rush to get to Ancient Abyss Grandmaster, so he ignored them. He did not expect their wounds to have healed in such a short amount of time. They were almost fully recovered. It was no wonder why they were true god xenogeneics.\n\nHan Sen walked through the holy palace and asked the three of them, “Where is Littleflower?”\n\n“Littleflower really isn’t at the palace. Old Cat took him to the sanctuaries to harvest genes.” Auntie Mei answered Han Sen’s question. Her attitude was a bit different from before. Her answers were different too.\n\n“Really?” Han Sen coldly asked. He kept walking.\n\n“We told you Littleflower is not here!” the eyeless big beast screamed. “What else do you seek to do?”\n\n“What do I want to do? I thought I told you ages ago.” Han Sen kept walking. He raised his cause karma knife. He brought the knife above his head and slashed it down. Scary knife air was rushing through the hall. “Today, I will tear down the holy palace.”"
}