{
    "chapter": 1187,
    "title": "Sky King Is Born",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1187",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was made up, and he thought to himself, “Hmm, perhaps this is not all bad. Give me a few more, and I’ll have myself a personal army.”\n\nIn the sky, the hellbird raged with great curtains of fire that smoked the skies and turned them black. Try as it might, it was unable to incinerate the vines that sought to ravage its fiery body.\n\nThe green vines had put a strain on it and quelled the ferocity of its flames. The wretched, lecherous vines did not fear anything.\n\nThe vines lashed the bird whose flesh they were born from, and they swayed like manic green fire-licks of their own. Eventually, they proved too much, and they tore the bird apart.\n\nThe bird had hoped to reach Han Sen and his bottle, and it had been rapidly descending as all this unfolded. Unfortunately, it was too late. The only thing to reach the ground was a rain of fleshy chunks and blood-stained feathers. It was another meal for the Sky Tree.\n\nHan Sen saw a giant flower get torn apart at the entrance to the Sky Tree.\n\nThe other super creatures had all been too late for Han Sen to save, and they all ended up as food for the Sky Tree.\n\n“Where is Baby Ghost?” Han Sen asked as he searched amidst the ruin, thinking of all the questions he still wanted to ask.\n\nThe walnut forest was a vile hellscape now, painted dark with the blood of spirits and creatures.\n\nHan Sen asked Qing Jun, who was in the Cruel Bottle, “Where is Baby Ghost? Why did he not exit alongside you?”\n\n“We got separated. He was supposed to be here,” Qing Jun said.\n\nHan Sen asked the Water Fairy if she had seen him, but she said she had not seen him, either.\n\nHan Sen thought this was boding poorly for Baby Ghost. His failure to escape didn’t make sense, though. Han Sen had informed him about the true nature of the conspiracy surrounding the operations of Immortal Shelter, so he should have been among the first to get out.\n\nHan Sen could no longer find the entrance to the Sky Tree, as the original tree hole was now filled up. There was no other way inside.\n\nBut then, a scream sounded in the sky. Looking up, Han Sen saw a gold peacock descending from atop the tree. A person was on top of the peacock; a figure with gold-colored hair adorned with a crown. The man’s simple aura was one of immense power, and Han Sen felt it was comparable to Xiang Yin.\n\n“Is that Sky King?” The man was incredibly handsome. His beauty and strength transcended that which seemed achievable by humans, and one could have easily mistaken him for a god of sorts.\n\n“That’s him,” Dragon King said.\n\nThe gold peacock landed near Han Sen. The man’s eyes gleamed with the color of gold, but they seemed empty and devoid of emotion.\n\n“Leave them, and I’ll grant you a swift and merciful death,” Sky King said.\n\nHis eyes were callous pits of false holiness, and they saw through Han Sen as if it was a strain to even acknowledge his existence.\n\nOf course, a greedy person such as Han Sen was not willing to hand over his goodies, even if it meant he’d get away scot free. Now was the perfect time to run, he believed.\n\nBut still, not knowing the fate of Baby Ghost pained him. Ultimately, he ended up thinking the spirit might have just remained inside the Sky Tree to die.\n\nHan Sen thought about fighting Sky King, but now that the Sky Tree had been revived and his power might have been restored, it wasn’t worth trying. He couldn’t be sure he had what it took to deal with a foe such as that.\n\nPlus, if Han Sen was truly able to defeat Sky King, he’d just respawn back in the Sky Tree. Han Sen would have to destroy the tree itself to ensure he had dealt with Sky King for good.\n\nHan Sen’s Phoenix Sword had only been able to deal a minor scratch on the tree’s bark. And that was before, when it was supposedly dead. He wagered he’d probably be unable to do anything to it now, in its current state.\n\nEarlier, when the bark of the tree fell off, it was replaced with new layers of bark. This bark was like burning, red-hot steel. It looked like a frightening monument, fresh from the forges of hell. It was an unsettling sight, for sure.\n\nSky King wasn’t going to let Han Sen run off with so much of the tree’s food, though. The gold peacock inflated itself like a balloon, and it became so bloated it blocked half of the sky.\n\nThe gold peacock inhaled air in front of Han Sen, whipping up a frenzied suction. It sought to consume Han Sen and the bottle.\n\nHan Sen gritted his teeth and summoned Disloyal Knight. Then he activated super king spirit mode.\n\nHe summoned a coin in his hand and then fired a multitude of them at the peacock.\n\nAlthough they were only coins, super creatures never seemed to have what was necessary to overcome super king spirit mode. Han Sen always prevailed in that form.\n\nThe peacock, seeing the coins coming towards it, stopped sucking. With its mouth, it chomped a number of the coins to break them and their power.\n\nDisloyal Knight used its halo to dye the peacock, and Sky King, a delightfully unholy, tarnished bronze color. Then, as it very much liked to do, it moved toward the creature and let loose a flurry of punches.\n\nThe peacock’s beak struck one of its fists, knocking Disloyal Knight back with a mark across its gauntlet. But this was good, as Han Sen took advantage of this opportunity to leap onto the peacock’s back and dash before Sky King.\n\nHan Sen’s mighty fist, draped in a shroud of purified power, was thrown towards Sky King.\n\nSky King watched Han Sen approach, and the exact moment the fist was set to collide with his face, he moved.\n\nHan Sen saw Sky King’s arm, which was clad in gold armor, move. Then, he felt a sickly power meet with his chest.\n\nIt felt as if he had gotten hit by a train. When Han Sen hit the ground, he formed a fifty-meter-deep hole.\n\nBlergh!\n\nHan Sen coughed blood from his mouth, and he thought to himself, “Dragon King, I thought you said Sky King needs the Sky Tree to achieve the power of an emperor. Why is he this strong already?! He must already be an emperor, one who has opened ten gene locks. He must be as powerful as Xiang Yin.”"
}