{
    "chapter": 3065,
    "title": "Holy Wen White Deer",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3065",
    "text": "Turin Planet was different from ordinary planets. It was a planet without a god temple. Without a god temple, there were no cities to be built around the absent god temple.\n\nThus, Planet Turin was a very rare planet with multiple cities. On Turin, there were a few hundred smaller cities.\n\nOn the largest pier of the city, Spirit Light City, Han Sen, Mister Yang, Ghost Kill, Jian Bu Gu, and the mother and daughter walked along the streets.\n\n“You do not have to do this, Mister. If you have somewhere to go, I recommend you just go.” Han Sen spoke to Jian Bu Gu, who was walking alongside him.\n\nJian Bu Gu shook his head. “Mister, you spent 3,000 king money to buy me. Unless I do something to pay you back, I belong to you now.”\n\nHan Sen laughed. He did not say anything. He just looked at the mother and daughter and said, “If you guys want to leave, I can give you some money to help get you started.”\n\n“Please, keep us in your employ!” The young mother pulled the little girl closer to kowtow before Han Sen.\n\n“Get up. If you guys want to stay, then you can stay.” Han Sen frowned. Mister Yang helped them get up. Han Sen asked Mister Yang, “Old Yang, do you know where King Qin used to live?”\n\n“King Qin lived in King Qin City, but there used to be no city. King Qin lived there, so it was built there.” Mister Yang was next to Han Sen. He told him legends and stories while they walked.\n\nAt this time, in Seven Hearts Department, Manager Wen’s face looked as grey as the earth. His mouth was wide open as he looked at the Seven Hearts Department leader, Fang Qi Yuan, in absolute shock.\n\n“Leader Fang, you must be joking.” Manager Wen was unable to speak straight.\n\n“Who has the time to spare joking about with you? The person you sold really was the Jian Bu Gu, who was the famous king’s tutor in the Qin Kingdom. He was once so famous.” Fang Qi Yuan looked at Manager Wen as if he was an idiot.\n\nManager Wen still could not believe it and said, “That should be impossible. If he really was the king’s tutor, Jian Bu Gu, how could he have become a slave and enable others to bully him? There has to be something wrong there.”\n\nFang Qi Yuan coldly laughed. “About 10 years ago, Jian Bu Gu was commanded by the king to go into Wu Wei Dao Palace alone. He was required to kill the two leaders of Wu Wei Dao Palace and force the Wu Wei Dao Palace out of the Qin Kingdom’s realm. Jian Bu Gu’s swordsman teacher was one of Wu Wei Dao’s nine leaders, the sword grandmaster. He felt as if he betrayed his teacher, so he decided to stop fighting for 20 years. Dead or alive, he would not fight anybody. He also quit his position in the government and vanished without a trace.”\n\n“Back then, I saw Jian Bu Gu a few times. I saw him attack Wu Wei Dao Palace, so that person had to be Jian Bu Gu.” After he said that, Fang Qi Yuan looked at Manager Wen’s pasty face. He lifted his lips and said, “If you could have kept Jian Bu Gu, no matter if you sent him to the Qin Kingdom or sold him to Wu Wei Dao Palace, you would have had so much fortune. I cannot believe you pawned him off for only 3,000 king money. Only you would strike such a terrible business deal.”\n\nWhen Manager Wen heard that, he dropped to the floor in a state of paralysis. He was like a madman repeating the words and sentence, “I sold Qin Kingdom’s king’s tutor Jian Bu Gu for 3,000 king money…”\n\nFang Qi Yuan’s eyes looked as if they were on fire. “It has not yet been 20 years. It looks like that Jian Bu Gu is holding true to his promise. It must be fate that God has enabled me to find him.”\n\nHan Sen and the others did not know what was happening in the Seven Hearts Department, but Li Bing Yu kept examining Jian Bu Gu. She looked murderous.\n\nJian Bu Gu killed two leaders of the Dao Palace. One of them was Li Bing Yu’s teacher. With Li Bing Yu’s age and skill, she was not yet able to be a leader yet.\n\nWhichever way one looked at it, Jian Bu Gu was Li Bing Yu’s nemesis.\n\nLi Bing Yu was not entirely certain that the Jian Bu Gu in front of her was the real king’s tutor of the Qin Kingdom who was so famous. She wasn’t there to witness the fight.\n\nWhile Li Bing Yu was still thinking about all of this, she suddenly heard footsteps that sounded like rain. A man in white clothes was riding atop a white deer. He did, however, possess a black beard. The white deer, though, was far prettier than a horse. It glowed with holy light.\n\nHan Sen saw the deer and the man. He saw the white deer was coming toward them, so he stopped.\n\nIn just a moment, the white deer was 30 feet away from them and stopped. It had been moving so fast, but it was able to instantly stop. It did it so naturally. It was like the white deer was frozen on the ground and entirely unmoving. “I heard you bought three slaves for 3,000 king money. How about I spend 30,000 king money and take one of them off your hands.” Fang Qi Yuan sat atop the white deer, smiling as he spoke. He did not look at Han Sen once. He merely stared at Jian Bu Gu.\n\n“I am not making a trade with you,” Han Sen said as he looked at Fang Qi Yuan.\n\nMister Yang looked at Han Sen seriously and quietly said, “Be careful, Mister. That man is probably riding atop the ultimate body of a Holy Wen White Deer. In the Big Qin Kingdom, it is in the top 100 gene races to be found.”\n\nFang Qi Yuan ignored Han Sen and Mister Yang. He only looked at Jian Bu Gu and asked, “Mister King’s Tutor, do you remember me? I am Fang Qi Yuan.”\n\nAfter he said that, Mister Yang was shocked. He did not expect that the slave was really the Qin Kingdom’s king’s tutor, Jian Bu Gu.\n\nJian Bu Gu calmly looked at Fang Qi Yuan and said, “You are the student of Sky Leader. I saw you on Sky Path Peak. You were standing next to Sky Leader.”\n\n“If you know that, then there is no need for me to talk crap,” Fang Qi Yuan coldly said. “You owe Wu Wei Dao Palace, and today is the day you should pay them back.” His body glowed. The Holy Wen White Deer combined with his body, and it made Fang Qi Yuan’s body stronger. His head had a holy set of antlers. He looked very holy. His hands turned into the trotters of a deer. They looked as if they had been born with a holy mark.\n\nHis eyes had a god light in them. Fang Qi Yuan faced his palms towards Jian Bu Gu. The holy light flashed like a flooding sky river. It gathered across his holy text and made the holy text glow.\n\nThe holy text looked as if it was born from the sky and earth. It triggered the power of the sky and earth. It made Han Sen and the others feel as if they were going to be crushed beneath those words by the sky and the earth. One word was able to crush a mountain.\n\nJian Bu Gu just peacefully stood where he was. He looked up at Fang Qi Yuan as he tried to attack him. He did not look as if he was going to dodge or fight back. He did not summon a gene race to combine with.\n\nHan Sen was just going to sit back and watch, but he saw Fang Qi Yuan’s palm was just about to strike Jian Bu Gu’s body. Jian Bu Gu did not evade. It looked as if he was happy to accept death. This shocked Han Sen.\n\nHe sensed that Jian Bu Gu really was not going to fight back. He was just going to accept that hit.\n\nFang Qi Yuan looked murderous and very excited. Jian Bu Gu was waiting for his strike. He really was not going to attack. Now, Fang Qi Yuan could erase an enemy for Wu Wei Dao Palace.\n\nSeeing the light text was going to crush Jian Bu Gu, it did not matter how famous he used to be. If he did not combine with a gene race, there was no way he would be able to withstand that strike.\n\nWho knew a hand would suddenly appear and grab Jian Bu Gu’s hand to pull him aside? Fang Qi Yuan hit empty space.\n\nFang Qi Yuan frowned. He looked at the person who pulled Jian Bu Gu away. It was Han Sen, who had spent 3,000 king money to buy Jian Bu Gu.\n\n“We did not agree on a price yet, and you are trying to kidnap him. You are very unreasonable.” Han Sen smiled at Fang Qi Yuan."
}