{
    "chapter": 1245,
    "title": "Three-Life Fruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1245",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBecause only Han Sen and his father had been home at the time of that incident, knowing the cat had been painted should have been information exclusive to the two of them.\n\n“Is he still alive?” Han Sen asked.\n\nHan Sen was filled to the brim with a mixture of varying emotions following this most recent encounter with Blind Man. If his father hadn’t died, then he wondered why his father never came back to visit them. If this was revealed to be true, anger would be the prevailing emotion.\n\nBut Han Sen knew nothing was ever straightforward, and it wasn’t likely for his father to be some deadbeat dad. If he was alive, perhaps there was a reason he could not see his family anymore.\n\nHan Sen only wanted to learn where he was and put all the nagging questions to bed with answers. The constant lingering questions never ceased to tug at the fringes of his mind.\n\n“He is alive,” Blind Man answered resolutely.\n\n“Where is he? I want to see him,” Han Sen said.\n\n“Now is not the time,” Blind Man said.\n\n“Why?” Han Sen asked.\n\nBlind Man said, “He is doing something very dangerous, but if you become a demi-god, there is a chance you two can meet again.”\n\n“He has been in the sanctuaries all this time?” Han Sen asked, with a leaping heart.\n\nBlind Man did not answer this immediately. He simply knocked the table in idle silence for a while. When he spoke next, he said, “The pill that resides inside that cauldron is something most valuable. His procurement of it came at a great risk to his life, but he got it for you, nonetheless. But that is not the only thing he wants to give you, as there is advice, also. He wants you to refrain from getting involved with Blood Legion affairs and the circumstances regarding Han Jinzhi. Just take care of your mother and your sister.”\n\n“Tell me what he is doing,” Han Sen demanded, with a cold stare.\n\n“That is not for me to say. I cannot. But when you are capable, and the time is right, provided he is still alive, the time for another encounter will come,” Blind Man said, standing up to leave.\n\nHan Sen was angry now, as he couldn’t stand such tantalizing teases. He hated being left to hang, only receiving half the answers. Cliffhangers were the bane of his existence, and it was frustrating how prevalent they were.\n\nHan Sen was going to grab Blind Man, but he had already gone.\n\nThis was the Alliance, though, so it would be unwise for him to fight there. And when Han Sen left his seat to catch up with him, he couldn’t find Blind Man anywhere. He seemed to be long gone.\n\nHan Sen used his Dongxuan Aura to trace where he might have gone, but that was useless as well.\n\nHan Sen was no longer in the mood to take Bao’er to eat ice cream, so he went straight over to his mother’s house. There, he showed her the ring.\n\nWhen his mother saw it, her eyes suddenly turned red.\n\n“Is that your father’s ring?” she asked, prompting Han Sen to relay to her the tale of what had occurred and who he had met while on his lengthy quest for ice cream.\n\n“So, that’s the long and short of it? The *sshole is alive, and he’s not dead. If I see him again, I swear I’ll kill him myself,” Luo Lan said.\n\nLuo Lan sounded incredibly angry, but Han Sen could recognize the soft undercurrent of a secret happiness in the way she spoke.\n\nOf course, Han Sen couldn’t be certain whether or not Blind Man was telling him the truth. But with all this on his mind, Han Sen decided to return to the sanctuary and take a look at the cauldron once more.\n\nHe couldn’t tell what the little, jewel-like orb was. And since Blind Man wasn’t the most trusting fellow, he couldn’t be sure whether or not it would be beneficial as he said it would be. So, again, Han Sen shelved the cauldron.\n\nAt long last, Han Sen took Bao’er out to get the ice cream she so ardently desired. He also got her additional snacks. He was willing to spend a bit on food in the Alliance, too, as there was never anything decent to eat in the sanctuaries.\n\nAfter half a month more had passed, Saint Fan had yet to show his face again. And now, the Three-Life Tree had finally matured.\n\nThe three fruits dropped to the ground like sparkling, shooting stars. The Three-Life Tree withered and died after the fruit departed its electrical branches.\n\nHan Sen wouldn’t dare open the treasure himself, as he never had luck doing such things. So, after he brought the fruit out of the well with him, he asked for Zero, Bao’er, and Little Silver to come join him.\n\n“Who would like to open this?” Han Sen pointed at the fruit which contained the Twin Knight.\n\n“Me!” Bao’er immediately raised her hand.\n\n“Okay, but you have to give it back when you’ve opened it. Do that, and I’ll reward you with ice cream,” Han Sen nodded approvingly.\n\nBao’er took the fruit and bashed it against the floor. The shell broke.\n\nThe knight beamed into Bao’er’s head.\n\n“So, care to tell me what it is? Han Sen asked.\n\nDragon King told Han Sen it was a Twin Knight beast soul, but noted how remarkably strange it was for it to be growing on something that wasn’t a Twin Knight tree. Therefore, what was inside could not be guaranteed.\n\nAll he knew for sure was that it was a beast soul of some kind.\n\nBao’er sent Han Sen the knight beast soul and made sure to comment, “Just don’t forget my ice cream.”\n\n“Super-class Twin-Thunder Knight [possession type] beast soul obtained.”\n\nIt was indeed a Twin Knight, but one associated with thunder. If it could only adhere to the one thunder element, then that was disappointing.\n\n“I won’t forget.” After Han Sen told Bao’er this, he turned to look at the silver fox. Little Silver seemed to have a bit more control over itself now, but he still looked incredibly anxious to open the fruit that was before him. “This is for you, Little Silver.”\n\nThe silver fox was the strongest there amongst them, as it had ten whole gene locks open. It was only fair that Han Sen provided it goodies.\n\nLittle Silver reached out its paws and crushed the fruit. Then, the hand inside emerged and began to fly around.\n\nObserving the hand after it emerged from the fruit, Han Sen noticed that it wasn’t actually made of flesh. What Han Sen had presumed to be veins were actually streaks of lightning.\n\nThe silver fox then gobbled up the entire hand, and his body started to shake and vibrate. After that, the furry thing burped out a plume of blue lightning."
}