{
    "chapter": 1886,
    "title": "I Make the Calls",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1886",
    "text": "Guya looked at Buddha King. The clouds that trapped Buddha King rose up and drifted over to her.\n\n“Did you take the leader?” Guya asked Buddha King expressionlessly.\n\n“Amitabha! I don’t know what you mean!” Buddha King said, after speaking out his buddha phrase.\n\nGuya looked at Buddha King and went on to say, “I know how powerful the Kao are. Without support, they wouldn’t have been brave enough to betray us in the manner that they did.”\n\n“Amitabha! What does that have to do with me?” Buddha King said.\n\nYou think the Buddha Duke’s meeting with the Kao leader slipped our notice?” Guya looked angry, and she went on to say, “If the leader had simply listened to me, none of this would have happened. Tell me! Where did the leader go?”\n\nNow Han Sen understood why they had not met a stronger Gana. At the auction, they had only seen Viscounts.\n\nThe Dukes had not appeared, and neither had the Earls. They had already been taken by Buddha King.\n\nBuddha King and the Kao had used the auction house as a distraction for the other races. While it played out, the more important Gana were successfully kidnapped. Buddha King and the Kao hadn’t expected the Purgatory Heaven to come into play.\n\nIt wasn’t Buddha King’s fault, of course. No one expected the Gana’s deified item to have been in the Gana’s hands. Or for it to have been inside a random statue.\n\n“Amitabha! If you release me, I will keep you safe and bring you all together again.” Buddha King admitted he had his hands on their leader, clearly planning to use this as leverage.\n\nAs soon as Buddha King said this, though, Guya drew a ghostly scimitar and swung it toward his neck.\n\nIn a split second, the King class elite was beheaded. His head rolled across the floor, with his eyes open. No one had expected Guya to simply cut his head off.\n\nThe other Kings were all in shock after what they had witnessed. Guya was a very decisive individual. In this heaven, a King class elite’s life was as worthless and weak as the average commoner’s. There was no need to pay them respect.\n\nHan Sen was shocked, but it made sense. Guya had already cast a spell to activate Purgatory Heaven, so yes, the fact she was a very decisive person was already established.\n\n“Sister! You killed Buddha King. What about our leader?” Guna sounded worried.\n\nGuya coldly said, “Killing him did not make a difference. Our leader isn’t going to be returned, but don’t worry; he’s not going to die. He will likely be made a slave, for the Buddha won’t kill him.”\n\nThe other Kings did not speak, and Guya was correct. The Gana couldn’t save anyone. If they had been reckless and left Purgatory Heaven, Buddha King would have found a chance. Instead of saving their kin, they’d end up captured like the rest.\n\nEveryone knew this was a familial matter, but not everyone could make a decision like her.\n\nGuya killing Buddha King had put an end to his tricks and deception. It also counted as vengeance for her own people. When Guya looked at the clouds, she noticed that all the elites were in shock.\n\n“You!” Guya looked at Han Sen. She spoke one word, and Han Sen’s cloud started flying towards her.\n\nEveryone was shocked. No one expected that the second guy she’d kill to be Han Sen.\n\n“What are you doing? We have been through so much together. We didn’t take your blood, and neither have we forced you to do anything against your will. Why don’t you kill the guys who robbed you of your blood instead of Old Han, huh?” Wang Yuhang said.\n\nGuya ignored him and looked at Han Sen. “But you did bully Guna, did you not?”\n\n“What do you want from me, then?” Han Sen asked, sitting on the cloud.\n\n“You did not harm Guna, and you did help us. I can give you one chance.” Guya looked at Guna while speaking to Han Sen.\n\n“What do I do with this chance?” Han Sen did not believe she would let him go so easily.\n\n“Kill them, and you vdll be considered one of us.” Guya pointed at Gold Jade King, Giant King, and the others.\n\nThe five Kings were sent forward, near Han Sen.\n\n“Good idea! Killing this many elites will gain me so many enemies, and that’s just what I need. Even a King of the Rebate? Not even Knife Queen would protect me for such a transgression! With this leverage, I could only work for you and no one else. If I don’t do what you say, you can tell the others and make me one of the universe’s Most Wanted,”\n\nHan Sen said coldly.\n\n“Are you going to kill them or not?” Guya asked, looking at Han Sen.\n\n“Sure! Why not? They’re not my family. There’s no point giving up my own life for theirs.” Han Sen just shrugged with his shoulders.\n\n“Good. Use this to cut their heads off, and then you will be considered a friend.” Guya gave the Ghost Scimitar to Han Sen.\n\nGiant King and Gold Jade King were surrounded by clouds. They could not move. They watched Han Sen approach, still holding his knife.\n\n“Han Sen, do you really want to betray Knife Queen and the Rebate?” Gold Jade King said icily.\n\n“From what I recall, you never treated me as one of the Rebate, anyway. If you did, you would have taken me with you when you tried to escape. Now you think I’m betraying you? Is this a joke or something?” Han Sen slightly pressed the weapon against Gold Jade King’s neck. The touch of the blade gave him a cold sweat.\n\nBut Han Sen did not cut him. He then brought the scimitar in front of Giant King and said, “What did you say? You said if their blood was not enough, you’d use ours. I should kill you for that, shouldn’t I?”\n\n“Kill me if you want to. Just the crap and get on with it,” Giant King said stolidly.\n\nHan Sen didn’t strike. He walked past each elite, and eventually he turned back to Guya and said, “These are five King class elites. It would be a shame to kill them all. You should hold onto them.”\n\n“If you don’t kill them, I will kill you and your friends,” Guya said dangerously.\n\n“There is no way we are dying.” Han Sen smiled.\n\n“That is not up to you to decide. I decide what happens here,” Guya said.\n\nHan Sen threw the Ghost Scimitar back to Guya and said, “From now on, I call the shots. You and Guna can be my secretaries. Treat this place nicely, and I will treat you nice in return.”\n\nGuya, Guna, the Gana, and the Kings all looked at Han Sen like he was a madman."
}