{
    "chapter": 2190,
    "title": "Taking the Legacy",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2190",
    "text": "Yisha had been a very special person to the Rebate, so there was no need to worry about the funeral too much. Narrow Moon performed the services very well, and all Han Sen had to do was cooperate with their rituals.\n\nYisha’s death impacted the Rebate a great deal. It affected them deeply, in a variety of ways.\n\nAs one of the two highest ranked individuals of the Rebate, Yisha’s death made them far weaker. It also altered the distribution of benefits and resources that various important Rebate received.\n\nDue to these changes, the biggest negative ended up impacting Yisha’s student Han Sen.\n\nWhen Han Sen went to Night River King to confirm what of Yisha’s legacy would be left to him, he found himself frowning continually.\n\nNight River King provided Han Sen with a list, and there were very few items on that roster with any actual value. Furthermore, Yisha’s home planet of Planet Blade was taken by the elders.\n\nHan Sen was only allowed to claim Yisha’s personal items and belongings. Having expected this treatment, though, Han Sen was prepared to accept the verdict in silence. Now that Yisha was gone, Han Sen was back to being a proper outsider, and the Rebate wouldn’t be willing to give anything of theirs to someone like him.\n\n“Knife was the Cold Palace guardian, but you replaced her. And now that she is dead, it is down to us to select a new guardian for Cold Palace. A real one. Thanks for your help in the meantime, but you can now give us back the tablet. And this is the list featuring all her legacy items you may claim. You will need to sign it,” Night River King said coldly, peering right at Han Sen.\n\nNight River King wanted the Cold Palace guardian’s position. This time, things were going more his way. He would indeed become the guardian in Han Sen’s stead.\n\nHan Sen met Night River King’s eyes and held out the guardian tablet.\n\nNight River King stared at the guardian tablet as it was passed toward him, and his eyes sparkled. The geno art he practiced was aligned quite well with the boons that the deified toad could impart. He’d be able to use the ice and moon powers of the deified toad to become half-deified in only a few centuries.\n\n“I can give you the tablet, and I will sign the form as you asked, but I have one request to make.” Han Sen did not pass the tablet to Night River King just yet. As he spoke, he held it tightly.\n\n“This is a decision from the Full Moon Office. You aren’t out shopping, kid. You can’t haggle with me for a better deal,” Night River King said emotionlessly.\n\nHan Sen ignored Night River King’s jab, and while fiddling with the tablet, he said, “Planet Blade is where my master used to live. I hope I will be able to visit Planet Blade during the times that I miss her. I would like permission to access Planet Blade whenever I fancy.”\n\n“I cannot permit this. Planet Blade belongs to the elders, and this is known to the public of Narrow Moon. People cannot just go there willy-nilly. Not even I can go there without proper permission,” Night River King said seriously.\n\nNight River King certainly could have provided Han Sen access to the planet, but he didn’t want to help Han Sen in any way.\n\nHan Sen did not speak. He merely continued to play with the tablet. He didn’t sign the paper, either. All he did was smile at Night River King.\n\nNight River King frowned and retreated into thought for a moment. “Okay, fine. I will help. I will go and talk to the elders on your behalf, and I will see if I can get you permission.”\n\n“I don’t need you to talk. I need you to add that permission onto this list.” Han Sen stared at Night River King icily as he spoke.\n\n“That is impossible. Don’t push me too far now,” Night River King growled.\n\n“Without that permission added to this list, you can find someone else to sign it. But you won’t see my name on it,” Han Sen said simply.\n\nNight River King looked gloomy, but he didn’t look mad just yet. He turned to Han Sen and said, “You can only enter Planet Blade. You cannot touch anything there, then.”\n\nNight River King didn’t want to cause any trouble for himself. After all, he and the elders had already taken many things that, by all rights, should have now belonged to Han Sen. If Han Sen didn’t sign the agreement, that unfairness would get way too much exposure.\n\n“I only miss her. I do not want to take anything from there,” Han Sen said.\n\nNight River King amended the list for Han Sen without saying a word. He provided Han Sen with permission to access Planet Blade freely. When he was finished, Han Sen signed it. He confirmed his acceptance of the measly legacy, and then he passed the tablet to Night River King.\n\nHan Sen didn’t look at the list. Night River King would only have given him whatever the Rebate were willing to part with. They had taken everything they wanted, and they had left what they didn’t. There was no point in looking at the stuff.\n\nSeeing Han Sen packing up Yisha’s things, Night River King laughed inside and thought to himself, “What is the point to get permission to go to Planet Blade? You will never receive any more resources from the Rebate.”\n\nHan Sen took Yisha’s legacy items back to Planet Eclipse with him. He had gained many treasures, but not a single one of them was King class. The highest were two Duke treasures that weren’t even useful to him.\n\nThe other things were worth nothing, and they would not benefit him in the least, either.\n\n“Is that all she possessed as a half-deified being?” Han Sen laughed darkly. He thought the whole of Narrow Moon must have looted Yisha’s warehouse already. They had only left him with the meaningless scrap.\n\nEven so, there was nothing Han Sen could do about it. The only person that could back him up was gone, so there was no way he’d ever get his hands on those things.\n\nYisha seemed to have known that, though. And that was why she told Han Sen to let go.\n\n“I will let go, only if I should. But I will not let go of anything that belongs to me by right.” Han Sen smiled.\n\nHan Sen put the items in storage in his warehouse on Planet Eclipse. He took out the few useful items, some of which were things Yisha always made use of.\n\nYisha’s death had crushed the Rebate, but people like Night River King had benefitted a great deal from her passing. They were probably happy about what had happened.\n\n“Brother-in-law, are we staying here in Narrow Moon?” Ji Qing asked Han Sen.\n\n“Of course we are. Planet Eclipse has a fair amount of resources, and if we were to leave, we’d be allowing others to benefit.” Han Sen smiled\n\n“But Night River King and the others keep trying to undermine you. The coming days on Planet Eclipse won’t go well for you,” Ji Qing said.\n\n“It is hard to say who will have a difficult time and who will not,” Han Sen murmured, squinting his eyes in thought.\n\nHan Sen did not plan on leaving Narrow Moon. He didn’t like the idea of being kicked out; he’d leave on his own terms.\n\nThe fifteenth day of the month rolled around, and Night River King went to Cold Palace for the first time since accepting the position of Cold Palace guardian. He merrily trekked up to the stone house and settled himself on the porch as the Cold Palace guardian.\n\n“With this Cold Palace guardian position, I might become half-deified in a mere two centuries. I will be able to replace Knife in Narrow Moon.” Night River King grinned at the thought. He held the Cold Palace guardian tablet so tightly that his hands began to shake. He had waited for this opportunity for so long.\n\nTime passed, and midnight came. Night River King looked at the stone door, waiting for the deified toad to emerge.\n\nSuddenly, Night River King saw a shadow walking across the mountain. He was shocked. Planet Blade was taken, so no one should have been wandering around. And on top of that, it was a restricted area."
}