{
    "chapter": 2402,
    "title": "God’s Wish",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2402",
    "text": "Han Sen’s heart jumped. He didn’t mind hearing about deifieds, but he really did mind hearing the word “God.”\n\nThis sensitivity came from his time in the sanctuaries. Since he first entered the sanctuaries, he had come to despise the word “God.” Even hearing it would put him in a bad mood for a long time.\n\nEspecially when it came to the events with the Seventh Team. They had really affected Han Sen.\n\n“This guy cannot be the god that claims to grant wishes, can he?” Han Sen stared at the man who sat atop the stone platform, and he really thought that this man had to be the one he had heard so much about.\n\nPlus, the black crystal armor’s reaction made Han Sen much more alarmed.\n\n“I’ve never heard of any of the Extreme King dying in this Destiny’s Tower. People claim to learn a lot from their time in the tower. No matter what is said about this place, there is never a hint of something fatal residing inside. Otherwise, with so many people having already entered this place, at least one of them should have died,” Han Sen thought to himself. “No wonder each of the Extreme King learns something different inside the tower, though. There is no geno art here. There is just this living god.”\n\nHan Sen froze, and he didn’t answer. The man asked again, “Young man, do you believe that God exists in this world?”\n\n“Yes,” Han Sen answered with certainty. But inside, he thought, “Of course, I believe. Han’s big brother is Dollar God.”\n\nThe man nodded, and he went on to say, “If I told you I was God, would you believe me?”\n\n“I would,” Han Sen said, feigning cooperation. He wanted that man to keep talking. After all the time Han Sen had spent tracking down bits and pieces of this man’s exploits, he badly wanted to know what the man’s true goal was, or where he might have come from.\n\nThe man didn’t seem impressed or concerned by Han Sen’s answer, though. His expression hadn’t changed, and he still smiled. “It is a fated meeting that you have come here to speak with me. I can fulfill one wish for you. You can say whatever you want, as it should be something deep in your heart. You only have one chance. No matter what you say, it will be fulfilled. But you cannot change what you wish for.”\n\n“This guy is just like King Qun,” Han Sen chuckled darkly in his heart. He looked at the man.\n\n“I can make any wish?” Han Sen asked, looking at the man.\n\n“Any wish that you desire. God can do anything,” the man said calmly.\n\nHan Sen frowned, and he didn’t speak. Making a wish seemed like a simple process, but there were many traps. Each member of the Seventh Team from the Alliance had made a wish, but before the end, each one of them had regretted their wish. Something disastrous that they never expected had befallen them.\n\nFor instance, Han Sen could wish for a lot of money. God would set up an accident and drop a lot of money right into his lap. Things would seem great, until it eventually came out that the money had belonged to a psychotic killer. While Han Sen would indeed be the recipient of great fortune for a time, he would eventually be killed by that psychotic killer.\n\nGod was supposed to be an abstract concept. Once people made their wishes to God, they were supposed to move on with their lives, not linger in the moment.\n\nIf people really thought that God was a person who granted wishes like this man, it would be very dangerous.\n\nIf someone believed in God, then they believed that God was a real force in the world. Every action he took would have ramifications in the world. He wouldn’t just be able to make something out of nothing.\n\nSo, whatever wish a person made should be something that already existed inside the universe someplace. These items would, of course, have a pre-established connection to the universe. Any rare item that someone wished for would be deeply associated with the workings of the world.\n\nHan Sen used to think that, if God really existed and he could really fulfill wishes, then he might be a special sort of lifeform that had Causal powers.\n\nA person had to wish for something they wanted, but the consequences of the item might befall the wisher. So, the rarer the item was, the greater the consequences could be. The price that had to be paid could be huge.\n\nIf a person wished for ten thousand dollars, and that ten thousand dollars were with a mother who wanted to heal her ailing son, and that ten thousand dollars were then given to the wisher, the son would die from lack of treatment. That death and that mother’s hatred would end up on the wisher.\n\nIf the wisher was greedy and wished for one million dollars, the wish might hurt one hundred lives. The wisher would be hated by a hundred families. Having one hundred different families seeking revenge against you would be a high price to pay.\n\nThose were just Han Sen’s predictions and guesses, though. They might not have actually been true, but according to what happened to the Seventh Team, the guesses were in the realm of possibilities.\n\nIt didn’t matter if someone wished for immortality or a return to their youth; every wish had its price. That price also took away the governance of a person’s own life and death. Perhaps it was because there were too many consequences, but sometimes, not even death brought freedom from the consequences of a wish. They would have to continue their miserable existence to pay back the debt.\n\n“If this theory is correct, then everyone who entered this Destiny’s Tower should have paid a price. But I haven’t heard of any misfortunes among the people who have come here. Why?” Han Sen frowned.\n\nThe guy that was claiming to be God noticed Han Sen’s continued silence. He smiled and said, “You can think about what you wish to want to make. There are forty-eight God pictures. They all have my will in them. You can go and take a look. Perhaps they will help you decide. That will be the first gift I give you. When you have thought of the wish you seek to make, come to me and I will make it come true.”\n\nHan Sen didn’t leave. He looked at the man and asked, “If I make a wish, do I have to pay something back in made?”\n\nThe man continued smiling and said, “You will.”\n\nHan Sen was surprised that the man answered. He had thought the self-proclaimed God wouldn’t admit this, even if asked. Han Sen immediately followed up his question.\n\n“What do I need to give you?”\n\nThe man looked at Han Sen and didn’t answer the question. “You are not the first person to ask me this question. And you surely won’t be the last. I can answer you, but if I answer, you must make a wish. Do you agree?”\n\nHan Sen thought for a brief moment, and then said seriously, “I agree.”\n\nThe man smiled and said, “The wish you make will be fulfilled, and that is because it is what you deserve.”\n\n“It is what I deserve? If I want a hundred wives, that means the wives will already have been my wives? What sense does that make?” Han Sen was frozen. What the man said was something Han Sen couldn’t accept, but when he thought about it some more, his breath caught. He now knew why the man would say this.\n\nWhat the man had said was reversed. If you tried to understand it in reverse, then the sentence made sense. But the Causal relationship reversed it."
}