{
    "chapter": 2723,
    "title": "Weird Black Crystal",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2723",
    "text": "Empty God wasn’t afraid of Han Sen, but this whole scenario was too embarrassing for him to bear. He had tried to trick a mere child, but he had failed miserably. More than once. He had also lost a true god item—the Star Gauge Mirror.\n\nHe started to step toward them, but he knew that he couldn’t do anything to Han Sen. He couldn’t take the Star Gauge Mirror back, and Han Sen might even mock him for trying.\n\n“Wait here. We are not done yet!” Empty God growled to himself, staring at the father and daughter. He teleported away, still enraged.\n\nWhen Han Sen heard Bao’er yelling for him, he was shocked. A place like Star Tree shouldn’t have some random person moseying about. Han Sen teleported to Bao’er, but he didn’t see the man she had mentioned. But he did notice that Bao’er was holding a small bronze mirror in her hands. She was merrily running toward him.\n\n“Dad! Look at this treasure mirror and this gem. A good uncle gave them to me.” Bao’er held out the Star Gauge Mirror and gem toward Han Sen while she spoke.\n\n“What good uncle?” Han Sen asked, frowning at the two items.\n\n“I was playing on the Star Fruit earlier…” Bao’er quickly told the story.\n\nAfter Bao’er spoke, Han Sen almost laughed out loud. The man she had met must have been Empty God. Han Sen thought Empty God would go for Exquisite or Li Keer, but he had actually selected Bao’er.\n\n“Oh, Empty God. You were unlucky to select Bao’er. Now you are losing all your treasures. You couldn’t get Bao’er to make a wish, and as you tried, you lost a true god item.” Shaking his head at the thought, Han Sen took the Star Gauge Mirror out of Bao’er’s hands.\n\nGods were allowed to trick people, but they could never lie. If Empty God said that Star Gauge Mirror was a true god item, then it probably was.\n\nHan Sen’s mind went to the Shield of the Medusa’s Gaze, which was a true god weapon. This mirror was of the same level, and according to what Bao’er had said, it would enable him to see the future and the past. Han Sen was so happy about receiving this.\n\nThe black crystal armor was no longer locking down the power in his body, which meant that Empty God must truly have left the vicinity. So, Han Sen cast his Dongxuan Sutra to try and make use of the Star Gauge Mirror. He wanted to see if it was as good as Empty God made it out to be.\n\nAlthough he couldn’t completely activate the power of the Star Gauge Mirror, the Dongxuan Sutra was still able to elicit some response from the Star Gauge Mirror. He tried to use it a few times, but he was ultimately disappointed by the results.\n\nHan Sen didn’t know if his power was too weak to use the Star Gauge Mirror effectively, or if the mirror itself had some restrictions. Either way, the future that the Star Gauge Mirror could display was only a very short scene.\n\nSuch as, when Han Sen used the Star Gauge Mirror to see the future, he could only see a scene. The image flashed across the scene, showing Han Sen sleeping and nothing else.\n\nAnd after Han Sen used it that one time, it took him a whole day to recover the power needed to activate the item again.\n\nHe used it a few times, but the scenes depicting the future turned out to be a pointless waste of time and energy. They were just flashes, after all. He didn’t learn any useful information.\n\nAnd the power to see the past was just as crappy. The Star Gauge Mirror allowed a window into the past, but activating that ability cost a great deal of energy. The further back in time you wished to see, the more power it would cost.\n\nWith Han Sen’s current power, he could only see up to one minute into the past, and the mirror would only show the area within a meter of his location. Using that ability repeatedly would drain his strength at an alarming rate.\n\nThose were the results Han Sen received after rigorous testing. As for the exact rules that governed the use of the Star Gauge Mirror, Han Sen still hadn’t figured them out.\n\nClearly, the Star Gauge Mirror was too high level for him, just like the Shield of the Medusa’s Gaze. Han Sen’s level and power were not enough to unlock the true power of the item.\n\nBut the mirror’s Mirror Armor was a pleasant surprise. Although Han Sen’s power was limited, the Mirror Armor power didn’t require much energy. He activated the new armor while wearing his Apollo Set, and he found that the two armors reinforced each other. The armor’s defense was as good as a larvae class treasure now.\n\nBut sadly, there was a time limit on the armor. After he activated the ability, Han Sen’s armor would only look like a mirror for a few minutes. Once that time elapsed, he would return to normal.\n\nHan Sen decided that the short duration of all the mirror’s abilities was probably linked to his own lack of power. He just couldn’t effectively make use of a true god weapon.\n\nBao’er wasn’t interested in the Star Gauge Mirror, and she only played with it for a bit before throwing it to Han Sen. Han Sen gladly took it off her hands. The thing would still be useful, and once he became deified, it was bound to be even more useful. After all, the power to look into the past could come incredibly handy once Han Sen became stronger.\n\n“Is there a way for us to get rid of this troublesome Empty God? If he keeps trying to set traps for us, things will turn out very poorly.” Han Sen was a bit annoyed by the man, but he couldn’t think of a way to deal with him just yet.\n\nThe gods kept appearing out of nowhere. They could even come and go as they pleased in a place like Outer Sky. Furthermore, Han Sen didn’t have a way to kill such beings. There was nothing he could do.\n\nHan Sen expected Empty God to return and torment them some more, but over the next few days, the black crystal armor showed no sign of activity. That meant Empty God hadn’t bothered to come back.\n\nThat surprised Han Sen, but only because he was lacking a key piece of information about gods. They could go to any place in the universe freely, but their bodies had many limitations. They couldn’t stay in one place for too long. So, Empty God couldn’t just remain in Outer Sky for as long as he wanted.\n\nBut Empty God was finding a way to deal with Han Sen and his daughter. He first met them through his search for gene protoplasm, but the frustration they had caused him had almost driven the gene protoplasm from his mind.\n\nHan Sen stood by the Star Tree, holding a black crystal. He looked very weird.\n\nThe black crystal armor had released its limitations, so Han Sen could take the black crystal out of his Sea of Soul. Once he had it in his hands again, Han Sen tried to feed the black crystal to another xenogeneic.\n\nHowever, the other creatures that he tested it on didn’t react. It was like the black crystal was now useless.\n\nAnd after Han Sen tried putting his power into the black crystal, he realized that his Dongxuan Sutra no longer did anything to it. But when he activated The Story of Genes inside of himself, the black crystal exhibited some strange changes.\n\nThe black crystal in Han Sen’s hand took on the shape of a miniature Immortal Dragon. Aside from the black color and minute size, it looked exactly like the Immortal Dragon.\n\nHan Sen passed the power of The Story of Genes into the black crystal, and the crystal rose out of his hand and flew down to the ground. It swelled to become a life-size Immortal Dragon. The dragon stared straight at Han Sen, just like the first time they saw each other.\n\nHan Sen’s heart leaped. The Immortal Dragon’s body released a strong, holy light. It covered a wide area around them. There was a scar in the tree’s surface nearby, which was probably the result of a bug bite. The damage was healed by the Immortal Dragon’s holy light."
}