{
    "chapter": 1204,
    "title": "Same People",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1204",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nProfessor Long was very excited, but he made sure not to alert Han Sen. He remained there watching, and only left when he saw the sweat-drenched Han Sen finish practicing.\n\nThe next day, after Han Sen entered the lab, Professor Long called for him to come to his office.\n\n“Han Sen, my boy! Research this for me, would you please? And then, hand me your reports when done,” Professor Long said, handing Han Sen a task.\n\n“No problem. Is there anything else?” Han Sen asked.\n\n“No, but these are unfinished projects. Don’t allow anyone else to see them. Go to room 507 to do the work, too.” Professor Long then handed Han Sen a key card, before saying, “There you go.”\n\nSeeing Han Sen walk away, Professor Long smiled. He knew people like Han Sen would be very attracted by such information and would invest time in learning it.\n\nBut the classes were soon to come to an end, which worried Professor Long. There was only about a month left, so for now, he provided Han Sen the most important parts to see.\n\n“A month is not enough time. If he can give me ten years… fifty years…” Professor Long said to himself, losing himself in deep thought.\n\nHan Sen went to room 507 as instructed. A lot of text and video had been included in the information he had been provided. Although Han Sen did not know too much about it, he still tried his best to understand. For a full grasp, he knew it’d take a long time, too.\n\nHan Sen had never learned something like this before, so he had to start slowly. He liked it, though. And despite the struggle, he never once felt bored or tired with the task.\n\nHan Sen was still being annoyed by his predicament with the hyper geno art creation, as he still couldn’t find a way to combine time and space. After reading this, though, he was very inspired.\n\nHan Sen thought Professor Long was something of a genius, in fact. He was a very creative man.\n\nProfessor Long was focusing much of his thoughts on Han Sen now, and he greatly admired him. After he read the first round of notes he was given, Professor Long told Han Sen to skip the lessons so he could focus on the research instead.\n\nThe lessons during the daytime dealt with time and space, and how it was associated with humans, so there was no real need for Han Sen to sit there and listen, anyway.\n\nHan Sen was delighted, and with the information he was provided, he knew there was a lot more to learn and a lot farther to go. He knew he was still dealing with the research on a very basic level, but it was a start. And that aside, it was much better than what he was doing before.\n\nAfter Han Sen’s brain mutation, his memory and abilities of comprehension had become far better. But even so, there was still too much for even him to wrap his head around in such a short timeframe. When the classes were all finished, Han Sen had only managed to go through twenty percent of the stuff.\n\n“Take it home and spend more time with it,” Professor Long said when Han Sen came to return what he had done so far.\n\n“Can I, really?” Han Sen was like a happy child, hearing this.\n\nA lot of information and research breakthroughs were contained within, but many of them had been withheld from the public.\n\n“It’s my private research. You can take it home, just keep a lid on it. Don’t allow any leaks,” Professor Long explained.\n\nThis information was very important, but it was all hogwash to those who did not have a grasp on the elements of space and time. Han Sen never did research for money and fame, he just wanted results. He wanted an advancement of his self, not what surrounded him.\n\nAfter that, Han Sen accepted the information and returned home. He continued having trouble and restlessness over combining space and time into one hyper geno art, but now the predicament had shifted a little. Before it was all about how he could combine them, now it was about which way he could combine them.\n\nHan Sen decided to read through everything he had been given first. After that, then he would decide how to combine the space and time properties.\n\nDue to there being no super creatures in the immediate vicinity, Han Sen didn’t spend much time hunting. Instead, he took his time reading the information and learning.\n\nBefore he finished, Moment Queen had at last managed to find Holy-Sword Shelter.\n\nBringing the humans to Holy-Sword Shelter, Han Sen wondered what they’d all think, once they saw Xie Qing King.\n\nXie Qing King had not changed in Han Sen’s absence, and he was still soaking in an unhealthy vat of human culture. He wore flip-flops, boxers, and a loose t-shirt. To go along with his aviator sunglasses, Xie Qing King now had a straw hat. He was having another cookout it seemed, and as he charcoaled once-fine slabs of meat, he wiggled his body, holding a beer in one hand.\n\nIf Xie Qing King did not have a good body shape, Han Sen would have believed him to be a psychotic butcherer.\n\nStrangely, Han Sen did not see any comics around him. So, he thought to himself, “Has he grown tired of comics and now just indulges himself in the art of barbecuing?”\n\n“Han Sen, ‘sup! You’re back!” Xie Qing King saw Han Sen and placed his arm around Han Sen’s neck and shoulders. Swaying from side to side, he brought him over to sit. He then said, “Let me tell you something, you ain’t going to believe fo’ sho’. I’m a freestyling mofo, in the way I made my own style! Can you believe it, bruv?”\n\n“This is a new style?” Han Sen thought he might have created a new skill or something, something tangible and beneficial.\n\n“Come take a look! This is my new product, so whatchu’ fink?” Xie Qing King presented Han Sen with a book.\n\n“A book? A comic book? Did you draw this?” Han Sen’s eyes were wide-open in a mixture of confusion and about ten other emotions.\n\n“I’m telling you, son. This gon’ light the streets on fire. It’s gonna’ sell like hotcakes!” Xie Qing King said, with much excitement.\n\nHan Sen was in a bit of a daze, and when he looked at the comic’s name, it was called, “Overbearing President Love Luv Looove!”"
}