{
    "chapter": 1252,
    "title": "Broken Flagon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1252",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen listened for a while longer, but there was nothing more useful he could learn. As for the shelter, he decided to delay his attack on it for the time being.\n\nHan Sen was going to wait for Yaksha and Blood River King to take the vine. At that point, he would either attack the shelter or try to claim the fruit. There were two choices, and Han Sen still had to weight the pros and cons of each.\n\nHan Sen poked around the shelter for a bit, wanting to get a look at the super creatures that inhabited it.\n\nAlthough it was not an emperor shelter, Han Sen knew he should still maintain caution and not be so foolish as to underestimate the threat of those that resided inside the shelter.\n\nHan Sen walked towards a tree and saw a human pouring the blood-like water of the river on it. Seeing his skin, Han Sen knew he was one of the Xue family members with the incorrect learning of Jadeskin.\n\n“That one must be Xue Chen. I wonder what he possesses that is so important,” Han Sen wondered to himself what it might be.\n\nHan Sen used the Night Cloak to enter the shelter, and as much as he would have liked to ask him, he knew he couldn’t risk doing so. It could jeopardize the lives of the two and blow his cover. So, Han Sen found out where he lived and then decided to leave the shelter.\n\nEven if Han Sen did go and meet him, he didn’t think the man would give him whatever he was holding onto. So Han Sen returned to the riverside and looked for a cave he could camp out in for a few days. When the time was right, he’d go out and take the vine for himself.\n\nThere were loads of mountains around, and when he found a cave, he brought Bao’er in with him. Even if there were creatures inside, Han Sen could defeat them with ease and not bring awareness to his presence there.\n\nThe cave was very dry, though, and neither was there any discernible odor. That told them it was creature-free, and as a result, hassle-free. The cave was only sixty meters deep, and the only exit was the one they had used to enter.\n\nStrangely, however, Han Sen did find something there. Despite there being no telltale signs of a nearby creature, or one that had paid a recent visit, there was a bird’s nest that had been crudely built from wood. The egg inside looked rather like a goose’s egg.\n\nThe nest looked old, though, and the egg was caked in a layer of dust that obscured its true color.\n\n“Bao’er, we’re in luck!” Han Sen grabbed the egg and examined it.\n\nHolding it in his hands, he thought it must have weighed around a kilogram.\n\nHan Sen gave it a scan, but he could not sense the presence of a lifeforce within. Han Sen wondered to himself, “Is this a rotten egg?”\n\nAfter wiping the dust away, he noticed the egg was red. What’s more, it was decorated with a number of symbols.\n\nThe symbols were similar to waves, and not unlike a representation of the Blood River.\n\n“Meh, I’ll cook it first, anyway.” Han Sen brought his cooking tools and utensils out of the Cruel Bottle. He decided to boil the egg in hot water. Perhaps it was because it had no lifeforce, but Bao’er showed no interest in the egg. Instead, she just grabbed her jerky and snacks to munch on.\n\nHan Sen grabbed his flagon and started to drink near Bao’er.\n\nSince they were in a remote location, and Han Sen had hidden their presence there, he didn’t think anyone would come poking about.\n\nThe best thing about the Cruel Bottle, he had recently discovered, was not the fact you could hide creatures and spirits within. No, it was the fact he could store tools and utensils. It sure helped lessen his load.\n\n“Cheers, Dad!” Bao’er used her milk to raise a toast.\n\n“Cheers!” Just as Han Sen was about to drink from his flagon, its bottom collapsed. The drink that was within all fell out and soaked his clothing.\n\nHan Sen was shocked, and his first reaction was to look around for a potential troublemaker. But he could not detect anyone or anything nearby.\n\nHan Sen saw a gaping hole in the bottom of his flagon, and its bottom looked as if it had been cut out perfectly.\n\nTang Zhenliu gave him this flagon, and he told Han Sen it had been crafted by a master craftsman. It was the work of a legend, and it had been forged from z-steel. It was supposedly one seamless item.\n\n“He must have gotten tricked! This thing isn’t seamless, and now his foolishness has had me waste all my drink. My wife gave me this!” Han Sen’s mind was in a bit of a state.\n\nHan Sen was willing to lick the drink from the floor, but he held off from doing that for now. The thought of an enemy nearby hadn’t completely escaped him, so he had to stay on his toes and remain wary.\n\nHan Sen put the flagon back and pulled out the whole bottle. Fortunately, the drink was not strong, and it could help keep one’s eyes open.\n\nPang!\n\nBefore the bottle reached his mouth, the bottom of the bottle also broke.\n\nBut he wasn’t going to waste the drink this time, so he quickly pulled the bottle up and positioned his mouth below, so it’d all spray into his mouth.\n\nHan Sen quickly looked around, to try to confirm if there was trouble afoot.\n\nIt couldn’t be a coincidence that this had occurred twice in a row, so Han Sen decided to check out the surrounding vicinity again.\n\nThe water was boiling by this point, and the egg was still intact amidst the bubbling water. It still looked as dead as ever, too.\n\n“Was that just a coincidence? If so, that’s a bad sign.” Han Sen was not superstitious, but this sure made him think twice.\n\nHe returned to the fireside and brought out another drink. As he held it in his hands, he stared at the egg. The egg looked fine, but Han Sen knew nothing was ever so straightforward. He had to be sure.\n\nAs Han Sen continued to stare at the egg, he brought the drink to his mouth."
}