{
    "chapter": 2710,
    "title": "Honest Cow-Headed Monster",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2710",
    "text": "“You see, we are not your sacrifice, and yet you are asking us to give you something valuable. That is simply not appropriate.” Han Sen could see that the bull monster’s intelligence wasn’t very high, and he could tell that the creature was afraid of the Shield of the Medusa’s Gaze. So, he stopped playing nice.\n\nWhen it heard what Han Sen said, the bull monster started to get angry. Before it could react, though, Han Sen continued. “How about this: we’ll make a wager. If you win, I will give you the shield as a sacrifice.”\n\n“What do you want to wager?” the bull monster asked.\n\nHan Sen was pleasantly surprised that the creature was considering his proposal. He hadn’t actually expected the bull monster to agree to his suggestion. He only wanted to stall for more time and extract some extra information from the bull monster. But it seemed as if the bull monster was genuinely interested.\n\n“This deified creature is easier to talk to than I thought.” Han Sen didn’t dare to let his guard down. He thought about it and then asked the bull monster, “So, what should I call you?”\n\n“Whatever you like,” the bull monster said impassively.\n\n“I will call you Brother Bull. Have you ever played coin toss, Brother Bull?” Han Sen asked him.\n\n“What is a coin toss?” the bull monster asked with curiosity.\n\nOpportunities just kept presenting themselves. So, Han Sen quickly brought out a coin and explained, “This coin has two sides. One side features a number, and the other side contains the image of a person’s head. I will shake the coin in my hands, and you have to guess which will be shown when I reveal the coin—the number or the head. If you guess it correctly, I will give you the shield as a sacrifice. How does that sound?”\n\n“Sure. Let’s start then,” the bull monster said. Its voice had grown much quieter than it had been at the beginning.\n\nHan Sen laughed and said, “Brother Bull, if this is a bet, we both need to put something on the table for the wager. I am offering up this shield, but if you lose, what are you going to give me?”\n\nHan Sen was testing how far he could push this bull monster. There was nothing he really wanted from the creature, and if it grew angry, Han Sen would ask for nothing more.\n\nSurprisingly, the bull monster really did bring out something.\n\nPang!\n\nThe bull monster dropped the item right in front of Han Sen. It fell, creating a deep hole when it hit the ground. Han Sen craned his neck to get a look at it. It was a gemstone with thunder trapped inside it. It was only the size of an egg, but the lightning inside it was shining with power. It looked as if it might randomly explode at any given moment. There was a frightening amount of energy inside the small item.\n\n“Let’s use this lightning geno core to sweeten the pot,” boomed the bull monster’s voice.\n\n“Is this a deified geno core?” Han Sen was shocked. He hadn’t expected the bull monster to offer up something so expensive.\n\nA deified geno core was a treasure only deified xenogeneics could create. They were called treasures, but they were different from the ones that were artificially constructed. Deified geno cores could melt into a person’s body and give the geno core power directly to their recipient.\n\nOrdinary synthetic treasures required the user’s power to activate. Once a deified geno core was absorbed into a person’s body, however, they could use it with the same ease as one of their own geno arts.\n\nDeified geno cores were also known as skill geno cores. They were very useful, but only deified xenogeneics could create them. Even for deified xenogeneics, producing one was no mean feat. A single deified geno core was considered quite precious.\n\nEven if people killed a deified xenogeneic, ordinary deified xenogeneics would destroy their geno cores before death. They would never allow one to fall into enemy hands.\n\n“Brother Bull is truly generous,” Han Sen thought as tears leaked down his face. Now that the bull monster had wagered something so valuable, Han Sen had to gather his wits before he could respond.\n\nDeified geno cores were divided into ranks, and the bull monster was definitely above primitive class. If he was able to get the creature’s deified geno core and absorb it, Han Sen would receive a power that was equivalent to the bull monster’s. And since it was a geno art, that was a very good thing.\n\n“What? Is that not enough for the wager?” The bull monster saw Han Sen staring at the deified geno core in profound silence. He thought Han Sen wanted something more.\n\nAlthough the bull monster wasn’t particularly intelligent, it was smarter than a lot of other xenogeneics. But compared to intelligent creatures like humans or Very High, the bull only had the mind of a seven or eight year old.\n\nHe recognized that the Shield of the Medusa’s Gaze was a powerful item, and he knew his geno core was nowhere near as valuable as the shield. That was why he had asked if he needed to wager something else as well.\n\n“It is a little bit unfair if you ask me. But because it is you, Brother Bull, I will accept it,” Han Sen conceded, looking a little embarrassed.\n\nHe hadn’t anticipated that the scary bull monster would be so easy to fool. It made him wonder if he was dreaming. He had never known that the world had a xenogeneic that was this easy to talk to.\n\n“Then let us begin!” the bull monster said as he stared eagerly at the coin Han Sen was holding.\n\nThe bull monster had once seemed scary and almighty, but by this point, that image had been completely scrubbed out of Han Sen’s mind. Han Sen lifted the coin and smiled at the bull monster. He said, “Brother Bull, look closely. This side is the number, and this side has the image.”\n\nAfter that, Han Sen clasped his hands together and began shaking them back and forth. And while Han Sen was shaking his hands, he used his Dongxuan Area power to keep the bull monster from stealing any information about the coin.\n\nThe Dongxuan Area wasn’t as powerful as the bull monster, but it would allow Han Sen to see all the cogwheels spinning nearby. Han Sen might not be able to stop the universal cogwheels if they act strangely, but he would definitely notice.\n\nHan Sen had underestimated the bull monster’s honesty, though. The beast really wasn’t trying to steal a look at the coin. Eventually, Han Sen stopped shaking his hands and held them up before the bull monster. The creature looked at Han Sen’s hands and hesitated to make a decision. He was guessing which would end up on top; the image or the number.\n\n“Did this bull monster grow up with a family? Why is he so honest?” Han Sen would never have guessed that a xenogeneic like this existed.\n\n“Number,” the bull monster said eventually, after a long time of hesitation.\n\n“Brother Bull, are you sure that the coin is showing a number? Once you confirm your bet, you cannot change your mind again,” Han Sen said, smiling at the bull monster.\n\n“I will choose the image, then,” the bull monster said. It actually changed its mind.\n\n“Are you sure it’s the image? Are you certain of your answer now?” Han Sen smiled again.\n\n“Yes. It is the image. I’m not changing,” the bull monster said, gritting its teeth.\n\nHan Sen opened his hands to reveal that it was the number that was facing up. Han Sen looked at the bull monster and said, “Brother Bull, what a shame. You should have stood by your gut instinct earlier.”\n\nAlthough Han Sen appeared calm, his body was tense and ready to attack. If the bull monster was going to lash out after losing, Han Sen would have to react instantly. He was afraid the bull monster would disregard the results of their wager.\n\nBut the bull monster simply stared at the coin for a while.\n\n“Do it again,” he said after a while.\n\nIf the bull monster hadn’t had such a scary presence, Han Sen would never have believed that it was a high-level deified xenogeneic."
}