{
    "chapter": 1008,
    "title": "Wolfpack",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1008",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nLin Weiwei and her people looked through the darkness in confusion, and Han Sen did not say anything more.\n\nIt didn’t take long for her face to change and exclaim, “Han Sen is right! Many creatures are fast approaching.”\n\nLin He heard the patter of paws on the forest floor, growing louder as the creatures moved towards them. He was surprised to learn that Han Sen had noticed them a whole ten seconds before he did. Lin He had already opened seven gene locks, and for Han Sen to have better awareness, he must have had a higher number unlocked. How such a thing was possible, he could not guess.\n\nLin Weiwei looked at Han Sen with shock now, too. She was just as surprised as Lin He was, to learn Han Sen was quicker to notice the incoming threat.\n\nThe phantom prowlers were drawing nearer, and the sound of footsteps could now be heard by all of them. Stricken with nervousness, the fighters summoned their beast souls and began to sweat.\n\nThey did not know what was coming their way, and they did not know how they’d fare when the battle commenced.\n\nSoon, a green shadow flickered through the nearby underbrush. A pair of emerald eyes gazed at them from out of the black.\n\nMore flickering shadows appeared, and their silhouettes outlined by the green cracks and snaps of electricity.\n\n“Daddy, I want to play with the cats,” Bao’er professed, clapping her hands with sudden exuberance.\n\n“They aren’t cats, Bao’er. They’re wolves.” Han Sen had a wry smile, as he determined the shapes to be that of wolves on the prowl. Han Sen attributed Bao’er’s interest in the animal figures to her fondness for bright lights.\n\nThe others were not half as relaxed as Han Sen and Bao’er were, though. There were at least three hundred of those green wolves, but fortunately, they did not look too strong.\n\nStill, the environment did not do the humans any favors. In this dangerous forest, the trees themselves could be considered enemies. Once the wolves attacked, they’d have to watch their step, and it’d be too dangerous to take off running. If they ran smack into a tree, they’d be incinerated and killed in a frighteningly painful manner.\n\nRoar!\n\nA lightning wolf cast a bolt of electricity at a person on the team, which was quickly repelled with a fist ablaze with fire.\n\nPang!\n\nFire and electricity collided in the air. The block was successful, but the man had to take several steps back to maintain his guard.\n\nEverybody was now very alarmed at the sudden violence.\n\nThe man that deflected the lightning bolt was called Chen Hu. He was not the strongest in the party, but he had unlocked five gene locks and his fitness was just over fifteen hundred. Although he managed to repel the attack, it was not a flawless deflection. The wolves were strong, it seemed, and Han Sen wagered they were mutant class creatures.\n\nThe wolf that attacked looked identical to the others in its pack, and this told Han Sen one thing; they were all the same strength. They were all mutant class.\n\nThe party of humans was a strong collective, but they could hardly face down the three hundred wolves that had shown up to chew them all to pieces.\n\nThe wolf in the front howled, and they jumped towards Han Sen.\n\nHan Sen was happy this was going to happen, though, and he thought to himself, “Finally, it’s my time to shine. I’m getting tired of Weiwei making me look like a noob. How can she have the audacity to make me look like a noob?”\n\nHan Sen rolled up his sleeves, ready to fight. But before he could make a move, Lin He brought out a longsword and screamed to the high heavens. One moment later, two of the wolves were dead, and a few were injured.\n\nThe swing of that longsword was fast and cruel.\n\nWhimper! Whimper!\n\nThe wolves fell back, the injured ones limping away while whimpering.\n\nLin He was delighted, learning he was powerful enough to kill them. As good as this was for him, he feared his team wouldn’t be up to the task and would fail to repel the invaders.\n\nSo he decided to step forward and attack before the wolves could retaliate. He wanted to let the wolves know their passage shouldn’t have been disturbed, and they were not a company of travelers to mess with.\n\nThe wolves had most certainly been spooked. Despite their visible fear and trepidation, however, they seemed determined not to leave.\n\nLin He thought about trying to flee with his people, but all of a sudden, a louder howl sounded. The trees around them shivered with lightning that lit up the sky in response to that announcement.\n\nEveryone looked in the direction the howl came from, and they saw a giant blue wolf perched on a rock. Blue lightning flashed around it as its howl ended.\n\nEveryone’s face dropped in misery.\n\nThey might have been able to kill the three hundred mutant creatures, and they were confident enough to try. But when the alpha wolf showed up, that confidence evaporated, leaving them to tremble in fear.\n\n“It’s a sacred-blood creature!” Han Sen frowned. He was not afraid of doing battle with a sacred-blood creature, but he was unsure what it would be like to deal with an alpha wolf that was sacred-blood.\n\nMany alpha wolves were smart, and if the humans couldn’t kill it quickly, they’d have a lot of trouble going forward.\n\nHan Sen had once encountered a sacred-blood fox king in the First God’s Sanctuary. It was able to control its entire tribe of foxes, and dealing with it was a monumental task for Han Sen.\n\nWhen the subordinate wolves heard they were being backed up by their alpha, their fear vanished. With hearts renewed with courage, they leapt forward.\n\n“Fly, you fools! I will draw their attention,” Lin He commanded, as he ran towards the wolves with his sword in hand. He was determined to take down that alpha."
}