{
    "chapter": 2356,
    "title": "Back to the Extreme King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2356",
    "text": "Han Sen had obviously planned this.\n\nBecause Han Sen let Nine-Headed Bird strike first, Nine-Headed Bird had a chance of winning. That was why Nine-Headed Bird agreed to the bet. But Han Sen’s dragon area defeated Nine-Headed Bird’s first attack, and the moment he stopped attacking was the moment he sealed his loss.\n\n“Can I go now?” Han Sen smiled at Nine-Headed Bird.\n\n“Get lost! Do not let me see you ever again.” Nine-Headed Bird’s face was contorted with anger. Without waiting for Han Sen to respond, he turned and flew away.\n\nHan Sen was surprised. He hadn’t expected Nine-Headed Bird to keep his promise, but it was a good thing he had.\n\nThe dragon area’s power came from its connection to water; if Han Sen was sealed inside the Suppress Demon Coffin, he would lose his connection with the sea and get pulled into the demonic abyss.\n\nUnless Han Sen used his super god spirit body, he wouldn’t have been able to defeat Nine-Headed Bird.\n\nWithout any hesitation, Han Sen flew up into the air and headed back to Half-Star Bay. He didn’t say another word to Xius.\n\nIf Miss Mirror hadn’t left yet, that was where she would be. Too many elites wanted to get their hands on the Ancient God Origin. Staying next to Miss Mirror would be the safest thing for Han Sen, as it would prevent others from trying to take the item away from him.\n\nAlthough Han Sen could probably escape, Bao’er was still with the Extreme King. So, Han Sen felt obliged to remain.\n\nHe flew for a few hundred meters, but suddenly, he felt the crackle of lightning all around him. A giant that looked like either a demon or a god hung there in the clouds. A hand came slapping down towards Han Sen.\n\nThe hand slowed down, and the air around Han Sen concentrated until it was as dense as a steel board. Han Sen couldn’t tear through the air. He couldn’t move his body.\n\n“A deified elite!” Han Sen felt a chill, and he prepared to fight back. Just as he was about to lash out, a sword-light appeared and slashed across the big hand.\n\n“Argh!” The giant in the clouds screamed and pulled his hand back. The god-like eyes looked down to where he had been struck. A beautiful woman holding a copper sword in her hands had emerged.\n\n“Miss Mirror!” Han Sen was so happy.\n\nThat giant stared at Miss Mirror, then disappeared. He seemed to be afraid of Miss Mirror, and he obviously didn’t want to make an enemy out of her.\n\n“I cannot believe Ancient Water God selected you.” Miss Mirror came before Han Sen and looked at the Ancient God Origin he was holding.\n\n“Isn’t that why you brought me here?” Han Sen said.\n\n“I was just here to try my luck. I didn’t place any hope in you, so I didn’t expect you would succeed,” Miss Mirror said simply.\n\nHan Sen touched his nose and looked at the blood-red sea.\n\nMiss Mirror seemed to know what Han Sen was thinking. In a neutral tone of voice, she said, “Extreme King ships are here. They will take over the planets that were touched by Ancient Water God’s blood.”\n\nMiss Mirror hadn’t come for the Ancient God Origin at all; she just wanted to claim the system that had been flooded with Ancient Water God’s blood.\n\nAfter Ancient Water God’s failure and the subsequent dispersal of his blood, the primitive creatures of these planets would now grow strong. Even barren planets would now flourish because of Ancient Water God’s lifeblood.\n\nThe watery area that came from Ancient Water God’s blood had an incredible lifeforce. It could grow many scary xenogeneics. This was exactly what the Extreme King needed.\n\nOn the flipside, the Ancient God Origin wasn’t as important. It could only be used to grow one strong water element elite. It was nothing compared to the value of an entire system.\n\nHan Sen followed Miss Mirror back to the ship, and he saw that the Extreme King’s ships were splitting up to guard the individual planets of the system.\n\nHan Sen found the blood kirin was on their ship, and he was surprised that it had sat and waited for him the entire time. It obviously wasn’t the mindless beast Han Sen had believed it to be.\n\nWhen the blood kirin saw Miss Mirror, it looked hostile and scared.\n\nHan Sen could guess why. Ancient Water God had moved Han Sen far away, and the blood kirin wouldn’t listen to Miss Mirror’s commands. She must have used some sort of trick to get the creature onboard a ship.\n\n“This woman is too tricky. I don’t know what she wants. Why didn’t she tell anyone else that I’m not actually Bai Yi?” Han Sen stroked the ring on his finger and thought to himself, “It most likely has something to do with this ring. But she didn’t force me to take the ring off. Why?”\n\nHan Sen didn’t understand. He knew he would have to stop thinking about it. He brought out the xenogeneic gene of the Silver-Winged Dragon and swallowed it to refine it.\n\nDuke Gene +1… Duke Gene +1…\n\nThe Duke gene announcements kept sounding-off in Han Sen’s head. He received ten Duke genes in total.\n\n“If I can get a few more King class xenogeneic genes, then I won’t have to worry about The Story of Genes.” Han Sen was both happy and worried.\n\nMiss Mirror didn’t remain on the planet for long. She had been needed during the takeover, but she wasn’t in charge of building up the planet. Her task was finished before most of the Extreme King’s ships even arrived.\n\nHan Sen knew Miss Mirror had many elites around her, but they didn’t appear in her proximity.\n\nTaking such an important system would be a bloody affair.\n\nThe Ancient God wouldn’t give up the place easily, so both sides would make sacrifices in the attempt to claim the system. The price would be high whether they succeeded or failed.\n\nAfter going back to King’s Kingdom, Han Sen took the blood kirin with him back to Planet Water Zone. Miss Mirror didn’t detain him, and she said nothing more to him. No one else sought to trouble him, either.\n\nThat made Han Sen even more worried, though. He didn’t know what was going through Miss Mirror’s head, and he had no idea what her ultimate goal was.\n\n“I can just put Bao’er back in the sanctuaries. That will be safer for both of us,” Han Sen thought in irritation. He would need to take Bao’er back from Lan Haixin.\n\nBefore Han Sen could find Lan Haixin, though, she came looking for him. She looked fairly moody, too.\n\n“Bai Yi, did you forget something?” Lan Haixin found Han Sen in the garden and looked at him with a raised eyebrow. She didn’t say what she wanted explicitly because she was still suspicious about Han Sen’s identity.\n\n“Last month, on the ninth. I remember. But Miss Mirror took me somewhere to do something. I had no choice,” Han Sen said with a shrug. He then thought to himself, “It is fortunate I have Bao’er as a spy.”\n\n“It is good that you remember. But since we missed it, we must now wait another two months. You better behave over the course of the next two months and stop giving me trouble.” After Lan Haixin spoke, she left. She didn’t even spare him a second glance."
}