{
    "chapter": 115,
    "title": "Cheating Device",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_115",
    "text": "\"Should be similar.\" Han Sen began to play in training mode, which could not be skipped and was meant to show new players how to use the versus version.\n\nHan Sen used to play the single-player version and had no opponent. In training mode, there was a hand trying to beat him to the spots, which took some effort for him to get used to, so he looked a bit clumsy.\n\nSometimes, Han Sen only found a spot gone when his finger moved over, which was quite different from when he was playing alone.\n\nIn addition to paying attention to the spots, he also had to pay attention to the action and intention of the other hand.\n\nJi Yanran saw him playing in the training mode and was rendered speechless. He was such a rookie that she had no idea where he gained the nerve to challenge her, president of the Hand of God Society.\n\n\"It looks a bit challenging indeed. Can I practice a bit before playing against you?\" Han Sen asked.\n\n\"Sure, anytime.\" Ji Yanran believed a rookie like him would not be her match even after practicing for a semester.\n\nShe wanted to show him some grace, so that when he lost, he would have no excuse to bother her again.\n\nHan Sen got Ji Yanran’s permission and returned to his seat to play online. He soon discovered that versus version was much more interesting than the single-player version.\n\nPlaying alone simply required him to be fast, while more factors were added to the versus version, including what and when the opponent would move, which made the game more fun.\n\nHan Sen played a few rounds and gradually mastered the versus version. In fact, as long as one had the skills and ability to judge correctly, the versus version was actually easier.\n\nAfter all, the single-player version was all about speed and in the versus version, all you had to be was faster than your opponent. If your opponent was weak, it would be really easy to win.\n\nHan Sen was only trying to study the game itself and did not care about the result, so he lost five games in a row.\n\nHan Sen played a final round when he had fully grasped the tricks. His opponent was not even able to hit a single spot and he had a complete victory.\n\nFeeling that he was ready, Han Sen went to Ji Yanran and said, \"Sister, I am ready. Would you add me?\"\n\n\"What is your ID?\" Ji Yanran was not about to make any comment. She would win anyway, and all that was left to do was to drive this annoying fly away.\n\n\"Win-a-girlfriend,\" Han Sen told her his ID.\n\nJi Yanran stared sharply at Han Sen, but did not say anything. It did not matter. He could not beat her no matter what ID name he used.\n\nHan Sen saw a friend request and the ID name was Souvenir.\n\nJi Yanran looked at Han Sen's record and saw he had lost five out of six rounds.\n\nShe did not even know where to begin so she said nothing. Setting up an online game room and password, she invited Han Sen to enter.\n\nThe moment Han Sen entered the room, Ji Yanran picked a level and started the match.\n\nAt the end of the countdown, a holographic image was projected from his comlink. in addition to the image like a crystal ball, there was also the image of Ji Yanran’s pretty hand.\n\nJi Yanran saw a spot flashing and immediately moved a finger over to touch it, but before she could do that, she saw a finger of her opponent on it and the spot disappeared.\n\nJi Yanran did not mind it and thought Han Sen got lucky. That spot was closer to his palm anyway.\n\nWhen the second spot appeared, she pointed to it at full speed, but when her little finger was about to touch it, a finger from the holographic image once again beat her to it.\n\nDing!\n\nThe spot disappeared and Han Sen gained another point, and Ji Yanran's score remained zero.\n\nJi Yanran paused but still believed that it was pure luck. A rookie like him could never be better than she.\n\nBut when the third spot appeared, Ji Yanran once again lost the spot she wanted to press.\n\nJi Yanran raged, as this time she saw clearly that Han Sen was targeting her, only aiming at the one spot she wanted to press.\n\n\"Brat, I will let you know you should never mess with a Blackhawk girl.\" Ji Yanran was fully focused this time and was prepared to teach Han Sen a lesson.\n\nShe still thought she had just lost a few points because of her carelessness.\n\nHowever, the same thing happened to the fourth spot and she still did not get a single point.\n\nJi Yanran was getting more and more angry. Her slender fingers danced away, but regardless of which spot she went for, her opponent could always hit it first.\n\nDing ding ding!\n\nThe sound of spot getting hit continued to ring. Ji Yanran was dumbfounded as she was not even able to get a single spot. Han Sen had got them all.\n\n\"Impossible... this is not possible...\" At the end of the game, Ji Yanran was stunned by the score, 0:59.\n\nShe had tried 59 times and was blocked 59 times. Han Sen did not hit any other spot than the ones she was going for. He was just targeting her.\n\nBut Ji Yanran could not believe that as the president of Hand of God Society, she would get no points at all, which seemed absurd.\n\n\"How is anyone able to do this? Even Jing, who is the best player in Blackhawk, could not have done this, not to mention the kid has not even been admitted to Blackhawk.\" Thinking of this, Ji Yanran bristled.\n\nBecause she thought of another possibility. Legend has it that a hacker had designed a cheating device of Hand of God, which could 100% prevent the opponent from getting any points—exactly what had happened. Han Sen must have used this cheating device in their game.\n\nJi Yanran was more convinced when she thought about it. Nothing could explain how he could have blocked all her points. Human simply could not be so accurate.\n\nEven some could achieve this, a kid who had not even been to military school would not be one of them."
}