{
    "chapter": 59,
    "title": "Lucky Dude",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_59",
    "text": "\"Your aunt is outrageous,\" Zhang Danfeng was upset.\n\n\"It does not matter. They are strangers to me,\" said Han Sen casually. He then asked curiously, \"Who is this Lin Beifeng she was talking about?\"\n\nHan Sen also knew a guy named Lin Beifeng who had traveled through the mountains and ended up in Steel Armor Shelter. Han Sen had even saved his life.\n\n\"Just one lucky dude.\"\n\nZhang Danfeng started to tell Han Sen about Sunwood Mining. Sunwood Mining used to be a small company with several mines, and later they bought a garbage planet to deposit their waste, where they ended up finding a lot of precious minerals.\n\nWithin 20 years, by selling the rare minerals they discovered on that planet, Sunwood Mining had become a prominent interplanetary mining group, the boss of which was Lin Beifeng’s father.\n\nLin Beifeng had just entered God’s Sanctuary and was already known for his generosity. Many were trying to make friends with him for that.\n\n\"Such good luck,\" Han Sen sighed.\n\n\"Such is life. He must have outperformed billions of other sperms to be who he is,\" Zhang Danfeng smiled and said. \"But Sunwood Mining has no facility here on Planet Roca. What is he doing here?\"\n\nIn the banquet hall of the same building, the social elite were chatting and drinking, many of whom had already entered Second God’s Sanctuary in their 30s. However, the focus of the banquet was a sixteen-year-old teenager.\n\nIf Han Sen were here, he would recognize the teenager was Lin Beifeng who he had saved.\n\nLin Beifeng was entertaining all guests gracefully. From his good manners, no one would think he was nouveau riche and several socialites were attracted by him.\n\nHan Yumei and Han Hao had wanted to speak with Lin Beifeng, but they found no chance as there were too many people who were more powerful than them at the banquet and everyone wanted to talk to Lin Beifeng. Naturally they didn’t dare to offend these people by cutting in.\n\nThe banquet was over, when Lin Beifeng was stepping outside the building, they finally found an opportunity and wanted to approach him.\n\nAt the time, Han Sen and Zhang Danfeng also happened to come over. When they saw Han Hao, Zhang Danfeng wanted to greet him so Han Sen had to follow.\n\nBefore Zhang Danfeng could finish his sentence, Han Yumei pushed him and Han Sen aside and said harshly, \"You two stay away from my son. Especially you, Han Sen, you are already notorious in Steel Armor Shelter, so do not implicate your cousin. Don’t even say you know him. Or I will come after your family.\"\n\nHan Yumei then walked toward Lin Beifeng with Han Hao.\n\nZhang Danfeng was stunned and asked Han Sen, \"What? You and Han Hao are in the same shelter?\"\n\nHansen nodded, \"Let’s go to a quiet place and I’ll explain to you.\"\n\nHaving heard Han Yumei’s words, Han Sen knew that Han Hao had told her about what had happened in Steel Armor Shelter.\n\nHan Yumei and Han Hao finally managed to approach Lin Beifeng. As Lin Beifeng happened to be looking in their direction, Han Yumei said hurriedly, \"Mr. Lin, this is my son Han Hao. He’s in the same shelter as you...\"\n\nLin Beifeng acted as if he hadn’t heard her and directly went past her and her son. Han Yumei was dumbfounded and watched Lin Beifeng leaving.\n\nLin Beifeng walked faster and faster toward Han Sen and Zhang Danfeng who were just leaving. He grabbed Han Sen’s arm and cried, \"Sen, I have finally found you. Brother, I’ve missed you.\"\n\nLin Beifeng then gave Han Sen a big hug.\n\nBoth Han Yumei and Han Hao were shocked. They had no idea how Lin Beifeng would know Han Sen and call him brother.\n\nHan Sen pushed Lin Beifeng away and frowned, \"Why are you here?\"\n\nLin Beifeng wasn’t offended at all and quickly offered cigarettes to Han Sen and Zhang Danfeng. He said excitedly, \"I came to look for you. I heard you live on Planet Roca so I came here. But I don’t have your address and it took me days to ask about it. Now I’ve met you, you must look out for me in the future. \"\n\nHan Sen saw everyone was looking this way and said to Lin Beifeng, \"Let’s not talk here. We can catch up later.\"\n\nHan Sen and Zhang Danfeng went out, and Lin Beifeng quickly followed them. \"Sen, my aircraft was parked outside. Let me give you a ride.\"\n\nHan Yumei and Han Hao watched Lin Beifeng cheerfully following Han Sen around and couldn’t believe him to be the elegant young master they saw at the banquet.\n\n\"Han Hao, it was indeed Han Sen who was talking to Mr. Lin?\" Han Yumei still couldn’t believe her eyes and asked Han Hao after they were out of the building.\n\nHan Hao clenched his teeth and said, \"Yes, it’s him.\"\n\n\"Why on earth did Mr. Lin know him and respect him like that?\" asked Han Yumei.\n\n\"Well, there is nothing remarkable about him. He’s just a gigolo, using a woman’s connections,\" Putting his cousin down, Han Hao was green with envy.\n\n\"What? Didn’t you say that he offended a powerful lady in Steel Armor Shelter and was having a hard time?\" asked Han Yumei.\n\n\"If he weren’t Qin Xuan’s boy toy, how would Mr. Lin know someone like him?\" Han Hao then bitterly recounted Han Sen’s experience, adding his imagination here and there.\n\n\"No wonder he could come up with two million dollars. A gigolo! I’ve always known he was a scourge, a disgrace to our name. Our ancestors would be so mad had they known...\" said Han Yumei viciously.\n\nFilled with jealousy and hatred, the mother and son left the building. Seeing Lin Beifeng opening the door of the aircraft for Han Sen and Zhang Danfeng, their faces darkened further."
}