{
    "chapter": 190,
    "title": "An Invite From Martial Arts Society",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_190",
    "text": "\"Do not cry. I am fine. I hunted some other creatures on the way and it took some time. Sorry to make you worry.\" Han Sen patted Wang Mengmeng who were in tears his arms.\n\n\"Brother Han, you scared me,\" said Wang Mengmeng choking, her eyes watery.\n\n\"Little fool, you should have more confidence in your brother.\" Han Sen patted her little head.\n\n\"I have confidence, but you were gone for so long, so I am a little worried,\" Wang Mengmeng said and gave the sacred-blood phantom ant armor back to Han Sen.\n\n\"Well, we will talk about it when we get back. I am so tired now and want nothing but a good sleep,\" Han Sen said with a smile.\n\nPeople turned back, while Huangfu Pingqing cast a complex look at and Han Sen who was chatting with Wang Mengmeng.\n\n\"I can’t see through him,\" Huangfu whispered to herself, looking at Han Sen with an intriguing smile, as if she had seen an interesting toy.\n\nHuangfu believed she was among the top in First God’s Sanctuary and would become the Chosen in next year’s contest.\n\nBut even she had no confidence in surviving the attack of all those black-feathered beasts alone, which Han Sen had accomplished. It was no coincidence.\n\nHuangfu still remembered Han Sen’s performance in the air, carried by an arrow vividly as if it had just happened.\n\n\"Mr. Han Shao, I’ve come to Steel Armor Shelter with some beat souls to sell, including two sacred-blood ones. If you are interested, you can have a look,\" Huangfu said.\n\n\"Sacred-blood beast souls? Which type?\" Han Sen asked.\n\n\"Generally speaking, I could not reveal that before the auction. But since you have asked, I can tell you one is a flying beast soul and the other is a weapon,\" Huangfu smiled and replied.\n\n\"I will be there.\" Han Sen had always wanted a sacred-blood weapon, and was thus very interested. With a sacred-blood weapon, he could kill a lot more sacred-blood creatures and speed up his evolving process.\n\nFor instance, if he had a sacred-blood weapon, that sacred-blood beast king would have been killed.\n\nBack to school, Han Sen needed rest for his burns to heal, which gave him time to go to lectures.\n\nThis day, Han Sen was in a lecture of Theories of Hyper Geno Arts. While listening, Han Sen was playing with a palm-sized butterfly boomerang in his hand.\n\nThe blacksmith who had sold Han Sen Z-steel weapons had custom made it for him according to the size and weight of the beast soul butterfly boomerangs. The blacksmith’s craftsmanship was impressive, and this almost looked the same as the beast souls.\n\nHan Sen had ordered a total of ten butterfly boomerangs. He was only using these to practice, since he would have used his beast soul ones up before he could practice properly.\n\nHan Sen had the foundation of Sleeveblade and had looked up many atrial arts of hidden weapons, so he was able to learn how to use the boomerang on his own.\n\nListening to the professor, Han Sen let the butterfly boomerang dance in his hand as if it was alive. Han Sen carried it everywhere to get the hang of it.\n\n\"Genius, can I ask you something?\" After class, several students went to Han Sen, and one of theM said to Han Sen.\n\n\"What?\" Han Sen was slightly surprised, as he did not know this person.\n\n\"Genius, so we are from Martial Arts Society and my name is Xu Qian. We have registered for a black and white boxing competition on the Skynet, and it is a team challenge. We have four now and need one more player. Can you join us?\" After the student finished, all four of them looked at Han Sen full of hope.\n\n\"There are many who are good at black and white boxing. Why have you come to me?\" Han Sen asked, puzzled.\n\n\"So if it is any other game, we could afford to lose, but this one is different. We are against St. Germain and we cannot lose. That’s why we’ve asked you to help,\" said the student excitedly.\n\nSeeing Han Sen was at loss, the students knew that Han Sen was unaware of the conflicts between Blackhawk and St. Germain and started to explain. Soon Han Sen learned that in terms of martial arts, the two academies were bitter rivals.\n\nFor three consecutive years, the obstruction to Blackhawk Military Academy getting into the eight-finals of the Alliance Tournament was St. Germain.\n\nSo this time, although it was just a casual game, Martial Arts Society still did not want to lose to St. Germain.\n\nAfter Han Sen heard them out, the students looked at him nervously.\n\nAlthough they knew Han Sen was great at black and white boxing, he was not a society member and did not have the obligation to join them.\n\nHan Sen saw their look, pondered and said, \"When is the game scheduled? If there is no time conflict with my schedule, I could join you.\"\n\nThe students were ecstatic. \"It will be in the weekend. Other matches are unimportant, but the one on October 6 was against St. Germain. We really need you for this one, but we need to include your name in our registration now.\"\n\n\"No problem, I should be able to participate in that one,\" Han Sen smiled and said. \"Also, do not call me genius. It does not represent all my strengths.\"\n\n\"Okay, so we will call you Han Sen then. Here is the form, you have to fill it out before we submit.\" Xu Qian handed a form to Han Sen excitedly.\n\n\"Right, genius ... Han Sen... for the Skynet game, you need to register with an ID, so fill that in as well,\" Liu Yuhu who was one of the students reminded him.\n\n\"OK.\" Han Sen thought about it and filled the form out.\n\n\"Black Fist Emperor!\" The students saw his ID and were dazed. That was so arrogant that they did not believe Han Sen had chosen such an ID.\n\n\"It can’t be already used, can it?\" Han Sen looked at the students and asked.\n\n\"No, it can’t be. We are registering as a group, so there will be a prefix of the school name. Even if the ID is used, it will still be fine,\" Xu Qian quickly said.\n\nThe students thought to themselves, \"Even without the prefix, no one would be so daring to use such an ID.\"\n\nBut they did not say anything. If someone else had used such an ID, they might try to talk that person out of it. However, when it came to Han Sen, it seemed okay."
}