{
    "chapter": 1141,
    "title": "Lady on the Tree",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1141",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe big-eyed thief looked incredibly arrogant, but when it saw the golden bird, the fire on its body extinguished and it tried to flee.\n\nThe bird wasn’t going to let it escape, though. It flapped its wings and flew towards the big-eyed thief’s rear. A countermeasure was in place, as the big-eyed thief shone gold and released a thick haze of toxic gas.\n\nBut the golden bird shone gold, as well. Its talons cleaved through the smoke and grabbed the big-eyed thief, and then tore the fiend in two.\n\nHan Sen and Queen were frightened by the sight, but they weren’t shocked the musical note was able to fight another super creature. What did surprise them, though, was its ability to tear one in half with a single strike.\n\n“Is that lady an emperor?” Han Sen asked himself, still reeling from the shock of that grizzly sight.\n\nThe big-eyed thief’s yellow miasma still hung in the air, and it was a ghastly smell. The creatures that had been caught inside it had all been killed.\n\nThe lady made a gesture with her gentle hand and wafted it away. The pleasant fragrance of the tree came back stronger, eliminating whatever was left of the big-eyed thief’s stink.\n\nHaving seen what had just occurred to the big-eyed thief, no other creature in the vicinity dared provoke the lady now.\n\nBut none of the creatures dared leave the area, either. And they remained there, as if to guard the tree until its fruit was ready for consumption.\n\n“Grabbing this fruit may prove difficult,” Han Sen thought to himself as he rubbed his head. He was unsure whether or not he could obtain a benefit or be gifted a fruit from the pleasant-turned-cruel mistress of the tree.\n\nIf she was an emperor with ten gene locks open, Han Sen didn’t believe he’d be able to obtain anything, even with the Blue Dinosaur and Disloyal Knight by his side.\n\nThat being said, the other super creatures in the vicinity would be too proud to allow the lady to take everything for herself. If chaos was to arise, Han Sen thought he might be able to nab something for himself amidst the carnage.\n\nHan Sen decided to wait alongside the rest of the creatures, and as he did so, he occasionally chatted with Queen. The two did not speak loudly though, and whenever they talked, they made sure to do so in whispers.\n\nThe lady, in the meantime, continued to remain perched in the tree. She swung her little legs delicately as she did.\n\nThe bird had gone by this point, and the lute had been returned, too. But eventually, the lady raised her arm and pointed her finger at Han Sen. Then she signaled for him to approach.\n\nHan Sen was shocked. Regardless of race or species, the signal she had just made was a gesture for him to come closer.\n\nAt that moment, every creature in the region looked over to see who the lady was pointing at.\n\n“Me?” Han Sen looked around, acknowledging she meant him without mistake. There were no other creatures around him, after all.\n\nThe lady smiled and nodded.\n\n“Don’t go. It is too dangerous,” Queen pleaded. Although Han Sen was strong, the lady was too strange. It’d be a risk to approach, but he didn’t want to incite her ire by refusing her summons.\n\n“It’s fine. I can always turn away and leave. Besides, I’m interested in seeing what she wants.” Han Sen flew over to the tree, leaving the Blue Dinosaur behind to safeguard Queen.\n\nHan Sen was rather interested in the identity of who or what the lady actually was, but it was primarily due to the fact the fruit was on the precipice of maturing. Getting that close, in anticipation of that moment, was a good thing.\n\nNothing was better than being able to approach the tree without a fight. Although the lady was frighteningly powerful, Han Sen believed he could always escape whenever he wanted to.\n\nWithout anything barring his passage, Han Sen approached the tree with ease.\n\n“What is it?” Han Sen asked, as he hovered before her.\n\nThe lady pointed to another branch and bid that he sit with her.\n\nHan Sen did as she asked and took a seat on the branch, but he made sure to keep his distance and maintain his vigilance. He did not trust the lady, so he exercised every caution he could possibly take while spending time with her.\n\nHan Sen immediately noticed how good the lady smelled, and how her fragrance was actually different than that of the tree itself\n\nHer scent wasn’t strong or overwhelming; it was light and refreshing.\n\n“Pretty Lady, do you need something from me?” Han Sen asked with a smile.\n\nThe lady smiled in return, her face curious.\n\n“Has a spirit never laid eyes on such a handsome face before? Did you need to take a closer look? You should take a picture,” Han Sen jested, due to her awkward and intimidating silence.\n\n“Um, pretty woman? Do you mind saying something?” Han Sen said.\n\nThe lady maintained her stare in silence.\n\n“Um, that’s okay. We don’t need to speak. And I know I’m handsome, so feel free to admire me all you like.” Han Sen started to look at the jellyfish fruit that were tantalizingly near.\n\nThe fruit all looked alive, and they definitely seemed to be king-class geno fruit.\n\n“There must be more than ten thousand of these things. If they can all increase a person’s super geno points, this sanctuary could see the rise of countless more elites,” Han Sen believed.\n\nHan Sen had no idea what the fruit did, though. Moment Queen was probably hiding most of the story from him.\n\n“What is your name?” the lady finally asked."
}