{
    "chapter": 2914,
    "title": "God Punishment Sword",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2914",
    "text": "The ability to come to the big barren systems, kill xenogeneics, and do the cleanup was not something an average deified could do.\n\n“One of the cleaners must have been a true god elite and a strong one at that.” Han Sen kept looking around as he flew forward.\n\nIf other people had been there, it meant Han Sen was on the right path. Although he did not know if he could find Littleflower, he knew he was sure to find something.\n\nThe grey dust was everywhere. The whole of space looked as if it was snowing. The scene was extremely weird.\n\nAfter flying for a short while, a giant planet appeared in front of him. That planet was like three Loga planets, but that planet had a big treasure sword going through it. The treasure sword was so big that one was unable to imagine it. It was like a fruit knife cutting through an apple. It cut through the whole planet.\n\n“That is a big sword. What kind of creature can wield it? Why is the sword cutting through the planet? Why did the planet not explode?” Han Sen was looking at the planet and big treasure sword.\n\nBecause the area was covered in thick, white dust, the real appearance of the planet and big treasure sword were not visible. Han Sen was only able to see the shape of it. He could not make out the details.\n\nHan Sen used his Dongxuan Aura to get a look at the planet and sword. He quickly realized that it was not an ordinary planet. It was a man-made planet. The structures inside were all man-made. It was no wonder a sword went through it without the planet exploding.\n\nHan Sen walked in front of the big treasure sword and reached out his hand. The big sword was covered with white dust. The dust quickly fell, revealing the sword’s true appearance.\n\nSurprisingly, the big sword was a stone sword. It looked like granite. Han Sen reached out his hand and flicked the sword. He noted how hard its texture was. Han Sen’s finger was unable to break the stone. He left a fingermark on it. Compared to the giant treasure sword, it was tiny.\n\n“This feels like a rock for sure, but this rock is a bit too hard.” Han Sen looked at the big treasure sword with shock. He tried to pull the big treasure sword away, but it felt extremely heavy. With his current power, he was unable to break it. It was like it was frozen in the air.\n\n“It is no wonder it has been sticking in here. No one can move it.” Han Sen was looking at the big treasure sword and thought, “I suppose these things are the leftovers from the big fight that toppled Sacred. As for these things that have been left behind… Did they belong to Sacred or the enemy?”\n\nHan Sen was ready to keep on moving when he suddenly frowned. He flashed away and entered a hiding spot on the planet.\n\nNot long after, he saw some movement in space. Four or five people broke space and arrived. They quickly approached the big treasure sword.\n\nHan Sen was looking at these people. He noticed the leader of the squad was Ancient Abyss Grandmaster from the Extreme King. “Ancient Abyss Grandmaster. Why is he here?”\n\nHan Sen did not know the other people from the Extreme King. Judging from their presence, they were likely deified class. Their level was not low either.\n\n“The Extreme King really does have many elites. I have never seen these guys before, yet they are already butterfly class. Why are they following Ancient Abyss Grandmaster into the big barren systems? What are they doing? Are these the people who have been clearing out the xenogeneics here?” Han Sen was confused.\n\nThe group of people did not go for the big treasure sword. It seemed as if they were just stopping by. They were headed in the same direction as Han Sen.\n\nAn Extreme King deified elite looked at the big treasure sword and asked, “Mister Grandmaster, is this the God Punishment Sword from the legends?”\n\nAncient Abyss Grandmaster looked at the big treasure sword and said, “Yes. This is the God Punishment Sword. It is a weapon wielded by gods. It is a shame that it belongs to the gods. It is not very useful for Sacred, which was destroyed, but many gods died here. Whoever owned this God Punishment Sword was killed by a Sacred elite. Since nobody has been able to move it, the sword has stayed here for more than a million years.”\n\n“The legends say that aside from the God Spirits, no creature has been able to remove this sword,” the deified elite said. “Is that true?”\n\n“If one was able to move it, the sword would not have remained here for such a long time.” Ancient Abyss Grandmaster paused and said, “The dust was recently moved. It looks like there are some other elites ahead of us.”\n\nHan Sen thought, “He was examining the big treasure sword, but he’s not interested in it. He is looking at the track I made. It is lucky I used the Dongxuan Aura to erase all evidence of my presence. I should not leave any trace of myself here.”\n\n“Would it be Sky Palace Leader?” the deified elite suggested.\n\n“I do not think so.” Ancient Abyss Grandmaster shook his head. He looked at the big treasure sword and said, “Let’s go. We cannot get left behind.”\n\nAfter Ancient Abyss Grandmaster and the others were gone, Han Sen exited the planet.\n\n“The leader of Sky Palace? Is that the one we met in the sanctuary’s door? The Extreme King and Sky Palace’s people are here. What are they coming here for?” Han Sen was a bit curious.\n\nSuddenly, Han Sen frowned. He looked into the distance and said, “If the grandmaster is here, I do not have to hide.”\n\n“I noticed you were hiding here. I thought you would not want to meet me, so I did not want to disturb you.” In space, Ancient Abyss Grandmaster’s body slowly appeared. He was like an invisible man.\n\n“Grandmaster, you are so caring. Well, I have to go now.” Han Sen turned around and prepared to leave.\n\n“Please stay, Godfather Han,” Ancient Abyss Grandmaster said. “Since you are here in the big barren systems, you must have a purpose. Can you tell me why you are here?”\n\nWhile the two were talking, the other four deified elites came flying back. They recognized Han Sen and were shocked to see Han Sen.\n\nThe Han Sen they knew was the crystallizer Godfather Han, who killed Destroyed Leader. It was not the Han Sen that disguised himself as a prince of the Extreme King.\n\nRegarding Han Sen’s disguise as an Extreme King prince, while they had heard about it before, they did not care about it much.\n\nThey were going to surround Han Sen. Once they knew it was him, they hesitated. They decided against trying to surround him.\n\nIf this was an ordinary deified elite, even a true god elite, they would not be afraid with Grandmaster’s presence there.\n\nThey knew that during a recent battle, Han Sen had turned Burning Lamp into dust. That scene had been shocking. Thus, they were quite afraid. They had practiced a long time to reach their current level, and they had experienced many difficult things along the way. They did not want to risk becoming weak again."
}