{
    "chapter": 1055,
    "title": "Unbelievable",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1055",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Haha! Fighting with a shura? The lad is out of his mind!”\n\n“A human with that measly level of fitness chose to fight with our prince? How stupid is he?”\n\n“Human bro, let me teach you a skill. It involves spinning your body repeatedly. If you do that, you might last a few seconds longer.”\n\n“He should make use of the Toyama theory, and use the landscape and geography of the arena to his advantage. Oh, wait a minute… the arena is flat. May God have mercy on his soul.”\n\nThe shura thought Han Sen’s decision to engage in this fight was so far beyond dumb, it was unwittingly hilarious. They mockingly devised methods how the human on stage might last a little longer. The stream was a meme-field.\n\nLou Lan laughed and said, “Are we positive this kid didn’t just come here to waste our time just to have a laugh?”\n\nLian Chan commented, “He’s only just become a surpasser, hasn’t he? What other kind of performance can we expect?”\n\n“Don’t underestimate him. This human is strong,” an elderly shura dourly said from beside Lou Lan.\n\nThe two looked at the old shura and said, “Uncle Gu Na? Isn’t he far weaker than the prince, though?”\n\nGu Na shook his head and said nothing more. He kept his eyes fixed on Han Sen, watching him with keen interest.\n\nWithout a reply, an unease settled on the minds of the two shura ladies. They did not say anything more, either.\n\nGu Na was the only one there who was not a royal shura, but he was two hundred years old. For the white-horned shura that he was, the third rank was the highest rank that could be achieved.\n\nSo, while Gu Na was merely an elite soldier, it was something that had not denied him a valiant history. He had participated in numerous battles over the years, and he had received a number of medals for the incredible service and heroics deeds he had performed.\n\nHe had been chosen for the expedition into the crystallizer ruins because he was very powerful, in a capacity that did not exceed the maximum allowed ballpark of strength for the people who went. He also had extensive experience and had seen much, over the course of his long lifetime.\n\nStill, due to his lower hierarchical prestige and age, the younger sorts like Lou Lan and Lian Chan didn’t often care for the words he spoke.\n\nYu Tuoshan threw a punch in Han Sen’s direction again. It came fast and hard.\n\nHan Sen didn’t seem keen to dodge, however, and decided to meet his opponent’s fist with his own.\n\nThe humans believed Han Sen was being stupid, trying to push in such a manner. They believed he was foolish in trying to match the shura’s strength directly.\n\n“I fear we already know who has won, as if it wasn’t obvious beforehand,” Zhao Yongbo said dismally.\n\nJi Hailan said nothing, but Han Sen’s behavior was strange.\n\nOnly Bai Yishan looked at Han Sen with a modicum of happiness.\n\nOthers may not have recognized the punch Han Sen was using, but he did. And that was because he was the one who had created Yin Yang Blast.\n\nIt was a dangerous talent. As such, its learning was forbidden, and it seemed likely that ruling would stand for a long time to come.\n\nBai Yishan felt a great sense of pride and accomplishment whenever he saw someone use a technique he had created. This was especially true for Yin Yang Blast.\n\nStill, he didn’t understand exactly how Han Sen proposed to block or deflect the shura’s punch with this strike.\n\nYin Yang Blast was only effective against enemies that were of the same tier as the caster. Everyone thought Han Sen was considerably weaker, and as such, he thought the power of the skill would be squandered.\n\nBut Bai Yishan also knew something else, and that was about Han Sen’s character. He knew Han Sen was a highly proficient fighter, and his head was always screwed on correctly. Han Sen wouldn’t do anything that might result in his loss, so he put the doubts out of his mind out and waited for what was to unfold. He wanted to see how far the skill could go.\n\nWhen the moment of collision came, Han Sen’s fist opened up to reveal his palm. In a split-second, he changed his method of attack to grab Yu Tuoshan’s fist.\n\nTo the onlookers, it seemed like a pointless change. The general assumption was that fists were always stronger than palms.\n\nYu Tuoshan believed Han Sen had underestimated him snidely, so he resolved to hit his opponent even harder.\n\nBut when the fist came into contact with the palm, everyone was shocked.\n\nThere was no noise; it was as if the force of Yu Tuoshan’s incoming fist had simply refused to exist and had canceled itself. There Han Sen stood, with his fingers wrapped around the shura’s fist firmly.\n\nAnd then, with a slight movement, Yu Tuoshan’s entire body was cast away like a doll.\n\nBoom!\n\nYu Tuoshan’s body was thrown through the reinforced glass that separated the stage from the audience and crashed into a few chairs.\n\nEveryone was shocked, unable to believe what had just happened. The way the shura had been tossed away seemed so very easy and light, as if he was no heavier than a crumpled piece of paper to Han Sen.\n\nLian Chan’s eyes were wide open in bewilderment.\n\nThe viewers of the stream had all gone quiet, and an unsettling silence began to choke the viewers both online and offline. Their all-powerful prince had been chucked away by a human. In the aftermath of such a shock, not one word was spoken or typed.\n\n“Awesome!” Bai Yishan was the one to break the gripping quiet, and he sounded far happier now than he did whenever he won fights of his own.\n\nBut Bai Yishan wasn’t just happy over Han Sen’s victory, he was overjoyed in seeing that the skill he had developed could be dexterous enough to overcome and defeat a shura."
}