{
    "chapter": 2285,
    "title": "Deified Fight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2285",
    "text": "“That guy seemed very spirited… What would make him run away in such a hurry?” Han Sen looked at Yisha with confusion.\n\nYisha sighed and said, “Maybe its power takes a long time to regenerate. That strike he unleashed might have cost him most of the power he had gathered.”\n\nNow Han Sen was able to understand. It was like the Red Mist King that depended on the seven red mist minks for energy. It took a very long time for such power to be gathered.\n\nIf Big King Bell had failed to bluff Han Sen and Yisha, it knew it had to run once Fox Queen showed up.\n\n“What do we do now, then?” Han Sen asked, looking at Yisha.\n\nYisha didn’t answer. She teleported to the backdoor.\n\nHan Sen knew what she meant by that. He mounted the blood kirin and followed after Yisha.\n\nBig King Bell was a big phony, but he was familiar with the surrounding area. Getting information from him could be quite useful.\n\nAfter they rushed out of the white whale, Yisha’s body flashed away. The blood kirin was unable to catch up with her. It was like a human having a foot race against a sports car.\n\n“Half-deified” had the word “deified” in it, but they were still King class beings at their core. Real deified beings were in another league entirely.\n\n“Han Sen!” Yisha had chased after Big King Bell, quickly disappearing. Upon seeing Han Sen emerge from the white whale’s belly, Fox Queen called out in surprise.\n\nBefore Han Sen could think of escaping, Fox Queen flashed before him and the blood kirin to block their path.\n\n“Good timing! Give me the relic, and I will spare your lives.” Fox Queen narrowed her eyes at Han Sen, but it looked as if she was smiling.\n\n“Pretty Sister, you are giving me more trouble. I don’t have the relic on me.” Han Sen looked troubled, and he said, “Did you see that person that just ran off? That was my master, Knife Queen. I gave her the relic.”\n\n“In that case, let us see if your master or the relic is the most important thing in your heart,” Fox Queen said coolly. Many cords of power slid out of her, and they came slithering over to wrap around Han Sen and the blood kirin.\n\nBut Han Sen patted his bird’s nest, which grew bigger to shield him and the blood kirin. It blocked out Fox Queen’s cords of power.\n\nEven so, the cords of power locked tightly around the bird’s best. And that meant Han Sen was now unable to escape.\n\n“My good little brother, you think having this bird’s nest will keep me from doing anything to you?” Fox Queen smiled, and then she pulled something out from her waist.\n\nHan Sen saw the item, and when he did, his heart fell.\n\nFox Queen had brought out a small jade flute. It was less than one foot long, and it was a translucent, creamy color. It looked very small and fragile.\n\n“Fox Queen, are you proficient in sonic powers? The bird’s nest might not be able to filter out noise, so I don’t know if it can withstand sonic powers,” Han Sen thought to himself.\n\nThe bird’s nest was not a bai sema, and Han Sen couldn’t trigger its full power. He used the bird’s nest’s power as a protective force, but it was difficult to tell if he could block a sonic attack.\n\nFox Queen brought the small jade flute to her lips. She smiled at Han Sen, and then, she opened those red lips. The jade flute began to produce sweet music.\n\nThe flute wasn’t particularly loud, but a very vague cord of power came out of the flute. The cord was coming for the bird’s nest.\n\nHan Sen was shocked. He realized that the music of the flute could seep through the dry grass of the bird’s nest, and that realization made him depressed.\n\nHe had received the approval of the Undying Bird’s Nest, and so he was able to make use of the bird’s nest. But that usage was limited. Since he couldn’t activate the bird’s nest’s power, he couldn’t utilize its defensive properties.\n\nFox Queen’s flute sounds were able to sink into Han Sen’s bird’s nest, and there was nothing he could do to prevent it.\n\nThat music of the flute sank into the bird’s nest like silk strands coming to tangle up Han Sen and the blood kirin. Han Sen and the blood kirin did their best to free themselves, but they were ultimately unable to get rid of the flute’s music.\n\nUnder the influence of the flute, Han Sen couldn’t control himself. He lifted the bird’s nest and began crawling out like a puppet on strings.\n\n“Oh no! Oh no!” Han Sen felt terrible.\n\nSeeing Han Sen slowly moving out of the bird’s nest, Fox Queen’s expression was beatific. But when Han Sen saw the smile, he did not feel good.\n\nJust as Han Sen was pulled fully from the bird’s nest, Fox Queen’s expression became surprised. She waved her jade flute.\n\nDong!\n\nA purple knife air roared through the air. It was like a demon coming forward to strike Fox Queen’s jade flute. That endless purple knife air slashed the jade flute repeatedly, then struck Fox Queen’s body and sent her flying ten kilometers away. Fox Queen broke the knife air and stood still.\n\nYisha’s body flashed next to Han Sen, and her phoenix eyes moved to meet Fox Queen’s beautiful eyes.\n\nFox Queen felt as if she could feel the spark between them.\n\n“You are Han Sen’s teacher?” Fox Queen smiled like a flower, but her eyes looked cold.\n\n“Not bad,” Yisha answered coldly.\n\n“Perfect. Han Sen said you possess the relic. Give it to me now, and I will let you both walk free,” Fox Queen said coldly.\n\nYisha responded seriously, “I do not recall having a queen like you to obey.”\n\nUpon hearing those words, Fox Queen looked furious. She swung her jade flute, and some sad sounds came at Yisha. As this occurred, she hissed, “How dare you!”\n\nHan Sen knew something very bad was about to happen. He didn’t say anything and just maintained his hold on the bird’s nest, moving toward the fallen white whale.\n\nTwo deified beings were now having a fight. Ordinary creatures would not be able to endure the shockwaves. Han Sen didn’t want to stay there and be reduced to dust.\n\nFortunately, the white whale was ownerless now that Big King Bell had departed. Han Sen planned to hide inside and see if he could operate the thing.\n\nThe white whale could block the attacks of a deified elite. Yisha and Fox Queen had been unable to destroy its body. That thing must have been very tough, so if Han Sen was able to drive it, the whale would be far greater than a top-class battleship.\n\nWhen Fox Queen came for Han Sen, she had given up trying to bind the white whale. The white whale had fallen into the sea, and half of it was just floating atop the surface of the sea.\n\nThe blood kirin dove and took them into the water. Han Sen planned on going to the backdoor and making his way to the white whale’s control room.\n\nAs soon as he entered, he noticed that Crime and Mister White had followed him."
}