{
    "chapter": 2550,
    "title": "Shura Horn",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2550",
    "text": "Greyish white feathers appeared, cloaking Han Sen’s body. The image of a rainbow peacock appeared on his face, and it released a scary rainbow light. That rainbow light quickly melted away the Sky Demon Lock’s purple smoke. In seconds, the power holding Han Sen in place had vanished.\n\nJi Yang Sheng and the other Demons were shocked when they saw this. Their Sky Demon Lock, which could securely ensnare a deified being, had just been melted away with ease. It was unbelievable, and as a result, they were left staring in stupefied silence.\n\nThey looked at Han Sen’s feathery clothing, unsure what sort of treasure he was now making use of. But whatever it was, it was obviously strong enough to break the Sky Demon Lock.\n\nTheir assumption was only half-right. Han Sen had been able to break free of the Sky Demon Lock because of the Peacock King soul robe’s power, but the beast soul alone wouldn’t have been enough to free him. Even if the Tianxia Peacock King was reborn, it couldn’t have broken the Sky Demon Lock.\n\nBut when the Peacock King’s soul power, Han Sen’s strength, and the power of the Dongxuan Sutra were combined, the resultant power was enough to shatter the Sky Demon Lock. Nothing less than that would have been able to free Han Sen.\n\nHan Sen hadn’t used the Peacock King soul robe at first because he knew there was something amiss with the armored man. He wanted to see who or what was behind the armored man, and that was why he allowed himself to get captured.\n\nNow he understood everything, and there was no point in pretending.\n\nJi Yang Sheng’s eyes widened. He didn’t say anything, but he poured more Sky Demon power into the purple horn that was still in his hands.\n\nThe armored man’s eyes glowed purple once more. He tried to grab Han Sen’s head again.\n\nHan Sen waved his hand, and a rainbow light struck the armored man. The armored man’s body lost control and fell prone. The rainbow light covered his whole body, and the power of the light quickly dissolved the black armor, revealing the person inside.\n\nIt was a very muscular man. He was much taller than Han Sen. He wasn’t very tall compared to many of the giant races in the universe, but his body was so solid that his limbs looked like towers. Tattoos covered his entire body.\n\nHan Sen could see that these tattoos were shura-associated. Han Sen had rarely seen shuras with those kinds of symbols, though. They were different from the traditional Demon tattoos.\n\nHan Sen raised his eyes and looked at the man’s head. To his surprise, the man’s head didn’t possess shura horns. His head was only covered in short purple hair.\n\nBut in that short hair, Han Sen could see an oval-shaped marking. It looked the man had once possessed a horn, but it had been broken off.\n\n“It really is one of the shura,” Han Sen thought to himself.\n\nThe guy was emotionless, and his muscles bulged so much that they looked like they were about to burst. The purple air rose, and it came at Han Sen in another attack. Han Sen immediately detected the Sky Demon power.\n\n“Are the Sky Demon Sutra and the Falsified-Sky Sutra the same? But if there is practically no difference between them, doesn’t that mean pure shuras shouldn’t be able to learn it? If he is a shura king from the sanctuary, how could he practice Sky Demon powers?” Han Sen wondered.\n\nThe man’s fist came before Han Sen, but Han Sen raised his hand to stop it. Han Sen’s hand was enshrouded with a rainbow godlight formed by substance chains. The rainbow godlight quickly tied up his enemy’s body.\n\nThe man struggled and writhed inside his bonds. Sky Demon power was strong, but it could only make use of causal powers. It wasn’t some invincible ability. And speaking of power, this creature wasn’t quite deified yet. He was weaker than the soul robe’s power.\n\nIf the shura had been fighting someone other than Han Sen, he could have used causal powers to escape. But Han Sen was using his Dongxuan Area in conjunction with the Peacock King’s soul robe. The Dongxuan Area’s force stopped all of the universal cogwheels in the region. Not even causal powers could escape Han Sen’s manipulation. Unless the shura was stronger than Han Sen, the shura’s powers weren’t going to be of any use while Han Sen had his Dongxuan Area active.\n\nJi Yang Sheng and the other Demons were in shock. The Demon Doll’s power was almost deified class, and Demon Dolls weren’t like ordinary Demons. They had very scary talents. After they became Demon Dolls, they would undergo a weird reaction with the Sky Demon powers. The Demon Dolls would then gain causal powers, which would allow them to apply causal powers to a wide range of uses. Not even a pure Demon could do that.\n\nEven deified elites couldn’t trap a Demon Doll. But now, the Demon Doll had been subdued by Han Sen, and it seemed completely unable to break free. It was being held tightly by Han Sen’s power. The entire situation was way too scary.\n\nWithout hesitation, Ji Yang Sheng turned around with the plan to run away as fast as he could. The other Demon elites thought to do the same. But they suddenly noticed their powers had disappeared. None of their abilities seemed to work. They couldn’t tear through the fabric of space. They couldn’t even cast any powers outside of their bodies.\n\n“What’s going on?” Ji Yang Sheng and the other Demons looked at each other with wide, frightened eyes.\n\n“Let me deal with them,” Elysian Moon said smoothly. She waved her paper umbrella, unleashing a swordlight. It flew right at Ji Yang Sheng.\n\nDue to the fact that they couldn’t use their powers, Ji Yang Sheng and the others had to jerk clumsily away. But with their reaction times being so slow, they couldn’t dodge many of the swordlights, and the cruel attacks began to punch through their bodies. Demon blood gushed everywhere as they screamed.\n\nA second later, a few of the Kings had already perished under Elysian Moon’s swordlights. Ji Yang Sheng and the other two half-deifieds were badly injured.\n\nNow they believed what Han Sen had said. That woman was so pretty, but she was also someone who could slaughter her enemies without so much as a blink of hesitation. They were shocked by how powerful she was.\n\nThey were under the influence of Han Sen’s Dongxuan Area. They couldn’t use their powers, even though they could still touch their self-cogwheels. Their power was there, but they couldn’t make use of it. They couldn’t do anything to save themselves.\n\nThat woman’s area power was no greater than King class, but her swordlights could pierce through the bodies of half-deifieds. Just that power exceeded what an ordinary King could accomplish.\n\nJi Yang Sheng was as shocked as he was angry. He hated the fact that he hadn’t followed the Demon King’s advice.\n\n“Han Sen, I’m the son of the Demon Alpha. If you kill me, the Demons will do all they can to avenge my death. If you let me go, you can take any deified treasure and xenogeneic genes you wish,” Ji Yang Sheng shouted.\n\nHan Sen looked at Ji Yang Sheng and said, “A Demon? You’re lowly compared to the Extreme King.”\n\nWhen he heard that, Ji Yang Sheng’s face turned grey. He remembered that Han Sen was the one who had killed a prince of the Extreme King. If he wasn’t concerned about their wrath, why would he fear the Demons?\n\nHan Sen reached out, and a rainbow light shot from his palm. Ji Yang Sheng didn’t have the time or strength to dodge it. The purple horn was taken by Han Sen.\n\nHan Sen ignored Ji Yang Sheng and the others getting killed by Elysian Moon’s swordlights. He took the mysterious purple horn and lifted it next to the broken stub on the shura man’s head.\n\n“It is his horn.” Han Sen thought about it and wondered what had happened."
}