{
    "chapter": 446,
    "title": "Shocked",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_446",
    "text": "\"If we do not join your gang, how much do we need to pay for an ice-armored beast?\" A middle-aged man in his 40s or 50s asked Han Sen.\n\n\"An A-Class Saint Hall license of the evolver level,\" Han Sen said determinedly.\n\n\"What? An A-Class Saint Hall license of the evolver level for an ice-armored beast? Why don’t you go rob someone instead?\" The man shouted madly immediately.\n\nMany people also accused Han Sen of being shameless. Some even tried to snatch a body on the back of the golden growler.\n\nThis was just human nature. Many people could go through hardship with you together, but could not share your wealth, let alone watch you become fortunate.\n\n\"Ouch!\" Han Sen made a sudden move, and the cursed wolf dagger suddenly cut off the hand of someone who had touched the golden growler to snatch a body.\n\nThe shrill scream made everyone feel dumbstruck. They all stopped moving and looked to Han Sen and the man with a broken arm was rolling around on the floor.\n\n\"Without my permission, I dare you touch my properties. If your hands touched it, you would lose your hands. If your feet moved, you would lose your feet. If your head came close, you would lose your head,\" Han Sen said coldly with the blood the cursed wolf dagger.\n\n\"Dammit. He got some nerve to use violence. Let us kill the bastard.\"\n\n\"You injured our friend. Are you even a human being?\"\n\n\"Kill this animal!\"\n\n\"Son of a bitch!\"\n\nHan Sen suddenly became the person whom everyone hated, as if he was so guilty that everyone would kill him the first chance they got.\n\nXu You and a few others tried to stop the rest of the group, because they were so few, four or five persons had already thrown themselves at Han Sen, who were all old-timers who had been in this place for more than two decades.\n\nOf course, they were not trying to avenge the person who had lost his hand, but to take all the bodies for themselves after getting rid of Han Sen.\n\nIn their eyes, Han Sen was no more than a brat who got lucky. Since he had just entered Second God’s Sanctuary, there was no way that he was their match. It would be a piece of cake to kill Han Sen.\n\nThose people summoned their beast souls and tried to kill him with each move, ready to take Han Sen’s life. These bodies were so attractive, especially to those who had not seen so much mutant meat in decades. On top of that, there was even a sacred-blood bird leg. Lust had gone to their heads.\n\nHan Sen did not change his expression at all. Smiling coldly, he had thought of this possibility when he brought back the meat and did not feel surprised at all. It was not even necessary to get angry.\n\nYang Manli’s face became stern. She summoned a bow and arrow, ready to help Han Sen. These people were the ones she despised the most.\n\nBecause most people could potentially gain some benefits, they became self-righteous in grabbing what belonged to others. These people were nothing different from robbers, and even worse than robbers.\n\nAt least robbers got the bad name that they deserved, while these people tried to justify their behaviors.\n\nHowever, before Yang Manli could even shoot an arrow, Han Sen suddenly moved. Instantaneously, he dashed between the first five people who made their attacks.\n\nOuch!\n\nFive screams were made at the same time, so they sounded like it came from the same person. The first five people who threw themselves at Han Sen all lost their right hands which were holding their weapons. Blood jetted out, and the five persons were rolling around on the ground with their left hands covering their broken arms, pleading and crying.\n\nEveryone was dumbstruck by Han Sen who had a straight face and the five screaming persons, shocked at what had happened.\n\nThose five people had been in Second God’s Sanctuary for more than a decade. They were all quite experienced. Although it was hard to get some meat in this place, their fitness level must be over forty after so many years. However, after one move, all of them lost their right hands, which made everyone shocked.\n\n\"Who else want to take my life?\" The code gaze of Han Sen swept across everyone’s face. Those who were trying to kill Han Sen were snatch some meat all felt a chill and stepped back involuntarily.\n\nYang Manli looked at Han Sen with a complicated expression, as she had not expected that Han Sen would be so aggressive.\n\n\"Uncle Qing is here…\"\n\n\"Uncle Qing, you must help us. This bastard hurt his own kind.\"\n\n\"Uncle Qing, we have always helped each other, and he is cruel even to one of us. He’s just an animal.\"\n\n\"…\"\n\nA middle-aged man in his 70s or 80s came from the ice cave. For an evolver who had a lifespan of three hundred years old, eighty years old was indeed just middle-aged.\n\nSeeing the man called Uncle Qing, Yang Manli became nervous, put down her bow and arrow and said hastily, \"Uncle Qing, don’t listen to them, they were trying to steal Han Sen’s…\"\n\nBefore Yang Manli even finished her words, Uncle Qing gestured her to stop.\n\nSeeing Uncle Qing’s behavior, the rest of the group became excited and blamed Han Sen for everything with exaggeration, as if it was a felony for Han Sen not to share his gains with them for free. Their behavior of stealing was also beautified as a move for justice.\n\nYang Manli looked upset. Uncle Qing should be the first person who was teleported to this place. He had been here for a few decades and had the most geno points among the group. He was also the only person who had killed a mutant creature.\n\nAccording to Uncle Qing himself, his fitness level was around sixty, but Yang Manli believed it should be more than that.\n\nIn addition, Uncle Qing had also practiced strong hyper geno arts design for evolvers, so he was not any average evolver. It was fair to say that Uncle Qing was the strongest person in the group.\n\nAlthough Han Sen was strong, he had just entered Second God’s Sanctuary. If Uncle Qing was trying to harm Han Sen, Han Sen might be killed.\n\n\"Uncle Qing, this is not all Han Sen’s fault…\" Xu You gritted his teeth and said in Han Sen’s favor.\n\nHowever, Uncle Qing gestured him to silence as well, and walked to Han Sen.\n\nYang Manli’s face became even more grim. She quickly walked to Han Sen, showing her attitude.\n\nThe rest of the group were celebrating Han Sen’s mishap with expectation and greed. As long as Uncle Qing got rid of Han Sen, they should be able to split the meat. Uncle Qing had always been generous, so they should all be able to get some.\n\nSeeing Uncle Qing walking straight to Han Sen, many people were shouting inwardly, \"Kill him… Kill him…\"\n\nAlthough Han Sen had some extraordinary performance and an impressive dagger, no one believed he could beat Uncle Qing who was absolutely stronger than him.\n\nWhen Uncle Qing was less than 6 feet from Han Sen, under everyone’s watch and expectation, he drew a Z-steel knife that looked ancient.\n\nWith the surprising, suspicious, puzzled, confused, uneasy, and frightened looks from different people, Uncle Qing wielded the weapon and cut off the heads of the five people who were rolling around and screaming. Then, Uncle Qing bowed to Han Sen reverently.\n\n\"Young Master Han, Ning Qing has come too late. I deserve any punishment from you.\"\n\nEveryone was shocked at the moment. Uncle Qing was the strongest person in the group, the only one who had killed a mutant creature, acted as if he was Han Sen’s servant. Everyone felt they needed more brainpower to understand that."
}