{
    "chapter": 2325,
    "title": "Bai Wei“s Visit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2325",
    "text": "“Why are you so nervous? Didn’t I tell you not to disturb me unless I called for you?” Han Sen asked from the building.\n\n“My Prince, this is bad! Queen Bai Wei is here,” Lilly quickly said.\n\nHan Sen seemed to have expected this, so he pushed the door open and exited.\n\nBai Wei looked glum as she above the sea. In King’s Garden, she received word that Han Sen had been destroyed by Bai Yi’s Return to Origin. She went home and noticed that Bao’er and the blood kirin were gone, so she immediately headed to Planet Water Zone.\n\nNot long after, the water shifted beneath her. Han Sen brought Lilly up to the surface with him.\n\nWhen Bai Wei saw Han Sen’s face, her expression looked conflicted. She said icily, “Brother Sixteen, you killed my guard! And you also stole things from Planet Wind Zone. Give me Bao’er and the blood kirin back, or I will let my father decide how to handle these matters.”\n\nHan Sen laughed and looked at Bai Wei. He said, “My good little sister, I’m afraid you have made a mistake. I am Prince Sixteen; why would I go to your planet and steal anything? I was only taking what rightfully belongs to me.”\n\n“Since when was Planet Wind Zone yours?” Bai Wei demanded furiously.\n\nHan Sen laughed. “I have taken Han Sen. His body and his mind are now mine. So, I am him and he is me. His stuff is my stuff. So, of course I took back what belongs to me. What’s wrong with doing that?”\n\n“You… Don’t give me these quibbling rebuttals! Give me Bao’er and the blood kirin back, or I will go and complain to father!” Bai Wei shouted.\n\n“Whatever. I do not have time for you.” Han Sen turned to head back into the underwater city.\n\n“Stop! You can keep the blood kirin, but that kid is pointless for you. Give her to me, and I’ll consider us settled.” Bai Wei gritted her teeth.\n\n“Haha! Such a beautiful little girl. Why would I give her to someone else? Of course, I will want to raise her all by myself.” Han Sen grinned.\n\n“You *sshole!” Bai Wei roared. She threw a punch at Han Sen.\n\nShe knew what Bai Yi was like. Han Sen was taken and nothing could be done about it, but she couldn’t let Bao’er fall into the lap of someone as sick as Bai Yi. That was why she wanted her back.\n\nHan Sen’s expression was hard. He used his water area-of-effect to bind Bai Wei’s body. It kept her from moving, and he easily punched her away.\n\n“Bai Wei, this isn’t a place for you to take a sh*t. Stop being ridiculous! If you don’t, I will be rude to you,” Han Sen said threateningly as she was flying away.\n\nBai Wei slowed to a stop and hung in the air, wiping away the blood. “What do I have to do to get you to give me the girl?”\n\n“You want the girl that badly? Did you make it with Han Sen? I don’t see memories of such a thing in Han Sen’s head.” Han Sen leered at Bai Wei.\n\n“She is just a little girl! She is useless to you. What do I have to do to get you to give her to me?” Bai Wei asked stiffly.\n\n“Such beautiful and cute girls are very important to me. Okay, you are my little sister; if you want her that badly, then I will give her to you. But first, hand me your Thousand Heart Lock and I will give you back the cute little girl.” Han Sen grinned.\n\n“You.” Bai Wei’s face changed.\n\nBai Wei didn’t have many good things, so she didn’t have many decent geno treasures. But King Bai had given her mother the Thousand Heart Lock. It was passed on to Bai Wei later. It was her only deified item, and it was the only thing she had to keep her alive. This wasn’t a secret among the Extreme King, and even Han Sen knew about it.\n\nHan Sen couldn’t give away Bao’er, and so he suggested something he knew that she couldn’t trade.\n\n“I will swap a King class item for the girl instead. She is just a kid, you don’t need her!” Bai Wei looked sad.\n\n“I said I want the Thousand Heart Lock. If you want my cute daughter, bring me the Thousand Heart Lock. If you won’t, we are done discussing these matters. I’ll leave you to think about it.” After Han Sen spoke, he began to lower himself back into the sea.\n\n“Thousand Heart Lock is combined with my body. I cannot simply give it to you. Even if I could, you wouldn’t be able to use it. Aside from me, no one can use the Thousand Heart Lock.” Bai Wei stopped Han Sen and gritted her teeth. “Give me the kid, and all of Planet Wind Zone’s resources are yours for a year.”\n\nHan Sen was shocked. Planet Wind Zone was poor, but one year’s worth of resources was an incredible thing for her to offer. She was planning to give everything for Bao’er. He didn’t know if she had been able to tell how special Bao’er was, or if there was an ulterior motive to her desperation.\n\nIf she was willing to do this to prevent Bao’er ending up with Bai Yi, then it proved her to be a very good-hearted person.\n\n“You are willing to trade so many resources for one little kid? That kid is special. I should really take good care of her. Perhaps she can earn me a lot more money. Maybe we can talk more about the price later. Hahaha…” Han Sen dropped back into the sea.\n\n“A**hole!” Bai Wei angrily punched the sea, but it a futile gesture.\n\n“That prick!” the princess of the Siren growled at the same time. She was angry at what Bai Yi had done as well.\n\nIf she didn’t need the protection of the Extreme King and her title as princess, she would never have married a scumbag like that. Even just her title made her feel sick. She really wanted to kill him.\n\n“My Princess, we need to look at the greater good. Prince Sixteen is the last generation of the virgin blood. We need him to take the holy item,” the old Siren said.\n\n“It is only because my blood isn’t pure enough that I cannot activate the relic. If it was, I wouldn’t have to work with an *sshole like this,” the princess said furiously.\n\nThe old Siren sighed. “We cannot change this. The Siren were destroyed, and not many of us survived. We need to mate with other races. You and Prince Sixteen have the blood of virgins. It isn’t pure, though, so you cannot do it alone. It might work if you two cooperate. For the sake of the Siren, please endure.”\n\nThe princess didn’t say anything in response. She looked towards the garden, then walked in that direction.\n\nHan Sen went to the garden, but before he reached his little place, he saw the princess headed his way.\n\n“What are you doing here? Are you so lonely that you require my company?” Han Sen grinned. He was just pretending to be Bai Yi.\n\n“Give me the little girl,” the princess said emotionlessly."
}