{
    "chapter": 2772,
    "title": "As Long as You Like It",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2772",
    "text": "“Yes. He is the best meal here. Are you worried that he won’t taste good? That is fine, if so. You can have your pick. Eat anything you want. If you like it, it is yours,” the phoenix said.\n\nLooks of confused horror covered the faces of Elder Nader and all the others. They couldn’t believe what they were hearing. They had all been trapped in this place, and the phoenix considered them to be nothing more than food. Dollar, however, had been invited to eat with the phoenix like a guest of honor. If he wanted to, he could consume them until his belly was full.\n\nAlthough Han Sen had no idea why the phoenix was treating him differently, he felt as if he was relatively safe now.\n\n“You’re giving them all to me?” Han Sen asked, looking at Elder Nader and the others.\n\n“Of course. Assuming you like them, that is.” The phoenix smiled. It was like a doting mother who had found an opportunity to spoil her kid. It was difficult for Han Sen to comprehend its current behavior, given that he had just watched it toy with the lives of its prisoners. It had turned Kings and deifieds into piles of dust with ease.\n\n“I can do whatever I want to them? I mean, if I don’t want to eat them, can I let them go?” Han Sen asked.\n\n“Yes, as long as that is what you want.” The phoenix looked as if it really was spoiling him.\n\nHan Sen only wanted to save Dragon One, but then he hesitated. He decided to save Bao Lian, too. He wanted to beat Bao Lian by himself; he didn’t want the man to die like this before Han Sen could settle the score between them.\n\n“Then, let those two go.” Han Sen pointed at Dragon One and Bao Lian.\n\nWhen the phoenix heard Han Sen’s request, it didn’t move. But Bao Lian and Dragon One, who were being pressed into the ground, suddenly felt the crushing gravitational force lift from their bodies.\n\n“Brother Dollar, I really appreciate this,” Dragon One declared, his face looking rather shaken. Immediately after he finished speaking, he flew away. He didn’t dare stay any longer.\n\n“What you’ve done here today will be paid back in full. I owe you one,” Bao Lian said. And then, he left with Dragon One.\n\n“Mister Dollar, help!” Many elites that were bound to the bridge had seen that the phoenix agreed to free Dragon One and Bao Lian at Dollar’s request. They were shocked, but hope quickly dawned in their eyes. A few desperate Kings called out to Han Sen for help.\n\n“I can really do whatever I want with these people?” Han Sen asked again, looking at the god phoenix with uncertainty.\n\n“Of course. They are all yours,” the phoenix said with a smile.\n\nHan Sen squinted and looked at Elder Nader and all the others. He remained silent for a long moment, and his reluctance made everyone worry profusely.\n\n“Mr. Dollar, please be kind and let us live! I have a family back home to raise…” begged a King from a small race.\n\n“I have no association with your people, and neither am I cooperating with you. Why should I save you?” Han Sen looked at the King and spoke coldly.\n\nThe King immediately answered, “I have many xenogeneic treasures and genes. I can give them all to you; I just want to live. I will owe you so much.”\n\n“Are you truly willing to do that? I haven’t forced you,” Han Sen said with a blink.\n\n“Of course, I’m willing to! I will be eternally thankful if I’m allowed to live. You will be my savior for all time, and I will work my hardest to pay you back,” the King quickly said.\n\n“Mr. Dollar, I am willing to offer you all my treasures and xenogeneic genes.”\n\n“Mister Dollar, please take mine…”\n\nSuddenly, many Kings were fighting to be the ones to give Han Sen treasure. They pleaded with Han Sen to show mercy and let them live.\n\n“If you guys are being this nice, I won’t decline your offers,” Han Sen said, his voice slightly awkward. He quickly collected the treasures and xenogeneic genes from the Kings. And then, he asked the phoenix to remove the restrictions binding them.\n\nThe Kings were delighted. After they thanked Han Sen, they were quick to escape that place.\n\n“Brother Dollar, this is all I have. Is it enough to spare my life?” Barr said.\n\nBarr never saved up much. The only thing of real value that he possessed was a deified sawblade. And it was only at the primitive level.\n\n“If Brother Barr is willing to give that up, then I will accept it.” Han Sen nodded and took Barr’s sawblade. The phoenix then released the restrictions holding Barr.\n\nWhen the deified elites who were present saw Barr give up a deified treasure in exchange for his life, they all decided to follow his example. They were willing to give up their deified treasures in exchange for permission to live.\n\nHan Sen turned to the other deifieds with a wolfish grin. He said, “Barr and his buddy Dia Robber are old clients of mine. That is why he is getting special treatment. If the rest of you would like to purchase your lives, deified treasure alone is not enough.”\n\nAmazement swept through the deified prisoners. That was especially true of Elder Nader. His face kept warping, shifting from green to white as his emotions vacillated between nausea and rage.\n\nBefore, he had thought of Dollar as a useless nobody. He refused to team up with Dollar. Who would have known his life would end up in this man’s hands? He wasn’t optimistic enough to believe that his chances of being saved were 50/50. He probably wouldn’t be allowed to live, even if he gave Han Sen everything that he had.\n\nAs he watched Han Sen scam the other deified elites, Elder Nader’s first impression of Han Sen grew deeper. This was a greedy man. Those were the five words he would pick to describe Han Sen.\n\n“This guy is so greedy. No wonder people call him Dollar.” Now that the other deifieds were being forced to give up all their prized possessions in exchange for their freedom, they also realized what sort of person Han Sen really was.\n\nBut losing all their money was better than dying there. It might have been unpleasant, but the deifieds paid up rather quickly. None of them were bold enough to try to bargain with Han Sen.\n\nA short time later, Han Sen was a much wealthier man, and all the elites that were bound by the bridge were released. Only Elder Nader remained, and he hadn’t said a word thus far.\n\nElder Nader couldn’t even move his head to look away. His face was turning a deeper and deeper shade of red, but he didn’t say anything.\n\n“I don’t believe you will release everyone from all these races, yet dare to kill me. Killing me in front of all these witnesses is like declaring war upon the Destroyed,” Elder Nader thought to himself, but still, he did not speak.\n\n“Mr. Phoenix, thank you for your kindness and generosity. The rest of these people are useless to me. You can have them all.” Han Sen bowed to the phoenix.\n\nElder Nader’s mouth fell open, but before he could protest or say anything, the god phoenix opened its mouth and drew in a breath. Elder Nader turned into clouds of dust.\n\nEveryone stared in mute silence. They were terrified by the fact that a transmutation deified had been murdered in an instant, but they were also happy that they had made a smarter decision. If they hadn’t coughed up Han Sen’s ransom demand, they would have ended up like Elder Nader.\n\n“Elder Nader stayed at home for too long. He must have forgotten how dangerous the universe is. Even to the moment of his death, he was just thinking about preserving his reputation.” Barr shook his head casually, then chuckled a little. Although the Destroyed were powerful, they didn’t have many deifieds. Losing a transmutation deified like that was a big blow to them.\n\nBut Elder Nader had been famous for too long. Instead of spending his time fighting for survival in the universe, he had spent the last few hundred years teaching students. He had lost his edge and forgotten how cruel the universe can be. He had taken his reputation too seriously.\n\nWhen everyone was gone, Han Sen bowed to the god phoenix and said. “Thank you for your help. If there is something you need me to do, I will try my best to help you. If there is nothing else, then I will take my leave.”\n\nAfter Han Sen said that, the phoenix picked him up in its beak. It flew deep into the xenogeneic space."
}