{
    "chapter": 164,
    "title": "Sacred-Blood Pet",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_164",
    "text": "Han Sen quietly tracked the gang and saw they had set up a tent and made a fire.\n\nGu was tied up and Han Sen had not found any good opportunities to rescue him.\n\nAs Son of Heaven’s gang were about to finish eating, Han Sen thought if Gu was tortured again, the big guy would probably be useless even if rescued.\n\nHaving an idea, Han Sen summoned Meowth and ordered it to run toward the other side and roar at the gang.\n\n\"A creature!\"\n\n\"It’s a sacred-blood creature!\"\n\n\"Do not let it run away!\"\n\n\"Knife and Baldy stay, we will go hunt that sacred-blood creature,\" ordered Son of Heaven, leaving two guys watching the camp and Gu, while he chased the sacred-blood three-eyed cat with the rest.\n\nRunning, Son of Heaven instructed, \"Spread out and circle around it. We could not go far since it’s dark.\"\n\nSeeing the gang running away, Han Sen summoned the wings and shapeshifted into bloody slayer, flying toward the camp in darkness.\n\n\"Baldy, incoming!\" shouted Knife when Han Sen was 30 feet from the camp.\n\nBaldy quickly summoned a mutant beast soul spear and watched Han Sen closely. Knife also summoned his pair of daggers.\n\nHan Sen was in their face in no more than the blink of an eye. Holding the Shura katana, Han Sen whacked it at Baldy.\n\nThis strike from above was swift and powerful, but Baldy raised his spear with two hands and tried to block it.\n\nThe Shura katana cut into the spear deeply, and Baldy’s legs were forced into the sand by Han Sen’s terrifying strength.\n\nWhen Baldy thought that he had warded off the strike, his spear broke.\n\nBaldy wanted to go back, but his legs were still in the sand and there was no way to run. Another katana strike cut Baldy in half.\n\nDing! Ding!\n\nTwo daggers were shot at Han Sen and mercilessly nailed in the gaps on the elbow part of his armor. To kill Baldy, Han Sen had no time to dodge.\n\nFortunately, these two daggers were only mutant beast souls. Although they were swift enough, they were still stuck before they could cut deeper. Otherwise, Han Sen’s arms would have been disabled.\n\nAfter killing Baldy, Han Sen turned to deal with Knife, who immediately started running at an incredible speed, not leaving any chance for Han Sen to approach him.\n\nShouting while running, Knife managed to alert Son of Heaven and the rest of the gang.\n\nHan Sen did not chase him, but lifted Gu who was tied up and ran away with all four hooves of the bloody slayer.\n\n\"Dollar, you son of a bitch! If you are a man, fight me one-on-one,\" cursed Son of Heaven behind him.\n\n\"I think it is more like one gang on one person,\" said Han Sen full of disdain, running at full speed.\n\nThe gang thought that lifting a big man like Gu must slow Han Sen down and they could eventually catch up. But suddenly, a black three-eyed tiger appeared next to Han Sen and he simply lay Gu on the tiger’s back. The bloody slayer and the tiger disappeared from their sight in an instant.\n\n\"Why would that sacred-blood creature help Dollar?\" The gang members were confused.\n\nSon of Heaven finally understood, \"Damn, that is not a sacred-blood creature. It is a sacred-blood beast soul pet! That motherf*#er had fed a sacred-blood pet!\"\n\nEveryone was shocked. A sacred-blood pet must have cost so much advanced creature meat to transform.\n\nAfter chasing for a while, the gang gave up. In fact, when they found out that the tiger was a sacred-blood pet, they had lost confidence.\n\n\"How did he make a sacred-blood pet transform? Did he use sacred-blood creature meat to feed his pet?\" Everyone was shocked by the fact that Dollar had a transformed sacred-blood pet, which implied incredible power of him.\n\nHan Sen ran for a while and shapeshifted back after losing the gang. He put Gu on the ground and cut loose the ropes.\n\n\"Dollar?\" Gu recognized him.\n\n\"Friend, how much do you think your life is worth?\" asked Han Sen.\n\nGu was suddenly taken aback, \"You also want my sacred-blood sledgehammer?\"\n\n\"Not necessarily that beast soul, but I did save you. You do not mean to say the risks I took are for nothing, right?\" said Han Sen.\n\nGu did not speak and cast an odd look at Han Sen.\n\n\"And now you have nothing but injuries. Can you leave Devil Desert alone safely? If you pay me properly, I can get you back to the shelter,\" Han Sen continued.\n\n\"Why should I believe in you?\" asked Gu.\n\n\"Do you have any other choice?\" Han Sen laughed.\n\n\"Except for the sacred-blood sledgehammer, you can pick from all the other beast souls I have. But you have to take me to the shelter first,\" said Gu, wiping blood off his face.\n\n\"Brother Gu, is it?\" Han Sen looked at Gu.\n\n\"Call me Gu Ming, or whatever you like. I will not hear Brother Gu ever again.\" Gu Ming gnashed the teeth in anger.\n\nHan Sen smiled, \"OK. Now you have two options. One is to go out on your own, and the other is to pay up front. There is no other options. I am not Son of Heaven and will keep my promises. If you pay me two mutant beast souls, I could promise to get you back to the shelter alive.\"\n\nGu Ming looked Han Sen up and down and summoned several beast souls. \"The enemy of my enemy is my friend. I know you and Son of Heaven are enemies, so I believe you. Here are all my mutant beast souls. Take your pick.\"\n\nHen Sen glanced at them and pointed twice. \"This one is my reward for saving you, and that one is the price to take you back to the shelter.\""
}