{
    "chapter": 2724,
    "title": "Golden-Haired Monkey",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2724",
    "text": "The black crystal that had transformed into an Immortal Dragon could follow commands that Han Sen gave it telepathically. And it had a healing power that was deified class.\n\nThis new black crystal wasn’t exactly what Han Sen thought it would be, and it didn’t have the power of his first black crystal. However, the power it had just demonstrated didn’t seem too shabby.\n\nWith this Immortal Dragon, Han Sen could fight carelessly. He wouldn’t have to worry about getting hurt. As long as he didn’t die, the Immortal Dragon could simply heal his body.\n\nThe strangest thing about it was that the Immortal Dragon could be reduced to a black crystal. In many ways, it was like a beast soul. He could lob it into his Sea of Soul for easy storage, which meant he could take it with him wherever he went.\n\nHan Sen couldn’t wait to fight a deified xenogeneic so he could give it a try. The idea of fighting while the Immortal Dragon’s immortal area backed him up was very exciting.\n\nBao’er had grown quite bored as she lounged comfortably on a Star Fruit. She spent some time playing with the gem she had gotten from Empty God, but eventually, she put it away. It didn’t take long for her to lose interest in it.\n\nRight now, Bao’er was missing Empty God. He was the only person who had been kind enough to give her so many toys for free.\n\nAs Han Sen was practicing under the tree, someone teleported to the boundaries of the Star Tree. Han Sen raised his head and realized that person was Shale.\n\n“Brother Han.”\n\n“Shale?” Han Sen looked surprised to see him. Han Sen hadn’t seen Shale since the silkworm bout. He didn’t know why Shale would have come all the way to the Star Tree.\n\n“I received the leader’s permission to come here and collect a Star Fruit.” Shale pulled out a notice to show Han Sen.\n\n“I see. Please come in.” Upon confirming that the notice was legit, Han Sen shut down the defenses of the Star Tree to permit Shale to enter.\n\nHan Sen felt very uneasy about this, though. After the Star Tree’s original guardian left, Star Fruit was forbidden to be consumed by anyone. But the Very High leader had still permitted Shale to come and take fruit. That wasn’t normal, for sure.\n\nShale wasn’t shy or hesitant. He walked right into the Star Tree zone. Han Sen commanded his legion of xenogeneics to not harm the man, and Shale made it safely to the Star Tree.\n\nWhen Bao’er saw Shale, she looked curious. That was because when Empty God had shown her the future using the Star Gauge Mirror, she had seen Shale picking Star Fruit. With Shale now arriving, her curiosity had been piqued.\n\nShale walked toward the tree in a straight, determined path. He didn’t stop or wander around. He seemed to have a pre-selected target.\n\nHan Sen didn’t think this was weird, though. If the Very High leader had given him such unusual approval to come and claim a fruit from the Star Tree, then they wouldn’t just leave his reward up to chance. He must have a target already.\n\nHan Sen was curious, so he followed behind Shale. He wanted to see what Star Fruit Shale was going to collect.\n\nA few minutes later, Shale arrived at the Star Fruit of his choosing. Han Sen couldn’t see what was so special about this particular Star Fruit. Shale didn’t immediately pick it, however. He turned to face Han Sen and told him, “Brother Han, we might have a fight on our hands later. I hope you can protect the Star Tree and keep it from being harmed.”\n\n“Sure,” Han Sen nodded. That was his responsibility. But Shale was a primitive deified, and he spoke to Han Sen like he wasn’t confident in his ability to control whatever it was that lurked inside the fruit. That gave Han Sen a bit of a shock.\n\nThe xenogeneics that came out of the Star Fruits were always asleep, and there was a secret skill to make a contract with them before they awoke. If the person who opened the fruit didn’t want to make a contract with the creature inside, they could kill it while it was still asleep.\n\nBut Shale, who was a primitive deified, said there would be a fight. That cast this entire fruit-opening scenario in a more ominous light.\n\nOnce Han Sen had prepared himself, Shale flew to the top of the Star Fruit. He knocked the Star Fruit down from its branch.\n\nThe whole process, thus far, was the same as when Han Sen had picked his own Star Fruits. The fruit itself burned away, revealing the xenogeneic inside.\n\nThe xenogeneic’s body wasn’t very large. Like Shale, it was an ordinary and muscular creature. It was around three meters tall, and it had blonde hair.\n\n“A golden-haired monkey.” Han Sen was shocked. That xenogeneic had short legs and long arms. Its head had three sets of ears. Each one looked like a snail. It looked very strong, but there was also something strange about the creature.\n\nAlthough Han Sen couldn’t see any substance chains, he could tell that it had a scary presence. He knew that this six-eared, golden-haired monkey was deified.\n\nIt was different from the normal xenogeneics of the Star Fruits. When this blonde monkey was revealed, its eyes were already open and shining gold. The gold light in its eyes looked like it could outshine the moon and the sun.\n\nUpon seeing Shale in front of it, the six-eared, golden-haired monkey suddenly screamed. Its gold substance chains exploded like a holy light. That powerful radiance wrapped around its entire body, and the creature shot toward Shale like a golden flame.\n\nShale’s eyes were unwavering, and he generated a gold substance chain. He didn’t fall back. He moved toward the attacking monkey.\n\nTheir fists hit each other, but the golden-haired monkey didn’t move. Shale’s body stumbled back a few dozen meters before coming to a stop. Judging from this display of power, Shale was weaker than the monkey.\n\nWithout a moment of hesitation, the monkey kept moving. It rushed toward Shale with blinding speed. Its body was releasing a scary presence.\n\nBut Shale didn’t seem worried by the creature’s power. He moved with almost casual elegance, and he shook the pursuit of the six-eared monkey. He fought the monkey not by matching its power, but by utilizing his own prodigious skills.\n\nAlthough Shale was very talented, he had been raised poorly. When Han Sen had first fought him, Shale hadn’t known many top-class geno arts. In the time since they had last seen each other, Shale’s fist skills had improved. He also had a few more top-class geno arts. He had gained a lot of strength, and he was obviously a much more capable fighter now than he had been during the silkworm fights.\n\n“He really did eat a demon fruit and earn a fake eleven armor talent. His improved speed is way too fast.” Han Sen complimented him.\n\nBut after watching this battle for a while, Han Sen’s brow furrowed. The super-powerful Shale was being suppressed by the six-eared monkey.\n\nAs he watched the fight, Han Sen could tell that the six-eared monkey was a primitive deified. Its speed and power were better than Shale’s fake eleven armor talent, however.\n\nPlus, the six-eared monkey’s power was very strange. Shale would occasionally find an opening to land a blow on the monkey with one of his scary geno arts, but after he attacked, the monkey’s shadow was the only thing that would remain. The six-eared monkey’s real body would appear elsewhere. It would then send a dangerous strike back toward Shale.\n\nShale stayed calm and managed to avoid losing his head each time, but the monkey’s attacks left cuts across his body. He was bleeding continually now, and he looked terrible."
}