{
    "chapter": 2764,
    "title": "Walk Your Own Path",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2764",
    "text": "In the days that followed, Han Sen didn’t eat or drink much. He spent all his time modifying Under the Sky and Break Six Skies.\n\nUnder the Sky wasn’t very compatible with Break Six Skies, so Han Sen would have to use his dual pistols from Spell to channel the power. And Break Six Skies had to be modified, as well. He might not be using the geno art’s full destructive capability, but the explosive power had to be sufficient to annihilate God’s Knife. Only by doing that could Han Sen perform his one-second judgment into the past.\n\nThis was a very big project. Han Sen focused all his attention on modifying the skills. He wanted to make the technique as perfect as possible. God’s Knife was such a scary being. If there was the slightest flaw in his plan, Han Sen would lose the fight and die.\n\nBut Han Sen was confident that he had what it took. Sooner or later, he’d make it work.\n\n“Now that I have sorted out how to deal with the Super Space Slash problem, I must move on to the last problem that is standing in my way. How can I actually destroy God’s Knife?” While Han Sen was practicing, he mulled over this next task.\n\nIf he was unable to destroy God’s Knife, blocking Super Space Slash was pointless. Reaching a stalemate would be the same as losing. Gu Wan’er would remain trapped either way.\n\nBut with Han Sen’s current resources and power, he couldn’t defeat God’s Knife.\n\n“If I can’t break it, then I must find a way to trap it. Maybe Turtle would be a good choice for that, but I just don’t know if it will work on God’s Knife.”\n\nHan Sen realized that his imagination alone wouldn’t be enough to solve the problem. Whether he was attempting to predict his opponent’s attack vector or trying to determine the effectiveness of Turtle, he needed to perform real-world tests. He had to see how his plans worked out in proper combat.\n\n“It looks like I still need to go to God’s Farm. I wonder if God’s Knife is still on the Demon Sheep Planet?” Once Han Sen finished modifying Under the Sky and Break Six Skies, he planned to go to God’s Farm.\n\n“The path other people walk is the path for them. I have to walk my own path.” Han Sen continued not to eat and drink, and he kept chipping away at his modifications to the geno arts. He didn’t sleep or rest for two weeks.\n\nEvery time he thought of Gu Wan’er having to use her own blood to feed that knife every day, Han Sen’s heart ached.\n\nBefore the modification works were finished, Exquisite came back. But this time, it was only her. Li Keer didn’t join her.\n\n“The leader still isn’t willing to let me out?” Han Sen asked, glancing at Li Keer. He was already prepared.\n\nExquisite didn’t answer Han Sen. She only coldly told him to follow her. Then, she flew toward the mist.\n\nHan Sen was surprised. This was well beyond his wildest expectations. Exquisite was going to lead him out of the bottle. Han Sen had never expected the Very High to actually free him.\n\nBut if he was able to leave there so easily, he wasn’t going to hesitate or complain. He flew to catch up with Exquisite, and he followed her through the mist.\n\n“Does the leader believe that I’m not cursed?” Han Sen asked Exquisite.\n\n“Don’t say or ask anything. I’ve got this. You just need to be quiet and follow me,” Exquisite said without even looking at him.\n\nHan Sen could feel there was something amiss here, but he didn’t dare to speak again. He remained silent and followed after Exquisite.\n\nExquisite guided the two of them through the mist, and they eventually emerged outside the bottle.\n\nThe hall that held the bottle had such powerful restrictions that they didn’t need a Very High to guard the place. Exquisite had used a small stamp to enter, and it kept the restrictions from affecting her. She led Han Sen out of the hall.\n\nAfter exiting the hall, Exquisite placed her hand on Han Sen’s shoulder. She was going to teleport both of them away from that place.\n\nBut Han Sen took her hand, stopping her from using Galaxy Teleport.\n\nExquisite looked at Han Sen with confusion, and Han Sen looked back at her with a very serious expression. In a quiet voice, he said, “Answer my question. Are you taking me to the leader?”\n\nExquisite hesitated a bit, but then she shook her head and said, “No.”\n\nWith that answer, Han Sen was almost certain that his guess was correct. He persisted and asked Exquisite, “The leader hasn’t given you permission to take me out of the bottle world, has he?”\n\n“You don’t need to concern yourself with such matters. I’m taking you away from Outer Sky. After you leave Outer Sky, you should go back to Sky Palace. Tell everything that happened here to Zhang Xuandao. If he is willing to keep you, I don’t think our leader will try to take you back from Sky Palace,” Exquisite said.\n\nHan Sen’s expression became unreadable. He knew what was happening now. Exquisite was taking a huge risk. She was breaking the rules and setting him free on the sly.\n\nHan Sen had never expected that Exquisite might do something like this for him.\n\nHan Sen had only thought of Exquisite as a tool for accelerating his growth, but now, he couldn’t consider her that way anymore.\n\n“Why?” Han Sen asked, giving Exquisite a complex look.\n\n“You came into this place alive. I’m going to make sure you leave this place the same way,” Exquisite said with an emotionless look.\n\n“If I leave, what is going to happen to you?” Han Sen knew the Very High’s rules were strict. The Very High could be an extremely heartless people. If someone broke the rules, they wouldn’t look on the transgression kindly.\n\n“Nothing much will happen. All I have done is set my silkworm free. It isn’t a big deal. And I have other things to do, anyway. Stop wasting my time,” Exquisite said coldly.\n\nHan Sen nodded and said, “Yes. We really can’t waste any time. Take me back to the bottle world.”\n\nExquisite froze. Then, she looked at Han Sen with confusion and asked, “You don’t want to leave?”\n\n“That is correct. If you had destroyed your contract with me and trapped me in the bottle world and scolded me, someday I would put my knife to your neck and leave this place by force.” Han Sen paused, and then he went on to say, “But if you let me go like this, I will feel very guilty. I cannot owe someone this much.”\n\nHan Sen hadn’t been with the Very High for very long, but he had taken the time to read their cruel rules. He knew what would happen if she let him go. She might not be killed, but she would be imprisoned for a century.\n\nHan Sen’s personality wouldn’t allow that to happen. He didn’t mind fighting people. No matter how cruel the enemy was, he could find a way to kill them. But he was afraid of people treating him too kindly. He didn’t want to owe anyone too much.\n\nHan Sen didn’t know how he could pay back a woman who had wasted her youth on him. He didn’t want Exquisite to be in jail on his behalf for a hundred years. So, he had no choice but to stay.\n\nOf course, Han Sen also had a plan. His situation wasn’t hopeless. If it had been hopeless, he would have simply left and taken Exquisite with him.\n\nBut he couldn’t do that just yet, because Exquisite might not completely betray the Very High to be with him. So, Han Sen had to reject Exquisite’s good intentions.\n\n“You won’t owe me anything. This isn’t a big deal,” Exquisite said to Han Sen casually.\n\n“How can a century of jail time be considered nothing? How many centuries can you even live for?” Han Sen asked.\n\n“How did you know that?” Exquisite was shocked.\n\n“Send me back.” Han Sen didn’t answer. He calmly looked at Exquisite with soft eyes.\n\n“You need to know that if you miss this chance, you risk being trapped inside the bottle’s world forever.” Exquisite looked at Han Sen with a conflicted expression.\n\n“No, I will not. I will use my powers to leave. Nothing can trap me there,” Han Sen said firmly. His face looked so confident, as if he was telling her that 1 + 1 = 2."
}