{
    "chapter": 3102,
    "title": "Steel Scene",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3102",
    "text": "Before Han Sen went to find Feng Yin Yin, Feng Fei Fei had already brought her to where he lived.\n\n“San Mu, I had a discussion with my auntie,” Feng Yin Yin happily said as she tugged at his arms. “You should move into our house.”\n\nHan Sen looked at Feng Fei Fei. She smiled and said, “I still haven’t paid you back for the favor of saving my life. Little Yin seems to get along with you very well. If you are willing, I would be happy to allow this.”\n\n“OK.” Han Sen smiled and agreed to the notion. He had something to ask Feng Yin Yin, so he did not decline the invitation.\n\nFeng Fei Fei did not expect Han Sen to agree so quickly. She was shocked. “Mister Han, there is something I would like to ask you,” Feng Fei said with a streak of seriousness.\n\n“I only have a lobby. I do not have a private study. If you do not mind doing so, please enter my room to have this discussion.” Han Sen knew Feng Fei Fei wanted to talk to him privately, so that was why he said that.\n\nFeng Fei Fei hesitated a little, but she ultimately agreed. “OK.”\n\nHan Sen let Jiang Shi take care of Feng Yin Yin for the time being while he and Feng Fei Fei entered the room.\n\nFeng Fei Fei would not have entered a man’s room under normal circumstances, but this was a very urgent matter. She did not care too much for how appropriate it was.\n\nShe checked out Han Sen’s room in detail. The decorations were basic. It was just like how the hotel was supposed to look, which disappointed Feng Fei Fei.\n\nShe thought people like Han Sen would have some sort of fetish, but it was actually very normal.\n\n“You can tell me anything,” Han Sen said as he looked at Feng Fei Fei and sat down on the couch.\n\nFeng Fei Fei had a serious expression as she looked at Han Sen. She bowed and said, “I am here to thank you for saving my life. I am also here to save your life.” “What do you mean?” Han Sen looked at Feng Fei Fei with interest. Feng Fei Fei did not answer. Instead, she bluntly asked, “Am I correct that it was you who killed Mister Gong Shu Jin?” “Let’s say I did. What about it?” Han Sen did not deny it.\n\nFeng Fei Fei sighed and said, “Gong Shu Jin died because of me. I understand if Gong Shu Zhi cannot let me go. If he really wants to kill me, he will kill you too.”\n\n“Are you saying it was Gong Shu Zhi who did that to you at the party?” Han Sen was shocked.\n\nFeng Fei Fei nodded. “I asked a friend to investigate. It was Gong Shu Zhi. He used my best friend, Si Tu Ya. Otherwise, I would not have come under the control of that gene race without being aware. While I thank you for saving me, this will only drive Gong Shu Zhi to want to kill you more.”\n\nHan Sen smiled at Feng Fei and asked, “If you knew it was Gong Shu Zhi and Si Tu Ya, why are you letting them walk free?”\n\n“I do not want to let them go, but I can only watch them go. Yesterday, they were invited to Ice Snow City.” Feng Fei Fei, upon seeing Han Sen appear confused, explained, “Ice Snow City belongs to a god-blood noble, Steel Scene. He inherited a God Spirit Blood-Pulse and has incredible power. Furthermore, Steel Scene has the kingdom’s guard. He is an important character in the Qin Kingdom. I am just a singer. Although I am quite famous, no one would dare offend Mister Steel Scene on behalf of a singer.”\n\nle\n\n“Why would Steel Scene seek to protect Gong Shu Zhi?” Han Sen quietly asked.\n\n“According to the information I received, Gong Shu Zhi collected many god-class gene races and gave them to Steel Scene. He now has Steel Scene’s protection, and he will kill us both.” When Feng Fei Fei said that, she sounded sad.\n\nIf it was just about Gong Shu Zhi, Feng Fei Fei could talk to him. A god-blood noble like Steel Scene was not someone she could afford to enrage. She could not just sweep this under the rug.\n\nSome nobles willing to help Feng Fei Fei, but the conditions made her unwilling to accept.\n\nFeng Fei Fei sought Han Sen out so the two of them could go against Steel Scene together. Other people did not know Han Sen’s strength, but she knew. Han Sen was a god-blood noble. He was not as strong as Steel Scene, but he was not someone that could easily be killed.\n\nPlus, in Jade Wall City, Steel Scene was not able to randomly go and murder someone.\n\nHan Sen said anything. He looked a bit murderous. It was as if he had just made a decision.\n\nHan Sen decided to live with Feng Fei Fei. He did not try to slow this process down. He had Jiang Shi and Mister Yang pack their bags. They went to the castle in Jade Wall City that Feng Fei Fei lived in.\n\nOn this day, the castle was not very busy. It was rather quiet. Feng Fei Fei had Han Sen occupy an independent sector.\n\nHan Sen and Feng Yin Yin went to the garden to play. There was no one around. He took out the stone ocarina and gave it to Feng Yin Yin.\n\n“Little Yin, see if you can play a song with this. This ocarina is weird, so you need power to operate it.”\n\nAlthough Feng Fei Fei had greater power than Feng Yin Yin, Han Sen did not fully trust her. He did not want her to see the gold lightning in the clouds. He only allowed Feng Yin Yin to play with it.\n\n“Let me try.” Feng Yin Yin took the stone ocarina and summoned the mutant eight sound bug and autumn cicada. The two gene races combined.\n\nCombining with two gene races required a lot of will and vitality. Ordinary gene casters exhausted all their strength by attempting it.\n\nFeng Yin Yin had only owned two gene races for a little while, yet she was already able to combine the pair. She was very talented.\n\nAfter successfully combining, Feng Yin Yin looked at Han Sen and asked, “San Mu, what song would you like me to play?” “Just play a song that evokes the most emotion,” Han Sen quickly said. If he had guessed correctly, it was not a higher pitch in the music that made the gold lightning marks show up. It was all dependent on the amount of emotion that was put in.\n\nFeng Yin Yin nodded. She thought for a moment before putting the stone ocarina next to her lips to play it.\n\nThe ocarina was supposed to sound sad. Feng Yin Yin’s performance made people feel refreshed and rejuvenated. Han Sen’s ears felt like new after listening to it.\n\nAs Feng Yin Yin played, some smoke came out of the ocarina. It created a cloud above her head. That cloud had a godly tone. It was like a god demon was praying inside.\n\nAfter a while, Han Sen saw that the cloud had some gold lightning. There was more this time. It turned into the gold lightning mark.\n\nHan Sen was happy. He observed the gold lightning marks to understand how amazing it all was."
}