{
    "chapter": 1007,
    "title": "Life or Death Moment",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1007",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“If we keep going like this, we are sure to meet our demise. We might as well turn back,” one surpasser said, pleading for them to leave. Another surpasser threw up, and others broke down in tears or screams, afraid of the killing trees that surrounded them.\n\n“Turn back? Turn back and go where?” Lin He asked.\n\n“Back to Wind God Shelter,” the man answered.\n\nLin Weiwei angrily retorted, “Have you forgotten what occurred there? It was conquered by a spirit—it would be suicide to return!”\n\n“If we sign a contract, perhaps they won’t kill us!” the man said desperately.\n\nEveryone looked to Lin He, thinking the same way.\n\nWhichever way they were headed, their survival was not guaranteed. But amidst the deadly trees that surrounded them, making a groveling return to the shelter to put themselves at the whims of a spirit suddenly seemed like a more attractive option than it had before.\n\nIf they knew for sure that there was a place of sanctuary somewhere ahead, they would continue. But only the unknown guided their feet, and that was the nexus of all their fears.\n\nLin Weiwei had thought of surrendering to the spirits, too. What had occurred to them was not an anomaly; in fact, such conquerings were a frequent occurrence. They had each been lucky enough to spawn in a human shelter, anyway.\n\n“And what do you say?” Lin He looked at each of them now, posing the question. When he did, they each lowered their heads in shame for what they wished to do.\n\n“Uncle San, if there was a human shelter ahead of us, we would go. But we don’t know what awaits us,” a middle-aged man sadly proclaimed.\n\n“Uncle San, can we truly make it across Ghost Mountain? We have barely begun our ascent, and already, a few of us have been killed. If monsters lie in wait, especially here amidst these trees, fighting them would be folly. We assuredly cannot compete.”\n\nPeople started to argue amongst themselves, laying forth their reasoning, but it did little to change things. People were starting to turn away and return. No one mentioned their desire to surrender to the spirit that had robbed them of their home, but their intent to do so was clear.\n\n“Everyone has control of their own fate. Choosing whether you live or die is not a frequent privilege, but on this day, I believe you have each been given this choice. And this is not something I can decide for you. You may either straddle a thin line between life and death amidst the treacherous unknowns ahead, or return in the belief you will guarantee your survival, albeit as a thrall for a new and cruel master.” Lin He gave another look to each member of his weary, broken-hearted group and continued by saying, “I will not falter in my resolve to keep my fate my own. I will continue to traverse this path, and you are all welcome to join me. I would sooner die due to a bad decision that I made myself than submit to the whims of a callous spirit.”\n\n“You won’t go back?” a few people asked in shock.\n\n“No. I won’t forget the sacrifices made by our fallen allies; they that bravely allowed us to escape from the shelter. I won’t allow their deaths to be in vain,” Lin He proudly stated.\n\nThe soldiers each wore a complex expression. No one wanted to be taken as a slave, but they couldn’t see a happy existence ahead. Both options were shrouded in darkness.\n\n“All life is precious. Command your own fate, and you won’t be subject to judgment from me. Do what you think is best with this one life you possess.” Lin He smiled.\n\n“I’m going with you. I’d rather die with pride than whimper softly as some spirit’s toerag,” Lin Weiwei said, as she went over to stand by Lin He’s side.\n\nHan Sen started walking over to Lin Weiwei, too. But she stopped him and said, “You should go back with them. Ji Yanran is waiting for you, and this road is too perilous for one as green as you.”\n\nHan Sen did not honor her wishes this time. He continued walking forward and said, “If I go back, I don’t think the spirit will allow me to use a teleporter.”\n\nHan Sen’s words startled a few of the surpassers, who had not fully realized how miserable and robbed of freedom they would be, with a spirit presiding over them. Some of those who were still on the fence decided to join Lin He after hearing this.\n\nOthers, without a word, gave one last look to the foul trees around them, and turned away to exit.\n\nAlthough Han Sen was strong, he could not promise to lead them all out safely. As such, he did not say a word.\n\n“We will share our resources evenly, and then, we will go our separate ways,” Lin He solemnly said.\n\n“You are a good person.” Lin Weiwei was actually surprised Han Sen had decided to follow them.\n\nLin Weiwei always thought Han Sen was a decent human being, due to the accolades given by Lin Feng. But seeing his stoic heart in person was something else entirely. She had really grown fond of him.\n\nFor many surpassers, this was a difficult decision. Such choices never came easy, even to the strongest of people. And Han Sen, new as he was, made it without flinching.\n\nHan Sen wished to tell her that, with his power, he would survive even if the rest of them died.\n\nBut he held his tongue. Now wasn’t the best time to hurt their feelings.\n\nSeeing people pack and organize their things before going their separate ways, no one looked confident in the decision they were making.\n\n“Let’s go,” Lin He said, after taking a deep breath.\n\nLin He started walking in the front, knowing he was the leader. He had to be firm in his resolve and not show a single sign of regret. He had to be a pillar of support for all those who followed him. After all, a leader could not lead if he did not know where he was going.\n\nThe members of his band looked at each other and then moved forward to follow him, beneath the cruel malice that tainted the trees of that forest.\n\nUsing his Dongxuan Aura, Han Sen scanned the area. He needed to remain alert, for his own sake as much as theirs.\n\n“Han Sen, when are you going to marry Yanran?” Lin Weiwei asked Han Sen this lighthearted question, upon seeing the glum expressions that were glued to the faces of everyone else in their company.\n\n“After this ordeal is over, I think it will be the right time,” Han Sen answered.\n\nLin Weiwei wanted to say something else, but Han Sen then suddenly said, “Careful. A group of creatures is coming this way.”\n\nEveryone was shocked at the sudden announcement, but when they looked carefully, they could see the flickers of a shadow that suggested something was coming for them."
}