{
    "chapter": 1206,
    "title": "The Growing Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1206",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe fact that none of the creatures appeared to be possessed was a relief to Han Sen.\n\nThe purple mountain was further away than Han Sen initially believed it to be, and he hadn’t quite realized how big it had become. And yet, it still wasn’t done. It was continuing to grow, with no end to its development in sight.\n\nHan Sen was ten miles away from its foothills, and as eerie as the scene was, its creepiness was aided by the fact it was silent the whole time. It rose from the ground in complete, utter quietness.\n\nHe could view the mountain with fair clarity, and he could espy what lay on its slopes. The purple light he had viewed earlier, though, was a projection of the clouds that now swirled around the growing landmass, hanging around it like a thick mist.\n\nThe mountain was not in fact purple. It was black and green.\n\nHan Sen decided the follow the creatures on their way there, and that was when he noticed something even stranger.\n\nThe creatures that could fly were not going up the mountain. They all stopped two hundred meters away from the slopes, standing there. And it wasn’t just them, either. The ground-based creatures stopped before ascending, too. They all just gathered like the audience to some spectacle that had yet to begin.\n\nAs this transpired, the mountain continued to grow. The catalyst for that growth was still a complete mystery to Han Sen, so far.\n\nHan Sen decided to travel to the other side of the mountain and see if there were any other creatures there. He hoped he’d see the silver fox amongst them. On the other side, there was a wide abundance of different creatures. But to his great dismay, Han Sen was unable to spot the silver fox among them.\n\nNeither could Han Sen see any of the other creatures that disappeared from Ghost Mountain. The absence of the white snake was as much a mystery, as well.\n\nBut as Han Sen reviewed this disappointment, he couldn’t wallow in it for long. All of a sudden, he heard one of the beasts squeal. It was followed by the sound of a fierce strike.\n\nThen, silence drowned the scene once more.\n\nHan Sen heard these sounds emanate from the peak, but it was shrouded in a veil of mist. Thus, Han Sen’s vision of whatever had occurred was obscured. And as loud as the sudden outburst was, it was over in an instant. Nothing else accompanied the two sharp sounds that rang out. No rustle, no movement, nothing.\n\n“Is silver fox up there on the mountain, perhaps?” Han Sen wondered.\n\nHan Sen scanned the remainder of the creatures at the bottom of the mountain and made sure there weren’t any of the super creatures he was missing there. There wasn’t a single one down there.\n\n“Maybe silver fox really is up on top of the mountain!” Han Sen guessed.\n\nAfter this short while of thought, the silence that re-nestled the land did not last. The thundering roars of explosions began to echo across the region, accompanied by the cries of creatures. The noise came from the peak again.\n\nBut it only lasted for a few seconds, just as it had earlier. A sudden grand crescendo, fading into absolute nothingness.\n\nHan Sen had no clue where the silver fox might have been, and while he wondered, Bao’er leaped off of Han Sen down onto the mountain ground. She turned to look at Han Sen and said, “Daddy, come.”\n\nHan Sen, witnessing Bao’er’s fearless approach, decided to follow. There didn’t seem to be any harm in doing so, after all. The purple light-flickering mist that cloaked the top of the mountain was very thick, though. Bao’er was hasty in her ascent, and she went into the mist without waiting for Han Sen. When she was inside, she could not be seen.\n\nHan Sen, seeing her disappear, quickly called out, “Slow down! We should go together.”\n\nBut Han Sen’s face immediately turned ugly when he realized he could not hear what he had just spoken aloud.\n\nHan Sen quickly re-activated his dongxuan aura. Aside from what his naked eyes could see, it was of little help. He couldn’t sense Bao’er’s presence or anything. So he walked faster to try to reach her. Eventually, Bao’er returned, coming out of the purple mist with a visible look of confusion.\n\nHan Sen picked her up and told her, “You should stick with me.”\n\nBut again, Han Sen could not hear himself speak those words. It was as if a noise-canceling dome had been established, circling the whole mountain. It was impossible for someone to make a noise, it appeared.\n\nBao’er could understand what Han Sen wished to speak, though, and then she said, “There is something here, but I cannot find it.”\n\nHan Sen was shocked at his ability to understand her, also. It was if he had heard what she said, even though he actually hadn’t heard what she said.\n\n“What is it?” Han Sen asked.\n\n“Treasure,” Bao’er answered.\n\n“What treasure?” Han Sen’s interest spiked, and he knew he had come to the right place. If Bao’er said there was treasure, you could bet your bottom beast soul there would be.\n\nBut Bao’er shook her head then, strangely. She signaled she did not know what sort of treasure they’d be after. There was treasure, but its nature was a mystery even to her. Han Sen knew if she had seen the treasure, she wouldn’t have come back with such an obvious look of confusion.\n\nHan Sen looked up towards the purple mist, and he noticed it was beginning to descend to swallow the rest of the mountain. From a slow roll, it quickly picked up like the ravenous tumble of an avalanche. It looked as if it wished to swallow the entire world below.\n\nWhen it passed the halfway point of the mountain, though, it slowed down. And when it reached Han Sen’s position, it had resumed the gradual descent he had first witnessed.\n\nHan Sen did not sense anything coming from the mist. He could not detect the presence of any power—benevolent or malevolent—and neither could his ordinary senses pick up anything. No sound had been heard in quite a while, either.\n\nAs Han Sen observed this strange phenomenon, the noise started up again. It was a crude sound, one that made him picture the hewing of rocks. Each sound was accompanied by an angry roar. But then, it suddenly stopped again. It was as if an earplug had fallen out and hastily been re-plugged.\n\nThen, something came out of the mist.\n\nIf there had been fighting up there, it could have been just a rock. But when Han Sen saw what tumbled out of the mist, he was quite shocked."
}