{
    "chapter": 2460,
    "title": "The Same Stone Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2460",
    "text": "Han Sen looked at the woman, his expression carefully veiled. He wanted to know, but the woman obviously wanted something in return. He would need to know what she wanted before he agreed to some sort of bargain.\n\nThe woman smiled at him. “I will tell you, but you will have to help me with something first. Do it, and I will explain everything.”\n\n“You are so strong. If there’s something that you can’t do yourself, how will I be able to accomplish it?” Han Sen asked hesitantly.\n\nThe woman smiled and said, “Don’t worry; the task isn’t dangerous. I simply can’t leave this island, so I need your help to get it done.”\n\nHan Sen remained silent, but he didn’t think this would be a trivial task.\n\nThe woman paused, then pointed in a particular direction. “Once you leave this island, keep going that way. Before long, you will see some light. You must follow that light. Then, you will find an island that is identical to this one. That island doesn’t have a wooden house on it, though. You must go and cut off the top of that mountain, just like this. That is all you have to do.”\n\n“Is there a creature over there or something?” Han Sen asked.\n\nThe woman shook her head. “No, but you must remember one thing: once you see the light, you cannot speak. As long as you don’t talk, you should be fine. If you say anything, even if it is just a single word, you will be dead.”\n\n“What is the light?” Han Sen asked.\n\n“I don’t know what it is, but it is still up to you if you want to go or not. I won’t force you to go if you don’t want to,” the woman said. Then, she turned away from Han Sen and carried on with her research.\n\n“Can I see those geno arts?” Han Sen pointed to the books lined up on the shelves.\n\nThey were the best geno arts of all the races. Even if Han Sen didn’t practice them, it would be useful for him to be able to remember them all.\n\n“If you are willing to go, you can read as much as you like. Okay, you can leave my house now,” the woman said, without raising her head.\n\nHan Sen flew out the window, and he landed outside the yard. The woman was way too clean, and she had a serious case of OCD. If Han Sen wasn’t working for her, she would never agree to let him touch her things.\n\nHan Sen decided to go to the place the woman had described to him.\n\nThe woman had nothing to gain by hiding any dangers in the task. If Han Sen died halfway through the task, then sending him would have been pointless.\n\n“Even if it is dangerous, I can only suppose the danger will arise after completing the mission.” Han Sen knew that the woman probably wanted him to free her from her prison. Han Sen turned and looked back through the window.\n\n“I’m willing to go, but first, can you tell me what kind of test the Sacred Leader conducted?” Han Sen asked.\n\n“I will tell you when you get back,” the woman’s voice responded from someplace inside the wooden house.\n\n“I’m afraid that when I get back, you will not be here,” Han Sen said.\n\nThe woman went silent for a while, and Han Sen wasn’t sure what that meant. When he was just about to say something more, something flew out the window.\n\nHan Sen caught the item, and he noticed it was a stone book. He tried to open it, but it seemed to have been sealed by some sort of power.\n\n“Everything you need to know is within that book. When you have finished what I’ve asked you to do, the locks on that book will be removed. Now, it is again up to you to decide if you want to go or not,” the woman said.\n\nHan Sen looked at the stone book. He wasn’t sure if what the woman was saying was true, but he was out of options. He had no choice but to believe her. Otherwise, he’d never know the truth.\n\n“D*mn.” Still holding the stone book, Han Sen gnashed his teeth and asked, “In the legends, Sacred had a xenogeneic space called the sanctuaries. Do you know that place?”\n\n“That is the place Sacred Leader researched the immortal spirits. I’ve never been there myself, though. So, I don’t know,” the woman said.\n\nThe fact that the woman didn’t know about the sanctuaries was quite disappointing to Han Sen.\n\nHan Sen wanted to know the answers to a few more questions, but the woman said, “I will not answer any more questions of yours if you aren’t going.”\n\n“You have to tell me what the light looks like,” Han Sen said.\n\n“You will know it when you see it,” the woman said coldly.\n\nHan Sen shrugged and then flew in the direction that the woman had told him to go.\n\nAs he was surrounded by the yellow clouds, there was a limit to how much Han Sen could see. So, he made use of his Dongxuan Area to try to detect nearby objects and energies.\n\nThere was nothing notable about the direction in which he was flying. As far as he could tell, there were just more clouds. One thing that might have been different from other places within the Tianxia System, however, was the distinct lack of xenogeneics.\n\nHan Sen continued flying in the direction the woman had instructed him to go, and he didn’t deviate. And lo and behold, after three or four hours, he saw a light ahead.\n\nThe light was like the sun in the twilight hours. It was a deep red, and it looked like a big lantern on the horizon. Just as the woman said, he knew it when he saw it.\n\nWhen Han Sen found the light, it was as if the light had found him, too. It flew over towards Han Sen, enveloping him in its glow.\n\nHan Sen remembered what the woman said, and he didn’t make a peep.\n\nThe light spun around him for a while but eventually lost interest. A few minutes later, it flew away.\n\nHan Sen felt some modicum of relief. He caught up to the light, though, and he followed it from behind.\n\nThe light was pretty slow, but it also drifted back and forth. It didn’t stick to a fixed trajectory or direction. It went left, right, forward, and back.\n\nHan Sen was confused, but he still followed it.\n\nLuckily, the wandering light didn’t seem to be leading him into danger. As he flew, he still didn’t notice any nearby xenogeneics.\n\nAfter following the light for half a day, he suddenly saw a giant shadow ahead. When he peered at it a little more intently, he noticed that the shadow was actually another island. That made him happy.\n\nWhen Han Sen got a bit closer, he noticed that the island was indeed the same as the woman’s island. Even all the plant life was identical.\n\nThe light went to the island and settled down upon the grass like it was sleeping.\n\nHan Sen came down to the island, as well. As he came close, the heavy gravity dragged him down to the surface. He certainly couldn’t fly on this version of the island.\n\nThat mattered little to Han Sen, though. He walked towards the mountain at the island’s center, and it wasn’t long before he came before its foothills. There were some stone stairs carved into the familiar rocks, and so Han Sen walked all the way up them. There was no wooden house or garden on the small peak.\n\nA weird black symbol was carved into the side of the peak. He couldn’t tell what it was.\n\nHan Sen guessed that might have been the restriction of the island. If he destroyed it, then the woman might be freed."
}