{
    "chapter": 2594,
    "title": "One Eye Empty",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2594",
    "text": "“Impossible.” Meng Lie’s face changed as he saw the eyes of the woman atop Han Sen’s shield begin to glow. His face grew pale.\n\nWhen the Ghana entered the geno hall long ago, they hadn’t needed to fight in order to light a lantern. At that point in history, there were many geno lanterns that remained unlit. But that didn’t mean that the Ghana weren’t strong. Later, the Ghana alpha used Purgatory Heaven and the Shield of the Medusa’s Gaze, both of which were deified weapons, to control the world. Very few could fight them.\n\nPeople like Ancient Water God couldn’t even enter the door to the geno hall, but the Ghana alpha had fought inside the hall for a few days before she fell. That proved how strong she was.\n\nFor ordinary races, the strongest deified weapon would be their race weapon. The Ghana alpha had the Ghana’s race weapon Purgatory Heaven, but her strongest deified weapon was the Shield of the Medusa’s Gaze. Because of this weapon, she was able to control most creatures in the world and fight them.\n\nMeng Lie heard about how powerful the Shield of the Medusa’s Gaze was, but he had never seen it himself. If he had been able to choose, he would have opted to never lay eyes on the terrifying power of the Shield of the Medusa’s Gaze. And the last thing he would ever hope for would be to end up as its target.\n\n“Die!” Meng Lie roared, gnashing his teeth. He sent all his power into his gold soldier king body. A scary knife light fell with incredible power. He wanted to kill Han Sen before he activated the Shield of the Medusa’s Gaze. Meng Lie couldn’t allow that ancient weapon to fully activate.\n\nThe gold knife light was like a cosmic aurora that could break the sky and destroy the ground. It wasn’t something a mere shield could block. That scary power was everywhere. Han Sen would be killed even if he hid behind the shield.\n\nHan Sen had no other choice. He gritted his teeth and poured all of his power into the Shield of the Medusa’s Gaze. He used his power for a final gambit.\n\nThe people in the white whale were in shock. The power Meng Lie unleashed was too scary to behold. The amount of energy he had placed in his attack was enough to devastate an entire race. It was like a punishment from God that couldn’t be resisted.\n\n“Mr. Meng Lie is too strong. He earns his reputation as a deified of the Extreme King. He is much better than the deified elites of lesser races.”\n\n“Of course, our royal uncle is very special.”\n\nThe Extreme King knights were all so happy. They hoped Meng Lie’s destroying-the-sky-and-breaking-the-grou nd attack could kill Han Sen, and save them from Han Sen’s people.\n\nThe pirates and Fang Qing Yu were all scared. Even if there had been a million of them, that strike had enough power to reduce all of them to dust. They couldn’t comprehend the amount of power that was being unleashed.\n\nThe pirates had traveled around the galaxy for years, and they had never seen this sort of power before. Their legs all quivered, and they thought, “It is over… it is over… It looks like the captain is going to die here… The captain was quite nice. He didn’t mistreat us. If we end up under the Extreme King’s thumb, it’s hard to tell what will become of us. I don’t know if we will be permitted to live.”\n\nGu Qingcheng and Elysian Moon looked ill. That power was stronger than they knew.\n\nNing Yue was holding Bao’er, and she was crying. “Is he going to kill us, too? I don’t want to die!” The little red bird’s mouth continued to spew out its phoenix flames. Its fire became a sea of flames that tried to subdue the gold knife light. But the sea of fire couldn’t stop the gold knife light. The flames would explode like fireworks when the light touched them, and the light showed no sign of slowing down.\n\nYisha’s expression hardened. The Teeth Knife in her left hand swung through the air, and a space crack headed in Han Sen’s direction. A rift appeared next to Han Sen.\n\nIf Han Sen went through that rift, he could avoid Meng Lie’s wrath.\n\nBut Han Sen didn’t see the space crack. His eyes were red. They were too red. It was so scary. He stared at Meng Lie.\n\nHan Sen didn’t remain immobile because he didn’t want to escape. He simply couldn’t. All the power in Han Sen’s body was being sucked up by the Shield of the Medusa’s Gaze.\n\nThe moment the Shield of the Medusa’s Gaze lit up, Han Sen felt as if his power was a wild horse that had escaped its reins. It went thundering into the Shield of the Medusa’s Gaze.\n\nHis body seemed to have been sucked dry. The power from his four geno arts drained out of him within a second.\n\nHan Sen suddenly became emaciated. He looked like a skeleton. It was like some witch had consumed all of his blood until he was nothing but a bloodless husk. His muscles were dying, and his skin was tight against his bones. He had become a dried-up human.\n\nEven the light of the peacock soul robe dimmed. The rainbow light extinguished, and the peacock king beast soul almost died. The eyes of the woman on the Shield of the Medusa’s Gaze opened a little. It was like she was half awake and half asleep, with her heavy eyelids barely parted.\n\nAs those eyes opened, two weird purple lights emerged. They shone on the gold knife light that could destroy the universe.\n\nIn the future, onlookers would have a very difficult time describing what happened next. The strange light from the Medusa’s eyes met the terrifying gold knife light, and the knife light froze in place.It wasn’t just the gold knife light, either. Wherever that weird light shone on, everything froze. Even Meng Lie, who had previously seemed like an untouchable god. Both he and his gold lion head knife were motionless, still caught in mid-slash like a freeze-frame from a movie.\n\nThe purple light continued to shine. It wasn’t just Meng Lie beneath that weird light. The purple color was spreading so fast, and many asteroids and planets were caught within it. They were frozen. And still, the light spread. If this continued, perhaps the whole system would be frozen.\n\nBlergh!\n\nHan Sen coughed up some blood. He separated himself from the Shield of the Medusa’s Gaze. The moment Han Sen moved away from the Shield of the Medusa’s Gaze, the eyes of the weird woman on the shield shut. The weird purple light vanished.\n\nBut that region of space was still frozen in a purple hue. Meng Lie, the gold lion head knife, and the scary knife light hung in space like statues.\n\nAnd the nearby planets had once been spinning, but now they were purple and still. The scene was surreal and unsettling, something that shouldn’t have been able to exist.\n\nThe whole system looked dead. Everyone who could see this stared with open mouths. No one made a sound. The sight before them was too frightening for them to think about, and too strange to understand. They didn’t even know how to respond.\n\nMiss Mirror waved her hands, and a mirror appeared. She stepped into it and disappeared."
}