{
    "chapter": 45,
    "title": "A Thousand Arrows",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_45",
    "text": "The next morning, Han Sen entered God’s Sanctuary and saw the copper-toothed beast had become purple all over except for the tip of its tail. He was happy to know it was about to become a sacred-blood creature in a day or two.\n\nWatching the beast over and over again, Han Sen left for the Bullseye training camp. When Han Sen arrived, he met an acquaintance.\n\n\"Su Xiaoqiao!\" Han Sen was surprised to see Su Xiaoqiao, who was wiping the bows and arrows at the shooting range.\n\n\"Ass Freak, how do you know me?\" Su Xiaqiao was also surprised.\n\n\"How do I not know you? Everyone was calling Dollar ‘Doll’ because of you.\" Han Sen smiled while secretly hating Xiaoqiao. Thanks to him, Han Sen had such a strange nickname.\n\nSu Xiaoqiao was very proud, \"If it wasn’t for me, Dollar wouldn’t be as popular as he is now.\"\n\n\"Good job.\" Han Sen gave him a thumbs-up, while thinking, \"You little bastard.\"\n\n\"Brother, why did you choose to enter Bullseye?\" Su Xiaoqiao asked Han Sen.\n\n\"Because you can stand away from the creatures to reduce risks. Safety first,\" laughed Han Sen.\n\n\"Great minds think alike.\" Su Xiaqiao felt like he finally met someone who understood him. \"The only good thing about Bullseye is safety. I wouldn’t come here in a million years if it wasn’t for this. The team leader Manli looks great but she is a sadist. You know what we call her behind her back? Nazi...\"\n\nSu Xiaoqiao and Han Sen suddenly shuddered as they were talking. They turned back and saw Manli standing near them. She must have heard everything they said.\n\nHan Sen and Su Xiaoqiao were petrified. Su Xiaqiao quickly put on a smile, \"Manli, I was just teasing the new guy. In fact, you are so charming that...\"\n\n\"Use a 7.0 practice bow. You each have to shoot a thousand arrows. Don’t leave until you are finished,\" said Yang Manli coldly and turned away.\n\n\"My god! 7.0 practice bow, a thousand arrows? Why doesn’t she just kill me?\" Su Xiaoqiao's smile collapsed.\n\n\"She won’t be here anyway. She wouldn’t even know how many arrows we shoot,\" said Han Sen.\n\n\"Brother, you are too naive. Of course Nazi has thought of this. There are people who are in charge of counting arrows. You can’t shoot standing over the line. Nor can you miss the target,\" Su Xiaoqiao said in desperation.\n\n\"We will take our time then. She didn’t say when we have to finish.\" Han Sen patted Su Xiaoqiao on the shoulder.\n\nWith a strength rating of 9.1, a thousand arrows with a 7.0 practice bow could be a difficult task, but it wasn’t the end of the world. However, for Su Xiaoqiao, who only had a strength rating of 7, it was different. If he was going to shoot continuously, a hundred arrows could kill him.\n\nThe two took the practice bow and started. Standing next to Su Xiaoqiao, Han Sen was shooting at a slow pace. The other members of the Bullseye team were all gloating at them.\n\nSeveral Bullseye members carried a few bundles of practice arrows, and one of them said to Su Xiaoqiao, \"Xiaoqiao, keep practicing. We will hunt the sacred-blood creature tomorrow.\"\n\n\"Another sacred-blood creature found? When? Why didn’t I know?\" Su Xiaoqiao said with wide eyes.\n\n\"Son of Heaven’s gang found it. They couldn’t hunt it by themselves so they asked us to help. We will leave in the morning to hunt but you won’t be able to make it. A thousand arrows will take you at least three days,\" the team member said with a grin.\n\n\"Enough said. Xiaoqiao, go practice!\" yelled an angry young man, the deputy head of Bullseye.\n\nAfter the other members had left, Su Xiaoqiao begged the angry man, \"Hongtao, please ask Manli to let me go tomorrow. I will double my practice time when I come back.\"\n\n\"You think this is a farmer’s market where you can bargain? Manli said shoot a thousand arrows, so you can’t miss even one.\" Liu Hongtao gave Han Sen a hard look and said, \"And you, don’t think you can get away with anything here just because you know Qin Xuan. This is just a small lesson. Don’t let me catch you or you will regret it.\"\n\n\"Liu, you know we meant well. Please help us out.\" Su Xiaoqiao passed a pile of cash to Liu Hongtao.\n\nLiu Hongtao threw the money on the floor and rebuked Su Xiaoqiao, \"You think you can bribe me? Rules are rules. You can’t go anywhere unless you finish shooting a thousand arrows.\"\n\nLiu Hongtao turned away after his speech.\n\nHan Sen was a bit surprised and asked Su Xiaoqiao, \"Are the rules really so strict at Bullseye?\"\n\n\"Strict my ass. Liu always takes money from us,\" Su Xiaoqiao gritted his teeth and said.\n\n\"Why didn’t he this time?\" Han Sen was confused.\n\nSu Xiaoqiao looked at Han Sen and whispered, \"You better be careful now. I think Manli is very upset with you, and Liu likes Manli a lot. He must be deliberately messing with you. Or else you are supposed to still go hunting even when punished.\"\n\nHan Sen suddenly realized why Liu Hongtao had looked at him with disgust and hatred.\n\n\"This is my fault. But no worries, we can still go tomorrow.\" Han Sen patted Su Xiaoqiao on the shoulder.\n\n\"What if we can’t finish a thousand arrows?\" Su Xiaoqiao sighed and suddenly thought of something, \"Brother, are you sleeping with Qin Xuan? If it’s true, just talk to her and we can definitely go.\""
}