{
    "chapter": 2328,
    "title": "Exposing Himself",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2328",
    "text": "“Should I kill her or not?” Han Sen thought to himself.\n\nCher’s power was stronger than Han Sen had expected. His ice powers didn’t work on her very well, and when Han Sen saw that Cher was about to free herself, he knew that her escaping would result in him being exposed.\n\nBut killing Cher wouldn’t exactly make him appear less suspicious, either.\n\nThis was Night Charm Town. It wasn’t a place where people were murdered for resources like Knight’s Paradise. In this town, people were required to follow the laws established by the Extreme King. Not even a prince could randomly murder someone with proper cause.\n\nHan Sen’s eyes flashed. Cher, who was currently crushed under Han Sen, was overwhelmed with both anger and fear. She had been fully confident that her Fox Eyes would work on Han Sen, so she had been caught completely off guard when he turned the tables on her.\n\nFortunately, her own powers were rather impressive. She was stronger than Bai Yi, and she had a high resistance to ice. She couldn’t be bound easily.\n\nSeeing that Cher was about to escape the ice, Han Sen leaned over next to her ear and whispered, “Cher, do you remember Fox Queen?”\n\nWhen Cher heard this, she shivered. Her attempts to struggle away from him suddenly ceased. Soon after, though, she returned to normal, trying to fight her way free as if she hadn’t heard what Han Sen had just asked her.\n\nHan Sen knew which way the wind was blowing, so he let go of Cher and coldly said, “I am very close with Fox Queen; if that claim was untrue, then you know that I would already be a dead man. So, you had better be quiet and talk. If something happens to me, something will happen to Fox Queen, too.”\n\n“Why would I believe you?” Cher broke through the last of the ice that caked her body, but she didn’t jump away after she freed herself.\n\nHan Sen brought his mouth close to Cher and spoke the two words quietly. “Red Sleeve.”\n\nCher’s jaw went slack. Clearly, she was aware that Red Sleeve was Fox Queen.\n\nHan Sen now felt much safer. He laid down on Cher and said quietly, “I’m sorry to invade your personal space, but I’m sure you can understand my situation. Can you tell me how I might manage to get through this?”\n\n“You are Han Sen?” Cher wasn’t stupid; not many of the Foxes were. She knew what was really going on, but she just found it hard to believe.\n\nHan Sen was a Duke, and Bai Yi’s Return to Origin had failed. Han Sen had ended up killing Prince Bai Yi, then assumed the man’s identity as a disguise. He was so brave it was almost impossible to fathom.\n\nHan Sen knew that he couldn’t hide his knowledge of Fox Queen, but this was the best result he would be able to achieve, given the current circumstances.\n\nThey both had dirt on each other. Han Sen thought that a Fox wouldn’t sell him out unless they absolutely had to.\n\n“What do you say?” Han Sen smiled at Cher.\n\nMany different emotions flickered across Cher’s face. After a while, she gritted her teeth and said, “Wait for me on the bed. I am going to call the Pig lady.”\n\n“Don’t even think about it. If I was willing to do that, why would I have exposed myself?” Han Sen crushed Cher to the bed to keep her from moving.\n\nCher blushed and said, “If I don’t go, Bai Ling Shuang will notice. Do not worry; I will use a geno art to control the Pig lady. Put on your clothes and wait for me, just don’t get off the bed. Only the bed isn’t faced with a camera.”\n\n“Okay, I will take your word on it this one time.” Han Sen rolled over to the other side of the bed, grabbed his clothes, and put on his garments one by one.\n\nCher glanced at Han Sen and walked out.\n\nWhile Han Sen was pulling on his clothes, he receded into thought. When Cher came back, she brought someone who was three meters tall and had a waist that was eight feet wide. It was the Pig.\n\nBut it seemed as if the Pig lady was under a spell. Her eyes looked dull, and she listened to Cher’s every command. She fell down on the bed, and the bed made a chorus of squeaky noises.\n\nCher looked at Han Sen and murmured, “In order to make this work, I need you to make some noise.”\n\nNot long after, Cher took the Pig woman away. She came back and lay down next to Han Sen wearing only a bathrobe.\n\n“How did you disguise yourself as Prince Sixteen?” Cher asked as she lay looking at Han Sen.\n\n“That wasn’t difficult. What about you? You are so young, and you’re surrounded by the elite of the Extreme King. Your life must be hard,” Han Sen said with a broad smile.\n\n“Couldn’t you show a little gratitude? I just saved your life. If I hadn’t, you would have had to do it with that Pig…” When she realized what she was saying, Cher blushed and stopped talking.\n\n“Out of all the Foxes that I have met, you are the least shameless. You seem to be very pure, yet you’ve also managed to achieve King class. You must be quite famous among the Foxes,” Han Sen said with a smile.\n\nCher raised her red lips in a slight sneer. “Are you trying to get information out of a Fox? You are too naive.”\n\n“We are merely making a trade. You think too much.” Han Sen coughed.\n\nHan Sen was very interested in Fox Queen’s conspiracy. If a woman like Fox Queen was willing to disguise herself as a female guard, then something big had to be going down.\n\nHan Sen had intended to glean more information from Cher. She was so pure that she looked rather inexperienced. But she actually seemed smart enough to deprive him of hope.\n\nCher moved her face closer to Han Sen. She was facing him, and she was so near that she almost touched Han Sen’s nose. They could feel each other’s breath.\n\n“What are you doing? I have standards, you know,” Han Sen said with a blink.\n\n“You really are Han Sen?” Cher asked curiously, still examining him.\n\n“We are sleeping together, and still you must ask that? I feel rather hurt.” Han Sen lifted his shoulders in a light shrug.\n\nCher’s eyes looked like moons. She smiled and said, “I thought that we Foxes were very good at changing our identities, but you must be even better. You’ve disguised yourself as Extreme King’s Prince Sixteen and successfully avoided detection. Not even Fox Queen would have the courage to do what you’ve done.”\n\n“I learned a few tricks from Fox Queen that made it possible,” Han Sen said.\n\nCher’s eyes looked bright. “Are you close with her?”\n\n“Close. Very close. Fox Queen kind of wanted to marry me, but I didn’t want that to happen,” Han Sen casually said.\n\nWhen Cher heard that, her eyes widened. She didn’t believe the claim. “Liar.”\n\n“Why would I lie? Your Fox Queen’s butt has a…” Han Sen supplied some helpful descriptive details.\n\nCher looked at Han Sen as if he was a monster. A while later she said, “You and Fox Queen… That… That…”\n\n“I failed her when I turned down her proposal.” Han Sen sighed. “Now I can only make up for it by trying to help her and assuage her grief. If I can do that, I can die a happy man.”\n\n“You are going to help Fox Queen claim our treasure?” Cher felt touched as she spoke.\n\nHan Sen felt a ripple of relief pass through him; Cher was much easier to deal with than other Foxes. While she was King class and strong, she didn’t have much practical experience."
}