{
    "chapter": 39,
    "title": "Saint Paul: Part 1",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_39",
    "text": "\"Let’s talk about this another time. I have to go now, and thank you so much for all your help. I’ll buy you dinner sometime,\" said Han Sen, ready to go back.\n\nHe knew that what Qin Xuan said made sense, but he had his own plan. He wanted to get an aristocratic title before he turned 20 and went to serve, because aristocrats had certain privileges in the army and would not be sent to the front.\n\n\"Stop! Have I excused you?\" Qin Xuan stared at Han Sen fiercely.\n\n\"Stationmaster, please, that’s not my thing,\" said Han Sen bitterly.\n\n\"It’s fine if you don’t want to go.\" Qin Xuan suddenly smiled at Han Sen and said, \"If you do not go, each time you enter the teleport station, I will fight you.\"\n\nLooking at her evil smile, Han Sen’s heart sank.\n\nHe knew that Qin Xuan hadn’t tried her best at all when fighting with him in the past, because he was no match for her at the moment. Judging from her expression, he knew if he declined, he would really have a hard time in the future.\n\n\"I’ll just join Bullseye then,\" Han Sen said, depressed.\n\nQin Xuan snapped at Han Sen, \"Do you have any idea how many people in Steel Armor Shelter want to join my gang? And you just acted like I’ve asked you to take poison!\"\n\n\"Freedom is priceless, and to lose my freedom is exactly like taking poison,\" Han Sen sighed.\n\n\"Then you could die a slow death. Even if you died and became a ghost, you’d still be my ghost,\" Qin Xuan pouted and said.\n\nHan Sen knew that Qin Xuan had made up her mind, and he accepted the offer unwillingly. Feeling dejected, he left the hall.\n\nQin Xuan watched him go and was very pleased by his upset look for some strange reason. She couldn’t help but smile.\n\n\"Stationmaster, why do you have to recruit such a person to our Steel Armor Gang? He’s not worthy of being a member of Bullseye,\" a woman of the same age as Qin Xuan came out from a side door and asked after Han Sen had left.\n\n\"Manli, trust me, although this guy can be a bastard sometimes, he does have great potential in some aspects,\" Qin Xuan told Yang Manli seriously.\n\nQin Xuan had witnessed what a fast learner and diligent student Han Sen was. Repeatedly defeated by her, he didn’t go down but grew stronger and stronger. Now even she had to take him seriously. Such progress and mentality were truly amazing.\n\nQin Xuan’s opinions of Han Sen had improved a great deal, or else she wouldn’t have defended him in front of everyone.\n\nHan Sen returned to his room and teleported back home before Qin Xuan had the chance to leave God’s Sanctuary.\n\nHe was not the least interested in going to a military school. Before, it would have been a great option for him, because he could learn hyper geno arts there. Now, with Jadeskin, he didn’t have to waste his time in a military school at all.\n\nIt would be much wiser for him to spend time hunting and increasing his geno points.\n\nAs for Bullseye, Han Sen had even less interest in joining. Although as a member of Bullseye he could gain assistance from Qin Xuan’s information network to improve his chance of finding mutant and sacred-blood creatures, he would also have to share the meat hunted with the rest of her team.\n\nHan Sen decided to go hunting alone after some preparation. If Qin Xuan didn’t see him for a while, she would probably forget about the whole thing.\n\nHan Sen had wanted to buy an alpha alloy dagger with the 150 thousand he had earned, but now he had the broadsword he seized from Liu Feng,so the other was no longer necessary.\n\nThe broadsword was made of a special alloy with Z-metal, which made it very stiff. Its edge could easily cut primitive creatures open. So weapons made from this kind of alloy had always been expensive.\n\n\"Nice!\" Hen Sen touched the edge and his finger was cut immediately. Looking at the shiny edge, Han Sen loved the weapon so much he couldn’t put it down. \"It’s worth the price,\" he thought to himself.\n\nThe Han family had an alloy business before, and although it was a small factory, they had unique formulas. Their products might not be as good as this broadsword, but could also cut open the skin of some primitive creatures. So the business was quite profitable.\n\nIf it was not for those terrible family members, their company could surely be among the top three on Planet Roca. But now the company had been bought by Starry Group.\n\nHan Sen was too young back then, and to this day he still didn’t quite understand why Starry Group had to acquire their company. He knew his father’s death must have had something to do with Starry Group, but he had no ability to find out the truth, so he had to lay low.\n\n\"Son, today I have something important at work. Can you take Yan to school?\" Luo Sulan knocked on the door and asked Han Sen.\n\n\"School has started already? I did not know that. No worries Mom, I’ll take her,\" Han Sen quickly said.\n\n\"School started a few days ago, and you were in God’s Sanctuary so I didn’t want to bother you,\" said Luo Sulan.\n\n\"Which school is it?\" asked Han Sen.\n\n\"It is Saint Paul, and I used to the money you left to pay the tuition.\" Luo Sulan felt slightly uneasy, as she had spent almost all the money on Yan’s school.\n\n\"Great! Saint Paul is the best on Planet Roca except for the posh schools.\" Han Sen was very happy. He didn’t have an aristocratic title for the moment and couldn’t send Yan to a posh school, but a good private school is still much better than integrated compulsory education.\n\nAfter chatting with his mother, Han Sen took Han Yan on a maglev train to school.\n\nThe entrance of Saint Paul was almost blocked by private aircrafts, and some of them were deluxe. Almost all rich people without an aristocratic title would send their children to Saint Paul. And almost all students here were from affluent families.\n\nWalking his sister to school, Han Sen saw a middle-aged fat guy getting off an aircraft with a flirtatious woman on his side and an eight-year-old boy in his arms.\n\nHe paused, as the middle-aged fat guy happened to be his uncle, Han Lei."
}