{
    "chapter": 2900,
    "title": "Accidentally Seeing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2900",
    "text": "Han Sen thought there was too much that could not be explained. If the spirits were composed of the God Spirits Sacred Leader tried to replicate, why did the spirits have a true body that could not be exterminated?\n\nThere were some other muddy details that Han Sen couldn’t quite fit into the jigsaw puzzle. Now, Han Sen was having a hard time trying to think.\n\n“It is a shame Extreme King Alpha is dead. If he wasn’t, I could grab him and ask him about the undead. Perhaps only then I would learn the truth” Han Sen sighed.\n\nHan Sen looked at the fighters battling the undead with a conflicted expression. Although Bai Wei was not particularly outstanding, every hit she made was beneficial. Han Sen could tell Bai Wei was keeping her power in check too. She wasn’t showing all she had yet.\n\n“It looks like going to the Very High to become a silkworm aided Bai Wei a great deal. I am afraid with all these royals, Bai Wuchang could not even beat Bai Wei.” Han Sen sighed. He thought since the Very High were so strong, it had not taken much time for Bai Wei to grow so much.\n\nIf this kept going, Bai Wei could certainly become a true god.\n\nIt was a shame that Extreme King would not give whoever became a silkworm the throne. If that was not true, the Extreme King might have ended up with their first queen.\n\nThe undead was powerful. Bai Wanjie and the others fought it alone, but they were unable to defeat it. Now, with the five of them fighting it together, they were able to slay the undead.\n\n“Killed high-level undead.” The electric voice boomed through the temple.\n\nAfter killing their enemy this time, no bridge arose from the sea.\n\n“Have we made it through Starter King’s Land?” Han Sen looked out across the misty sea. He did not see any other islands around.\n\nBai Wanjie and the five people fighting the undead stayed inside the blue temple. They were practicing their geno arts and combat skills.\n\nIn the beginning, it took three people to defeat one undead. As time went by, they learned more about the undead and improved themselves. After two days, Bai Wuchang could defeat the undead alone.\n\nBoom! Boom! Boom! Another bridge appeared across the sea. Han Sen quickly understood what it meant. “It looks like an undead must be defeated solo to trigger the bridge that leads to another island.”\n\nBai Wuchang did not hesitate. He walked across the bridge.\n\nBai Lingshang and Bai Wanjie looked at each other and followed.\n\nBai Wei was going to step on the bridge when Prince Qingxia suddenly said, “My power is not enough to solo the blue temple’s undead. I am not going to keep going. You guys should be careful.”\n\n“Thank you, Brother.” Bai Wei bowed and walked across the bridge.\n\nHan Sen followed her across the bridge. Bai Wei turned around. She looked at Han Sen and said, “The next temple must be very dangerous. I suggest you do not proceed.”\n\n“Don’t you worry. I can protect myself.” Han Sen laughed.\n\nBai Wei wished to say something, but Bai Wanjie, who was in front of her, said, “Sister, you do not need to stop him. If he does not come with us, he will probably be unable to report to Father.”\n\nBai Wei was surprised. She understood something but did not say anything. She kept going.\n\nHan Sen shrugged his shoulders. He continued to follow them.\n\nBai Wanjie knew that Bai King had sent him there. Otherwise, he would have just been an outsider xenogeneic student. There was no other way to explain why he was allowed to go to the Starter King’s Land.\n\nThe few of them kept going forward. It was not long before they reached an island. This one was surprising. The island did not possess a temple. It only had an empty volcano.\n\n“Weird. Why is there no temple? Does the practice in Starter King’s Land only cover high-level enemies?” Bai Wuchang frowned.\n\n“If things were like that, there is no way so many princes and princesses would have died through the years,” Bai Wanjie said as he began ascending the stairs.\n\nEveryone followed him. They walked toward the peak. They discovered it was a circular mountain that looked like a volcano. The peak was a giant, cylindrical hole.\n\n“What is this?” Bai Wuchang stood at the edge of the mountain. He looked down with surprise.\n\nHan Sen and the others looked down too. Inside the big hole were all sorts of crystal tools. It made the whole inside of the mountain look like a giant laboratory.\n\nThere was an entrance in the center of the mountain. An egg-shaped crystal was dangling by it. It looked like some giant creature egg. It was at least 3 feet wide.\n\nThere was a girl curled up inside the crystal egg.\n\n“Wan’er…” When Han Sen saw the girl inside the crystal egg, his face changed.\n\nThe girl had blonde hair and was wearing white pajamas. She looked like she was sleeping. She looked like a blonde Wan’er.\n\nHan Sen’s heart waved like a mad sea. His thoughts were a mess. He did not understand what was going on. Why did Wan’er reside in the Extreme King’s Starter King’s Land?\n\n“What is going on here?” Han Sen subconsciously looked at Wan’er inside Destiny’s Tower. He then glanced at the lady inside the crystal.\n\nThey were the same. There was nothing that was not the same. They looked like a copy-and-paste entity.\n\n“What is inside this black egg that is below?” Bai Wuchang asked as he stared at the crystal egg. “It cannot be another high-level undead.”\n\nWhen Han Sen heard him, he was shocked. He looked at Bai Wuchang and thought, “Is this guy color blind? There’s no way he is that blind and cannot tell the difference between black and white.”\n\n“I don’t know,” Bai Lingshang said. “Maybe we can try to break this big black egg to see if there is an undead inside.”\n\nHan Sen was shocked and thought, “What is going on? Do they all see a big, black egg and not a giant crystal?”"
}