{
    "chapter": 2225,
    "title": "Extortion",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2225",
    "text": "Outside of the Ice Blue system, Night River King was in the middle of slaying a bunch of xenogeneics that were planning to invade. His face turned pale before long, and he was left gasping.\n\nAfter he was forced into the Ice Blue Knights, Night River King had been forced into the frontline ranks to be the first vanguard against any xenogeneic enclaves that wished to invade the system. This engagement, however, had a few too many xenogeneics to deal with. Even Kings like him were left exhausted after the fight, and with how it had been each and every day, he couldn’t stand how things were working out for him.\n\n“Han Sen is an asshole! If I ever get the opportunity to, I’m going to kill him.” Night River King quietly cursed his nemesis.\n\n“Who is here!” Night River King looked down a hallway due to being alerted.\n\n“You want to kill Han Sen? I will give you the chance you seek.” A man approached him with a smile.\n\n“Mister Inspector, what do you mean?” Night River King, upon seeing Edward, was surprised. It made him produce a large frown.\n\nEdward came before Night River King and said, “Han Sen took something that belongs to me, but Ice Blue Knight King and Mister White is around. As a result, I cannot go and kill him by myself. If you are of the mind to kill Han Sen, too, then we can co-operate. I will give you the exact opportunity you need to kill him.”\n\nNight River King lifted his lips and said, “You must be joking. These are the Ice Blue Knights. If you have someone you don’t dare kill, why would I take that risk? And on top of that, I am just a conscripted knight.”\n\nEdward smiled and said, “Over the next two days, I will be exploring a new system alongside Mister White and Ice Blue Knight King. I can have you sent to Planet Ice Blue, and if your kill is clean enough, I can ensure no one ever finds out you were in the area. You have to retrieve one item for me, however. After that, I can also have you work by my side. You know, Ice Blue Knight King put you out here on behalf of Han Sen. It was to please him, but you don’t deserve such treatment at all.”\n\nNight River King’s face cycled through a variety of different expressions. He looked at Edward, not sure whether or not he would used and discarded once Edward had gained what he was looking for.\n\nEdward sighed. He looked at Night River King. “You don’t have to do it, but you are already in Mister White and Ice Blue Knight King’s bad books. And now you’re rejecting me and my fix? Oh, your fate worries me so much.”\n\nNight River King’s heart kept jumping. The Ice Blue Knights had three key figures. There was Ice Blue Knight King, Edward, and Mister White.\n\nIce Blue Knight King and Mister White stood on Han Sen’s side. If Night River King offended Edward, it would be difficult for him to foresee how he would survive the duration of his service in the Ice Blue Knights. He would be treated as little more as cannon fodder. He’d be expendable.\n\n“Mister Inspector, it is not that I don’t want to kill Han Sen. In fact, I would like to skin him alive. The thing is, it’s that I actually cannot kill him. He has a very powerful shield treasure that not even my power can break,” Night River King said while lowering his head.\n\n“Yes, I have heard about that. But don’t you worry; I have a little something prepared for you.” Edward, after saying that, gave Night River King something. “Take this with you. I assure you that it will enable you to break Han Sen’s shield treasure. Without his shield, you will surely be able to kill him with ease. But make sure your kill is clean. If it isn’t, then there is no way I can assure your survival.”\n\nNight River King was holding a metal figure that was around the size of a hand. He kept wondering whether or not Edward was seeking to use him and then silence him when all was said and done.\n\nEdward seemed to know what Night River King was thinking, though, so he coldly said, “If it wasn’t for Ice Blue Knight King and Mister White keeping an eye on my people, I wouldn’t be asking this of you. But by drawing them away with me, I am giving you the only window of opportunity you are likely to get. You just have to remember to get that item for me. If you don’t, I will kill you.”\n\nNight River King gritted his teeth and bowed. “Do not worry, Inspector. If Han Sen has the item with him, then I will surely bring it back to you.”\n\n“Be prepared. In a few days, people will come to pick you up. Remember, you will only have one chance at this. Make it swift and clean, and for the love of all, do not leave a trace! If you leave incriminating evidence, no one will be there to back you up.” Edward patted Night River King on the shoulder, and he prepared his defense work.\n\n“Mister Edward, why are you asking an outsider to do this for you? What if he takes this item for himself?” The pilot of the vessel asked after Edward returned to his ship.\n\nEdward laughed and answered, “Night River King is smart. He will keep that item for himself as a trump card that will enable him to live. He will probably take it to Ice Blue Knight King and Mister White in the hopes of living.”\n\n“Then you’re still using him?” The Ice Blue Knight asked in obvious confusion.\n\n“It does not matter. He has no choice.” Edward squinted with his eyes as he spoke. “With Night River King’s suspicious personality, he will do the kill prettily. Including Han Sen, everyone in his team will die. Even Queen Bai Wei.”\n\n“Queen Bai Wei is in Han Sen’s team?” The Ice Blue Knight’s face changed, and then he immediately understood Edward. “Night River King knows he is going to be killing a queen? He knows going to Ice Blue Knight King won’t work? It will be death for him to admit the crime, so he will have to come running to you? And Ice Blue Knight King and Mister White will suffer because of Queen Bai Wei’s death? They won’t be able to take care of anything.”\n\nHan Sen’s team followed the way through Lava Valley. They had cleaned the early regions once already, so their going was quick and unhindered.\n\nBai Wei was following Han Sen, but she remained very quiet. She slowly watched Han Sen and Han Meng’er, eager to learn of their powers.\n\nBut on that trail, there was no opportunity for them to fight, and that disappointed her expectant desires.\n\nSeeing Han Sen continue to move, Bai Wei looked hesitant to speak, but after a while, she had to say, “Captain, I am leaving the group for a while.”\n\n“No, you are in my team. Listen to me: you are not allowed to go off on your own.” Han Sen did not beat around the bush.\n\nIf Bai Wei went off on her own and something bad happened to her, Han Sen and Ice Blue Knight King would be doomed. There was no chance he’d let her wander off alone.\n\n“In that case, why don’t you guys come with me?” Bai Wei said coldly.\n\n“I told you; I am the captain. We go where I say we go.” Han Sen frowned.\n\n“Go together, or I go alone. The choice is yours to make.” Bai Wei looked indifferent and just as boorish as before.\n\n“Where are you looking to go?” Seeing Bai Wei was insistent on going someplace, Han Sen at least had to ask her this.\n\n“The nest of an Undying Bird,” Bai Wei said coldly."
}