{
    "chapter": 657,
    "title": "The Holy Statue Under the Peach Tree",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_657",
    "text": "The peach forest was red, like the blush of a young lady. The place seemed to go on forever, and it was filled with the energy of youth.\n\nWhen Han Sen walked into the peach tree forest, he was quite surprised. All the peach trees had dragonflies flying around them. The pink flowers on the trees were wide open and rivers of them flowed down to the ground in harmonic beauty.\n\nThe scent of the flowers could be smelled from far away, and the sweet fragrance brought a smile to the faces of all who encountered it. It was like the scent of a young lady.\n\nThe berserk bone elephant did not care for anything in its way, and it continued to beeline straight for the forest. As it approached the eaves of the tall boughs, however, it slowed down. It didn't blusterously stomp its way through the forest as it had on its way there. It tiptoed gently and lightly around the trees, venturing as quietly as it could, as if to avoid waking up a sleeping beauty.\n\nThe berserk bone elephant's red hue started to rescind and go lighter, which surprised Han Sen and Wang Yuhang. Never before had they seen a creature revert back from a berserk-state.\n\n\"It looks like the bone elephant didn't truly become berserk. It must be some sort of ability that it possesses,\" Han Sen said, as he pondered the curious trait.\n\n\"I suppose you are correct. Should we enter?\" At the edge of the forest, Wang Yuhang looked in, but did not dare take a step forward.\n\n\"How about this, Little Uncle? You return to the shelter and wait for us. We will take a look.\" Han Sen was worried something might happen if Wang Yuhang accompanied him.\n\n\"Sure!\" Wang Yuhang quickly agreed. He turned and took off running to Devil's Shelter without looking back. Han Sen thought it odd, as he'd never seen him demonstrate such haste before.\n\nHaving thought about it some more, Han Sen understood; earlier, Wang Yuhang appeared before everyone in Devil's Shelter as a glorious savior of the people. Now, he was eager to finish the show.\n\nHan Sen wiped the cold sweat from his forehead. Wang Mengmeng's \"Little Uncle\" was a legendarily strange man – with no equal in the entire world.\n\n\"Do you want to go back and wait for me, too?\" Han Sen looked at Zero, who didn't say much. She just stepped closer to Han Sen, signifying she was keen to continue.\n\nHan Sen, without saying anything more, walked into the peach forest with Zero by his side. With the silver fox accompanying them, it was unlikely they'd suffer much trouble. If a creature were to encounter them, it would most likely run off.\n\nThe blood-red color that tainted the bone elephant's appearance had now entirely faded, with its bones turning to their original grey and white color. It was still walking incredibly slowly, as well, as if it was afraid to damage the trees. Because it was going at this pace, Han Sen and Zero could follow its passage with ease.\n\nThe peach forest was massive, and it was impossible for them to be certain of how big it was. They followed the elephant for a whole day and the environment did not change much, as vast streams of flowers continued to drape the sides of the trees and color the forest floor.\n\nThe elephant continued to tread softly, as if it was walking through a sacred place and was afraid of making it dirty.\n\nHan Sen constantly looked around, but he only saw trees and flowers for as far as his sight could reach. There didn't seem to be anything inherently special about the peach forest, from what he could tell. They hadn't seen a single other creature on their way, either.\n\nEven with the silver fox by their side, they should have still been able to see some, or notice signs of them having been in the area. The entire time, since they first entered the forest; the elephant was the only creature they had found.\n\nHan Sen activated his gene lock every now and again, using his senses to assess the surroundings and analyze whether or not there were any dangers in the vicinity. Despite his best attempts, there was nothing.\n\nThe silver fox could not discover anything, either. Quietly, it continued to lie in Zero's arms.\n\nThe moon was in the sky, and under the moonlight, the ocean of peach flowers looked even more beautiful. When a breeze danced between the trees, it rustled the flowers as petals submitted themselves to the pull of the wind. As gorgeous as it was, the entire affair seemed somewhat surreal.\n\nHan Sen and Zero both sat upon Golden Roarer. As she sat graciously between the rain of flowers and petals, Zero's pretty face graced the view as a mesmerizingly beautiful image.\n\nHan Sen could not help but pick up one of the flowers and place it in her hair. Now, she was perfect.\n\n\"Now you are even prettier.\" Han Sen looked at Zero, who almost seemed to be one with the flowers. He was not sure whether her beauty was accentuated by the flower, or if the beauty of the flowers were accentuated by her presence.\n\nZero, who had always appeared emotionless, started to look red in the cheeks. This made her even prettier, like some fairy that lived amidst the peach flower trees.\n\nThe bone elephant, by this point, had been wandering through the forest for a few days now. Just when Han Sen started to feel lost in the seemingly endless peach forest, he suddenly saw a giant peach tree up ahead. The trunk of the tree was bigger than the rest, leading upwards into the heavens. The flowers that graced and decorated its body spread out at the top like stars in the sky.\n\nThe bone elephant seemed to be heading towards that tree.\n\n\"What is this strangely big peach tree?\" Han Sen observed the peach tree from afar and couldn't believe its size.\n\nHe did not sense any danger and neither did the silver fox. All the silver fox did was stare at the peach tree, and all Han Sen could do was wonder what it was thinking about.\n\nSince they were here already, Han Sen wanted to see what the elephant wanted. Han Sen followed the elephant but stayed a safe distance away from it, not daring to get too close.\n\nThe giant bone elephant was heading straight for the perplexingly huge peach tree. As it approached, the massive elephant didn't look so big anymore.\n\nThe elephant walked beneath the boughs of the tree gently and knelt. Then, it kowtowed before the tree, lowering its head as if it was praying before it.\n\nHan Sen was frozen. He did not believe that a super creature like this, a monstrous elephant no less, would pray in front of a tree. It was unbelievable.\n\n\"What is this strange peach tree? Does something more powerful than a super creature even exist? Why would the elephant adore the tree and show so much respect?\" Han Sen was puzzled. He watched the bone elephant kowtow before the tree for a very long time.\n\nBut what happened next was even more unnerving.\n\nUnder the moonlight, the bone elephant sat beside the tree in a human pose. With all the flowers flying around it, it appeared to be meditating.\n\nWith the forest lit with the moonlight, and the flowers and petals continuing to skate the breeze, the bone elephant's body started to resemble the flowers from the peach tree. Then, it started glowing.\n\nThe grey and white bones now looked like jade crystals, which seem to exude a holy light of some sort.\n\nEven the red eyes of the elephant seemed to fade away, and it didn't seem as if it wanted to kill anything anymore.\n\nThe whole bone elephant was like a sacred buddha beneath the peach tree, with a halo of divine light coming from it.\n\n\"What is going on here?\" The longer Han Sen watched, the more confused he became."
}