{
    "chapter": 2295,
    "title": "The Extreme King’s Secret",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2295",
    "text": "Han Sen looked at that man, who was similar to his age. He coughed awkwardly and hesitantly asked, “Um, so, what should I call you?”\n\nIn the past, Han Sen had received a secret Xuan Men skill from the man. But the man said he wasn’t going to take any students. And Han Sen was also able to obtain Dongxuan Zi’s legacy. He didn’t know which of the two was a more important figure.\n\nThe man laughed and said, “Names are merely symbols. When someone practices as much as I have, they’ve already given such titles up. You should just keep on calling me Mister White, to make sure that my identity within the Extreme King doesn’t get exposed.”\n\n“You are going back to the Extreme King?” Han Sen asked with surprise.\n\nMister White smiled and said, “The Extreme King isn’t some scary hole for beasts to fester in. There are many resources to obtain. To be fair, it is a fine place to continue with one’s practice. Why wouldn’t I go back?”\n\n“Then how are you going to explain what happened here?” Han Sen asked, holding up the little box.\n\nCrime was dead, and Mister White had given the box to Han Sen. Han Sen was afraid that if he returned, he would be unable to report to Prince Fourteen.\n\n“Everything will work itself out, if given the time. Use your heart. Think, hear, and see. Hold onto everything you can in this world. There is a solution to each and every woe.” After that, Mister White gave Han Sen a card. “This is what I have been thinking about over all these years. You can take a look, but remember: do not put the stock of your belief too deeply into anything. You still need to form your own opinions on things in this life. A portion of the real Xuan Men requires one to practice with the faith of their own heart. I have no time to take care of it. My Xuan Men legacy has probably come to an end on this day. You count as half of the Xuan Men members. I hope that in the future, you will find a way to continue the teachings of the Xuan Men and pass on my techniques. You don’t need to ask anyone to join the Xuan Men formally, but the Xuan Men will be lucky enough just to have one or two out there that have really devoted themselves to the learnings.”\n\nHan Sen did not reject the plea. He gladly accepted the card he was given. He knew Mister White wasn’t too personally invested in all of this; otherwise, he wouldn’t have given Han Sen Xuantian’s secret skill before.\n\nThere were many religions and parties working in the world, but most religions only taught a person what to do and what to believe in. Only Xuan Men taught a person how to explore and find their own understanding of the world, their own connection within the workings of the universe.\n\nSo, it would be very difficult for the Xuan Men to become famous. It wasn’t explicitly defined, so it couldn’t compete on the same wavelength as other teachings and religions. That was because this teaching confused people. Most people wanted to be comforted. They wanted something to guide them through the hardships of life.\n\nBut Xuan Men was about having to think about things yourself. You had to take charge of your own fate and explore the unknown. The future was full of unknowns and variables. It was tough. People that didn’t have the required intelligence or endurance could never make it through. So, it wasn’t beyond belief that Xuan Men fell into oblivion. The road of Xuan Men was not one that many would willingly choose.\n\nAfter Mister White spoke, he looked at the little box in Han Sen’s hand. He said, “If my assumptions about the box are correct, then it doesn’t actually contain the Sacred Leader’s treasure. It is just a red herring. The real treasure still resides someplace in Holy Town. But our combined strength still isn’t enough to explore all of that town’s secrets. When we have both become deified, we can return and resume exploration of the town.”\n\n“Mister White, what is the picture upon my back?” Han Sen still felt nervous when he thought about that painting. It was way too weird.\n\nMister White thought for a moment, then said, “Ancient Blood Dragon Lady’s blood was used as ink. A picture was drawn upon your back. I couldn’t see the picture, and so I can’t make a sound assertion. But do not worry, as I have made some calculations of the future on your behalf. Following a terrible incident, there were still some good fortunes to be had. Whatever that picture was, it wasn’t a bad thing.”\n\n“Good fortune following something terrible? That means something terrible is going to happen!” Han Sen was shocked.\n\nMister White laughed and said, “You’re in for a rough ride.”\n\n“It would be nice if you didn’t tell me these things so bluntly.” Han Sen gave a wry smile.\n\nMister White quietly said, “When you follow Yisha back to Narrow Moon, you should be prepared. I believe that the Extreme King will eventually summon you to their ruler’s kingdom.”\n\nHan Sen was curious, so he had to ask, “Mister White, how did you end up becoming part of the Extreme King?”\n\nMister White quietly said, “I disguised myself as a hybrid of the Extreme King so I could stay among them. I was drawn to their resources, but I also learned something very interesting there. I stayed so I could find out more about it.”\n\n“What was it?” Han Sen asked again.\n\n“We humans have the Extreme King’s blood pulse gene. Although it is only a small smidgen of the stuff, it does exist. And that is how I was able to successfully pass myself off as one of the Extreme King without being discovered,” Mister White said.\n\n“I guessed as much.” Han Sen nodded. He had considered this possibility before, and if Mister White had followed the same line of thought, there was no reason to believe he was incorrect.\n\nMister White continued to say, “When the Extreme King become King class, they can awaken their king body. The king bodies are very similar to the super god bodies we have in the sanctuaries. There’s one primary difference, however. Our super god bodies are independent, while their king bodies are not independent.”\n\n“What do you mean?” Han Sen didn’t understand.\n\nMister White groaned and went on to explain, “What I mean to say is that our super god bodies are a part of us. Their king bodies seem to have a connection with the outside world and some mysterious power. I am still investigating it. There are so many questions I have been unable to find answers for. I cannot explain everything.”\n\nAfter chatting with Han Sen, Mister White said, “I should go. If you head left when you leave, you should soon come across Yisha.”\n\nMister White left, but Han Sen didn’t go after Yisha just yet. He walked over to the skeleton sitting in the command chair of the white whale. He took off the clothes that were on the skeleton, and then, he put the skeleton in a box. He planned on finding a good place to bury the man when he returned.\n\nIt was a crystallizer. It was like someone of the same race.\n\nAfter thoroughly cleaning the pieces of clothing, Han Sen put them on. He put the transparent eyepatch on his head, and he felt as if his thoughts were spreading. His body and his vision expanded.\n\nThat feeling could not be explained. It was like the whale was becoming a part of his body. Waves of information rolled through eyepatch and were downloaded into his mind.\n\nTo put it simply, Han Sen could now use his mind to control the white whale. Piloting the machine was as simple as using his own body.\n\nHan Sen guided the big white whale to the left. And there he found Yisha.\n\nYisha was swimming through the sea. She saw the big whale and surged towards it. Han Sen quickly jumped out of it to prevent any misunderstandings.\n\n“My Queen, where is Fox Queen?” Han Sen asked.\n\nYisha shook her head. “She escaped.”\n\n“Then we should get out of here, too. I got the item from Holy Town. Let’s leave now.” Han Sen then piloted the white whale out of the holy spirit sea with Yisha.\n\nWhen they reached the maze, Han Sen put away the whale.\n\nThe enormous whale really was just like the beetle. It could shrink with its space technology. It shrank until it disappeared into the eyepatch. It was like a little whale placed inside a bottle, and it looked magical."
}