{
    "chapter": 1333,
    "title": "Free Spirit Geno Points",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1333",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nInside the ninth spirit base, a few spirits were discussing amongst themselves.\n\n“Six-Arm, did you hear about the human and his Super Spank?”\n\n“What a silly question! Of course I have; it destroyed both Ruin Emperor and No God Emperor. The human has been expanding the reach of his territory following that, hasn’t he?”\n\n“I wonder what powers he practiced to be able to do what he did.”\n\n“I have heard some spirits have tried to resist him and have refused to pledge their allegiance to the man when he came to their shelters. Needless to say, they were quickly struck down. He’s merciless.”\n\n“If it goes on like this, he’ll soon end up claiming the entirety of the Third God’s Sanctuary.”\n\n“You worry far too much, far too soon. It won’t be as easy for him as he thinks. He is a human, and those who accompany him are spirits and creatures. He treats them well, but when he claims a shelter, the spirit that previously owned the place is put under a contract with one of his close allies.”\n\n“There is no such thing as an invincible foe; powers have a limit. There must be some way we can fight back and break him. Undead Emperor and The King still haven’t tried their hands yet. Undead Emperor never dies, and The King has an incredible amount of power, or at least he did, last we saw him. If he had ten gene locks open, he might be able to win.”\n\n“Don’t jump the gun just yet. I’m sure it will still take The King some time before he opens his tenth gene lock.”\n\n“You and I both know The King is vastly different than most spirits. He is delightfully unpredictable, and it would not surprise me if he already had opened his tenth gene lock.”\n\nAs they spoke, a new island appeared at the spirit base.\n\nThe king spirits looked over to see who was coming, and it was the person they had just been discussing: Han Sen. Of course, they wouldn’t recognize him as such.\n\nThe king spirits drove their island towards Han Sen and asked him, “The King, have you heard about the human?”\n\nHan Sen took a moment before responding, thinking to himself, “Well, duh. That’s me, you numpties!”\n\nOf course, he was far politer to them than that when he spoke. And wanting to have some fun, he smiled and told them, “That is why I am here. I need to open my tenth gene lock as soon as possible, so I can kill him.”\n\nThe spirits were enthusiastic, hearing this. They immediately said, “You can break Super Spank?”\n\n“I have Skill Negation. To fight and destroy the boy, all I need is my tenth gene lock to be open,” Han Sen said.\n\n“How do you plan on opening it? You can’t take too long!” a king spirit asked.\n\n“I need to fight to open it, and I need all sorts of spirit geno points,” Han Sen feigned.\n\n“I have water element! I can give you those points so you can kill the human,” one king spirit offered.\n\n“Yeah, I do need some. It would be wonderful to receive some of those!” Han Sen was thrilled, for he had played them like a fiddle. This was exactly what he had come to do, and they had fallen for his bait, hook, line, and sinker.\n\nIt was normally difficult to gather king spirit geno points, and he could only receive one point for each kill.\n\nPlus, the last time he had come here, king spirits tended to avoid him. They didn’t like his pompous attitude, and neither did they like the fact he’d always one-hit kill them. Now, they thought they needed him, so their tunes had changed.\n\nKing spirits began to line up, one after each other. They were all dying to give him their geno points so he could challenge Han Sen. And the offerings weren’t measly, either. They often gave more than just a handful.\n\nThis was the ninth spirit base, so the king spirits around often possessed nine hundred geno points. Maxing out the figure to one hundred would not be too difficult for him.\n\n“I have thunder geno points! I will give you as many as you need, but please kill the human.”\n\n“Me, too!”\n\nThe queue was a messy one, as spirits impatiently wished to provide The King all the geno points they could offer.\n\n“I will take your earth geno points. There is no need for more fire. But I also need someone to help me practice in combat.”\n\nAs Han Sen watched his king spirit geno point tally steadily increase, he was exuberantly happy. Every now and again, Han Sen came to the spirit base to collect a few points where he could and practice combat.\n\nHe had never been beaten, for he utterly annihilated all his challengers with the greatest of ease. It was for this particular reason the spirits believed The King would be the person to beat Han Sen.\n\nAnd before long, his king spirit geno points were maxing out, one after each other, element after element.\n\nHan Sen was now able to maximize his efficiency with wind, fire, thunder, and lightning. He wasn’t as effective with them as he would be if he was a professional that trained with one element exclusively, but he was nothing to laugh at.\n\nThe reason Han Sen wanted to collect and better his elemental powers so much, though, was because of his desire to hammer out new, complex hyper geno arts. And that was what was great about humanity.\n\nHan Sen was in a fine, cheery mood, but the spirits around weren’t. They had no idea Han Sen was The King and The King was Han Sen.\n\nHe initially feared encountering Sky King or the lady with Serpent Throne, but fortunately for him, they did not show up. If they did, he believed they could expose him. They had seen Han Sen don the appearance of The King when he activated super king spirit mode.\n\nThat being said, they had ten gene locks open. And once Han Sen’s super king spirit mode opened its tenth gene lock, the chance of having an awkward encounter with them was far higher.\n\nAs long as he kept away from them, and they could not see The King’s appearance, Han Sen wagered he’d be fine.\n\nHan Sen hoped they had never even heard of The King, but that might have been unlikely. At the very least, he hoped they didn’t like spending time in the spirit base.\n\nHe didn’t think many people would believe them, though, even if they did try to expose The King as being Han Sen. It was a stretch to believe, and it’d be his word against theirs.\n\nPlus, it wasn’t as if they could challenge him. He had maxed out his geno points, too."
}