{
    "chapter": 1858,
    "title": "Bao’er Enters Kindergarten",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1858",
    "text": "When they emerged from the mountain, it didn’t seem as if anything had been affected by the events that occurred inside. The landscape was the same as it was before they entered.\n\nBack in the base, Black Steel took Captain Wood to an airship where he could heal and recover.\n\nThe people in the base had lost their marks. Han Sen asked Little Angel and Zero what things were like after he left, and he was surprised to learn that a mark had appeared on every single person in the base other than Little Angel and Zero.\n\nWith the crisis having come to an end, the day-to-day routine of the base returned to normal. It had been a rough period of time, though, and the base had been dealt quite a blow. There were only a dozen Barons remaining, and one Viscount. They would need more manpower for the future, that much was certain.\n\nHan Sen did not have the time to recruit right now, though. And at the moment, he was more concerned about how he might cook up and eat the small Sun Raven.\n\nHe tried cooking and grilling the bird, but the meat was like steel. It certainly wasn’t edible in its current condition.\n\nHan Sen took the Sun Raven back to the sanctuary and nothing happened. It was still not edible, so he decided to put it into storage for the moment.\n\n“This is Bao’er’s first day in kindergarten. We have to go and accompany her,” Ji Yanran said to Han Sen.\n\n“Sure. Aw, my cutey-pie is going to kindergarten!” Han Sen picked up Bao’er.\n\nBao’er had grown up a lot, and she looked like an average three-year-old now.\n\n“Dad, I want to stay with you! I don’t want to go to school.” Bao’er looked troubled.\n\n“It will be hard for you to join me where I am right now. It’s not a good place. When things get better, though, I will bring you with me. But for now, you should go to school,” Han Sen said, encouraging Bao’er.\n\nThey moved to be closer to the school. Littleflower had been kidnapped by Old Cat, so Ji Yanran was focusing her maternal efforts on Bao’er instead.\n\nAfter the formalities were conducted, Bao’er was left to her own devices in the kindergarten. Han Sen and Ji Yanran did not go straight home, and instead, they walked around for a while.\n\n“Han Sen, I miss Littleflower.” Ji Yanran’s voice was quiet.\n\n“Me, too. All of this is because of that blasted Old Cat. But don’t worry, Littleflower is fine there. Old Cat sent me some videos, remember?” Han Sen tried comforting her.\n\nOnce in a while, they’d receive a new video of Littleflower. It must have been Old Cat who was sending them, but he never showed up himself.\n\n“Knowing Littleflower is fine is okay and all, but I miss having him right next to me. It’s like there’s something missing in me, when he’s not here.” Ji Yanran was still sad.\n\n“I will bring Littleflower home and skin that Old Cat, as soon as I am able to.” Han Sen gritted his teeth as he spoke.\n\nHan Sen changed his tone and said, “How about we make a little Littleflower? When Littleflower comes back, he’ll have a sibling. How about we make a few, so this place is more crowded?”\n\n“I don’t want that many. I am not a breeding pig.” Ji Yanran looked very angry.\n\n“Where did I find such a beautiful pig?” Han Sen laughed and picked her up.\n\n“What are you doing? We’re out in public.” Ji Yanran growled.\n\n“You are my wife. I can hug you, can’t I? I don’t care what others think of us.”\n\nIn the kindergarten, Bao’er was sitting on a small chair. She held her jaw, looking miserable and bored.\n\n“Bao’er, why aren’t you playing with your classmates? Are you sick?” A woman teacher crouched down next to her and stroked her head as she spoke.\n\n“I don’t like those games. They are boring.” Bao’er blinked.\n\n“How about I teach you how to sing?” the teacher asked.\n\n“What song?” Bao’er asked the teacher.\n\nThe teacher clapped her hands and acted all cute. She said, “Follow along with what I sing! I picked up a coin on the road…”\n\n“Teacher, how old are you?” Bao’er asked, looking at her.\n\n“Twenty-four. What about it?” The teacher looked at Bao’er strangely, unsure why she had been asked that question. “You are so old, and yet you act cute and sing stupid songs. Poor you.” Bao’er sighed.\n\nThe teacher’s face twitched, as she was taken aback. She held back the urge to smack Bao’er on the head, and simply said, “I… am still young. Haha!”\n\n“Twenty-four is very old. Women like you are prone to say they are two years younger than they actually are, too. So, you are at least twenty-five. Perhaps almost thirty. I suppose you still don’t even have a boyfriend yet. That is so sad. You don’t have a boyfriend at that age, and you have to act all cute in the kindergarten. When you’re off work, I bet you go shopping to buy pointless things and make yourself feel better about yourself.” Bao’er looked straight at her, and went on to say, “But on top of that, your wages are probably low. I am afraid you can only buy knock-off products. If you went to a decent brand store, you could probably only afford the cheapest items, and ask for the biggest box and bag to carry it around on the streets, trying to prove to others that you exist.”\n\n“This d*mn kid!” The teacher’s face went dark, and her face twitched repeatedly. She forced a smile. “It is… not… like… that…”\n\nThe saddest thing was that Bao’er was correct. And it made her feel extremely sad.\n\n“Teacher, I think you are very good at gambling,” Bao’er said.\n\n“No, gambling is bad! Why would I do that? Haha…” The teacher’s face twitched, and her smile was terribly forced.\n\n“Your appearance is fair enough, but I bet at home, all you do is smoke and play mahjong. I bet the place is a dirty pigsty, too. Clothes scattered everywhere, with dirty plates molding in the sink for days.” Bao’er kept on talking.\n\n“This d*mn kid! D*mn kid!” The teacher felt as if she was about to go insane with rage.\n\nBao’er’s eyes glanced at the woman, her eyes as thin and conniving as a con artist’s. Before the teacher ran off, Bao’er opened a bag and pulled out a box.\n\n“Teacher, do you know what this is?” Bao’er shook the box.\n\n“This… this… is the legendary lipstick, number twenty-nine from Planet Doris! How could you have it?” The female teacher’s eyes widened as she looked at it in amazement.\n\n“You cannot afford it, but you can tell whether it is real or fake, right?” Bao’er threw it at her.\n\nThe teacher caught it and looked at it as if it was a million-dollar antique.\n\n“It’s real!” The teacher opened it with shiny eyes.\n\n“Teacher, how about we gamble? If you lose, give me ten dollars. If I lose, I give you this lipstick.” Bao’er pulled out a pair of dice and smiled.\n\n“I can’t…” The teacher receded into thought.\n\n“Never mind, then. I don’t like this lipstick, and it is a waste. Now I have to keep on holding it.” Bao’er sighed, and motioned for the teacher to give it back.\n\n“Hang on.” The teacher picked Bao’er up and carried her swiftly to a storage room. She looked around like a burglar, then closed the door.\n\nOne hour later, the storage room was filled with the sound of crying. A voice was heard, saying, “Leave me those ten dollars, please! Or at least leave me enough for a meal! I need it for the next two weeks!”"
}