{
    "chapter": 955,
    "title": "The Strongest Skill",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_955",
    "text": "Odin's Eye could expose a target's weakest point, and it was not like the Falsified-Sky Sutra. Han Sen had his own method of evaluating his opponents, though, through his Dongxuan Sutra. He used it trace his foe's attacks and effectively block each one.\n\nFighting Liu Meng was not easy. He was around the same level as Han Sen, and he was exceptionally talented. Since he was unable to break through Liu Meng's defense, Han Sen knew victory would not come easy when it was his turn to attack.\n\nDespite the underlying complexities of each fighter, the fight was simple to watch. When one attacked, the other blocked with absolute perfection and vice versa. Right now, it was Han Sen's turn to defend, and after a half hour long barrage of attacks, Liu Meng could not damage his opponent in the slightest.\n\n\"I have heard he has learnt Heavenly Go from the Huangfu family. I see now that it is true.\" Green frowned.\n\nHan Sen blocked every one of Liu Meng's attacks, despite their power. The moves Liu Meng performed against Han Sen had been taught to him by a demigod, and under the effect of Odin's Eye, they were executed flawlessly.\n\nHe could use any skill perfectly, as a matter of fact. Whether it was a righteous skill or an evil one, Liu Meng could use it.\n\nHalf an hour later, the battlers switched and Han Sen was the one to start attacking. But just like before, he was unable to overcome Odin's Eye.\n\nBy now, they had been gone a long time. The other party-goers, noticing their absence, wandered around in search of them.\n\nOne person, seeing that the light in the training room was on, curiously peeked inside and found them.\n\nThe news of this fight spread like wildfire, and people came in droves to watch.\n\nOne would attack and the other would defend. Their fighting skills were incredible, but it shocked the onlookers to see Liu Meng unable to penetrate Han Sen's defense.\n\nHan Sen's fists, when he attacked, came in simple. It was Han Sen's signature skill, Sonic-Thunder Punch. It wasn't the same-old-same-old, however. Han Sen was switching up his formation a lot, and that had a knock-on effect to the display of his skill.\n\nStill, it was not enough to damage Liu Meng.\n\nBoth of them swapped between attack and defense many times, and a decisive victor seemed impossible to decide.\n\nCompared to the ferocity of their initial fighting, though, things started to change. They had slowed down in fatigue, but neither was tired enough to drop their guard.\n\nThe audience had been there a long time now, too. Their excitement had long since depleted, and a few people had even gone to sleep.\n\nAfter five hours of battling, there had been no progress. Annie's butt had gotten numb.\n\n\"I have already prepared rooms for the guests. Come with me,\" the housekeeper announced.\n\n\"Oh, thank heavens.\" People had grown tired of watching them fight.\n\nMost went off with the housekeeper the instant he appeared, but quite a few stayed. A few hours later, that changed. After more and more people left, only Annie remained.\n\nThey may as well have been shooting free throws in basketball, except neither of them had scored a point the entire time. The initially enthralling spectacle of their combat had long since lost its excitement, and the two were a mind-numbing bore to observe now.\n\nAnd after all that time had elapsed, neither had been able to inflict the slightest damage to the other. Their defenses were impenetrable.\n\nHan Sen and Liu Meng, by this point, were gasping and sweating. Their exhaustion had slowed down their fight.\n\nHan Sen's fist, which once gleamed like suns of electricity, only produced minor sparks. Liu Meng only had his bare fists left to fight with.\n\nPang! Pang!\n\nTheir knuckles collided with each other, shaking off droplets of sweat as they coursed through the air.\n\nIt was midnight by now, and still, the fight limped on. Soon after, their movements were twisted and neither of the two could stand upright.\n\nNeither of them wanted to concede, though, and their will was all that kept them going.\n\nTheir attacks, being much weaker than before, were easier to block.\n\n\"That Taia sword is mine!\" Han Sen declared.\n\nLiu Meng's body was extremely fatigued, and he had exited Odin's Eye a long time ago.\n\nLiu Meng, unable to dodge Han Sen's next attack, was thrown to the ground.\n\nWith an opening before him, Han Sen climbed on top and repeatedly punched Liu Meng in the face.\n\n\"No, I'm going to win!\" Liu Meng managed to get Han Sen off of him. Kicking him away, it was his turn to mount Han Sen and punch his face in.\n\nThe once delicate exhibition of combat by two highly-trained individuals had swiftly turned into a drunken bar brawl.\n\n\"Are you guys done?\" Annie could not watch anymore, and so she stood up and left.\n\nShe knew that with both of their stamina being what it was, neither would end up dealing considerable amounts of damage to the other. It was practically over.\n\nWith Lan Te's housekeeper there to keep an eye on the proceedings, she knew everything would be all right after she left.\n\n\"Friend, I don't think our bet is going to present the results either of us want,\" Zhuo Donglai said.\n\n\"Han Sen should be proud of his ability to fight with my grandson like this.\" While what Green said was graceful, he was sweating on the inside. He did not expect Han Sen to be able to fight Liu Meng to this point.\n\n\"I'm going to rest. I have no interest watching kids quarrel on the ground,\" Zhuo Donglai said.\n\n\"Walk with me.\" Green left.\n\nIn the training room, both were writhing on the ground. They were sopping wet as if they had both been for a swim.\n\n\"I have a skill I have not used yet. Had I used it, I would have won a long time ago.\"\n\n\"I have a skill that's more powerful than your skill. It's super-secret, but you'd have lost immediately, had I used it.\"\n\n\"I have a skill that would kick your skill's butt.\"\n\n\"I have a skill that is so so so so so much more powerful than your skill. It's the strongest skill, and I could kill you with ease.\"\n\nThey were both on the ground, and the only thing that seemed to fight now were their mouths."
}