{
    "chapter": 1956,
    "title": "Galaxy Sand",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1956",
    "text": "Clearly, the Meka Battle King and Clear Sea King had their sights on Little Seven. Han Sen was wondering if he should back out now, but as he was considering his options, a few people came out of the house. It was Speechless and the other Buddhas.\n\nHan Sen did not see Clear Sea King; it was just the young Buddha men and women. Han Sen’s heart jumped.\n\nHan Sen followed them and turned on his Dongxuan Aura. He didn’t put a lot of effort into hiding himself, as Speechless and the others didn’t seem to be too paranoid. They were just walking around and chatting casually amongst each other, not suspecting they were being followed.\n\nBut Han Sen followed them for half a day without learning a single useful nugget of information. Their chatter was standard fare. Just as he was going to give it up, though, a Buddha man said, “What is the master thinking? Why would he swap Galaxy Sand for those Meka babies?”\n\nHan Sen was surprised by this. He had heard of Galaxy Sand before. It was a famous treasure belonging to the Buddha, primarily.\n\nGalaxy Sand was not really sand. They were the tears of a King class xenogeneic called Galaxy Dragon. Each teardrop would become Galaxy Sand, and it was a rare treasure.\n\nGalaxy Sand possessed an impressive amount of energy. King class creatures that refined Galaxy Sand received many benefits. Low level creatures that used it would level straight immediately.\n\nClear Sea King was swapping it for Meka babies. It was a lot to give up, so he must have been doing it for something even bigger.\n\n“Shush.” Another of the Buddha’s stopped him from talking. He then lowered his voice and said, “Don’t talk about it. This is where the Meka live; we cannot let them know about the trade.”\n\n“What are we afraid of? This is the Battle King’s territory, and he is the one selling us the goods. What can they say about it?” The Buddha lifted his lips, but he didn’t look like he was going to push the topic too much further.\n\nSpeechless Lady frowned and said, “Just be careful. Let’s stop talking.”\n\nSpeechless and the others walked around, and then they headed back to Battle King’s house. Han Sen thought he wouldn’t learn anything more useful than that, but Speechless received a message. Then, she told the other Buddhas, “Buddha King has asked me to return. You guys go ahead, and I’ll go find out what’s going on.”\n\n“Why don’t we go with you?” a Buddha said.\n\n“It’s fine.” Speechless shook her head and then left.\n\nHan Sen followed her. He could not fight Clear Sea King, but Speechless was just a Viscount. If he had to, he could take her.\n\nHan Sen planned to capture her and ask her why Clear Sea King was snapping up the Meka babies.\n\nSpeechless walked alone as she headed towards Battle King’s house. When she turned one particular corner, however, she frowned. A man that looked like a Buddha, wearing gold armor, appeared in front of her. Something seemed odd about him, but she couldn’t quite tell what.\n\n“I am Speechless, the Buddha Lady of the Buddha. Who are you? And why are you blocking my way?” Speechless Buddha Lady was being careful, and she watched the man closely as she spoke.\n\nShe recognized Han Sen’s armor. It was the man who owned Little Seven.\n\nHan Sen didn’t say a word, and he simply threw his hand forward to grab her.\n\nSpeechless Lady saw the hand get bigger in her vision. It was like it was consuming the entirety of space. It felt as if she had nowhere to run, and it was now she realized she had bumped into an elite.\n\nSpeechless’s Buddha Light burst out. She summoned a Buddha sword. When it came to strike Han Sen, she spoke the Buddha catchphrase.\n\nThe distance to the Battle King’s house was two kilometers, so her cries would reach Clear Sea King. With his power, he could definitely come and save her.\n\nBut when she opened her mouth, she unleashed a power minus its sound. It was like an empty sonic blast.\n\nSpeechless’ face changed. Before she could react, Han Sen had grabbed her Buddha sword. Then, he used his finger to fire a coin. It landed on her chest.\n\nSpeechless suddenly felt so heavy. She ended up dropping to her knees on the ground. She braced herself with her hands, though, so she wasn’t completely flattened out.\n\nHan Sen laid the Buddha sword across Speechless’s neck, coldly telling her, “I will ask, and you will answer. If you don’t, I will cut your head off.”\n\nSpeechless was putting all her strength into keeping herself from collapsing. The scary power from the coin made it feel as if her chest was going to explode. Pain radiated across her torso.\n\n“Who are you? Don’t you know my Clear Sea King and the Meka’s Battle King are nearby? If you kill me, you’ll be joining me soon,” Speechless said, as if she was holding the ground at bay.\n\n“I don’t know if I’ll be dead, but you will be for sure. That is, if you refuse to answer my questions. Why are you buying up the Meka?” Han Sen asked.\n\nSpeechless didn’t answer, and it seemed as if it was a secret she willing to take to the grave.\n\nHan Sen swung the Buddha sword and cut open her armor. Her skin was revealed.\n\n“What are you doing?” Speechless’ face changed.\n\n“Don’t worry, I’m not interested in women like you. If you don’t answer me, though, I will strip you completely. And you can prance on down the street naked, so everyone can see you clearly. Only after will I cut your head off.”\n\nHan Sen then went on to say, “I am an impatient man, though, so I will ask you one more time. Why are you buying the Meka?”\n\nSpeechless’ face remained unchanged. When she didn’t say, Han Sen cut the lower part of her armor off. He grabbed her by the scalp and started to drag her.\n\n“We are buying the Meka to fix a deified weapon!” Speechless was shocked. She couldn’t think anymore.\n\n“What deified weapon? And how does it get fixed?” Han Sen asked.\n\n“I don’t know! I have only heard a bit about it, but I know it’s a knife. Only Clear Sea King knows the specifics,” Speechless quickly said.\n\n“Ugh, you don’t know anything. Why would I need you?” Han Sen looked at Speechless without sympathy.\n\n“If you let me go, I will tell you anything you wish to know! If you let me go and gather the information, I will surely not disappoint you!” Speechless said.\n\n“I am giving you one last chance. If you still can’t answer for me right here, enjoy performing on the streets,” Han Sen answered, ignoring her plea. “Where is the Galaxy Sand you have stored to purchase the Meka? Don’t tell me it’s in Clear Sea King’s pockets!”\n\n“But it really is with him…” Before Speechless finished, Han Sen grabbed her head again and dragged her across the street. Speechless* face changed and she shouted, “It really is on him! But I have a way to get it for you.”"
}