{
    "chapter": 3047,
    "title": "Crown Prince Qin Bai",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3047",
    "text": "“Mister Crown Prince, I am sorry I was too late to save you. I should die.” A very sharp voice, which did not sound like a man or a woman, was heard. Suddenly, a dozen shadows appeared. They all kneeled in front of the white-clothed young. The leader of the regiment apologized profusely.\n\n“Useless slaves!” the white-clothed young man angrily yelled. “If Han Sen had not saved me, I would have been turned into charcoal by that woman. You guys are useless.”\n\n“Yes. We deserve to die.” The dozen people did not dare say anything else. They merely continued to apologize over and over upon the ground.\n\n“What the hell? Are they filming a TV show?” Han Sen was frozen as he watched the scene. Although the universe had an empirical system in place, it should not have been as ridiculous as this.\n\nThe white-clothed young man ignored the men and said to Han Sen, “Han Sen, you saved me. Why don’t you come back to my palace? I will treat you nicely.” He looked happy as he spoke.\n\n“Um, can I ask which kingdom you come from?” Han Sen looked at the white-clothed young man with a complicated expression.\n\n“This is the land of the Big Qin Kingdom, and I am Big Qin Kingdom’s crown prince,” the white-clothed young man cockily said. “My surname is Qin, but my name is Bai. Just call me by my name.”\n\nHan Sen’s face looked complicated. He thought, “Qin Xiu was powerful all his life. Why would he have such a dumb child? It looks like genes aren’t very reliable.”\n\n“Mister Crown Prince, I am not going to go to the palace,” Han Sen said. “If you really want to thank me, just give me a high-class gene egg.”\n\nUpon hearing Han Sen, Qin Bai receded into thought. A while later, his eyes turned bright. He happily asked, “Do you want high-class gene eggs? That is not difficult. In the palace, there is an ancient well with a high-class gene egg. I think its level is extremely high. Come with me, and I will give you the gene egg.”\n\nBefore Han Sen could respond, the faces of the people kneeling on the floor changed. The one with a voice that did not sound like a man’s or a woman’s voice said, “Mister, you cannot do that. That is the Big Qin Kingdom’s suppress luck item. You cannot move it. If the king finds out, he will be furious.”\n\nAfter Qin Bai heard mention of the king, he looked afraid. He changed his tone and said, “That doesn’t matter. If he is willing to come with me, I will give him a top-class gene egg.”\n\n“Thank you for your kindness, Crown Prince, but I have stuff to do. I do not think I can go.” Han Sen had yet to learn about the area. He did not want to go to Big Qin Palace.\n\nIf his body was not restricted by the world, he would not have been afraid. Now, he had to maintain a low profile.\n\nQin Bai really wanted Han Sen to go with him, but Han Sen was adamant about not going no matter what. There was nothing he could do. When he left, he kept turning his head back. He repeatedly told Han Sen that if he ever visited the capital, he should look for him. He would prepare the best gene egg for Han Sen.\n\nEventually, Qin Bai was gone. Peaceful did not leave with him.\n\nPeaceful looked at Han Sen and asked, “Han Sen, are you interested in establishing a trade?”\n\nHan Sen picked up the body of the overbearing bug and kept walking as he asked, “What trade?”\n\n“Don’t you need some gene races and gene eggs?” Peaceful asked. “I know a place with many gene races and gene eggs. If you and Mister Yang want to come with me, you are sure to get something out of it.”\n\nHan Sen did not speak. He looked at Mister Yang.\n\nMister Yang coughed and said, “Lady Peace, you are not suggesting the King Qin treasure, are you? To be honest, Mister Meng hired me to go and find the King Qin treasure with him. We were not successful in our venture. Mister Meng is still trapped somewhere and hasn’t come back, and I don’t know if he is dead or alive.”\n\nPeaceful shook her head. “You misunderstood, Mister Meng. I am not looking for King Qin’s treasure. I am looking for a hidden god pulse. We calculated where the hidden god pulse might be, but we were unable to determine the precise location. Ergo, we require your help. We will reward you after.”\n\n“A hidden god pulse in Ancient Big God Mountain?” After hearing that, Mister Yang was shocked. He looked at Peaceful in disbelief.\n\n“Yes, it is in Ancient Big God Mountain,” Peaceful said with a nod. She went on to say, “I am sure you must have noticed in the past year that many big god pulses have shown up, and there are usually many gene eggs. The hidden god pulse has only recently appeared. You can see the pulse air, but we do not know where it is. If you can find where it is, you will earn a fair share.”\n\nThe prospect greatly tempted Mister Yang, but he did not agree to it. He looked at Han Sen as if he was his boss.\n\n“What is a hidden god pulse?” Han Sen asked.\n\nMister Yang tried to explain things to him slowly. Ordinary land pulses were able to produce two or three gene eggs, which was considered a lot. Hidden god pulses were claimed to yield more than 100 gene eggs and perhaps even much more.\n\nBased on the description, a hidden god pulse was like a very rich mine.\n\nUpon hearing that, Han Sen was immediately interested. After finding out he could combine with gene races, he was eager to learn much more about them.\n\nOf course, the main reason was that after fighting the woman, Han Sen noticed his body was suppressed by the world far too much. If he could have some powerful gene races to help, things would be much easier for him.\n\nThat woman was strong, which made him feel weary. He had no clue how many scary elites might exist within the seven kingdoms. With his situation being what it was, Han Sen thought he was unable to defeat the top elites that existed throughout the seven kingdoms.\n\n“How did Qin Xiu break the space barrier and enter my universe?” Han Sen’s power was no worse than Qin Xiu. Yet, under the suppression of that world, breaking a tunnel seemed impossible.\n\nPeaceful proposed a deal. “If the two of you are willing to help me find a hidden god pulse, how about we each take 10%?”\n\n“If the two of us only get 20% combined, isn’t that too little?” Han Sen asked with a frown.\n\nPeaceful shook her head. “There is something you don’t know. The hidden spirit god pulse is very dangerous. It is not something two people can claim by themselves. I am co-operating with others. In the end, I will only be receiving 30%. You will be taking 20% of that pie. The others will be the ones claiming 50%.”\n\nHan Sen did not understand things like this, so he looked at Mister Yang.\n\nMister Yang nodded and said, “The hidden god pulse is dangerous. There will be gene races there that have already hatched. If the god pulse has been out for a while, perhaps the gene races will eat the unhatched gene eggs. Perhaps they have already grown. It will be troublesome no matter what.”\n\n“Fine, 20% it is then.” Han Sen sensed that Mister Yang was eager to go, which made him want to go as well. Thus, he agreed to the terms.\n\n“In that case, please follow me back to camp,” Peaceful said with a smile. “I will introduce you to the others we will be doing this with.”"
}