{
    "chapter": 972,
    "title": "Unbelievable Rabbit King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_972",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen sat down near the campfire and started cooking another bee.\n\nSo far, he had only cooked four out of the sixteen he had hunted. He had eaten one, and so had the rabbit king.\n\nHan Sen did what he could to make the bee taste the best it could.\n\nHan Sen had been grilling food for many years now, and he had become a bona fide master of the art. He was the king of cuisine, when it came to outdoor cooking and grilling.\n\nThis latest bee was laden with the perfect assortment of his best spices. This was the perfection of the culinary arts, and a mere gander at what he had cooked was enough to make the most stoic vegan drool copious amounts of saliva.\n\nAfter the rabbit was done gnawing on two bees, Han Sen’s latest masterpiece had almost been completed. When the furry fiend was done, it turned its attention to the one that was now being grilled.\n\nSurprisingly, it did not immediately grab it. The rabbit simply watched it get cooked in captivated silence.\n\nThis wasn’t at all what Han Sen expected, but he was glad the rabbit wasn’t rude enough to steal the unfinished food.\n\n“What’s wrong with this thing, I wonder?” Han Sen finished cooking the bee and then stood up.\n\nSeeing Han Sen put down the bee for it, the rabbit kicked its feet together in a joyous leap and began scoffing it all down.\n\n“Yes, eat it. Eat it all. This will be your last meal.” Han Sen watched the rabbit and smiled menacingly.\n\nAlthough it surely tasted divine, Han Sen had left one of the bee’s poison sacs inside.\n\nThis poison could numb and paralyze the tongue, but with the spices he had used, Han Sen was sure the rabbit wouldn’t be able to detect what it was eating.\n\nHe didn’t expect it to actually kill the rabbit, but making it sick would be enough for him.\n\nHan Sen continued to watch the rabbit, anticipating the moment it’d fall under the effect of the poison.\n\nAfter a few more mouthfuls, the rabbit suddenly froze in place. A white substance frothed from its mouth, before it collapsed to the ground and began convulsing.\n\nHan Sen watched with a captivated stare. His ploy had been more effective than he believed it would be, and he was pleasantly surprised at how low the rabbit’s resistance to poison was.\n\n“Is this really a sacred-blood creature?” Han Sen ran over to the rabbit and watched its lifeforce begin to fade while its body twitched in agony.\n\nHan Sen stroked its fur, and was surprised to see that its shield had vanished. From his light touch, the rabbit started to bleed.\n\nThe rabbit was far weaker than he believed it to be. He was quite shocked.\n\nWeak. It was unimaginably weak.\n\nThe sacred-blood rabbit was actually just as weak as an ordinary rabbit.\n\n“How is that even possible? How can a creature with seven gene locks open be so weak? How can such a weak creature possess the fitness level required to be a sacred-blood creature?” Han Sen was frozen in disbelief, watching the rabbit’s lifeforce fizzle away.\n\nThe rabbit was dying, but before it completely gave up the ghost, Han Sen decided to be merciful. With his holy light, he opted to heal the rabbit and purify the toxins in its body.\n\nHan Sen did not believe it was a sacred-blood creature. It was impossible for a sacred-blood creature to be that weak.\n\nThe only possibility for its weakness, Han Sen hypothesized, was that it had somehow managed to open seven gene locks while being an ordinary creature.\n\nAs unbelievable as it sounded, it was the only explanation he could think of.\n\nIf it was just an ordinary creature, killing it would have been pointless. He didn’t need ordinary geno points anymore, so being merciful wasn’t a problem.\n\nAnd besides, this was a puzzling creature. And the enigma fascinated him so much, he really desired to know how this strange anomaly had occurred.\n\nIf a human with a fitness of three hundred had opened their second gene lock, they’d be considered a genius. Opening a third gene lock would have made them a legend, and such a feat would require much time and talent.\n\nJust like Han Sen, who was very talented. He would have been capable of doing this, had he remained at the same fitness level and trained for two years.\n\nIf he had the opportunity to get extra geno points, he could have opened three gene locks. But that would be as far as he could go.\n\nBut Han Sen was not interested in doing things this way. He wanted to do things fast and hard, unlocking gene locks and amassing fitness levels the quickest way possible. The speed at which he gained power was something few would believe, though.\n\nMuch like the rabbit, no one would believe him if he said he had opened seven gene locks.\n\n“This rabbit must have received one h*ll of an opportunity, to achieve this. Can I somehow extract a benefit of my own, following this discovery?” Han Sen pondered to himself, as he continued healing the sick rabbit.\n\nHan Sen really wanted to find out what was wrong with the rabbit king.\n\nA short while later, the rabbit seemed to be getting better. Before long, it was able to open its eyes again.\n\nThe rabbit, despite what Han Sen had done, was not aggressive. It remained still, accepting all the healing it was given."
}