{
    "chapter": 2406,
    "title": "Nine Spin Destiny Mirror",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2406",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nOnce every drop of that strange power had drifted into Han Sen’s body, his lifespan reached 1787. In less than a minute, his lifespan had increased by half a millennium.\n\n“I wonder how many years he has taken from the Extreme King? This cannot be all, surely.” Han Sen asked the black crystal armor, directing a greedy stare at where the man’s body had been.\n\nThe black crystal armor ignored him. It turned around and returned to his Sea of Soul. Just like before, it hung in a corner of the Sea of Soul without moving an inch.\n\n***\n\nThe moment the guy that called himself God was destroyed, far away, in a mysterious palace, a man frowned and said, “Empty God… Even if my god doll offended you, you could have just taken his eyes. Instead, you actually killed him. Do you think I am afraid of you?”\n\n***\n\nIn the streets, the fortune-teller looked at the broken article of underwear in his hand, then let it go. It was reduced to dust. He sighed and said, “What a shame. It was hard to get my hands on that item.”\n\nHe picked up his bowl of noodles that had fallen to the ground and wiped the bowl clean with a cloth. Then, he put the bowl away. Picking up his sign, which read “Destiny,” he walked down the street and disappeared amidst the crowds.\n\n***\n\nHan Sen watched the man turn to dust, and as he did, he realized that his time was up. He quickly ran down through the tower. As he ran, he thought to himself, “If the Extreme King finds out the statue is destroyed, they won’t come after me, will they? I won’t admit I was the one to destroy it, but even if I said I did, they wouldn’t believe I was able to, would they?”\n\nWhen Han Sen reached the sixth floor, he saw that the paintings were still hanging on the walls. But the meaning and influence behind them had disappeared. They were just ordinary paintings now.\n\nIt was like this all the way down. All of the paintings had lost their god minds. They were nothing special anymore.\n\n“Weird. Fox Queen said the Nine Spin Destiny Mirror was inside this tower. How come I haven’t seen it?” With that thought, Han Sen checked the time and realized that he still had one hour left. So, he decided to look around the tower.\n\nHe had walked up and down the tower many times over the past month. Aside from the paintings, the man had been the only other thing there. There were no mirrors.\n\n“Was Fox Queen lying to me? That doesn’t make any sense. Lying to me about the mirror wouldn’t benefit her in any way.” Han Sen frowned and thought to himself, “Did someone manage to trick Fox Queen herself? Maybe give her bogus intel? If that is the case, then that might mean Fox Queen’s identity has been exposed.”\n\n“But Fox Queen is smart. Tricking someone like her would be difficult.” Han Sen was both intrigued and a little worried, so he looked into every corner of Destiny’s Tower with complete thoroughness.\n\nThere was no Nine Spin Destiny Mirror. There was nothing inside the tower at all. Han Sen could see each floor clearly with just a look. If there was a mirror, he would have seen it. Searching should have been unnecessary.\n\n“There isn’t anywhere to hide things in this tower. Aside from the statue man that looked like a human but wasn’t actually a human, that is.” Han Sen suddenly thought of the man who had been sitting atop that pedestal. He returned to the seventh floor.\n\nIf something was hidden anywhere in this tower, it had to be inside that pedestal.\n\nHan Sen hadn’t returned to the seventh floor in order to help Fox Queen, though. If there really was a treasure like the Nine Spin Destiny Mirror, he would take it for himself. After all, the Nine Spin Destiny Mirror would be a powerful item. The Foxes thought that regaining the item would let them take back a prominent place in the universe.\n\nBack on the seventh floor, Han Sen looked at the platform the man had been sitting upon. It was just an ordinary stone pedestal. There was nothing special about it. It was made of the same stone that composed the rest of Destiny’s Tower.\n\nHan Sen reached out his hands and pressed against the pedestal. The platform had taken no damage at all. It clearly wasn’t something that would break easily.\n\n“It’s a shame that I used all my Nine Spin Fox Power. Otherwise, I could try to use that power to summon the mirror.” Han Sen went silent for a moment, then extended one of his fingers over the stone. He allowed a droplet of blood to fall down onto the pedestal.\n\nThat blood was infused with the power of the Blood-Pulse Sutra. Han Sen wanted to see if the platform was spiritual in some capacity.\n\nWhen the blood splashed onto the stone, the platform began to shake. The blood then blended into the pedestal, and it shook even harder.\n\nSuddenly, the platform floated up into the air. It hovered, its stone enamel cracking and flaking off from the violent tremoring. Soon, the real face of the pedestal began to be revealed.\n\nA while later, the stone surface shattered completely, revealing the stone mirror inside. When Han Sen let another droplet of blood bleed onto the stone mirror, silver light glowed from the mirror. Within the reflective surface, Han Sen saw the shadow of a silver nine-tailed fox. Those nine tails swayed softly, as the small fox eyes regarded Han Sen.\n\nBuzz!\n\nThe stone mirror started to fly, spinning around Han Sen. The stone mirror was the size of a mortar and pestle, but it shrank until it was around the size of Han Sen’s hand. It landed in his palm, and then the light completely disappeared. The shadow of the nine-tailed fox in the mirror was gone.\n\nHan Sen lifted the mirror, and he realized that it no longer reflected anything. It was just a piece of grayish-white stone. Even if he tried to polish it with a soft fabric, the mirror refused to show a reflection.\n\nBut on the back of the stone mirror, Han Sen found an engraving of the nine-tailed fox. It was just like the shadow Han Sen had seen when the mirror was glowing.\n\nThe droplet of blood had vanished. It seemed to have disappeared when the stone mirror activated. Han Sen played with the stone mirror for a while, but he was unable to find out how to use it. He couldn’t activate the stone mirror’s power.\n\n“I can try to use my blood to gain control of it. Maybe it will come to recognize me like the jade drum did.” Han Sen put away the stone mirror and waited until the departure time was upon him. When that time rolled around, Destiny’s Tower opened. Quickly, he rushed out of there.\n\nThe Extreme King didn’t seem to know anything about what had transpired inside Destiny’s Tower, which made him feel very relieved. He said his goodbyes and returned to Planet Water Zone’s Underwater Town.\n\n“If you were that powerful, you should have just done it sooner. If something like that happens again, you don’t need to wait around before cutting the bad guy down. Kill a few more Gods, and we’ll live a lot longer,” Han Sen said to the black crystal armor in his Sea of Soul once he had returned to his room.\n\nBut the black crystal armor didn’t move. It behaved as it always did, like a dead object.\n\nWhen the black crystal armor didn’t react, Han Sen left it alone. He rested at home for a few more days, waiting to see if the Extreme King noticed any changes in Destiny’s Tower.\n\nLuckily, the Extreme King was none the wise. They didn’t seem to have a clue that the man statue inside Destiny’s Tower had been destroyed. It made Han Sen feel much safer.\n\nHan Sen: super god spirit body\n\nGeno Battle Body: Mutant Blood (Duke), Spell (Duke), Dongxuan (King), Jadeskin (Duke)\n\nLevel: King\n\nKing Genes: 22\n\nDeified Progress: 12%\n\nLifespan: 1787\n\n“He isn’t dead?” Upon learning that Han Sen was alive and had visited Destiny’s Tower, Fox Queen was amazed."
}