{
    "chapter": 1100,
    "title": "First Fight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1100",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Dollar is really taking part?” In the Martial Hall of Trench Shelter, many people wanted to see Dollar’s name on the list.\n\n“Dollar versus Fei Yu King? What?! This is legit?”\n\n“Dollar has to be the Dollar, yes? It can’t be a spirit, right?”\n\n“Does anyone know who Fei Yu King might be?”\n\n“I don’t know, but if it is referred to as a king, it must be powerful.”\n\n“Old Li, where are you going?”\n\n“I’m going to spread the news. I’ll make some calls and have people come watch.”\n\n“I think there’s a while before the fight starts, too. I’ll help and make a few calls, as well.”\n\n“I can only see spirits spectating; where are the humans?”\n\n“You’ll probably see a few more when it starts.”\n\n…\n\nWhen surpassers learned Dollar was to take part, even if they had no prior interest in spectating Divinity’s Bout, they frantically scurried over to watch.\n\nEveryone who had heard Dollar was a participant went to the Martial Hall.\n\nSome humans eventually recognized who Fei Yu King was.\n\n“D*mn. His first opponent is Fei Yu King?”\n\n“Why? Is he strong?”\n\n“I’ve heard his name before. He’s known to control a massive region someplace, one where he is recognized as its supreme leader.”\n\n“Ouch. That’s bad luck, having such a nasty first opponent.”\n\n“Will Dollar even dare to fight him?”\n\n“Probably.”\n\nThe time for Han Sen to fight came, and with bated breath, the human spectators stared at the battleground intently.\n\nPeople saw a spirit with wings holding a bow approach the stage. The bow was decorated in a vast array of jewelry.\n\nFei Yu King, to his credit, was an incredibly handsome spirit. His white wings were a deliciously divine sight. With his purple, glittering bow, he did not look unlike an angel.\n\nFor him to merely stand in place, one could tell he was not a foe to be trifled with. His mere presence exuded an aura of frightening power.\n\nHumans were mostly focused on whether or not Dollar would show up, though.\n\nIt would have been a disappointment if he did not show, but the humans would find it understandable. They wouldn’t hold it against Dollar if he didn’t want to go up against such a powerful spirit.\n\nA person with long white hair then walked up onto the stage. His body glowed with a bright white light.\n\n“Um, is that Dollar?”\n\nNo one had seen Dollar’s face before, and it was a trend that was set to continue. Despite the stunning appearance, his identifying features were cloaked in armor.\n\n“It’s Dollar!” The surpassers in Trench Shelter were able to recognize him, because they had seen him with this look before.\n\nThe surprise of his appearance did not only apply to the humans, though. Even the spirits were in shock.\n\n“The King?!” Flower Empress was there, and she was dizzy in shock.\n\n“It’s a shame he has encountered Fei Yu King, who has opened nine gene locks,” Heavenly Empress said.\n\nThunder-Devil King was there, as well, and he chimed in to say, “That *sshole has had it coming a long time now.”\n\n“The King!” Many spirits trumpeted the name across the grandstands and the shelters of their residence.\n\nWhen Han Sen was stuck in the Valley of Time for three years, his super king spirit mode had opened nine gene locks. There was an abundance of fruit there, that he was able to eat and live on the whole time.\n\nHan Sen had not spent time in the spirit base since then, so no one knew he had opened nine gene locks.\n\nThey still thought The King had only opened three gene locks. They didn’t think he could compete with Fei Yu King, who had opened nine.\n\nEven if they were in the same tier, though, with the same gene locks open, they did not think Han Sen would have what it took to take down Fei Yu King.\n\nHan Sen knew he would enter the ninth spirit base when he returned there, so that was why he had stayed away for so long. He wanted his accomplishment to be a surprise for future spirit opponents.\n\nFor him to go from three to nine gene locks over the course of a few days would be a ridiculous thing.\n\nHe had paid the spirit base a short visit, but stayed out of sight and not fought with others.\n\nHan Sen had thought he could heal faster in the spirit base, as he could remain in super king spirit mode for as long as he wanted to there.\n\nBut it didn’t work as he thought it might. The spirit base was not associated with the physical body, and entry required and was dependent on the spirit stone.\n\nBeing in the spirit base, you could only change your spirit genes. If he tried erasing the crystals that plagued him in there, they’d return once he exited.\n\nOutside the spirit base, though, Han Sen could not remain a super king spirit forever.\n\n“It’s you! How fortunate for me. I’m going to teach you a lesson that has been long overdue.” The King was too famous, and even Fei Yu King was aware of him.\n\nAll the spirits continued calling him The King, despite the protest of the king spirits who despised the name.\n\nHan Sen’s super king spirit mode was limited outside of spirit base, so he knew he’d have to finish this fight quickly.\n\nHan Sen raised his right hand and snapped his fingers to the sky.\n\nImmediately after, a rain of coins started to fall. The entire stage was quickly battered and covered in coins.\n\n“What is that skill?”"
}