{
    "chapter": 2188,
    "title": "Dive Heart Practice",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2188",
    "text": "A year passed.\n\nOver the course of that year, Han Sen spent a lot of time practicing Jadeskin. He wanted to get that up to the rank of Duke first and foremost. At that point, he would be able to absorb Duke genes. With one hundred Duke genes for a base, he’d be able to level up his other geno arts a little faster.\n\nAs the year went by, Han Sen also came up with excuses to enlist more companions from the sanctuaries.\n\nFrom the humans, he brought over Ning Yue, Lin Feng, Tang Zhenliu, Qin Xuan, Huangfu Jing, Ji Qing, and Han Yan. There were also many super creatures and spirits that made the jump. Planet Eclipse did not have much in the way of high-class resources, but there were many xenogeneics. After he brought people to the geno universe, raising them to Marquise was fairly easy.\n\nEveryone’s super god body was different, so Han Sen’s personal experience might not translate well to each of them. They all had to discover their own paths; Han Sen only gave them the opportunity to do so.\n\nHan Sen brought such large numbers of people because he knew how powerful the many races were. There was a multitude of powerful forces in the geno universe.\n\nGroups such as Sky Palace, the Dragon, and the Destroyed were not to be taken lightly. They were all very strong factions.\n\nEven the deified Kong Fei had to pay a high price to knock the Feathers down a few pegs, and they weren’t even in the top hundred. The Feathers didn’t have anyone deified either. Han Sen would require as many elites as he could enlist if he wished to light his own lantern in the future.\n\nThere was no doubting their loyalties, either. In the Alliance, they were all allies. And Han Sen knew them personally. Even the spirits and creatures he brought over wouldn’t want to sell out humans.\n\nEven so, Han Sen took a few precautionary measures so that, in the event someone actually did try to betray him, he could deal with the situation quickly.\n\nHan Sen’s sister Han Yan was very talented. She was like Han Sen in many ways, but the development of her powers was still quite different. That was because she practiced with the Falsified Sky Sutra and the Asura Sutra. She was on a different path than he was.\n\nHan Sen knew her super god body was called King Release Sky. It was different from Han Sen’s own super king spirit body. Not many people had the same super god body as each other.\n\nPeople practiced differently than one another based on their super god bodies. Some of the differences were obvious, and some might take years to be revealed.\n\nSuper god bodies were usually secret, though. And Han Sen only asked Han Yan about hers because she was his sister. He hadn’t asked for the names or details of anyone else’s body.\n\nEvery human he brought over was a genius of their race, though. With their super god bodies, their talents wouldn’t be far off those of the higher races. That meant they would gain rank quickly.\n\nWith the resources available on Planet Eclipse, many of the people he had brought over managed to reach the rank of Earl within that single year.\n\nAside from Ji Qing and Han Yan, the others were keen to explore and see more of what lay beyond that entry point to the geno universe. And this was something Han Sen agreed to. They all wanted different things for their lives, and it wasn’t as if they needed to be babysat. Planet Eclipse was only going to limit their development. They would have to explore and obtain their own resources if they really wished to grow.\n\nHan Sen didn’t want to allow Han Yan to explore, however. She repeatedly asked him to let her travel, but he kept preventing her from leaving. If something happened to her, his parents would murder him.\n\nBut Han Yan wasn’t the sort to give up easily, and eventually, Han Sen conceded and said he’d give her a recommendation at Sky Palace. She agreed to that happily enough, at least.\n\nJi Qing was Ji Yanran’s cousin. By extension, she was Han Sen’s little cousin-in-law. And the Ji family had focused quite a bit of their time and attention on her. Ji Yanran told him to take good care of her, as well, and not permit her to take any unnecessary risks.\n\nFortunately, Ji Qing wasn’t too keen on the prospect of exploring. When Han Sen brought up the subject, she smiled at him. “I have to stay next to you and keep an eye on you for Yanran. Otherwise, who knows what you’ll get up to, all alone here in this geno universe? If it was something bad, I’d feel bad for Yanran.”\n\n“I have Bao’er as a spy. Why would I dare to do anything inappropriate?” Han Sen touched Bao’er’s face.\n\n“You wouldn’t dare? That must mean you thought about it, but you didn’t…” Ji Qing smiled at Han Sen.\n\nHan Sen shrugged his shoulders. “You’ll be here, and you can’t go back. Even if I have such thoughts, you won’t be able to tell her.”\n\nJi Qing looked surprised, and Han Sen left.\n\nHan Sen went to Cold Palace. By guarding the door, he was able to watch the tadpoles slowly become little toads. They absorbed the powers of the moons released by the deified toad, which made Han Sen quite jealous.\n\nThe deified toad could use its power to produce moons to level up its babies, but Han Sen couldn’t.\n\nLittle Angel and Little Silver were already Marquises. If they were unable to locate high-class resources, it would be much harder for them to level up. In the geno universe, if you were not King class, you weren’t really considered strong.\n\nThat was why Xi Qing King and Ning Yue went exploring often. King class elites were the true powers of the geno universe.\n\nAs the moonlight shone down on the baby toads, Han Sen put down the Cold Palace guardian tablet and left the stone porch so he could soak in the power of the moonlight and the ice.\n\nAfter a year of absorbing icy powers and refining moonlight, Jadeskin might not have reached Duke, but he did understand a lot more about the ice powers and the moon powers. He was also more familiar with the deified toad’s strength now.\n\nEven without the protection of the Cold Palace guardian tablet, Han Sen wasn’t frozen by the deified toad’s cold powers anymore. It was very cold, of course, but he could endure it.\n\nOrdinary Marquises and Dukes couldn’t have withstood that level of cold.\n\nHan Sen absorbed much of the deified toad’s ice powers and moon powers over time, and that was how he was able to build up his resistance to the ice. His body was very strong, and his Jadeskin power was connected to the deified toad. They were very closely aligned.\n\nThe deified toad spat out a moon atop the waterfall, and then looked at Han Sen. Its sudden attention made Han Sen jump, but the toad did not look hostile. In fact, it looked surprised.\n\nAfter a while, the toad turned around and continued spitting out moon powers.\n\nThe toad didn’t seem to mind his presence, and that made Han Sen happy. He walked closer to the waterfall. He did not follow the little toads up it, but even that proximity was enough for him to absorb more moon powers and cold powers.\n\nThe deified toad showed no desire to kick Han Sen away, either. And when the moon powers were gone, the deified toad took the little toads down to the pool.\n\nThe little toads left the water and went up the banks, and then they all proceeded to enter the cave in the side of the stone house. They saw Han Sen standing off to the side. Perhaps it was because he did not have the guardian tablet, but the little toads sensed him and approached him."
}