{
    "chapter": 1931,
    "title": "The Moon’s Reflection on Water",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1931",
    "text": "Han Sen’s desire to perform Moon had little to do with satisfying Kriman.\n\nHan Sen thought learning Moon was a challenge from Yisha, so he wanted to prove to Yisha that he was a genius. He didn’t want her suspicions taking root.\n\nHan Sen wouldn’t have dared to perform Moon before today, though. After all, he wasn’t smart enough to learn something from a brief look. He had practiced Moon for quite some time, and he knew that if he had done it prior to seeing Narrow Moon Knife, the quality of his performance would not have befitted a genius.\n\nExamining Narrow Moon Knife changed this. That was why Han Sen was now confident to perform Moon there. He was confident he could quell Yisha’s fears now.\n\n“Moon?” Rebecca and Du Lishe were shocked; it was Moon Wheel King’s geno art, and they knew it, too. They had learned it from Moon Wheel King himself when they were young, and it was something they were still practicing with.\n\nKriman coldly laughed and said, “You are daring to practice Moon in front of Rebecca and Du Lishe? That is hardly appropriate.”\n\nEveryone knew Rebecca and Du Lishe were excellent with the art. They were surprised that Han Sen had expressed his desire to perform it.\n\nHan Sen smiled and ignored Kriman. Then he said, “My teacher taught me Moon. I have been trying to learn it for some time, but my understanding of it has failed. I suddenly learned it when I looked at the knife. I don’t know if this is correct, so please correct me.”\n\nWhen everyone heard him say this, they all went quiet. Kriman swallowed the words he was going to speak, and coldly said, “Okay. Let’s see how Moon correlates with Narrow Moon Knife.”\n\nHan Sen looked around and stopped his gaze on the teacup. He filled the cup up with water, then placed it back down on the table. Rebecca and the others were watching him, keenly wondering how he was going to do in his performance of Moon.\n\nHan Sen gave them a swift answer. He pointed to the middle of the teacup and fired an arrow of light at it.\n\nWhen the light entered the water, there was no impact. It was like a reflection of the moon, hovering on the surface of the water.\n\n“What do you guys think of my Moon?” Han Sen lowered his hands and smiled.\n\nKriman laughed mockingly and said, “I thought you learned something amazing from the knife. The reflection of the moon is something only a beginner might have learned. You are much worse than Rebecca and Du Lishe.”\n\n“Then can I take a look at the Moon of the two ladies?” Han Sen looked at Rebecca and Du Lishe with great interest. Rebecca felt worried. Du Lishe didn’t hesitate, though, and she simply said’ “Why not?”\n\nAfter that, Du Lishe filled up her teacup with water. Then, she looked at Han Sen. “This is just a beginner move on Moon. I was able to do it by the time I became Viscount. I can generate three moons, so I am worse than my big sister. Please do not laugh at my Moon if it is bad.”\n\n“Three lunar reflections? That is much better than one!” Sad Night looked at Han Sen.\n\nDu Lishe smiled and did not say anything. She used her right fingers. Three fingers created three moons upon the surface of the teacup’s contents.\n\nWhen the moons entered, no ripples were formed. But those three moons almost filled up the entire teacup. It looked strange.\n\n“Sorry, I did that poorly.” Du Lishe was actually satisfied with her performance. She was being cocky, and a little provocative to Han Sen. Her eyebrows were raised slyly.\n\n“Good! These three moon reflections are great. It is no wonder you are the heir of Moon Wheel King.” Kriman loudly complimented her.\n\nSad Night followed his example, too. He wasn’t bluffing, though. Du Lishe really had performed exceptionally well.\n\nThe people there had all learned Moon, but like Han Sen, they could only cast one moon. They couldn’t do two. Du Lishe was able to do three because she had learned the skill directly from Moon Wheel King.\n\nSad Night looked at Han Sen strangely. “Genius Han, is that what you learned from the knife? Perhaps it is best not to compare it to Du Lishe. Even the rest of us, who didn’t learn from Moon Wheel King or stare at the knife for half an hour, can still do a reflection like yours. We didn’t need half an hour.”\n\n“Three moon reflections? This is great. I have learned a lot,” Han Sen said emotionlessly.\n\nThen, he stood up and told Black Steel, “I have something to do. I will talk to you later.”\n\nHan Sen said that and left. He didn’t want to interact with those people. He’d rather practice what he had learned while the memory was still fresh in his mind.\n\n“I will walk you out,” Black Steel said.\n\nHan Sen shook his head. He didn’t have a good relationship with the other heirs of Kings, and he didn’t want Black Steel to end up isolated like he was.\n\n“Running off like that? He sucks.” Kriman smiled.\n\n“Of course. Did you expect him to just let you insult him?” Someone laughed.\n\n“He deserved it. I don’t like people who keep pretending,” Kriman said darkly.\n\nHan Sen was not in their circle, so it did not affect them too much. Now, they returned to being happier and more friendly with each other.\n\nDu Lishe felt really good, too. She had finally shown off in front of Han Sen with success. She was smiling and smiling, and she just couldn’t stop.\n\nRebecca didn’t look so happy, though. She felt as if something was amiss, but she couldn’t put her fingers on exactly what was wrong.\n\nAs everyone talked, a Viscount accidentally knocked over a geno fluid and dirtied a seat, so he moved to Han Sen’s seat.\n\nHan Sen’s cup was still there. The Viscount reached for the cup, wanting to swap it for a new one, but when he just touched the teacup, his face changed and he screamed, “What the f*ck?!”\n\nAs everyone was talking merrily, hearing him scream made everyone turn to look at him. Kriman laughed and said, “What are you screaming about?”\n\n“Look! Look at this cup.” The Viscount pointed at the cup and looked at it strangely.\n\n“What about the cup?” Kriman asked.\n\n“This is Han Sen’s cup. Look closer!” The Viscount did not know how to explain, so he picked it up and moved it over."
}