{
    "chapter": 2689,
    "title": "Jail Demon Hall",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2689",
    "text": "“We managed to fish it up again!” Han Sen was shocked. He thought about the Four Sheep Cube that plummeted back down with the four eerie faces smiling at him. He looked closely at the heads of the sheep.\n\nHe jerked back in surprise. The bronze sheep had their eyebrows lowered, and their eyes were half-closed. They looked like monks that were meditating. They were no longer smiling as they were earlier.\n\n“Are the expressions on the four sheep heads different?” Han Sen wondered to himself. Then, he heard a pang. The Underworld Silk snapped again.\n\nHan Sen watched the Four Sheep Cube quickly sink again. This time, he could see the bronze sheep heads clearly. Their meditative expression was gone now. The sheep smiled creepily. It looked as if they were squinting their eyes to look at them.\n\n“Is that thing alive?” Han Sen wondered curiously. But before he could examine it any further, the Four Sheep Cube was lost in the lake once more.\n\n“Now this is weird. Why have we fished up the same thing twice in a row? And why does that thing seem as if it is alive? Do living creatures actually exist in the anti-material world?” Han Sen pondered. He didn’t know much about Underworld Lake, and he would have to wait for Li Keer and Exquisite to return so he could ask them.\n\nMany more occurrences followed that one, though. Bao’er managed to fish up that Four Sheep Cube a number of times. She could never pull it all the way up, though. The object would always detach and fall back into the lake.\n\nAs for Han Sen, he only ever managed to fish up useless garbage.\n\nThe triangular symbol on the small jade figure lit up. Han Sen knew Li Keer and Exquisite were on their way back. Not long later, he saw them appear via teleport on the shores of the lake.\n\n“Han Sen, I understand you are always keen to hunt xenogeneics, yes? We have found a suitable location for you. There are primitive deified xenogeneics to kill, and it is safe. You will have the chance to take down a primitive deified xenogeneic solo,” Li Keer said with a smile.\n\n“There’s such a good hunting ground out here? Why didn’t you tell me sooner?” Han Sen asked, looking at Li Keer with suspicion.\n\n“Before the silkworm bouts, there were places that you weren’t qualified to enter. Now that you’ve earned first place among the silkworms, though, things are different,” Li Keer explained.\n\n“I see.” Han Sen’s mind wandered back to the Four Sheep Cube, so he told them about his experience trying to fish it out of the lake a few times.\n\nWhen they heard the story, Li Keer and Exquisite’s faces both went grey. Exquisite looked at Han Sen and asked, “The Four Sheep Cube you fished up… Would you say it was three or four meters tall?”\n\nExquisite described the Four Sheep Cube she was thinking of, and it turned out to be the exact same one Han Sen had seen.\n\n“Yes, that is the one. Is there a problem with it?” Han Sen asked, glancing at the two women’s expressions. He knew there was something dodgy about this.\n\nLi Keer and Exquisite looked at each other. Exquisite said, “This Four Sheep Cube is something the Very High have fished up before.”\n\nAfter saying that, Exquisite stopped.\n\n“And then?” Han Sen asked.\n\n“Let me explain.” Li Keer looked at Han Sen with a strange face and said, “Our people have fished up the Four Sheep Cube before. But that thing is not an omen of good luck. All the Very High who fished up the Four Sheep Cube ended up having misfortune fall upon them.”\n\nHan Sen heart jumped. He frowned and asked, “What happened to them? Were they injured, or did they just end up dead?”\n\nLi Keer shook her head. “They were neither hurt nor killed. According to the histories of the Very High, there were three Very High that fished up the Four Sheep Cube. One of them was the one who made the Sky and Sky Palace.”\n\n“Isn’t that a good thing? Why would you consider that unlucky?” Han Sen didn’t understand what she was trying to say. Building a race and becoming supremely powerful was something glorious. Why would they consider that a misfortune?\n\n“Well…” With a wry smile, Li Keer went on to say, “The second Very High that fished up the Four Sheep Cube had something happen to him. It made him kill his parents. And then, he betrayed the Very High.”\n\nAfter pausing, Li Keer said, “The third one that fished up the Four Sheep Cube ended up stealing an important treasure from the Very High. Then, he disappeared. Where he went, no one knows.”\n\n“So whoever fishes up the Four Sheep Cube is from the Very High… and they have all betrayed the Very High…” Now Han Sen understood why the Four Sheep Cube might have been deemed unlucky.\n\n“Although there is no proof, there are records that confirm that the Four Sheep Cube was connected to all three.” Exquisite had a wry smile.\n\nHan Sen coughed awkwardly. “I’m not from the Very High. I will leave one day. That doesn’t mean I will betray you one day, does it?”\n\nExquisite went very quiet, then said, “The three Very High that I talked about only fished the Four Sheep Cube once. They never saw it before or after that one time. But you seem to have fished it up six times. Although the whole betrayal thing is just a guess, this item is considered taboo for our race. You and Bao’er should never again mention the fact that you fished up the Four Sheep Cube. It is best not to stir up any trouble.”\n\nHan Sen nodded. He had originally thought it might be a useful item, but he’d had no clue it was actually so profoundly unlucky. He wasn’t going to mention what he fished up to anyone else.\n\nThat being said, he didn’t know many people in the Very High. Even if he wanted to tell someone else, there was no one he could tell.\n\n“Let’s go. You two shouldn’t visit Underworld Lake for a while,” Exquisite said to them. Then, she teleported Han Sen and Bao’er away from the lake.\n\nHan Sen asked Li Keer about the place they were headed – a location known as Jail Demon Hall – and what sort of xenogeneics he would be able to kill. He learned that the place used to be a mere cave, but the Very High built a palace atop it.\n\nCalling the structure a “palace” was a bit misleading, though. In actuality, it was more like a prison. A xenogeneic had lived in the cave beneath Jail Demon Hall for a long time. The creature lacked the power to escape its prison, but after a while, it learned how to create a doppelganger that could enter the palace above the cave. The doppelganger was a primitive deified. Now, every so often, the Very High had to go to Jail Demon Hall and kill the doppelganger to make sure that the xenogenic stayed contained.\n\nLi Keer and Exquisite had already filled out the paperwork that would allow them to hunt in Jail Demon Hall. Now that his request had been granted, Han Sen would be given the chance to solo a deified xenogeneic.\n\n“A primitive class deified xenogeneic, huh? I can test the strength of my Apollo Set this way, and earn a deified xenogeneic gene as well. That is two birds with one stone,” Han Sen thought happily.\n\nThe peacock king beast robe and the Six Core Snake Bow were items Han Sen didn’t dare use while Li Keer or Exquisite were around. He didn’t want them to realize that beast souls and treasures were different.\n\nHis new Apollo Set would do a great deal to help Han Sen keep his secrets.\n\nThe four of them went to Jail Demon Hall. There, Li Keer pulled Bao’er to the side so that Han Sen could enter Jail Demon Hall alone. The rest of them would wait outside.\n\nHan Sen wasn’t suspicious. He thought they just wanted to get more of his battle experience and knowledge, and that was why they had asked him to go and kill the doppelganger xenogeneic. He pushed the door open and entered Jail Demon Hall."
}