{
    "chapter": 2699,
    "title": "Fish in a Bottle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2699",
    "text": "The incident in Jail Demon Hall had yet to be explained. Although it was suggested that the raging of the Red Blood Demon might have been somehow connected to the Blood Marrow Geno Fluid, the Inspection Department came to no ultimate conclusion. And before the incident, no one had known that the Bone Marrow Geno Fluid could produce this sort of effect. The warehouse frequently offered that type of geno fluid when they ran out of the ordinary ones, so it all seemed like one giant coincidence. No one should have been responsible for what occurred.\n\nBut Han Sen thought things couldn’t have been that simple. He firmly believed the event had something to do with Liyu Zhen and Li Xue Cheng. Li Xue Cheng had visited him not long before the lockdown took place. The timing was too suspicious to be a coincidence.\n\nBut there was no evidence linking the event to Li Xue Cheng, and that meant Han Sen could not do anything to the man.\n\n“It is a shame that the Red Blood Demon doppelganger will take another six months to regenerate. Otherwise, I could go and kill it again. Maybe that would help me figure out what an incomplete beast soul is,” Han Sen thought to himself as he fished at Underworld Lake. Then he heard Bao’er’s voice shouting to him, interrupting his thoughts.\n\n“Dad! I fished up the sheep head again,” Bao’er yelled as she pulled at the Underworld Silk.\n\nHan Sen looked toward her and saw that she was indeed pulling the Four Sheep Cube toward her. Half of it was visible through the clouds of the lake.\n\nHan Sen had gotten used to this happening. Bao’er frequently caught the Four Sheep Cube on the end of her line, but she was never able to bring it out of the lake.\n\nIndeed, whenever the Four Sheep Cube was on the cusp of being pulled free of the lake’s surface, the Underworld Silk tended to snap. The Four Sheep Cube would sink below the white mists again.\n\nAfter fishing it up so many times without actually being able to catch it, Bao’er was starting to get angry. As she watched the Four Sheep Cube again, waiting for the moment it fell back into the lake, she decided to try something new. With her free hand, she summoned her little gourd.\n\nShe aimed the gourd at the sinking Four Sheep Cube. Then Bao’er tapped the top of the gourd, unleashing a weird power. It was like an invisible lasso had been slung over the Four Sheep Cube. It yanked the Four Sheep Cube in the direction of the little gourd.\n\nHan Sen looked at Bao’er with shock. The things in Underworld Lake were very special, and generally, only strings made of Underworld Silk could affect them. Other powers didn’t really do anything in Underworld Lake.\n\nUntil an item left Underworld Lake completely, no types of power should have worked on it. Han Sen had already tried using his own powers to remove the Four Sheep Cube from the lake, but it hadn’t worked. If his power touched the surface of Underworld Lake, the mist would disrupt and render it null.\n\nBut the little gourd’s power of suction didn’t seem to be affected at all by the lake. It easily pulled the Four Sheep Cube up and away. Unfortunately, Bao’er didn’t have enough raw power, and she seemed to be struggling to pull the statue free of the clouds.\n\nHe didn’t know if it was an illusion, but it felt like the Four Sheep Cube was using its own strength to pull itself back into the lake. It was trying to return to the camouflage of the clouds.\n\nBao’er gripped her little gourd tightly, and the weight of the statue slowly began to drag her little body toward Underworld Lake. Han Sen’s heartbeat sped up, and he teleported over beside her and grabbed hold of her.\n\nHan Sen sensed that a foreign power had wrapped itself around Bao’er’s body, and it was towing both of them toward the lake.\n\n“What a scary power!” Han Sen’s face paled slightly. He didn’t have time to think, so he simply summoned his peacock king soul robe and used all of his power to remain still. His legs dug into the lakeside soil.\n\nIt wasn’t enough. Not even the powerful beast soul could prevent the malevolent force from pulling him closer to the lake. Han Sen’s legs slowly tore a trench through the soil as he was dragged toward the lake.\n\nHan Sen and Bao’er used all of their strength, and Bao’er’s face flushed a deep red. But she couldn’t fight off that power no matter how hard she tried, and she was on the verge of falling into the lake.\n\nHan Sen was about to tell Bao’er to put away the little gourd, but he suddenly felt a new power latch onto him from behind. The powerful force launched them backward, almost yanking the Four Sheep Cube clear of the mist.\n\nHan Sen looked behind, and with much shock, he saw that it was the sixteen little pigs. They had all lined up single-file, with each pig biting the tail of the next one in line. The little pig in front was biting Han Sen’s soul robe, pulling him back.\n\nMysterious spellwork glowed on the forehead of each little pig, and a strange power was spreading amongst them.\n\nHan Sen was shocked. This level of power should have been far out of reach for a mere King class being. Even after donning his Tianxia Peacock King soul robe, Han Sen had still been pulled toward the lake. But the sixteen little pigs were holding on just fine. That was a bit weird.\n\nHan Sen didn’t put too much thought into it, though. After all, he and Bao’er had been putting all of their strength into the effort. Perhaps they had only needed a tiny bit more power, and it just so happened to be provided by the sixteen little pigs. The little creatures probably weren’t that strong.\n\nThe Four Sheep Cube was on the verge of being pulled out of the lake, and Han Sen could see the faces of the bronze sheep above the clouds. They almost appeared frightened.\n\n“Very good! Let’s pull you up so I can see what the hell you are.” Realizing that their tug-of-war with the Four Sheep Cube was almost over, Han Sen started to get excited.\n\nEvery time they had failed to pull the statue free, the sheep heads had mocked him. That had always upset Han Sen.\n\nThe moment the Four Sheep Cube was lifted from the lake, Han Sen felt the tension on his hands loosen. Suddenly, Bao’er and the little pigs were all flying backward.\n\nPang!\n\nThe three-to-four-meter-high Four Sheep Cube came flying out of the clouds. It landed on the soil, one of its corners digging into the ground. Grass and soil sprayed everywhere, showering Han Sen and Bao’er.\n\n“Ah, I finally got you out! So what on earth are you?” Han Sen merrily exclaimed. He lifted himself off the ground and approached the Four Sheep Cube.\n\nBao’er and the little pigs came up to see it, too. Han Sen, Bao’er, and the little pigs surrounded the Four Sheep Cube.\n\nAfter walking around, Han Sen confirmed that the Four Sheep Cube was an ordinary bronze statue. He couldn’t sense any lifeforce or power coming from it. It seemed dead and inanimate.\n\nHan Sen looked at the four sheep heads, but their faces all looked the same. They had lowered eyebrows and half-closed eyes. They looked like frozen monks. They didn’t seem to be mocking anyone.\n\n“Weird. I swear I saw different expressions on their faces. Why aren’t they changing now?” Han Sen used his Purple-Eye Butterfly to have a look, but he couldn’t see anything strange about the statue. The Purple-Eye Butterfly’s rewinding power didn’t work on it, either.\n\n“Is this thing dead or alive?” Han Sen wondered aloud, searching carefully for some sign of power from the statue. Despite its lack of response, Han Sen didn’t believe that the statue was an ordinary bronze object.\n\nHan Sen reached out his hand to tap his fist against the side of the Four Sheep Cube. The action produced a dong dong noise. The statue didn’t look damaged at all. When Han Sen saw that, he became certain that this was no ordinary piece of bronze.\n\nWith his power, even treasures made from King class xenogeneic genes would break if he struck them. But the Four Sheep Cube was totally fine. That meant the material was special.\n\nBao’er jumped over to the Four Sheep Cube to get a better look. She said in surprise, “Dad, there are two fish!”\n\n“Fish?” Han Sen asked. He flew to the top of the Four Sheep Cube and lowered his head to get a better view of the top of the Four Sheep Cube. It was full of water, and there were two goldfish inside. They were black and white."
}