{
    "chapter": 2649,
    "title": "Meeting at the Lake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2649",
    "text": "Han Sen looked at the thick stack of yellow papers he had amassed. He wanted to cry. Those pornographic pictures he had fished up over the past few days were enough to compose an entire book. Aside from the yellow papers, he hadn’t been able to catch anything.\n\n“Don’t say that,” he reminded himself. “These pictures look kind of like a comic.”\n\nIf it wasn’t for Bao’er being there, Han Sen would have liked to examine them in greater depth.\n\nHan Sen looked at the Bao’er. Her experience fishing had been very different. She had managed to earn all sorts of things. Although they weren’t all deified treasures, the things she had collected were all better than the yellow papers Han Sen had received.\n\n“It looks like my luck hasn’t been too good in recent times. Perhaps I should ask Mister White to calculate my fortunes and find a way to heighten my luck,” Han Sen thought, considering various ways he might improve his situation.\n\nJust as it was Bao’er’s turn to fish, the small jade figure reacted. Han Sen quickly pulled Bao’er away and sat down on the lakeshore himself, pretending to be in the middle of fishing.\n\nNot long later, Exquisite teleported there.\n\nExquisite walked over to Han Sen and looked at him. She didn’t see anything next to Han Sen, and she said, “Don’t worry. Underworld Lake is often like this. Sometimes it can take a couple of days to get something, other times it can take weeks. I asked you to come here to test your luck and give you some time to practice geno arts.\n\nHan Sen was shocked. Hearing Exquisite, it sounded as if it was supposed to take a number of days to fish something out. But he had always received something in half a day, at the most. The shortest time it had taken those two to fish something out was half an hour. The average, if he had to guess, was two to three hours.\n\nHan Sen had been trying to think of a way to show Exquisite those yellow papers, but he didn’t have to do that anymore.\n\n“It looks like there are no resources I can use for practice here,” Han Sen said, looking at Exquisite.\n\nUnderworld Lake was magical, but he couldn’t stay here if he was only pulling out old pieces of paper. He would rather kill xenogeneics.\n\n“Don’t rush anything just yet. Recently, my little sister has needed my help. I don’t have the time to take you hunting. So, continue practicing here. If you have enough luck, maybe Underworld Lake will give you a pleasant surprise,” Exquisite said with a smile.\n\nHan Sen might have just been imagining things, but he noticed that when she spoke to him—even though she was still reserved—she tended to smile more and more. She was different from how she used to be.\n\n“There was a surprise, but the surprise was so big, I wasn’t sure how to take it,” Han Sen thought to himself.\n\nAfter a brief conversation with Han Sen, Exquisite quickly walked away. She left a few items behind for Han Sen to live off, and she also provided him with vials of geno fluid.\n\nHan Sen had actually brought his own, but he had forgotten to tell her.\n\nHan Sen pulled a parasol out of Destiny’s Tower, and he also brought out a couple of sunbathing chairs. Han Sen and Bao’er settled themselves down comfortably on the shores of the lake to fish. As they did so, Han Sen also set aside some time to research the geno arts he had been given.\n\nThe geno fluids Exquisite had brought him weren’t bad. They were good for his body, but Han Sen had yet to find a way to make a breakthrough that would enable him to become half-deified.\n\nAfter another couple of days, Han Sen gave up fishing. He let Bao’er do things herself. He focused on practicing his geno arts.\n\nPart of the reason he had given up was because he had continued to receive pieces of paper. It was pointless for him to continue. Whenever Bao’er fished, she would retrieve something encrusted in jewels. Each item was ornately wrought and beautifully finished.\n\nBut aside from the enormous gold sword and the hair clip, Bao’er hadn’t gotten any more deified treasures. Clearly, deified treasures weren’t easily found.\n\nSince Bao’er had already been able to get two, though, that was still a fantastic result.\n\nNot everything she fished up was a high-level treasure. There were a few ordinary items in there. But whether they were high-class or low-class items, they all looked sovereignly luxurious.\n\nSuddenly, Han Sen’s eyes flashed. He picked up Bao’er and pulled the Underworld Silk away from her.\n\nA minute later, he saw someone approach. It was Second Brother Liyu Zhen, the man that Han Sen had met when he first entered Outer Sky.\n\nLiyu Zhen saw Han Sen and Bao’er behaving as if they were having a vacation, lying down on their sunbathing chairs with a parasol. There were many snacks and drinks on a table beside them. There was even a nuclear reactor mini-fridge. The sight made him frown.\n\n“Exquisite brought you here to practice, not to have a vacation,” Liyu Zhen said coldly.\n\n“What has it got to do with you?” Han Sen continued to lounge on the sunbathing chair. He didn’t get up, and he didn’t even spare the other man a glance.\n\nLiyu Zhen’s face looked cold. He stared at Han Sen for a while. Without saying another word, he went to the other side of the lake. He pulled out an Underworld Silk from his head of hair. It looked as if he had come there to fish, as well.\n\nIf most people of another race spoke to Liyu Zhen like that, he would have reacted poorly. But Han Sen was already Exquisite’s silkworm. There was nothing he could do to Han Sen; that was one of the Very High’s established rules. Even if a silkworm committed a crime, it was the master of the silkworm that had to deal with it.\n\nIf Liyu Zhen fought Han Sen there, he wouldn’t simply be fighting Han Sen. He would be humiliating Exquisite. That was why Liyu Zhen didn’t do anything.\n\nWith Liyu Zhen being there, though, Han Sen couldn’t allow Bao’er to fish for him. So, he fished on his own the whole time.\n\nHan Sen’s situation was still mostly the same, though. He still reclined in his sunbathing chair. He tied the Underworld Silk to his finger, so he could sense movement the moment it happened.\n\nHan Sen then turned his attention back to reading through the geno arts. He didn’t have to look at his line, though. He knew it was only a matter of time before he received another yellow piece of paper.\n\nOf course, an hour later, something pulled at his line. He pulled it out of the mist, revealing another sheet of paper.\n\nLiyu Zhen glanced over when he saw that Han Sen had received something. It was just an old piece of paper, though, so he ignored Han Sen and carried on fishing.With Liyu Zhen being there, Han Sen felt uncomfortable. When there was no one, Exquisite could not feel him, and he was able to do anything he wanted to.\n\nIf he disobeyed Exquisite’s wishes while someone was there to tattle on him, however, he could risk getting into trouble.\n\nPlus, Liyu Zhen had seen what Han Sen had pulled out of the lake. Now, he could no longer hide what he had retrieved. If Exquisite wanted to read the pages, he would have to let her see them.\n\n“What is this guy doing here?” Han Sen couldn’t think of a way to get the man to leave, and he couldn’t leave himself. He had to continue fishing.\n\nAfter half the day, Liyu Zhen felt as if something was amiss. In that short period of time, Han Sen had pulled three things out of the lake. They all looked like old sheets of paper. Han Sen was operating at a remarkably efficient catch rate.\n\nWhen Han Sen pulled out his third piece of paper, Liyu Zhen put away his Underworld Silk and walked in front of Han Sen to look at the other man’s catch.\n\n“Let me see those papers.”"
}