{
    "chapter": 1223,
    "title": "Ice Wolf God Armor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1223",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nIce Wolf God’s flesh and Life Geno Essence were great rewards, but Han Sen was happiest about gaining ownership of the Purple Emperor and the beast soul.\n\nHan Sen looked at the beast soul with much joy.\n\nSuper Beast Soul Ice Wolf God: Armor Type\n\nHan Sen hadn’t found another super armor beast soul since his last one got destroyed, so this was a supremely beneficial gain. Han Sen summoned the Ice Wolf God armor to try it on. When it appeared, he was clad in ice-white armor that was skirted with fur. It was both stoic and beautiful.\n\nUnfortunately for him, it was a light armor. Its defense was not as sturdy as the last armor he had obtained, but with that being said, it had immense ice and frost defense.\n\nThe armor glistened softly as the images of snowflakes were generated around him, giving the illusion that snow was perpetually falling in his proximity. It was gorgeous.\n\nHan Sen could use it to block AoE attacks, and what’s more, it was also great against fire.\n\nHe would have liked something a little more useful, but Han Sen wasn’t willing to complain too much. This was already a brilliant find, and it sure had the looks.\n\nAfter a while of self-admiration in the armor, he put it away and decided to get a good look at Purple Emperor. Just the mere thought of doing that made him giddy, as he never expected himself to be able to obtain an emperor so soon.\n\nHan Sen did not bother reading his stats and just summoned him right away.\n\nWhen Purple Emperor appeared in front of him, Han Sen told him, “Tell me what powers you possess.”\n\nPurple Emperor told Han Sen about himself without delay.\n\nHan Sen was disappointed, ultimately. He had indeed opened ten gene locks, but his growth really had been stunted by nutrient deprivation. This made him weaker than the average emperor.\n\n“Opening ten gene locks is harder than replenishing the nutrition he might not have received.” Thinking it over, Han Sen’s disappointment was alleviated somewhat.\n\nSome king spirits actually managed to reach emperor status without opening ten gene locks. Purple Emperor was more than fine, and he had already proved his abilities in the fight earlier.\n\nPurple Emperor was strong and intelligent, and the only thing it truly lacked was experience.\n\nThat was most likely because it had only just been born. So, aside from what resided in his instincts, he knew nothing. He was like a big baby, in some ways.\n\n“It was fortunate of me to claim him now. With him being doe-eyed, it made my claiming much easier. If it was an emperor with much experience, I’d wager he’d rather self-destruct than submit.” Han Sen was certainly warming up to him.\n\nThere were quite a few super creatures in the vicinity, so Han Sen planned to stay at the shelter and see if he could kill a few of them and perhaps max out his super geno point tally.\n\nSo, Han Sen had Purple Emperor, Thorn Queen, and Disloyal Knight remain at Tower Shelter while he returned to the Alliance.\n\nHan Sen and Little Angel were still weak, so he thought it would be best if they took a small break to recover. Furthermore, upon returning to the Alliance, Han Sen’s attention was brought to a number of messages he had received while away.\n\nThey had all been left by Lin Weiwei, and with the number of them there, the subject must have been an urgent one.\n\nHan Sen opened the message to be greeted by an image of Lin Weiwei. She said, “Are you there?! Holy-Sword Shelter is under attack!”\n\nThe rest of the messages all dealt with the same matter, and almost immediately, Han Sen was greatly worried. With Xie Qing King there, whatever was attacking the shelter and causing such panic and distress had to be an obscenely powerful force.\n\nHan Sen contacted Lin Weiwei, and when she picked up, she was surprised and said, “Finally, you’re back!”\n\n“Yes. What’s the issue?” Han Sen said.\n\n“Some spirit brought a bunch of creatures to attempt to conquer us. Xie Qing King killed them all, and so we believed the issue to be over. But a little while later, another host of forces came. This time, the outfit contained a number of super creatures. Xie Qing King told us to teleport back to the Alliance, and if we couldn’t get a hold of you, stay there.” Lin Weiwei paused for a moment, in obvious worry. After taking a breath, she continued by saying, “Will Xie Qing King die by remaining there all alone?”\n\n“I don’t think that guy will go down without a fight; he won’t go down easy. I’ll go and check it out, you stay here safely.” On the inside, Han Sen knew this had to be bad.\n\nXie Qing King was not afraid of anything, but if he told the other humans not to come back, it showed he lacked confidence. That was what was most disturbing about this affair.\n\nAfter that, Han Sen returned to the sanctuary. He knew he had to hurry back to Holy-Sword Shelter.\n\nIt had been four days since the humans took refuge back in the Alliance, and so Han Sen feared it might be too late for him to save Xie Qing King if things had turned ill in his absence.\n\nHan Sen rode Golden Growler back, bringing all his spoils with him.\n\nWhen he arrived at Holy-Sword Shelter, all was quiet. The place was in ruin, but the fighting was over, that much was clear. Buildings had been toppled and walls had collapsed, so the place was in a right state.\n\nWhen Han Sen entered, he was immediately brought great relief. There, he saw Xie Qing King sunbathing as if nothing had changed. On his chest rested a comic.\n\n“You’re fine! That is a relief.” Han Sen smiled.\n\nXie Qing King sat up, and when the comic fell, Han Sen was given a fright. There was a big wound in his chest, one that had exposed his heart. You could clearly see the organ pump.\n\n“What happened?” Han Sen knew that whatever damage he had incurred, Xie Qing King should have healed by now.\n\n“The wound has been marked with a strange power. It… won’t heal. But that’s fine, don’t worry.” Xie Qing King composed himself and went on to say, “But they’ll be back. And I’m sorry to say this, but when they do… I won’t be able to stop them. Bring Lin Weiwei back and take them someplace else. Take them someplace they can be safe… yo.”\n\n“Who did this to you?” Han Sen frowned with much concern.\n\n“Thunder Hell Emperor’s cronies. He won’t show himself, but whoever he sends is sure to be strong. And next time, they’ll be even stronger. I can’t fight them alone,” Xie Qing King frowned and began to bleed again.\n\n“You’re not alone.” Han Sen approached Xie Qing King and used silver lightning on his chest."
}