{
    "chapter": 2319,
    "title": "Returning to Origin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2319",
    "text": "The guard’s water AoE didn’t give him any feeling of security. As those blue wolf eyes stared at him, cold sweat snaked its way down the King’s forehead and across his face.\n\nOwooooo!\n\nThen the blue metal wolf howled again. Its strong limbs unleashed a grand amount of power. The water AoE was strengthened by the falling lakewater, but even so, it wasn’t enough to trouble the blue metal wolf.\n\nThe blue metal wolf’s body blurred, and then it was opening its mouth and biting into the guard’s body.\n\nPang!\n\nThe wolf’s teeth sank into the King’s body, and at that moment, he exploded like water. His armor and weaponry were chewed up and swallowed.\n\nThe body itself had turned into water, however, and that water surged out of the wolf’s mouth and transformed back into a man that was headed for the lava sky.\n\n“He’s one of the Extreme King! That must be his water element King body.” Han Sen watched the King class guard become a waterman, then head for the lava sky. Han Sen wasn’t going to let him run off, and so he stopped the man and used the Thunder God Spike to pierce his body.\n\n“I am Prince Sixteen. Get out of my way!” the King shouted.\n\nHe wasn’t afraid of Han Sen, though. He was just afraid of that blue metal wolf. It had eaten his armor and lance, and now it was coming for him with hungry eyes.\n\nIf he was stopped by Han Sen, the blue metal wolf would be able to attack him once more. He knew that the wolf had to be some sort of deified being. He wouldn’t be able to win in a fight against it. His Original Water King Body would be useless against a deified enemy. He had been incredibly fortunate to escape the first time.\n\n“And I’m your daddy, King Bai.” Han Sen didn’t believe him, and so he pounded the Blood Scorpion Jade Drum and thrust the Thunder God Spike towards the man. He wanted to stop the King guard at all costs.\n\nThe King guard saw the blue metal wolf approaching him. He didn’t have time to hesitate. He gritted his teeth and ran into Han Sen’s Thunder God Spike without taking the time to evade.\n\n“Very good.” Han Sen had no intention of going easy on him. The Thunder God Spike perforated the guard’s Original Water King Body. The Thunder God Spike couldn’t be withstood by someone who was half-deified, so Han Sen didn’t believe a King body could overcome the lightning’s wrath.\n\nThe Thunder God Spike pierced into that watery body, its silvery lightning flashing all throughout the liquid. The water body started to brighten.\n\nBut the electrified water body didn’t fall back toward the wolf. Han Sen heard the King scream, coming straight toward Han Sen. He then managed to hit Han Sen.\n\nThe water body smacked Han Sen, then shattered. The guard was all over Han Sen.\n\n“Argh!” Han Sen shouted. The lightning in the water shot into him, so he was also electrified. His hair was blasted straight, and he almost fell out of the sky.\n\nThe blue metal wolf down below howled at the pair. It looked ready to unleash another attack. Han Sen fought off the numbness that was taking over his body, flapped his wings, and returned to the lava.\n\nAfter Han Sen teleported back to the lava and quickly began swimming upwards. He felt as if something was wrong with him. The King class guard had become water and splashed across him, and due to this, he had been electrified. The water was gone, but it felt as if it was now inside his body.\n\nHan Sen could clearly feel a strange, watery power inside him. It was sinking into his body and trying to merge with his cells.\n\n“What are you doing? Get out of me!” Han Sen shouted angrily.\n\n“Ha! Do you think I want to do this? If you hadn’t pushed me into this, I wouldn’t have performed Return to Origin to combine with your body. I am one of the Extreme King. You should feel honored to have my body combine with the body of a rubbish race like yours. Ha… weird… You have some blood of the Extreme King within you. Even God is helping me! It’s weak, but it’s better than nothing, though.” The King’s voice echoed within Han Sen’s body. It was like Han Sen’s own cells were screaming at him.\n\nHan Sen felt depressed. If he had known that this would happen, he wouldn’t have stopped the guy. He would have just let him walk away.\n\nThe man who claimed to be Prince Sixteen wasn’t using some skill that could take over a person’s mind. His technique allowed him to merge their cells and attempt to combine their very bodies.\n\n“So, you really are Prince Sixteen?” Han Sen asked, using some of his power to fight back against the invasion of his body.\n\n“Ha, my name is Bai Yi,” said the voice.\n\n“My prince, how about this. Let’s pretend that nothing happened between us. You get out of my body, and we both go our separate ways,” Han Sen said.\n\n“Are you scared now? It’s too late. Once the Return to Origin starts, not even I can reverse it. I will have to overtake your body,” Bai Yi said with a cold grunt.\n\n“Think of a way to stop it!” Han Sen tried repeatedly to remove his enemy. Neither Jadeskin nor his Blood-Pulse Sutra could stop the invasion of that power.\n\n“There is no need to waste your breath. I told you: this is Return to Origin. I have now become a part of you. I will be you. I will sink into your cells and even your genes. And then, I will replace your cells and your genes. And then, you will become me,” Bai Yi said with grim certainty.\n\n“Isn’t this something like a village surrounding a city?” Han Sen felt depressed.\n\nWhen ordinary creatures tried to take over his body, they usually ended up in his Sea of Soul. But this guy was doing things the opposite way. He was starting to combine with Han Sen from the body, which kept him from going into the Sea of Soul where he would be destroyed by the black crystal armor.\n\nRight now, Bai Yi’s Original Water King Body was inside Han Sen’s cells. If Han Sen wanted to get rid of him, he’d have to destroy his own cells. But that also meant he would have to destroy his body. It put him in a difficult situation.\n\nWhen the Original Water King Body started to replace Han Sen’s own cells, he felt the change.\n\n“Enjoy the final moments of your life. You will soon become me, and I will take all your things. That includes your body, your will, and even your memories. Everything belonging to this body will become mine,” Bai Yi said with a cold laugh.\n\n“You are too naive.” Han Sen chuckled. He used Spell, and a mysterious symbol appeared on his forehead.\n\nThe solidifying power of Eternity covered his body. It cemented his body as it was, forbidding any changes.\n\n“What kind of power is this?” Bai Yi screamed in shock."
}