{
    "chapter": 1040,
    "title": "Phoenix Headlight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1040",
    "text": "Han Sen wanted to approach the doors and examine them, but Brother Seven stopped him and said, “This place is dangerous. Don’t do anything reckless.”\n\n“Isn’t that where the Phoenix Eye might reside?” Han Sen asked.\n\nBrother Seven turned to look at the images of a phoenix and said, “A phoenix is a bird that has died, and is then reborn from the ashes of its prior form. Typically, dead is dead, and you don’t get to come back from that. But there have been rare instances of resurrection in the past.”\n\nBrother Seven noticed that the claws of each phoenix were painted around the door knockers. Each door had a knocker.\n\nWhen Brother Seven saw this, he said, “On my signal, we knock on the door three times.”\n\nHan Sen nodded and moved over to the left door’s knocker.\n\nThe door was massive. It would have been impossible for one person to use both door knockers at the same time, so the duo had to co-operate.\n\nBrother Seven reminded Han Sen to knock three times, and three times only. He looked nervous.\n\nHan Sen wasn’t really sure what was going on, so he wasn’t feeling any sort of pressure.\n\nBrother Seven gave his command, and then they used the door knockers three times.\n\nTheir knocking was perfectly in sync with each other.\n\n“Back!” Brother Seven shouted, which prompted them both to retreat away from the door a little. Then, they watched what might happen.\n\nBao’er was still there, suckling her milk bottle. She watched with as much curiosity as they did.\n\nThe screeching of two phoenix birds sounded. The images came to life, and they left the door to fly around together.\n\nHan Sen had maxed out his fire geno points, but even so, the heat the phoenixes were emitting was incredibly hot even for him.\n\nThe doors slowly opened to reveal a large hall. They could see two lanterns there, still lit after all those years.\n\nBrother Seven stepped inside and said, “Quick; when the phoenixes return to the doors, they will close.”\n\nHan Sen walked past both creatures, feeling as if his hair was being singed.\n\nJust as they both entered the hall, the phoenixes returned to their doors, and the doors silently closed.\n\nThe hall before them had nine lanterns, each shaped like the head of a phoenix.\n\nBut aside from that, there was nothing else of particular interest. There was, however, another room they could enter at the back. No light came from within, so it was pitch-black.\n\nBrother Seven muttered to himself, “Two phoenixes together, and the lanterns split them up. I didn’t know spirits practiced Yin Yang.”\n\n“Brother Seven, care to speak up? What does that mean?” Han Sen asked.\n\nHan Sen was a proficient fighter, but that was about it. He wasn’t really educated in the subjects that Brother Seven was.\n\nBrother Seven then said, “Phoenix Emperor is not a person.”\n\n“He is a spirit,” Han Sen replied.\n\nBrother Seven then said, “I mean, he is not a sole person. There are two.”\n\n“Are you saying there are two of these emperors?” Han Sen asked with much shock.\n\nBrother Seven responded with a nod. “There is a male and a female phoenix. ‘Phoenix Emperor’ is a title given to a pair of spirits.”\n\n“Or maybe they are together, in a two-for-one way?” Han Sen suggested.\n\nBrother Seven agreed and said, “It is possible, but they would still wield two separate powers.”\n\nBrother Seven looked at a lantern to his left and said, “This is the fire. It represents Yang.”\n\nBrother Seven then looked to the right lantern and said, “This is the blackfire. It represents Yin.”\n\nHan Sen noticed the fires did indeed look different.\n\n“Do they mean different things?” Han Sen asked.\n\nBrother Seven explained, “The living fire is Yang. It guides you to life, survival, and prosperity. The blackfire is Yin, which guides you to hell.”\n\nBrother Seven looked towards the black hallway ahead and said, “That is a path that straddles the line between Yin and Yang. I am not sure what danger, if any, will await us. If we seek to survive, we are going to need a lantern. But…”\n\n“But what?” Han Sen asked.\n\n“The phoenix lanterns are for the living. We have to bring them, if we want to survive. But even so, that doesn’t seem quite right.” Brother Seven paused for a brief moment of contemplation, and then went on to say, “This is a path between life and death.”\n\n“Then which lantern are we to pick?” Han Sen asked.\n\n“I don’t know. Whichever we choose, there is great risk. This is a test of this Phoenix Emperor; and he is smart, whoever he is.” Brother Seven had a wry smile.\n\n“Well, if we aren’t going to get any answers there’s no use debating is there? Let’s give it a go.” Han Sen picked up a lantern without consultation, and went on to say, “I’ll go first and check it out.”\n\nHan Sen didn’t know anything about the matters Brother Seven was talking about, so he was not very concerned with the need to be careful. If Phoenix Emperor was ahead, and he had to fight him, Han Sen was confident he could just use super king spirit mode to defeat him.\n\n“Hang on,” Brother Seven said, as he stopped Han Sen. “Think of a word in your mind. It can be any word. And now tell me what it is. I can predict, from your word, whether your selection of lantern is good or bad.”\n\nHan Sen smiled and said, “Prediction is pointless. We can’t change our destiny; a decision is a decision. Being able to predict things is a waste of time. I’m going; good lantern or bad.”\n\nAfter that, Han Sen lifted his lantern and walked forward into the dark place."
}