{
    "chapter": 132,
    "title": "Another Sacred-Blood Beast Soul",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_132",
    "text": "The sacred-blood fox king didn’t even move when seeing the arrow approach. It even showed contempt in its eyes.\n\nBut soon, the fox king was aghast. That arrow was not meant for the fox king, but a bean-sized eye of the golden rock worm.\n\nAlthough the golden rock worm had a huge body, its eyes were as small as beans and hidden in its stone-hard shell, hardly noticeable.\n\nHen Sen not only saw them, but also managed to shoot an arrow in one of them. with a scream, the golden rock worm rampaged toward Han Sen who was in the air.\n\nThe sacred-blood fox king had extremely high intelligence, but golden rock worm solely operated on instincts. Once it was provoked, it would go mad.\n\nIt was too late for the fox king to stop it, so it jumped off the worm with its injured leg as fast as it could before the worm fell off the cliff.\n\nWang Mengmeng was held in Han Sen’s arms and took back the bear. She felt she was falling with him.\n\nWith a sudden jerk, she felt ground under her feet. The impact was not that strong though. It was as if they had jumped from somewhere three or four feet above the ground.\n\nWang Mengmeng opened her eyes in surprise to find they were under a cliff more than 300 feet high. But nothing had happened to Han Sen and her.\n\nWhen she was feeling incredible, the golden rock worm fell on the ground next to them like a bomb.\n\nWith a boom, its stone-hard shell was broken in pieces. Worm juice, meat and inner parts were splashing everywhere, staining the cliff wall.\n\n\"Sacred-blood golden rock worm king killed. Beast soul of golden rock worm king gained. Eat its meat to gain zero to ten sacred geno points randomly.\"\n\nA wonderful voice rang in his mind, almost making Han Sen laugh out loud.\n\nThe fox king was still lingering on the cliff, gazing at him full of resentment.\n\n\"Let’s go.\" Han Sen summoned his mutant three-eyed beast mountm carried Wang to its back, and went in the opposite direction of the fox king.\n\n\"Should we take some of the worm meat with us?\" Wang Mengmeng asked.\n\n\"For such a big worm, there are only ten geno points in its meat. Even if we eat for a month, we might still end up with no geno points. Also, it is hot in here and the meat will go bad in less than two days. Just forget it,\" Han Sen said with a smile.\n\nA creature too big in size was hard to consume, which was just the fact. But he had gained another sacred-blood beast soul and a mutant horned sand fox beast soul, so the voyage was fruitful enough.\n\nThe only pity was that although he had killed many mutant horned sand foxes and a sacred-blood creature, he did not even get to eat a mouthful of meat.\n\nHan Sen took a look at the two beast souls he just gained and felt a bit bitter.\n\nThe beast soul of mutant horned sand fox was a mount, which was fine. Even if he had no use of it, he could still exchange it for something else or just sell it.\n\nThe disturbing part was the beast soul of the golden rock worm king. It turned out to be a sacred-blood beast soul pet.\n\nHan Sen had been feeding Meowth for quite some time now, but it never transformed. This was a sacred-blood pet, and God knows how much meat it would take for it to transform.\n\nAnd a sacred-blood pet must be fed with a sacred-blood meat, or else it would take even longer.\n\nHan Sen was rendered speechless. He did not even have enough sacred-blood meat for himself. Just where could he find food for this guy?\n\nHan Sen tried to summon the golden rock worm king and thought it should be huge. When it appeared, Han Sen saw that it was just a mini golden silk worm, not looking the least impressive.\n\n\"Brother Han, why were we safe after jumping from the high cliff?\" Wang Mengmeng had been puzzled.\n\nWhen they jumped off the cliff, she was too scared to open her eyes, and did not see how they landed.\n\nIn fact, even if she did not close her eyes, Han Sen was covering them anyway. He did it so that he could use the wings of the purple-winged dragon beast soul. Or it could never have been done.\n\n\"Because I know a special martial art.\" Han Sen smiled.\n\n\"What kind of martial art? Can you teach me?\" Wang Mengmeng looked at him with worship.\n\n\"It only runs in the family and only sons can be taught, so I can’t even teach my wife and daughter, let alone you.\" Han Sen laughed.\n\nHan Sen did not go back and try to kill the sacred-blood fox king. It was a sly creature. In the end, it did not escape but stood on the cliff. Han Sen knew from its look that it was trying to lure Han Sen back to kill it.\n\nIf he was alone, he could give it a try. But since Wang Mengmeng was here, he gave up the idea of adventure.\n\nThat fox king was the most cunning of creature he had ever seen, even more formidable than the silver bird.\n\nWith this accident, the voyage had to stop. When Han Sen and Wang Mengmeng were on their way back to the shelter, they met Gambler and the rest. They were all well with minor injuries which had almost healed.\n\nAfter some discussion, they did some hunting in the outskirts of the desert and did not go to the center.\n\nThey had met scary sacred-blood creatures when they just entered Devil Desert. The team became more careful especially they had to protect Wang Mengmeng in the meantime.\n\nHan Sen made up his mind to return as soon as they could, and he will make some in-depth exploration next time he came alone.\n\nThis task was successfully completed despite the accident. Qin Xuan was fairly satisfied with his performance. Because Wang Mengmeng worshiped Han Sen very much and named him her protector in Steel Armor Shelter, he could have an S-Class license of Saint Hall as his reward.\n\nBut his mission would be only completed when Wang Mengmeng had maxed out on all other three types of geno points than sacred geno points. Only by then he could have the S-Class license.\n\nHan Sen went back to school from God’s Sanctuary and continued to study warframe operation.\n\n\"Sen, you are finally back. You are in trouble.\" His roommates said to him excitedly when Han Sen just returned to his dormitory.\n\n\"What kind of trouble?\" Han Sen asked puzzled.\n\n\"The best player in Hand of God Society Li Yufeng openly challenged you in campus community,\" Shi Zhikang said.\n\n\"I do not know him. Why would he challenge me?\" Han Sen felt quite puzzled.\n\n\"Ha-ha, everyone knows Li Yufeng is Ji Yanran's suitor. And with you ID name, the entire school now knows you as Ji Yanran's boyfriend. Of course Li Yufeng needs to challenge you. He said if you lose, you need to change your ID name or stop using that account, and you will also have to apologize to Ji Yanran,\" said Lu Meng with a trace of joy in his voice."
}