{
    "chapter": 1138,
    "title": "Mother Tree",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1138",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Uncle Liu, can you provide us passage to this tree?” Han Sen asked, thinking to himself, “If the treasure is going to mature, I need to see it!”\n\n“You don’t want to go there; trust me. Countless creatures have amassed there. Your life is of considerably more important than the fruit,” Liu Yunhui said.\n\nThey wouldn’t take him there, no matter what Han Sen pleaded. Han Sen knew they were only being nice, but still, he wanted to see it.\n\nSo, Han Sen wasn’t going to push the matter any further with them. He told them he’d at least like to be nosy and poke about their shelter.\n\nThey agreed to take him there, but Han Sen called for Moment Queen and Blue Dinosaur to accompany him. The dinosaur could fight two super creatures at once, easily. If he held them off, Han Sen believed he’d have more than enough time to grab the treasure all for himself.\n\nThe humans were living in fair conditions in that shelter, and doing quite well for themselves. They were allowed to bring Han Sen and Queen in with them.\n\nAmongst the four, Wu Tian was the weakest. Although that was just relative, as he had opened six gene locks. Two of the others had opened seven, whereas Liu Yunhui had opened eight.\n\nThe reason they had so many gene locks open was because their spirit had provided them geno points.\n\nThe royal spirit that signed a contract with them had to have been really powerful. The humans, being of such strength, must have been quite important to the spirit, in return.\n\nWu Tian did not take them too far into the shelter. They walked around for a bit before they were told to leave.\n\nHan Sen was going to offer to conquer the shelter on their behalf, but he wanted to take a look at the tree first.\n\nWu Tian told Liu Yunhui, “There is a ninety percent chance those two will go and look for the tree.”\n\nLiu Yunhui replied to this, saying, “We advised them not to. If they continue, and something awry befalls them, on their heads be it. Their blood cannot be on our hands.”\n\n“That’s a shame. It’s a waste of a stunning booty, in regards to that woman,” Wu Tian said.\n\nHan Sen and Queen walked a few additional miles before coming across Moment Queen and the dinosaur running towards them.\n\nThe dinosaur had gobbled up a bunch of scorpions along the way, and it looked excited.\n\n“Why did you call me down this gloomy hole?” Moment Queen asked, and then started to sniff around as if in delight.\n\nHan Sen took notice of the pleasant fragrance Moment Queen was smelling, too. It was as refreshing as it was surprising, given the environment.\n\nTo find the tree, all they had to do was follow their noses. As such, they did not require the humans to guide them there. Moment Queen looked as if she knew where the scent was coming from, otherwise she wouldn’t have looked so strange and coy right now.\n\n“It looks like you know what it is. Spare us both the trouble and just tell me,” Han Sen told her.\n\nIf she wasn’t going to be honest, Han Sen had a way in which he would deal with her.\n\nMoment Queen knew the jig was up before it had even begun, and that her expression had sold her out. But she couldn’t blame herself, as the scent took her by complete surprise. It was too late for her to say she didn’t know anything now, though.\n\nMoment Queen told Han Sen, “This scent reminds me of a tree I once knew. I’m not sure if it is the exact same tree, but it sure does smell similar.”\n\n“And I’m sure you aren’t mistaken, right?” Han Sen said with snark.\n\nIt was obvious Han Sen was warning her. If she was not telling him the truth now, even Moment Queen herself knew she’d be in hot water.\n\nMoment Queen was a little mad at the comment, though. She said, “In the garden owned by my previous emperor, there was a Mother Tree. The smell is remarkably similar, that is all. I am not entirely certain, so it really won’t be my fault if I am mistaken!”\n\n“Why?” Han Sen asked.\n\nMoment Queen sniffed and said, “The tree I used to know had been growing for thirty thousand years, and the smell was far weaker than this. So, like I said, I am not entirely certain.”\n\n“What is that tree, then? What can it grow?” Han Sen asked.\n\n“I don’t know. I only saw it once, and the emperor did not tell me what manner of fruit it could grow. He only said it was an emperor tree that could benefit everything.” Moment Queen told Han Sen this, but it wasn’t the truth.\n\nShe had seen the tree, but it hadn’t ripened. The emperor, though, told her exactly what could be harvested from the tree, and that was why she was so shocked. If the emperor was telling the truth, it was no wonder he took such fond and delicate care of the tree. They were extremely difficult to come by.\n\nHan Sen knew she wasn’t telling him the whole story, though, and she was back to her conniving ways. As punishment, he returned her to the Sea of Soul.\n\nWhatever she had planned, she could only sit back and watch now.\n\nMoment Queen wanted to kill Han Sen more than ever, but it was a desire that had never truly gone away. She was planning on taking advantage of the tree, but now that Han Sen had put her back, she couldn’t do a thing.\n\nThat being said, Han Sen did not care for her feelings, and so he just walked to the tree alongside Queen and the dinosaur.\n\nThe Blue Dinosaur seemed to very much enjoy that smell, too. Without even being commanded to, it eagerly led the way forward."
}