{
    "chapter": 1071,
    "title": "Devil’s Realm",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1071",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was shocked. The black mist grew to swallow the entire area. Inside, his Dongxuan Aura had been throttled, and its effective radius had been brought down to a mere ten meters.\n\n“What the h*ll is going on? Where am I?” Han Sen examined the area and stumbled towards the first building he could see.\n\nHan Sen could not make out anything in that mist, but he could see this one building as clear as day. It was visible, and yet it must have been at least one hundred meters away.\n\nHan Sen poked around his current vicinity, but he could not find anything worthwhile in the midst of that black fog.\n\n“I should have waited for Xie Qing King and allowed him to take the spirit stone.” Han Sen had gone for the spirit stone first to see whether or not Holy-Sword Emperor would obey him. The spirit had gleefully opted to kill himself, which unnerved Han Sen.\n\nSuddenly, the sound of a baby crying emanated across the black-choked cobbles around him. It was spooky, and it immediately made both him and Bao’er alert.\n\nThe red bird was disturbed, too. It tucked its head into Bao’er’s clothing, prompting her to say, “It’s okay. Don’t be afraid.”\n\nSuddenly, a monkey with wings appeared before them through the darkness. It was veiled in a shroud of deeper black, and it did not look too different from the super creature they had encountered in Holy-Sword Shelter.\n\nAs it came closer, Han Sen was able to sense that it was different, though. This one was only a sacred-blood creature.\n\nHan Sen pulled out his Phoenix Sword and spared no time in swiping it against the monkey’s claws. Effortlessly, they were sliced off, squirting inky blood.\n\nThe monkey was aggressive right off the bat, so Han Sen had to react accordingly. Following its bloody nail-cutting, the monkey then tried to lunge forward and capture Han Sen in its fanged mouth.\n\nKatcha!\n\nHan Sen swung his sword again and lopped its head off.\n\n“Sacred-Blood Creature Ghost Fang killed. No beast soul gained. Consume its flesh to gain zero to ten sacred geno points randomly.”\n\n“This must be the same type of monster I saw back in Holy-Sword Shelter. I’ve unwittingly stepped into another realm of sorts, but I can only suspect it to be a place Holy-Sword Emperor himself has been in before. And if he was able to come here and later leave, I should be able to do the same.” Han Sen mulled his current predicament in his head.\n\nBrother Seven once told Han Sen that one of the creatures of Holy-Sword Shelter swore allegiance to Holy-Sword Emperor because it had been saved, once upon a time.\n\nNow that Han Sen thought about it, he guessed it might have been that monkey.\n\nHan Sen returned his attention to the statue before him. He reevaluated it, and came to the conclusion that it wasn’t a jolly woman as he had initially guessed it to be.\n\nThe ears of the humanoid statue were pointy, and she had wings and a tail that ended like an arrowhead. It looked like the common depiction of a devil or succubus.\n\nHan Sen tried to contact Moment Queen for assistance, but he was unable to. This told him that this location was not ordinary and getting out would be a trial.\n\nHe fingered the Dragon Blood ring and summoned Dragon King. Dragon King was weak, and when he spawned, he appeared as nothing more than a scrawny little dragon that hovered in circles.\n\n“My power fades every time you summon me,” Dragon King said, but then said nothing more. His attention had been immediately snagged by the statue in front of them.\n\nDragon King exclaimed to Han Sen, “Dmn it! Why are you here?”\n\n“I’m interested in knowing where here is, first and foremost.” Dragon King seemed to be familiar with the location, which was good news for Han Sen.\n\n“Get out of here. You must go at once!” Dragon King pleaded with worry.\n\n“How? I don’t know how to leave,” Han Sen explained.\n\n“What do you mean you don’t know how?” Dragon King was visibly panicked, and he swiftly moved on to ask, “Then, how did you get here in the first place?”\n\nHan Sen explained the events that had transpired in Holy-Sword Shelter, and what had led him up to this point. When he was done with his story, Dragon King looked surprised.\n\nDragon King was no longer able to speak in hushed tones, it appeared. Again, he shouted, saying, “That *sshole is cruel. He used a Devil Orb to send you here. Oh well, I guess we better get comfy and await our inevitable deaths.”\n\n“He used a Devil Orb? To send me here to this… what would you call it? Devil Realm? What is so special or unique about this place, exactly?” Han Sen asked.\n\n“Special?” Dragon King shook his head and prepared himself to explain. “Back in the day…”\n\nDragon King’s speech was abruptly cut short by some unknown force.\n\n“Back in the day, what?” Han Sen asked.\n\n“Look, you just need to know the danger you’re in. This place harbors countless creatures, ones that are all hungry. There are also cracks in this dimension,” Dragon King explained more succinctly.\n\nHan Sen smiled in response, saying, “You do know we are both in the same boat here, yes? By helping me, you’re helping yourself get out of this mess. If you’re hiding something from me…”\n\nDragon King seemed to ponder something for a moment. When he was ready to talk again, he said, “This is Ancient Devil Emperor’s Shelter. There was once a war, and one consequence of it was a shattering of the dimension. For some reason, the creatures in this place grew stronger and leveled up. Even in my prime, I would not dare venture here.”\n\n“Someone fought this Ancient Devil Emperor so hard that this was the aftermath?” Han Sen asked in shock.\n\nDragon King eyed the surroundings and said, “This is the entrance of the shelter. Scale this statue that’s in the image of a devil-woman, and after a hundred-thousand stairs, you will be inside the shelter in full. Unfortunately for you, the stairs have been destroyed.”"
}