{
    "chapter": 236,
    "title": "More or Less",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_236",
    "text": "\"We can only know after a match,\" replied Han Sen with a smile.\n\nThe senior team members cast odd looks at him. If the comment was from any other freshman, they would definitely tell the person all about the bad performances of Blackhawk in history.\n\nHowever, it was Han Sen who said it, so they remained silent. After all, Han Sen was the genius on campus and had achieved great success in other items. Deep down, they still felt contemptuous about what Han Sen had said.\n\nSitu Xiang was satisfied with Han Sen's remark. She was glad to see that at least one person had morale on her team. Blackhawk had been a loser for so long that it was natural for the senior team members to lose confidence.\n\n\"We will watch another video, also from an unevolved person.\" Situ Xiang played another video, the background of which was a virtual gaming platform.\n\n\"It is the White Birds Forest from Sagittarius.\" Someone suddenly recognized that.\n\nWhen the video started to play, Han Sen was surprised. It was the video of him taking the White Birds Forest test.\n\n\"Who is this person? That's so impressive!\" Shi Zhikang stared his eyes wide.\n\n\"This must be edited.\"\n\n\"Is he really an unevolved person?\"\n\n\"Is that also Jing Jiwu?\"\n\n\"I have seen that. It is a real video and has been recognized by Sagittarius.\"\n\n\"I've also been to the scene, and was no match to that. Who is he?\"\n\n\"It is not important who he is. Do you think he's weaker than Jing Jiwu?\" asked Situ Xiang.\n\n\"It is hard to say without a match.\" Everyone started to ponder. Jing Jiwu was indeed strong, but the person in the video was equally good. It was very hard to tell who was the better archer.\n\n\"Since someone is Jing Jiwu's match, why can't that be you?\" asked Situ Xiang.\n\nNo one replied. The teammates were all thinking, \"How is it possible that we have that kind of skills?\"\n\nAlthough they all understood Situ Xiang's intention, they became even more depressed after seeing how good other people were.\n\n\"Han Sen, do you think this person is stronger than you?\" Situ Xiang asked Han Sen. She wanted Han Sen to lead the team in this tournament. If he did not have the resolve to win, she would have to reconsider despite his good skills.\n\n\"I should be on more or less the same level.\" Han Sen cleared his throat and answered. It was him in the video, so of course it was the same.\n\nHan Sen was still wondering who had leaked the video. Fortunately, his facial features were blurred, and no one could tell it was him.\n\nHe did not think it was Qin Xuan, but who else would watch his test and record it?\n\nHan Sen did not mind either. It was fine if someone found out it was him.\n\nHan Sen's comment sounded arrogant to others. The level of the guy in the video was clearly beyond that of a monitoring school student. Although Han Sen did well in warframe and black and white boxing, he rarely went to archery classes.\n\nLike what Situ Xiang was thinking before, his teammates felt unsure about Han Sen's archery skills and were reluctant to believe that he had the same skill level.\n\nSitu Xiang was satisfied with his answer. She thought he was confident, which was a great quality for someone to lead the team. The senior team members were also good players. And they often lost because of their lack of confidence.\n\n\"Fantastic. This year, our goal is to beat the Alliance Central Military Academy. So, let's work toward that.\" Then Situ Xiang announced the training plan and asked each player to follow through.\n\n\"Han Sen, do you really think you can do the same?\" Zhang Yang asked Han Sen on their way back to the dormitory.\n\nShi Zhikang and Lu Meng also looked to Han Sen, interested to hear his reply.\n\n\"Which video are you talking about?\" Han Sen asked.\n\n\"How about Jing Jiwu's?\" Zhang Yang widened his eyes. It sounded like Han Sen thought he could match both.\n\n\"Jing Jiwu's skills are hard to match. His fitness index is too high. And I lack in physical strength compared to him.\" After watching Jing Jiwu's video, Han Sen also thought he was a formidable opponent.\n\nHis techniques did not seem fancy, but were extremely practical. In addition, he had an outstanding physique. Therefore, no one would be his match.\n\nHan Sen's physique was among the top in the unevolved category, but compared to Jing Jiwu, he was not as good.\n\nCurrently, Han Sen's sacred and mutant geno points were not maxed out yet, and his Jadeskin had not even reached the first phase. If he could improve on those two aspects, he should be able to beat Jing Jiwu.\n\n\"Han Sen, are you really as strong as the person in the White Birds Forest?\" Shi Zhikang couldn't help but ask.\n\nAs a student in the archery department, Shi Zhikang knew how difficult it must be. It was the ultimate goal of any archer.\n\n\"More or less,\" Han Sen shrugged and said helplessly.\n\n\"If you will, we should go take the test here on campus, so that the senior team members would stop their bulls,\" Shi Zhikang said with anger.\n\nAlthough the senior team members did not say much at the time, secretly they commented on Han Sen's arrogance, which pissed Shi Zhikang off.\n\n\"It is unnecessary to prove anything to strangers. At the time of the match, the truth will speak for itself,\" said Lu Meng reasonably.\n\nZhang Yang also nodded, \"We should ignore them now and practice hard. If the school sends us, we will show them Lu Meng is not impossible in the tournament.\"\n\nShi Zhikang had to give up the idea of taking Han Sen to take the test.\n\n\"Han Sen, do you have a minute?\" A sensual female voice sounded when they were going back to the dormitory."
}