{
    "chapter": 2565,
    "title": "Deified Five Stages",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2565",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen gnashed his teeth as he tried to get up. He used all of his power to do so, and that included opening his ninth-tier Dongxuan Area. Yet despite that, his body was still pinned to the ground. It didn’t look as if he would be leaving anytime soon.\n\nIt wasn’t only Han Sen suffering this. Li Keer and Exquisite were desperately trying to get free, as well. Their faces looked more than grim. They weren’t acting this time. This situation was beyond their control.\n\nThere were many accidents in life, and now, Li Keer and Exquisite had run into one. It was a very bad one, at that.\n\nThey had seen the Crocodile God before, and it wasn’t too long ago. They knew how strong the Crocodile God could be, but they were still confident they had a sufficient amount of power to get by if they fought the creature.\n\nBut while men propose, gods tend to dispose. And the Very High were not gods. It was impossible to see and know everything. They hadn’t realized that this deified Crocodile God had such strength.\n\nDeified beings had five stages of growth: primitive, transmutation, larva, butterfly, and true god.\n\nOrdinary deifieds in the core area were considered primitive. The core area’s deified xenogeneics were forever stuck in the bracket of primitive deifieds. It was thought that they were limited, unable to grow beyond that level.\n\nEven though the strong ones like Gold Armor General were on the upper edge of the primitive bracket, they were still worse than an average deified being.\n\nWhen they saw the Crocodile God, they thought it was on par with the Gold Armor General. It had a strong body that was on the upper borders of the primitive level. Its area was composed of chains that were used to restrict enemies.\n\nBut that was all there was to it. Exquisite and Li Keer weren’t afraid of the creature. God’s Wander could break space and let them escape the Crocodile God’s chains. The last time they were here, this was how they had gotten free.\n\nBut this time, something unexpected had happened. The Crocodile God had changed. It must have somehow managed to level up. But that should have been an impossible task for deifieds in the core area.\n\nThey didn’t know if the Crocodile God was of the transmutation rank or larva rank. What was happening here was completely outside of their experience and education, and the Crocodile God’s power exceeded what they were able to sense and understand.\n\nThe scariest thing about all of this, though, was that after the Crocodile God leveled up, wild changes had occurred within the creature’s substance chains. Its scary, gravity-like substance chains could affect space. Space was cracking and breaking under the creature’s power, which also kept them from escaping.\n\nLi Keer and Exquisite used all the geno arts they could think of to try to break free. They used more than Han Sen, even. But under the gravitic power of the Crocodile God, none of their abilities seemed to work.\n\nOne power could crush ten things, but the Crocodile God’s gravity was strong enough to crush everything. At the very least, it prohibited Li Keer and Exquisite from breaking free.\n\n“Third Sister, what do we do?” Li Keer asked Exquisite in a trembling voice.\n\nExquisite was able to keep calm. She watched the Crocodile God slowly coming toward them, and she said firmly, “Although I don’t know what has happened, the core area has allowed the Crocodile God to level up. I don’t think it has reached any further than transmutation, though. The substance chains have made their own substance rules, and those rules are not yet complete. We have our Very High Spell, and if we exhaust all of our power, we might be able to escape this.”\n\nUpon hearing Exquisite say all this, Li Keer felt much safer. But she asked, “What about Dollar?”\n\nHan Sen was quite far away from them. Under that scary force of gravity, they were unable to move. When they used their powers, they would only be able to escape the Crocodile God’s trap in a straight line. God’s Wander could probably allow them to escape, but they doubted they would be able to save Han Sen.\n\n“We will try to save him, but if we can’t, then you must select another silkworm,” Exquisite said quietly. It was like Han Sen’s life was nothing in her eyes. He was like a piece of paper; if it was ripped, it was no big deal.\n\nThe Very High had no emotions. They weren’t born that way, but the more they practiced the Very High Sense, the less they cared about the people around them.\n\nLove didn’t need to be shown. For the Very High, love didn’t mean anything. On top of that, Dollar was just a silkworm. The silkworms they selected were no more important to them than test subjects or lab rats. The Very High would foster their silkworms, watching them grow and develop until they became deified. Then the Very High would continue to raise their silkworms through the ranks of primitive, transmutation, larva, butterfly, and true god. The Very High would learn through this process, experiencing what it was like to become a god. With that experience under their belts, they would have a good base to become true gods.\n\nWhen the Very High began to follow their own path to power, the process would be much safer and smoother. Their power grew, and they never needed to experience the misfortune of a mistake.\n\nCreatures in that universe took pride in being selected by the Very High. They thought they were actually taking advantage of the Very High, as they would learn many geno arts and be given many other resources. Silkworms were treated well.\n\nThe Very High gave out so much that it might have looked like they didn’t want anything in exchange. It was unknown how many of the higher races had been selected by the Very High and developed under the protective wing of that most-powerful race.\n\nSo, the Very High didn’t fight against the other races in order to claim anything. But the reputation of the Very High was above even that of the Extreme King. They were a race admired by the entire universe.\n\nEven the Extreme King’s princes and princesses would be proud to be selected by the Very High for nurturing. Warriors from ordinary and lesser higher races would be even more pleased to be chosen. If someone from a lower race was selected by a Very High, that meant they would be made a primitive deified, at the very least. Their entire race could be considered a higher race then.\n\nAlthough many geniuses could guess that the Very High did this for their own betterment, so what? Many people were willing to sacrifice a great deal for the chance of becoming deified.\n\nThose who had watched Han Sen’s blessings had gone mad with the desire to become deified.\n\nPlus, Han Sen’s blessing only pushed them to the primitive deified territory. The Very High, on the other hand, could take them further. Many became butterflies under the nurturing hands of their Very High masters.\n\nThey didn’t mind making sacrifices for this opportunity, but the Very High never asked for anything.\n\nIn fact, being a lab rat for the Very High wasn’t all that bad. You received many benefits. If Li Keer had explained all of this to Han Sen, he might have agreed.\n\nBut Li Keer had wanted to claim Han Sen’s heart before she received his body. All her attempts thus far had gone terribly, though.\n\nAs the Crocodile God came nearer, Exquisite raised her voice to say, “Get ready to leave before it is too late.”\n\nAs she spoke, a light emerged from Exquisite’s body. Strange symbols appeared across her skin. It was like many musical notes were now glowing across her body.\n\nThis was the Very High’s Very High Spell. Very High elites placed the spell across their bodies. When they used the ability, they’d be gifted the power of a deified for a short time. They only needed one chance to make use of God’s Wander and depart to a place that was many systems away."
}