{
    "chapter": 2778,
    "title": "The Space Garden",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2778",
    "text": "“Why is that?” Xie Qing King glanced at Dia Robber with a raised eyebrow.\n\n“Since the battle powers of the Flower Gods are extremely low, they focus their efforts on protecting their Space Garden. In all the time that their race has lived here, very few outsiders have ever been able to access the Space Garden. Now it seems like they’re letting everyone in. Don’t you think that is a little suspicious?” Dia Robber said as he sat down.\n\n“It really is quite suspicious. Do you know anything about what is going on?” Xie Qing King asked with some curiosity.\n\nDia Robber shook his head. “Not really. But from what I have experienced in the past, I am inclined to believe that this will be a very dangerous trip. Teacher Xie, you are a man of great knowledge. There is no need for you to risk your life.”\n\n“It is fine. It is fine. There are some places I wouldn’t dare to go, but with him protecting me, going to the Flower Gods should be okay,” Xie Qing King said, tipping a thumb toward Han Sen.\n\nDia Robber could see the confidence Xie Qing King had in his guard, and so he looked at Han Sen and asked, “I have never formally met you before. Who are you?”\n\n“This is my bodyguard, San Mu. He is such a skilled fighter that he can battle two or three deifieds at once.” Xie Qing King was bluffing and hyping Han Sen up already.\n\n“San Mu, if you have earned the admiration of Teacher Xie, you must be a very powerful person. I wonder where you are from, Brother San Mu.” Dia Robber didn’t use a geno art to analyze Han Sen, but he noticed that he couldn’t feel or discern Han Sen’s presence. That surprised him.\n\n“I’m just from a nameless race. You wouldn’t know them, so it wouldn’t matter even if I told you,” Han Sen muttered, his voice dismissive and short.\n\nXie Qing King looked at Dia Robber and laughed. “Don’t worry about it. He has a bad temper. He’s always like that, I’m afraid. Even to his boss. There is nothing that can be done about it.”\n\n“It’s fine. People with power can get away with more than most. Just like Teacher Xie said: if Brother San Mu can beat three enemies at once, then it’s understandable even if he is a little abrupt.” Dia Robber let out a slight chuckle.\n\n“Even though you say he is good, I think he is just good at bluffing and being a d*ck,” said a provocative voice behind them.\n\nThe three of them looked over to its source, and they found that the voice had come from another table. There were two Extreme Kings, one of whom was the crown prince, Bai Wanjie.\n\nThe other person was a young girl. She had a very intriguing and powerful presence, but judging from her age, there was no way she could have been deified already. She was the one who had spoken.\n\nHan Sen and the other two at his table had experienced a lot in their lives. Unlike ordinary young people, they weren’t easily riled. They weren’t going to argue with a little girl. They just pretended not to hear her and resumed talking.\n\nThe little girl, upon seeing that her declaration received no response from Han Sen, grew bored with the thought of taunting them further. She stopped trying to rile others up.\n\nBecause Violet had needed to cram everyone into a small battleship, there were a lot of deifieds in one place. It was only natural that arguments might arise. Fortunately, everyone had assembled there for a singular purpose. Until they reached the Space Garden, no all-out fights would break out.\n\nHan Sen tried to memorize the route to the Space Garden, so he could recall how to get back there if he ever needed to.\n\nBut the battleship was moving too quickly. After a few space jumps, Han Sen lost track of where he was.\n\nOnce they entered the xenogeneic space of the Flower Gods, Han Sen finally understood why the place was called the Space Garden. What Han Sen saw was blankets of flowers covering sprawling meadows.\n\nThe flower fields looked like stairs rising between the clouds. There were loads of weird flowers scattered everywhere that Han Sen looked. All of them were xenogeneic plants of various levels. It was unbelievably pretty.\n\nThe ship parked next to the flower fields, and then, Violet brought them down.\n\nAfter they left the battleship, Han Sen smelled the scent of all those flowers. While the fragrance was very strong, it wasn’t cloying or overbearing. It had a natural tinge to it.\n\n“Is this a canna lily?” Dia Robber asked suddenly, looking at a particular flower.\n\nHan Sen and Xie Qing King followed Dia Robber’s gaze. There was a flowery vine that was half a meter long. A few flowers had sprouted from the vine, and each bloom looked like a little girl practicing ballet. They looked very pretty.\n\n“Yes. That is a canna lily. You have a good pair of eyes.” Violet gave Dia Robber a thumbs up.\n\nBut Dia Robber didn’t seem to be happy about his discovery. In fact, he looked rather glum.\n\nAfter everyone’s focus turned away from Dia Robber to move forward, Han Sen walked over to Dia Robber’s side and asked, “What is it?”\n\nDia Robber frowned and said, “From what I can tell, canna lilies should be deified plants. They grow in very unique environments, and their powers are never weaker than a primitive deified xenogeneic. The Flower Gods just grow them randomly on the side of the road. Isn’t that a little too strange?”\n\n“It is surprising to learn that the Flower Gods can grow deified plants with such ease,” Xie Qing King said with a frown.\n\nViolet kept moving. Han Sen and the others walked past countless flowers and fields of grass. There were so many varieties of plants, and Han Sen could only recognize a tiny fraction of them. But judging from the lifeforce of the grasses and flowers, he could feel that they were nothing ordinary. They were all xenogeneic plants.\n\n“None of these plants are ordinary. No wonder the Flower Gods can create so many geno fluids.” Han Sen kept looking around him. He didn’t know what most of the plants were called, but he could tell from their lifeforce that they were some good stuff.\n\n“This is such a nice place. If we can take over this territory, we would never have to worry about resources. The xenogeneic plant resources here could feed 100,000 people,” Xie Qing King murmured to Han Sen.\n\nHan Sen was thinking about something else, though. He ignored Xie Qing King.\n\n“Xenogeneic plants bear fruit from time to time. As long as the seeds inside a fruit are not damaged, I can take them to the land of the fire phoenix to grow. I don’t know how much that would reduce their growing time, though.” Han Sen couldn’t imagine how much he would gain if he could accelerate the growth of plants like this. If he brought a few seeds to the extreme living land, he could reap enormous quantities of xenogeneic fruit in a short amount of time. Then, he would most certainly become rich.\n\n“We are nearing the place where the incident happened. Please be careful.” Violet’s footsteps slowed.\n\n“Don’t we need to meet the leader of your race first?” Dragon One asked with suspicion.\n\n“The leader and the others are already there,” Violet said. He kept walking as he talked, so no one slowed down and they all continued following."
}