{
    "chapter": 2376,
    "title": "Siren Virgin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2376",
    "text": "“Little Xinxin, you are still as cute and naive as ever.” The white-scaled woman smiled at Lan Haixin as she spoke.\n\n“You… why are you here? I thought you were…” Lan Haixin was having difficulty composing her sentences. The situation was so incredibly unexpected that her mind was struggling to adapt.\n\nThe woman sighed and said, “Some unforeseen problems occurred during my evolution, and Little Yun tried to kill me. She forced my hand, and I had to put myself into the Siren Bottle to stay alive.”\n\nHan Sen understood now. The Little Yun she had referenced was undoubtedly the Siren Elder. It seemed that she had never actually won over Bai Yi’s mother. The plan she concocted was actually just a part of Bai Yi’s mother’s grand conspiracy. Even when she failed to evolve, she had actually won.\n\nThe woman then looked at Han Sen. She still wore that soft smile, and she said, “My son, I am glad to see you here.”\n\n“You must have heard what the Siren Elder said. I’m not your son Bai Yi,” Han Sen said simply.\n\nThe woman nodded. “I know. Bai Yi wasn’t my son, anyway.”\n\nWhen the woman said that, Lan Haixin reeled in shock. Even Han Sen was astonished.\n\nThe woman explained, “I am the Siren Virgin. I must keep my body pure. I had no choice but to marry into the Extreme King, but I made a deal with King Bai. I would be known as his wife, but when it came to child-making, that would be done by another Siren woman that I kept close by.”\n\n“That person couldn’t have been the Siren Elder, could it?” Han Sen’s heart jumped.\n\nThe woman gave Han Sen an appreciative look. She spoke softly to him, saying, “Yes. It was indeed Little Yun. And she only slept with King Bai once. She didn’t actually know about my deal with King Bai, and she never realized that I was still a virgin.”\n\nHan Sen shuddered, and he said, “Bai Yi was her son?”\n\n“Kid, I like you more and more.” The woman smiled at Han Sen, but she didn’t answer his question.\n\nThe realization felt like a chill sinking deep into Han Sen’s bones. His guess had been correct, he assumed. The Siren Elder said she had given her son for this woman. But the white-scaled woman didn’t actually have a child. Bai Yi had the blood of King Bai and a Siren. The only possibility was that Bai Yi was the Siren Elder’s son, but this white-scaled woman had used some trick to take the baby for herself. The Siren Elder had no idea, and she had believed for all this time that her son was dead.\n\n“What a frightening woman. The Siren Elder never guessed that Bai Yi was her son. It’s lucky she didn’t find out; otherwise, she would have done everything for Bai Yi, and she probably would have exposed me to King Bai.” Han Sen looked at the woman’s sweet smile and felt relieved.\n\n“Kid, how about you and I strike a deal?” The woman smiled at Han Sen.\n\n“What kind of deal?” Han Sen asked.\n\n“You know of my situation. My body is destroyed, and I live inside the Siren Bottle. If I do not find a body, I will fade away. You have disguised yourself as Bai Yi. He was not my son, but he was the son of King Bai. I assume you are aware of what might happen if King Bai learned that you killed Bai Yi?” The woman was straightforward, which Han Sen appreciated. “I can help you deal with that, and I can help you make use of the Siren Bottle’s power. But you will also have to find me a body to use. What do you think?”\n\n“That doesn’t sound like a bad deal. I will agree to it,” Han Sen said.\n\nThe woman seemed surprised. She hadn’t expected Han Sen to agree so quickly. Her smile deepened. “Kid, I like you more and more.”\n\n“I can help you, but I do have a condition,” Han Sen said.\n\n“Speak then.” The woman nodded.\n\n“You can call me by name, or you can just say ‘hey’ or ‘yo’ or whatever. Just stop calling me a kid,” Han Sen said seriously.\n\nThe woman grinned at Han Sen and said, “Fine. I understand.”\n\n“Then let’s go,” Han Sen said, nodding to the woman.\n\n“If you ever require my help, knock on the left side of the Siren Bottle.” The woman met Han Sen’s eyes, and the Siren Bottle stopped shining. The rainbow drained back into the Siren Bottle, taking the woman with it. The Siren Bottle left the altar and flew into Han Sen’s hand.\n\nThe light disappeared, and the Siren Bottle looked like nothing more than an ordinary crystal bottle.\n\nHan Sen looked at the Siren Bottle for a moment, then put it away.\n\nThat woman was strong. She had the Siren relic, the Siren Bottle, as a base for her current existence. It was likely that not even the little red bird could deal with her.\n\nThey had a temporary agreement to work together, as they really had no reason to fight each other. If something happened that caused them to butt heads, things would turn very bad very quickly.\n\nThe woman had used the Siren Elder to bring the rest of the Siren there to be killed. She clearly required the blood of the Siren. Her plan had probably involved killing Bai Yi and Lan Haixin as well.\n\nBut because Han Sen had been present, he had foiled the woman’s plan. She was probably uncertain about Han Sen and his capabilities, so she had chosen to form an alliance with him.\n\nShe couldn’t be trusted, though. He knew that. But right now, working for her was a good thing for Han Sen. So, he had decided not to expose her.\n\nThey both had something to gain, and they needed each other. So, they joined forces without much trouble or negotiating.\n\nLan Haixin looked bewildered. She had listened to the entire conversation leading up to the deal between Han Sen and the woman, and she still didn’t really understand what had happened. It sounded like some strange sort of joke.\n\n“What are you doing?” Han Sen approached, and Lan Haixin grew pale. She knew she was weak, and she couldn’t escape.\n\nHan Sen had a deified firebird. Even if he was alone, she couldn’t hope to fight him.\n\n“I’m taking my wife home. What else can I do?” Han Sen took Lan Haixin’s arm and smiled.\n\n“Don’t you dare! You killed all of my people. I will not be with you.” Lan Haixin tried to shake his hand loose, but she couldn’t free herself. Han Sen began tugging her away from the palace.\n\n“Their deaths were a result of your stupidity. Even if I hadn’t cut them down, the Siren Elder would have killed everyone here,” Han Sen said, his voice dispassionate.\n\nLan Haixin opened her mouth, but the words of response never came. She looked pale, and a desperate thought crossed her mind.\n\n“If you are going to commit suicide, I will not stop you. But think about this: you are the last Siren with virgin blood. You are the last hope of your people. If you die now, it will be game over for the Siren,” Han Sen said harshly.\n\nLan Haixin struggled to maintain her composure, and she did not speak."
}