{
    "chapter": 1688,
    "title": "Royal Garden",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1688",
    "text": "Han Sen and Old Cat looked inside the metal box. There was a bright light inside, seething like boiling water. But it didn’t spill.\n\nKatcha noises were coming from the light, and the noises made them both shiver with a chill.\n\n“Old Cat, what is that noise?” Han Sen looked at the light in the metal box, but he couldn’t see or feel anything.\n\n“How am I supposed to know? It sounds like teeth, munching on bones,” Old Cat said, peering at the box.\n\n“Munching bones? Be honest with me know: is this really some sort of greenhouse?” Han Sen hadn’t believed Nine-Life Cat when he was told it was a greenhouse.\n\nOld Cat decided to make a promise, and he said, “It is a greenhouse! I would not lie to you.”\n\n“So why does this look like a coffin? You say you hear some bone-breaking noises, so if this garden had bones… why would that make any sense?” Han Sen looked at Old Cat.\n\nOld Cat felt guilty, and mumbled, “This is a greenhouse! It’s just not a normal greenhouse.”\n\n“What do you mean? What is not normal about it?” Han Sen asked.\n\nOld Cat knew if he didn’t explain a little, Han Sen would just go on and on about this. So, he said, “I researched it for a while. If I am correct, this is a royal greenhouse belonging to the crystallizers.”\n\n“A royal greenhouse?” Han Sen thought Old Cat was lying. Greenhouses grew vegetables; they didn’t grow meat, and certainly not bones.\n\nOld Cat looked serious and said, “Do not underestimate the greenhouses of the crystallizers. The stuff they grow is not limited to carrots and other vegetables.”\n\n“It sounds as if you know what to expect.” Han Sen stared down at Old Cat with hostility.\n\nOld Cat coughed and said, “I only know a bit. This metal box is a crystallizer’s growing box. A new type of plant is inside it.” “What is different about their plants?” Han Sen asked.\n\n“I don’t know. I have seen the plants of crystallizers before, and they look very weird. They shouldn’t even be called plants, really. They have a lifeforce,” Old Cat said.\n\n“A plant with a lifeforce is nothing rare. There are loads of geno plants across the sanctuary,” Han Sen said.\n\nOld Cat suddenly said, “This is what I’m trying to tell you. The sanctuary does not have geno plants. Crystallizers planted their seeds across the sanctuaries, and that is why they possess a lifeforce.”\n\n“Are you saying a geno plant’s alpha is inside there?” Han Sen asked as he looked at the box with shock.\n\nThe metal box continued to create creepy katcha noises.\n\n“I don’t know about that, but if it has been created by a royal garden, it should be something good.” Old Cat stopped for a moment and then continued. “Crystallizers never planned to create new creatures or beast souls. What they wanted to grow was geno armor.”\n\n“You can grow geno armor?” Han Sen was shocked hearing this.\n\n“Not originally. Crystallizers tried combining the genes of creatures, spirits, and their geno plants. But something big happened. The crystallizers lost, and the leftovers were attacked. The unfinished seeds can be found across the sanctuaries, having become geno plants,” Old Cat explained.\n\nHan Sen looked at Old Cat and said, “If you can find this place and dig up this box, you must have a greater idea of what exactly is inside.”\n\nOld Cat looked awkward and smiled. “Actually, I really don’t know. I came because of my sound judgment. This could have been a royal greenhouse. It is possibly a location for geno armor, and that is why I selected this place. It was the best spot, and many important things are around. That’s why I chose this place.”\n\n“You know Feng Shui?” Han Sen didn’t believe Old Cat at all. And he looked at the cat as if he was a liar.\n\nOld Cat shrugged and said, “Fine. I admit I picked the place because of the fertilizer, but that’s important. I have dug through three other places nearby and found nothing.”\n\n“What fertilizer?” Han Sen looked at the deep hole he had dug, and there was nothing there.\n\n“Do you see how dark the soil in this place is? Look at the tablet. Do you see the red signs?” Old Cat pointed at the tip of the metal box.\n\nHan Sen took a look, and it was exactly as the cat had been saying.\n\n“Did you really think this was a gravestone? This is a piece of crystallizer gear from the greenhouse. The fertilizer was injected through the tablet Look at the tablet The item inside the box is being taken care of. This might be a very important item for the royal greenhouse.” Old Cat looked at the box with shiny eyes.\n\n“Can you take it out, then?” Han Sen lifted his lips.\n\n“Crystallizers items are tricky. You should be careful.” Old Cat ignored Han Sen’s suggestion. He kept on looking, but he did not move.\n\n“If I didn’t appear, how would you have gotten the thing out by yourself? You can’t just watch all the time,” Han Sen said.\n\nOld Cat wanted to say something, but they suddenly heard a slamming sound from inside the box.\n\nA hand reached through one of the broken sections of the box. It looked like jade but it wasn’t; it looked like bone, but it wasn’t. It gripped the box like a demon’s hand.\n\nHan Sen and the Old Cat jumped away together, moving quite the distance."
}