{
    "chapter": 2556,
    "title": "You Are the Savior",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2556",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen’s continued traversal of the core area was free from strife. Although many people sought to follow him, none of them sought trouble.\n\nThat was what depressed Han Sen, though. Not even the Demons came looking to start a fight. Han Sen wanted more of those Demon Dolls, and he wasn’t getting another chance to procure one.\n\nThe next day, Han Sen decided to let Autumn Wind go. He didn’t really need another person to pull the rickshaw for him, and if the Demon weren’t going to come, there was no point in doing any of this.\n\n“Brother Wind, you’ve fulfilled your promise. You can leave now.”\n\nAutumn Wind was actually pretty nice, so Han Sen didn’t want to trouble him too much.\n\nAfter Autumn Wind heard this, he shook his head determinedly. He said, “No! No! Since I lost, I must uphold my end of the bargain.”\n\n“You’ve already pulled it all day. That’s plenty,” Han Sen replied with shock.\n\n“One day is not enough,” Autumn Wind said. “I have to help you and these two ladies for at least year. No, ten years! It is my pleasure to help you three out.”\n\nJi Yang Sheng was so angry, and he thought to himself, “You are such an idiot. Why would you want to be a rickshaw boy?”\n\nHan Sen looked at Autumn Wind and said emotionlessly, “We don’t need this rickshaw anymore. You may leave. Perhaps we will meet again one day.”\n\nAutumn Wind still didn’t look willing to leave. He said, “Even if you don’t need a rickshaw, there must be some other service I can do for you. I can hunt down xenogeneics and cook well. Let me work for you.”\n\n“Just go while we’re letting you live. Stop talking crap!” Elysian Moon said in annoyance.\n\nAutumn Wind sighed and said, “If you insist on me leaving, then I will. I hope I can see you both again someday.”\n\nAfter that, Autumn Wind dropped the rope and departed. He kept looking back as he was leaving as if he didn’t want to go. People would think that being a rickshaw boy had been a luxurious vacation for him, not an arduous task that he was conscripted into.\n\n“This Autumn Wind would do anything for pretty girls. What a player.” Han Sen laughed. He knew that Autumn Wind was only there for Elysian Moon and Gu Qingcheng.\n\nAfter Autumn Wind left, Ji Yang Sheng saw Han Sen look at him. He thought to himself, “Let me go… let me go… let me go now…”\n\n“What are you waiting for? Hurry up and pull our rickshaw,” Han Sen said with a cruel stare.\n\n“F*ck!” Ji Yang Sheng was furious. He wanted to slap Han Sen more than a few times, but all he could do was pull the carriage.\n\n…\n\nIn a distant corner of a dark world, a dim light was shining amidst the old ruins of a palace.\n\n“Old Cat, are you sure Little Sacred Leader can go to the sanctuaries now?” Auntie Mei asked, looking at Nine Life Cat.\n\n“Old Cat, you better think this through. If something happens to Little Sacred Leader, I will kill you,” Old Vulture said to Old Cat with a fearsome gaze.\n\nOld Cat laughed. “Don’t worry. I’m not wrong about this. Little Sacred Leader is going to be King class. This is the best time for him to earn genes in the sanctuaries. If he reaches King class, his self-cogwheel will be complete. Then, it will be too late for him to earn the genes he requires. He must reset his body’s genes before he becomes King class, then he can use his self-cogwheel to become King class.”\n\n“But Little Sacred Leader is already a Duke. Are you sure it is safe for him to go to the sanctuaries?” Auntie Mei asked.\n\n“Others might not fare well, but Little Sacred Leader won’t have any trouble.” Old Cat paused and then went on to say, “Don’t worry. I will be following behind Little Sacred Leader. I won’t allow anything bad to happen to him.”\n\n“You better… Otherwise…” Auntie Mei coldly grunted.\n\nThose scary people said goodbye to Littleflower. Not long after, a man and a cat took a lantern with them as they left the ruins. They ventured out into the darkness.\n\n“Old Cat, I want to see my mother,” Littleflower said to Old Cat. He was holding the lantern as he walked.\n\n“Of course. You can now go anywhere, but you must know that your mother loves you so much. When you are back, she will want to keep you and not allow you to go anywhere. But this world is going to end, and when that happens, your mother, family, and friends will all die. If you don’t level up and save all of existence, then your mother and your father will leave you. Even your cute sister will die. You saw the video of her, right? Do you really want them to be killed?” Old Cat said.\n\n“Only I can save the world? Is there no other way?” Littleflower asked, looking at Old Cat.\n\n“Yes, you are the savior of this world. Only you can save everybody,” the Old Cat answered seriously.\n\n“Fine. We will go to the sanctuaries. I won’t let my parents or my sister get hurt. I will save the world.” Littleflower’s face looked certain of this.\n\n“Yes. Just like that. Save the world, and then you can be with your family,” the Old Cat said with a nod and a blink.\n\nStanding in the First God’s Sanctuary, Tang Ming’er happily clutched her knife and rushed forward. She headed for the fields, wanting to kill creatures. She had just turned sixteen, and this was her first time in the sanctuaries, but the weird thing was, the shelter she resided in was empty. She was the only person there.\n\nThat didn’t matter to Tang Ming’er, though. She had the Tang family’s positive personality, and she was confident in her abilities. She didn’t care if there was no one there. She just wanted to kill creatures quickly.\n\nAfter running for a short while, she saw two creatures running across the fields. Tang Ming’er was happy about this. She sprinted toward them with her z-steel knife.\n\nBut when Tang Ming’er drew close, she was given a fright. The two creatures were a twelve-year-old boy and a beast that resembled a cat.\n\nThe boy had red lips and white teeth. He was beautiful, and he looked like a human.\n\nPeople couldn’t enter the sanctuaries until they were sixteen, though. If they entered before their sixteenth birthday, their bodies would be damaged. With that in mind, he couldn’t have been a human.\n\n“Are you a human or what?” Tang Ming’er asked, raising her knife as she drew close to the boy.\n\n“I’m human. You’re a human too, right, big sister?” Littleflower looked at Tang Ming’er with curiosity. He hadn’t seen another human in years.\n\nTang Ming’er felt relieved to hear he was a human, but she didn’t think that could be true. She pulled out her knife and pointed it at Littleflower. She said, “Don’t lie to me. Humans can only enter the sanctuaries when they are sixteen. You are so small. How did you enter the sanctuaries before that?”\n\nLittleflower was about to respond when he heard something tearing its way out of the soil. Grass and dirt fountained up, and a ten-meter-long centipede came out of the ground. It was going to attack Tang Ming’er and Littleflower.\n\n“Run!” Tang Ming’er’s face went pale. She picked up Littleflower and ran toward her shelter.\n\nBefore she entered the sanctuaries, she had read about the creatures that lived there. She immediately knew this was a sacred-blood demon centipede. She had just entered the sanctuaries, and so she couldn’t beat it."
}