{
    "chapter": 2662,
    "title": "The Geno Art in Reverse",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2662",
    "text": "“Huh? Why am I not getting any more yellow sheets of paper?” A month later, when Han Sen was reeling in his next catch, he noticed that he had brought up a broken shield instead of the usual piece of parchment.\n\nThat shield was old and broken. It was caked in rust. Han Sen gripped it with his hand, and even a tiny portion of his strength was enough to crush it.\n\n“What the hell? How did I fish up this piece of crap?” Han Sen thought, both disappointed and insulted. But then he thought to himself, “If I’m no longer pulling up sheets of paper, does that mean I have finished collecting the last of them?”\n\nSince Exquisite wasn’t around, Han Sen brought out all of his yellow sheets of paper. He lined them up according to their numbers and placed them within the cover. It really was a complete book now.\n\n“Three hundred and sixty-five pages. That is a magically-significant number.” Starting from the first page, Han Sen read the contents again.\n\nUsually, Exquisite was there. Whenever she was present, Han Sen didn’t dare to think or practice. He only practiced God’s Wander and Very Real Body in front of her; both of those were the geno arts Exquisite had given to him herself. Having only those two techniques to practice had gotten quite boring, but now that he was looking at the Xuan Yellow Sutra, his interest and vibrancy were coming back to life. This book fascinated him.\n\nEven though the Xuan Yellow Sutra had no text and there were just pictures, after Han Sen observed it in-depth, he started to feel a chill.\n\nThe entire situation was weird. How could a paper that was fished up from Underworld Lake contain pictures of the human body?\n\nHan Sen considered the possibility that the pictures weren’t depicting humans, but a race that simply had similar features to humans. But after a thorough investigation of the red and blue lines that crisscrossed the figures in the pictures, goosebumps began to flare up across Han Sen’s body.\n\nThe lines in the pictures were like the Blood-Pulse Sutra. No. This geno art wasn’t similar; it was the opposite. It was like the Blood-Pulse Sutra, but in reverse.\n\nHan Sen didn’t know what would happen if one was to practice the Blood-Pulse Sutra in reverse, but that was what the Xuan Yellow Sutra appeared to be.\n\n“Is someone trying to use this Xuan Yellow Sutra to trick me?” Han Sen frowned. He had no idea what to make of this situation.\n\nHe had fished up a human geno art from the Underworld Lake. And rather than being some random skill, it was a reversed version of the geno art Blood-Pulse Sutra. It was all so very weird.\n\nBut it didn’t make sense that this was being orchestrated by someone who was trying to mess with him. Underworld Lake connected with the anti-material world. No one was able to actually go there. And even if someone had gone down there, no one should have known Han Sen could practice the Blood-Pulse Sutra and given him the same geno art in reverse.\n\nHan Sen looked at the Xuan Yellow Sutra with a complex expression. He didn’t dare practice it. He didn’t even want to think about it.\n\nHe actually wouldn’t have to practice it. If he ever wished to use it, he just had to cast the Blood-Pulse Sutra in reverse.\n\nBut Han Sen had no idea what would happen if he tried that. The pages of the Xuan Yellow Sutra didn’t suggest what would happen, either. He couldn’t guess what the ramifications of running the geno art in that manner would be.\n\n“What is going on?” Han Sen wanted to find someone from Blood Legion to ask, but he was in Outer Sky. He was now disconnected from the outer world. He couldn’t simply call up a Blood Legion member now.\n\nHan Sen put away the Xuan Yellow Sutra. He didn’t dare look at it anymore. If he was still interested in it in the future, he could cast the Blood-Pulse Sutra backward. God only knew what might happen if he did that, though.\n\n“It would be great if Mr. White was here. With his knowledge of the universe, he should be able to help me analyze what this Xuan Yellow Sutra is all about.”\n\nHan Sen wished he had spent more time studying. Now, he really regretted that he hadn’t taken the time to study the Xuan Men knowledge. If he had, he might have been able to tell what exactly was going on here.\n\nWhile he was thinking furiously about what to do, the small jade figure’s triangle symbol lit up again. Han Sen quieted his mind and forced himself into thinking about the Very Real Body.\n\nNot long after, Exquisite teleported nearby. She wasn’t alone, however; she had brought Li Keer along with her.\n\nHan Sen hadn’t seen Li Keer since they parted ways in the core area. She looked a bit sad, now. She clearly wasn’t as happy as she had been at the beginning of the year.\n\nExquisite introduced Li Keer to Han Sen. Li Keer remembered Han Sen, but she had no idea he was her coveted Dollar.\n\n“Han Sen, there is something I would like you to help me with.” After Exquisite introduced them to each other, she spared no time in making a request.\n\n“What can I do to help you on this fine day?” Han Sen asked, raising an eyebrow in surprise. He was an outsider in Outer Sky, so there wasn’t much he would be able to do. This must be a very unique request if Exquisite had come to ask for his help in particular.\n\n“There have been difficulties in Li Keer’s search for a silkworm. She has been unable to find a suitable one, and therefore, she still needs one,” Exquisite said.\n\nLi Keer shook her head. Continuing to look down in the dumps, she said, “Third Sister, you don’t have to beat around the bush so much. The silkworm I selected rejected me, and he will never want to see me again. Therefore, I have to choose a new silkworm.”\n\nHan Sen carefully avoided thinking about that. He was afraid that Exquisite would notice his thoughts and dredge up a disconcerting truth or two.\n\nHe knew Li Keer was talking about Dollar, but she had accused him wrongly. He hadn’t been absent from the core area because he was avoiding her. In fact, he hadn’t been making any effort to hide from Li Keer. He had simply been trapped inside Outer Sky, where going to the core area wasn’t an option.\n\n“What can I help you with, then?” Han Sen asked, looking at Exquisite. He didn’t know what Exquisite wanted from him. He had already agreed to be Exquisite’s silkworm, so he didn’t know what he could do to help Li Keer.\n\n“The time limit is almost up, and my little sister won’t be able to find a good silkworm before the deadline. Therefore, I’m asking you to help. If you can convince Lone Bamboo to become my little sister’s silkworm, we would really appreciate it,” Exquisite said.\n\n“I really can’t do that. If Lone Bamboo was willing to come, he wouldn’t have chosen to go to prison rather than become a silkworm. Nothing that anyone says to him will change that. He is his own man,” Han Sen said, raising his hands helplessly.\n\n“You’re saying that even with the friendship between you two, he won’t listen to you? I thought he was willing to go in your stead,” Exquisite said while staring at Han Sen.\n\n“I’m sorry, but I really cannot help you with this.” Han Sen shook his head. He knew how tenuous his situation was.\n\nDespite having the small jade figure, he still had to remain vigilant at all times. It was harder than being a thief inside a police station. If he wasn’t careful, Exquisite would do a deep dive into his mind.\n\nHe was already in such dire straits, but he didn’t want Bamboo to suffer the same fate.\n\n“If you cannot convince Lone Bamboo, then there is only one other way in which you can help us.” Exquisite giggled to Han Sen while she spoke.\n\n“What is it?” Han Sen asked, feeling a little dread settle upon him.\n\n“It’s exactly what you’re thinking. Please be my little sister’s silkworm, too,” Exquisite said, speaking Han Sen’s worry into reality."
}