{
    "chapter": 981,
    "title": "Tutor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_981",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nLife-and-Death Breakthrough was something Han Sen had heard of before, but he did not really know what it meant. He believed doing that could enable him to become a demigod, allowing him to practice the next Dongxuan Sutra.\n\nOf course, that was just him guessing.\n\nIn the Dongxuan Sutra, committing a Life-and-Death Breakthrough was incredibly dangerous. Even the most powerful of people could die using it, and traditionally, there was only a ten percent chance of survival when doing such a thing.\n\nDongxuan Zi explained that when he created the Dongxuan Sutra, he ensured its Life-and-Death Breakthrough had a higher success rate, though. It was apparently over fifty percent.\n\nThe Wedding Dress Skill said that if a woman was willing to sacrifice her learning of the skill, it’d allow a man to perform a Life-and-Death Breakthrough with a hundred percent success rate.\n\nIn Dongxuan Zi’s era, people who survived Life-and-Death Breakthroughs were regarded as gods.\n\nDongxuan Zi himself was the only known person to have performed one successfully.\n\nThe Wedding Dress Skill could enable a person to do what he did. It was a dizzying feat, and the entire concept was quite sweat-inducing.\n\n“It may be a Qi Gong, but this thing is useless to me.” Han Sen downloaded the details and removed it from his PC.\n\nHe then returned to the shelter and hid the rubix cube there.\n\nHan Sen: Super Body Super King Spirit\n\nLevel: Surpasser\n\nLifespan: 400\n\nKing Body Evolution Requirement: geno 100\n\nOwned Geno Points: ordinary geno points = 100; primitive geno points = 100; mutant geno points = 74; sacred-blood geno points = 14; super geno points = 5.\n\nSuper King Self-Spirit Points: 118\n\nHan Sen’s fitness was not bad, and he had been doing well so far. But for now, he wanted to open more gene locks.\n\nHe did not leave the shelter in fear of meeting Yaksha again.\n\nOne day, while Han Sen practiced his Dongxuan Sutra, he received a notification that Qin Xuan was looking for him.\n\n“Team Qin, long time no see.” Han Sen smiled, looking at her in the video.\n\n“Han Sen, do you have Taia?” Qin Xuan asked seriously.\n\n“Liu Meng gave it to me. Is that a problem?” Han Sen asked.\n\nHe was surprised, and he was now witnessing firsthand how serious the Qin family took this business with the Taia sword.\n\n“If you’re looking to sell it, would you mind selling it to us?” Qin Xuan asked.\n\n“Do you mind telling me why this sword is so special?” Han Sen knew this sword was nothing ordinary.\n\nQin Xuan said, “This sword just means a lot to us, and it is a secret that pertains to our family. What I can tell you, though, is that it’s useless in the hands of others.”\n\nHan Sen nodded and said, “Well, if I want to sell it, I’ll come looking for you.”\n\nHan Sen did not mind doing her a favor, but Taia was his primary weapon for the time being, and he needed it to kill creatures. Until he found a better replacement, he had to hold onto it.\n\n“Thanks a lot.” Qin Xuan sounded relieved. Then she proceeded to say, “Let’s talk about something else for the time being. I would like you to know I am establishing a training class for the Special Security Team. Would you mind being a tutor?”\n\n“Nope; I can’t teach.” Han Sen was surprised at the sudden request.\n\n“It’s not like you’ll be teaching directly from a textbook. And you’ll only need to do it from Skynet. It’ll take one hour each day for a month. If you are busy, we can schedule a replacement for certain days. We can fit it around your timetable.” Qin Xuan smiled.\n\n“When does it start?” Han Sen asked.\n\n“Day after tomorrow. Over twenty thousand people have signed up,” Qin Xuan said.\n\n“I’ll teach archery, then.” Han Sen was only spending his time practicing the Dongxuan Sutra each day, so squeezing in an hour to do something else would be fine.\n\nHan Sen was still a member of the team, too. He was still being paid wages, despite not having done anything for the longest time. And being a teacher for newbies might be fun.\n\n“When are you free, then? I need to sort out the rota.” Qin Xuan was visibly delighted at hearing Han Sen could join.\n\nAfter their discussion on that, they chatted about their lives for a while.\n\nQin Xuan did not want to become a surpasser yet. Ever since the discovery of super genes, many people wanted to focus on maxing out their level with the new genes before ascending to the next sanctuary.\n\nSome people managed to collect the eggs of super creatures, to obtain their super geno points.\n\nBut there weren’t many eggs, and if that is how they were to focus, it was likely only one person could max out their super geno points in a century.\n\nPeople in the Alliance believed Han Sen had a different method of obtaining super geno points, but Han Sen was Han Sen; they didn’t dare do anything to offend him.\n\nIf they tried making a move on Han Sen, they feared Godslayer Luo would unleash his wrath upon them.\n\nThat aside, he was Ji Ruozhen’s son-in-law. As such, no one dared touch him.\n\nIt would have been even more difficult to get to Han Sen in the sanctuary, too.\n\n“Han Sen is to be the tutor?” In a mansion someplace, a man read a list of names. When he saw Han Sen’s name there, he was surprised.\n\n“Which Han Sen?” a red-haired man asked, looking back.\n\n“There is only one Han Sen. It’s the Han Sen,” the man responded.\n\n“What is he teaching?” the red-haired man asked.\n\n“Archery,” the man answered.\n\n“I previously had no interest in going, but I can’t miss this.” The red-haired man lifted his eyebrows."
}