{
    "chapter": 2664,
    "title": "Deified Set",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2664",
    "text": "“You aren’t going to tell him about all the bets that have been placed on his performance?”\n\n“What is the point in him knowing that? Are we going to make him fight for his life against a born-deified? I don’t want to have to find another silkworm,” Exquisite said.\n\n“You’re right,” Li Keer said, tilting her head in acknowledgment. “It is impossible for a King to beat a born-deified. Plus, that deified has no lack of talent himself. He’s as good as a student of the Very High. It won’t be easy for anyone to win against him, and Han Sen is just a ninth-tier King.”\n\nLi Keer sighed and continued, “The people who have placed big bets on Han Sen—who believed he would earn first place—are going to lose the items they have wagered. They won’t be able to do anything against Li Xue Cheng. They’ll definitely take out their anger on Han Sen, even if they don’t hold him personally responsible. Wherever he goes, I’m sure trouble will follow close behind.”\n\n“That is something that cannot be avoided. We just have to find a way to sort this out, or at least mitigate the fallout,” Exquisite glumly said.\n\n…\n\nHan Sen spent some time reviewing the information he had been given. There descriptions and short bios of the twelve silkworms he would be squaring off against. The information was comprehensive, and whoever had been responsible for compiling it had done an excellent job. It was like a bona fide restaurant menu.\n\nThere was an image of every silkworm in the documents he received, too. Han Sen saw the born-deified fellow on the first page.\n\nShale: Lionheart Mutant\n\nLevel: Primitive Deified\n\nSex: Male\n\nPrimary Geno Arts: Lion Killer\n\nHobbies and Interests: Dessert\n\nThe content of the documents was very detailed, but most of the information was also pointless for Han Sen’s purposes. He didn’t need to know the hobbies of his competition. He didn’t need to know what color of armor they wore or the things they liked to do for fun. There was no mention of their powers. All he learned was that the deified had a geno art called Lion Killer.\n\n“So far, reading this is no help at all.” Han Sen shook his head.\n\nHan Sen kept on reading, and he noticed that every profile was the same. When he flipped over to the fourth contestant, he saw the description of Yu Shanxin. Again, the introduction was the same. It only described his looks and the fact that he was skilled in the Extreme Evil Path. That was about it.\n\nHan Sen kept flipping through the profiles, page by page. He memorized the faces of the silkworms, their names, and their races. The other information was useless for him to remember.\n\nHan Sen flipped through the character information and reached the last page. There, he saw his own profile.\n\nHan Sen: Crystallizer (serving Sky Palace)\n\nLevel: Ninth-tier King\n\nSex: Male\n\nPrimary Geno Arts: The Story of Genes, Teeth Knife, Under the Sky knife skills…\n\nOwned treasures: Charming God’s Jian, the Shield of the Medusa’s Gaze, unknown feather clothes, unknown bow…\n\n“Wait, what is this?” Han Sen was frozen. The information he had on the other silkworms was practically useless. But the profile on him was surprisingly detailed. It said everything quite clearly, and explicitly mentioned the treasures he wielded. It even separated each one to describe each geno art and treasure in a grossly detailed fashion. It was all so very elaborate.\n\n“Who created this d*mn folder? Why has the writer only gone and exposed my powers?” Han Sen felt as if he wanted to kill someone. He didn’t know anything about his enemies, but the enemies knew everything about him. This was bullcrap.\n\nAt the end of the information, there was a summary. “The genius that can suppress thousands of races that composed the fabric of the wonderful universe we live in. The one that stands out the most can become the greatest silkworm. Aside from Shale, who we know can fight, the other has yet to be decided. He is the most popular winner in the silkworm bouts.”\n\n“You motherf*cker.” After reading the summary, Han Sen felt fairly sure that he had been set up.\n\nHan Sen flipped through the book a few more times. He finally saw the last sentence at the back of the book, too, then. It said, “Editor: Li Xue Cheng.”\n\n“Who is this Li Xue Cheng? Why is he turning everyone against me?” Han Sen wondered, bewildered. He didn’t recall encountering a man that went by that name before. In fact, he’d only met a few of the Very High since he arrived in Outer Sky. He didn’t know anyone called Li Xue Cheng, so there was no way he had offended him.\n\n“Are Li Xue Cheng and Liyu Zhen working together?” Han Sen wondered to himself. Aside from Liyu Zhen, he could think of no other person of the Very High who would want to see him down like this.\n\nThinking of this, Han Sen was given a shock. He realized that the silkworms bouts wouldn’t be as easy as he initially presumed.\n\nHan Sen flipped back through the folder and read the details of his opponents again and again. They were all top-class fighters. There were many of the Extreme King there, and Yu Shanxin was one of the Sky.\n\nAnd in regards to Shale, who was a Lionheart, it was actually a nameless race. There was only one half-deified among his people. Shale just so happened to be the son of that half-deified, but for some reason, there was a gene mutation when he was born. It led to him becoming deified. He was extraordinarily talented.\n\nAfter the God Spirit Touch’s test, he was registered as a ten armor talent. Following his lead, the race of the Lionhearts had gained wider renown. If he hadn’t been selected by one of the Very High students to become a silkworm, he would have been planning a fight for a lantern.\n\nShale was chosen to be a silkworm four years ago. He had been practicing in Outer Sky for a long time, and he was so talented… With all that extra time to practice and refine those talents, it was easy to imagine how scary he would be as an opponent.\n\n“If I can use treasures, I’ll definitely be able to beat Shale and reach first place. If I can’t use treasures, then I will fail to defeat Shale, and possibly all the other silkworms as well. Even setting aside the others, I’ll have to fight Yu Shanxin. That guy will be very hard to deal with,” Han Sen thought to himself.\n\nAt the back of the folder, there was a list of all the rewards one could receive from various placements in the silkworm bouts. When Han Sen saw the reward for first place, his mouth gaped.\n\n“What is a deified treasure set?” Han Sen was confused, and so he continued reading. After reading it, he could only think, “The rich are stubborn.”\n\nThe so-called “deified treasure set” was a set of armor composed of powerful treasures. The chest piece was a deified treasure. So was the belt. The gauntlets and the boots were four deified treasures. With the helmet, that made seven deified treasures. It combined to become a deified treasure set called the “Apollo Set.”\n\nHan Sen continued to read. He noticed the Apollo Set wasn’t just a deified treasure composed of seven pieces. Each piece was an individual deified treasure. They were all primitive class. If Han Sen used them all together, it would allow him to make use of special substance chains. That would put him at transmutation level.\n\nThe second-place contestant would receive one deified treasure. There were other resources that would be awarded as well, but none of them were deified. There was a wide gulf of prestige separating the rewards for second place and the rewards to be earned in first place.The folder included a photo of the Apollo Set. The entire thing shone silver like a polished mirror. It looked bad-*ss and mysterious. It seemed to radiate glory.\n\nHan Sen read the description of the Apollo Set, and after reading it, he felt himself starting to drool. If a user hadn’t reached deified, they couldn’t activate the Apollo Set’s power. But if multiple people used the pieces of the set simultaneously, the seven-piece set could activate Apollo’s Wings, which were the substance chains. They had primitive power, and a King could control them."
}