{
    "chapter": 971,
    "title": "Mutant Sabertooth Bee",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_971",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Hmm, so it is an ordinary creature.” Han Sen frowned even more.\n\nThe Red-Eye Rabbits around him were all ordinary, which meant their boss could be no greater than primitive. But the thieving Red-Eye Rabbit Han Sen had first encountered had opened seven of its gene locks.\n\nOrdinary creatures were now useless to Han Sen, so he didn’t harm any others in the valley and simply kept on traveling.\n\nHe occasionally bumped into other creatures, but they were nothing he needed to hunt.\n\nAfter another fifty miles of travel, he no longer saw any more of the rabbits. Still, that first Red-Eye Rabbit continued to concern him.\n\nExiting the valley, he proceeded to ascend the slopes of a mountain. There, Han Sen stumbled across a mutant creature he could hunt. From a cliffside wall hung a large beehive. The occupants of the hive were bigger than average bees, approximately the size of pigeons.\n\nHan Sen was already aware of the existence of this creature, and knew that it was called a Sabertooth Bee. They were venomous, but they were usually only primitive in class. That being said, mutant ones did occasionally exist.\n\nAnd of course, that was Han Sen’s intended target. Their form and their weakness made them an ideal target for him to hunt.\n\nHan Sen had brought with him the corpse of the Red-Eye Rabbit he had slain. He laid it out on the grass, peppered it with some of the white bear’s blood, and left it there while he went off to hide.\n\nThe bees soon became aware of the liquid. In response, swarms of the insects exited the beehive in haste, all of them seeking the source of the smell that had ensnared their attention. There must have been at least three hundred of them.\n\nHan Sen drew his bow, nocked an arrow, pulled the string, and readied himself to fire an arrow at any mutant ones that appeared.\n\nThey were quick little blighters, and their eyesight was good. Hitting them from such a distance was no small feat.\n\nIf they were aware of an arrow headed their way, they’d have no trouble avoiding it. And following the first miss, they’d remain alert. Any further shots would also result in misses.\n\nHan Sen used his dongxuan aura to mask his presence so the bees would be unable to detect him. This increased his chances of successfully performing the stealth kills he wanted to.\n\nAfter gauging the scene for a while, Han Sen found the ideal opening for an attack. He fired the arrow, which silently ended the existence of one Sabertooth Bee.\n\n“Mutant Creature Sabertooth Bee killed. The beast soul has been acquired. Consume its flesh to gain zero to ten mutant geno points randomly.”\n\nHan Sen was delighted to receive a beast soul on the first kill.\n\nWithout waiting, he took a look at its features. The beast soul turned out to be an arrow type.\n\n“Oooh, I can finally replace the arrows I’ve been using.” Han Sen hadn’t been impressed with the power of his Flaming Arrow for a long time, so he was pleasantly surprised to find a mutant beast soul replacement.\n\nHan Sen summoned it, and he liked its look. It was white and serrated, not unlike the vicious teeth of the creature it had come from. The tip of the arrow was hooked like the saberteeth the bees possessed, as well. It was a spooky-looking arrow, for sure.\n\n“Nice arrow,” Han Sen thought, as he fiddled with it.\n\nEither the bees weren’t very smart, or they were too fixated on the blood Han Sen had lured them out with, but none of the other bees cared that their bee-friend had been murdered.\n\nNot wanting to waste a chance to score one more, Han Sen decided to take out another mutant bee. This time, he was going to use his sabertooth arrow. After lining up the shot, he released the string.\n\nThe arrow pierced through his desired target effortlessly.\n\nAfter re-summoning the arrow, Han Sen fired again. By the time the blood smell had finally gone away, Han Sen had killed an additional six.\n\nEnsuring his presence had been masked, there was nothing he had to worry about. Still uncaring for their fallen bee-compatriots, the rest of the bees returned to their hive.\n\nHan Sen emerged from where he was hiding and collected his kills. Then he sprinkled a few more droplets of blood on the carcass of the rabbit to lure out more. Before the bees returned, he went back into hiding.\n\nBy the time he was done with the bees, Han Sen had slain sixteen of them. He was also able to obtain another sabertooth arrow.\n\n“Awesome!” Without any more mutant bees for him to hunt, he decided to stop and move on.\n\nHan Sen took the bear’s blood frequently, and every time he did so, he was met with high-pitched squeals and screams. To extract the amount he needed, he always had to have Bao’er near him.\n\nFor some reason, the white bear was extremely frightened by Bao’er.\n\nHan Sen left the mountainsides on which he had hunted the bees, and then decided to have a cookout with his latest kills.\n\nThe taste of the Sabertooth Bees was different than the taste of the Tank Ants. The flavors were very wild and unappetizing, so Han Sen had to spruce the taste up himself.\n\nHan Sen added a variety of his favorite spices to the insects he roasted, and after sinking his teeth into their meat, his tongue was met with a smorgasbord of delicious tastes. It was exquisite.\n\n“Mutant Class Sabertooth Bee Consumed: Mutant Geno Points +1.”\n\n“Cool. The only thing that would make this cookout better would be a case of chilled beer.” Han Sen munched and crunched his way through the bees he had harvested. Their skin was crispy and their bodies were without bones, and it was a feast he was happy to relish in.\n\nBut then, Han Sen suddenly saw a white shadow emerge from the bushes. It wasted no time in destroying Han Sen’s enjoyment of the moment by grabbing one of the bees he had been cooking.\n\n“It’s you, you little sh*t!” Han Sen watched the rabbit king nibble on the bees he had hunted himself.\n\n“F*ck you! How dare you come back and steal my food again.” Han Sen was infuriated by the boorish, thieving critter. His phoenix fire was unable to break its shield, so this time, he fancied summoning his Dragon-Blood Snake. But before he did, he managed to stop himself.\n\nHe re-acknowledged the strength of the rabbit, and remembered that if the Dragon-Blood Snake was killed, it’d be a great loss for him.\n\nSeeing the rabbit gnaw the well-seasoned bees, Han Sen had an idea."
}