{
    "chapter": 312,
    "title": "An Effortless Shot",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_312",
    "text": "Many students were eavesdropping on the conversations between Han Sen's friends, trying to pick up some insider perspectives.\n\nHowever, hearing what Wang Mengmeng said, they all stared at her as if she were crazy.\n\nEven Han Sen's roommates found Wang Mengmeng's reply out of line. It was simply impossible for Han Sen to think beating Jing Jiya was a piece of cake.\n\nSomeone who could shoot a succession of ten arrows with a 16.0 bow, nine of which were spinning, would never lose easily. Whether or not Han Sen could beat him remained a question.\n\nThe eavesdroppers had determined that Wang Mengmeng must be a diehard fan, whose words were hardly believable.\n\nSitu Xiang and Chen Ling were also surprised by Han Sen's choice. Chen Ling asked Situ Xiang, \"Coach, I don't know that much about archery. But isn't an 11.0 bow much weaker than a 16.0 one?\"\n\nSitu Xiang nodded and said, \"if they were on the same level, the 16.0 bow is much stronger than an 11.0 one.\"\n\n\"Then why did Han Sen pick an 11.0 bow? With his strength, even if he cannot use a 16.0, he could always choose a 15.0 or 14.0, right?\" Chen Ling was puzzled.\n\nSitu Xiang smiled wryly and said, \"I don't understand either. If there is any reason, maybe he wants to beat the two brothers with the same kind of bow.\"\n\n\"Is that even possible?\" Although Chen Ling did not know archery, she knew how difficult it must be to beat Jing Jiya with a weak bow.\n\n\"I can't tell.\" Situ Xiang's words were rather conservative, because in her view, Han Sen was doomed.\n\nSeeing Han Sen's bow, Jing Jiya's face darkened. He could no longer keep up his good manners and asked sharply, \"Brother, are you really going to use the bow?\"\n\n\"Can't I?\" Han Sen said quietly.\n\n\"Sure.\" Jing Jiya took a deep breath and tried to calm himself down. He knew that being flighty and impatient was a big no-no before a duel. Although he had no doubt that he would win, he did not want to take his opponent lightly.\n\nNo matter what bow Han Sen had picked, Jing Jiya decided to go all in and leave Han Sen no chance.\n\n\"Since you're okay with it, let's start.\" Han Sen did not want to waste more time. After the duel, he must leave for Glory Shelter. The trip would take him at least a month, and he must hurry.\n\n\"Okay,\" replied Jing Jiya. He walked away from Han Sen and stopped when they were 220 feet apart.\n\nJing Jiya turned back and said to Han Sen with a smile, \"You beat my brother at this distance. How about we have the duel under the same condition?\"\n\nJing Jiya had thought about this a long time ago. He wanted to avenge his brother at the same distance.\n\n\"As you like,\" said Han Sen indifferently.\n\n\"Coach Situ Xiang, would you do the honor and blow the whistle?\" Jing Jiya asked Situ Xiang with a smile.\n\nSitu Xiang nodded, gave a pause, and blew her neck whistle.\n\nAll eyes were on Han Sen and Jing Jiya. The moment the whistle was blown, Jing Jiya shot the exact same succession of ten arrows at Han Sen.\n\nBecause the bow was strong, the ten arrows were in Han Sen's face in no time.\n\nJing Jiya knew very well that although the ten arrows seemed to be aligned, they would scatter into a storm in Han Sen's face and block every direction, thanks to the spinning techniques.\n\nJing Jiya had worked hard on spinning arrow in order to beat Han Sen this way. He had to beat Han Sen with Han Sen's own tricks to clear his brother's name.\n\nHan Sen saw what Jing Jiya did, but only shot one arrow in a languid manner. It seemed that he did not even pull the string to the fullest.\n\nAnd he did not make a second shot either. Putting the bow down, Han Sen stood there and watched.\n\n\"Looks like Han Sen has given up.\"\n\n\"He didn't even want to win. No wonder he picked an 11.0 bow.\"\n\n\"The genius has fallen. This is such a boring duel to watch.\"\n\n\"It's such a shame that Jing Jiya treats him seriously. He not only disrespects his opponent, he disrespects himself as well.\"\n\n\"It is the same genius I used to worship?\"\n\n\"It seems he's not the same person after the accident.\"\n\nSitu Xiang was also very disappointed. According to what she remembered, Han Sen was not someone who would easily give up, let alone make a move that equals surrender. However, she had seen it happen with her own eyes. Situ Xiang thought to herself, is the archery emperor gone forever?\n\nEven Jing Jiya was dumbstruck by Han Sen's attitude. He wanted to beat Han Sen, but not like this. Such a loser and such terrible skills, what point would he be making even if he could beat Han Sen? It would probably bring his brother Jing Jiwu more shame.\n\nIf Jing Jiwu had lost to a genius, Jing Jiya could accept it. However, it seemed that Jing Jiwu had lost to a scum.\n\nHan Sen, on the other hand, was very satisfied with the shot he made. The power of the spinning arrow did not lie in its speed or strength, but how it span.\n\nAlthough Jing Jiya's spinning arrow seemed impressive, in Han Sen's eyes, those arrows were barely spinning.\n\nAlthough Han Sen's shot was not fast, but it carried a spinning force that Jing Jiya could not even imagine.\n\nIn addition, Han Sen's shot also represented his understanding of the spinning force and Yin Yang Blast in the recent two years. Although it was not fast, Han Sen was quite satisfied with what he had done.\n\nJing Jiya's arrows had arrived, the first of which was about to clash with the arrow Han Sen shot.\n\nAll the audience just saw what Jing Jiya could do and knew that his arrows could make strange turns and avoid Han Sen's arrow. Therefore, even if Han Sen had also made his arrow spin, it would not change anything."
}