{
    "chapter": 3010,
    "title": "Adult Ceremony",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3010",
    "text": "When Han Sen heard that, his expression kept changing. It was not like he did not want to give Dragon Lady a drop of his blood. Let alone a drop of blood, Han Sen would have given her a bucket of blood if she needed it. For him, it was nothing that would harm him.\n\nBut that was blood Han Sen could not really give since he could not control the blue blood power. If Dragon Lady had some blue blood and was unable to refine it, she would end up being infected by the blue blood. That would have been bad.\n\n“Do you really think Sacred Leader’s blood was really that easy to absorb?” Han Sen seriously asked. “To be honest with you, I am infected with the blue blood. I am being controlled by the blue blood power. I cannot take control of my body, and I still cannot find a way to get rid of my blue blood. Are you sure you want Dragon Lady to risk this? If you ask me, it’s a bit reckless.”\n\nWhen Ancient Origin God heard that, he nodded and said, “What you are saying kind of makes sense. Although I, Ancient Origin God, eat all kinds of races, Sacred’s genes are different. We must be aware of that.”\n\nAncient Origin God was silent a moment before saying, “How about this? If Godfather Han is willing to help, give me one drop of your blood. I will have an Ancient God try it. If it turns out to be OK, then Dragon Lady can give it a shot.”\n\nHan Sen did not think that would be a problem. He cut his finger and placed a drop of blue blood into a jade bottle.\n\nThe blue blood was so still. The color was like blue ink. It did not appear to be anything special.\n\n“Godfather Han is so nice to us Ancient God. I will always remember this.” Ancient Origin God accepted the jade bottle and called an Ancient God over.\n\nThe body of the Ancient God was made of something like steel. It was like a steel monster. Han Sen looked at him and knew that he was an Ancient God with metal power.\n\n“Ancient Iron God, drink this blood.” Ancient Origin God gave Ancient Iron God the jade bottle.\n\n“Yes, Sir.” Ancient Iron God did not hesitate or ask why. He accepted the jade bottle and drank the blue blood inside it. He swallowed it completely.\n\nHan Sen and Ancient Origin God stared at Ancient Iron God. He did not seem to have any reaction to the liquid. Ancient Origin God asked, “Ancient Iron God, can you refine that blue blood?”.\n\nAncient Iron God’s face looked weird as he said, “That blood is in my stomach. It is like a rock that cannot be refined.”\n\n“Really?” Ancient Origin God looked at Han Sen.\n\nHan Sen was shocked. When Human King dropped blue blood all over him, the blue blood immediately invaded his body. There was no need for refinement or anything.\n\nNow that he thought about it some more, Han Sen started to have a guess. “Humans are mixed with crystallizer and Sacred Leader’s blood. Human King is the human alpha. It would be easy for me to combine with his blue blood. If other races seek to use the blue blood, I am afraid that might not be so easy.”\n\nAncient Iron God was unable to refine the blue blood. He could not melt it.\n\n“If I cannot refine it, I will try to put it in the baby god wok.” Ancient Origin God made Ancient Iron God spit out the blue blood. The blue blood still looked like crystal. It had not been affected by anything.\n\nHe put the blue blood back in the jade bottle. Ancient Origin God led Han Sen to a baby god wok.\n\nThis wasn’t the same baby god wok that cooked Empty Dragon King. There was only half a bowl of water in it. The flame beneath it was raging. It kept boiling the water in the pot.\n\nNo matter how much the water bubbled and boiled, there was no steam. The water levels did not decrease.\n\nAncient Origin God put the drop of blue blood into the water. That drop of blue blood combined with it. It was still in the shape of a liquid blood drop.\n\nAncient Origin God called the eight-armed black bear and one-eyed xenogeneic over. The two xenogeneics spit out flames. One spat green fire, which helped the fire on the ground, but it burned for half a day. It got to the point where the baby god wok was all red. The water inside bubbled like a dragon rolling. The blue blood still did not exhibit any changes.\n\nAncient Origin God’s face changed. “Sacred Leader’s blood is very powerful. Even the baby god wok cannot cook this gene essence.”\n\nHan Sen sighed. “The blue blood is not refined, but maybe that is not a bad thing. With how weird the blue blood is, if it was refined, perhaps that would just lead to a nightmare. Just like what happened to me.”\n\nAncient Origin God went silent for a while. He then said, “Blue blood really is weird. If things are like that, we will research it first. The geno holy fluid will not add this blood.”\n\n“Then, the ancient spirit seed…” Han Sen hesitated to say it.\n\n“Do not worry,” Ancient Origin God said. “I promised you I would not take its life. I will find another way to cook and extract Empty Dragon King’s gene essence. Godfather Han, you came just in time. You should come and take part in Dragon Lady’s adult ceremony before you depart.”\n\nHan Sen nodded and agreed. This was a big thing for Dragon Lady. Han Sen wanted to go to the cold planet, but he might as well remain there for another two days.\n\nBack in Dragon Lady’s garden, Han Sen and Dragon Lady talked about how they had been in recent times. Dragon Lady learned that Han Sen had been trapped by the blue blood and he needed to find Han Yufei somewhere on the cold planet. She said, “Ancient Origin God said I can leave freely after the adult ceremony. I can accompany you to the cold planet in case you encounter danger out there. Right now, the whole universe knows you have Sacred’s blue blood. Many old antiques might want to harass you. If they find where you are, you might end up in danger.”\n\nHan Sen did not refuse her offer. He smiled and replied, “Thanks. In that case, I will enlist you as my bodyguard.” “I am not really a hero,” Dragon Lady gently said. “I am just a chef. If someone wants to give me some cooking materials, I would not decline the offer.”\n\nHan Sen stayed in the garden and waited for the adult ceremony to start. The ancient spirit seed was awfully clingy. It always climbed on Han Sen and never left him.\n\nAlthough it looked like just a baby, it was a newborn Ancient God. If it was awakened, it would become an Ancient God and get god power.\n\nIt had not woken up yet, so it was hard to tell what sort of Ancient God element it would end up having\n\nHan Sen waited two days. It was time for the adult ceremony to start. Ancient Origin God invited Han Sen to watch.\n\nIn a giant Ancient God plaza, many Ancient Gods broke space and appeared. Some Ancient Gods looked like they were made of fire. Some Ancient Gods looked like metal Ancient Gods. Some of them were made of rocks.\n\nEvery Ancient God had their own element. All of them were incredibly scary. Although Ancient God had less than 300 people, many of them were already true god. Now, they were all together. Han Sen could not use his Dongxuan Aura to scan, but he was able to tell how scary they all were.\n\n“No wonder Ancient God is one of the three high races. It is hard to imagine what it would be like and how shocked the sky would be if there were 3,000 of these people running about,” Han Sen thought.\n\nWhen Ancient Origin God arrived, the adult ceremony started. Ancient Origin God was holding an old copper tool that looked like a Jun. The item looked lively. It generated steam that came out of its exit.\n\nAncient Origin God looked serious. He held the bronze tool with both hands. He read aloud in a language that Han Sen could not understand. It was like he was praying. It felt mysterious and serious. When Ancient Origin God was praying, his body glowed with rainbow god light. The rainbow god light was strong. Ancient Origin God put his rainbow-like blood into the bronze tool.\n\nAfter that was done, Ancient Origin God gave the bronze tool to another Ancient God. That Ancient God behaved just like Ancient Origin God. After praying, he placed a drop of rainbow blood into the bronze tool.\n\nThey passed it to each other. The 200 Ancient Gods placed their blood into the bronze tool. They then gave it to Dragon Lady."
}