{
    "chapter": 316,
    "title": "Feeding My Pet",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_316",
    "text": "\"That does not even make sense. We do not have sacred-blood beast souls from Second God’s Sanctuary, even if we do, it is impossible that we exchange them for something in First God’s Sanctuary,\" said Ma Mingjun with his brows knitted.\n\nThe sacred-blood beast souls in Second God’s Sanctuary were much harder to come by than those in First God’s Sanctuary, and thus much more valuable.\n\nHowever, an unevolved person could not receive any beast soul from Second God’s Sanctuary. If Han Sen was to purchase a beast soul from Second God’s Sanctuary for his mother, his mother would have to receive the beast soul from the other party directly. Otherwise, a primitive beast soul from Second God’s Sanctuary would easily beat most sacred-blood beast soul from First God’s Sanctuary.\n\nBecause the beast souls from a higher phase could not enter a lower one, the sacred-blood beast souls of First God’s Sanctuary were still very valuable.\n\nHowever, using a sacred-blood beast soul of First God’s Sanctuary to exchange for one in Second God’s Sanctuary was still out of the question.\n\n\"Forget about it then.\" Han Sen was very casual about the deal. Since Ma Mingjun was from Glory Gang, it was very likely that his gang was like Steel Armor Gang and had military affiliations, which was the only reason that Han Sen even considered a deal with them.\n\nMa Mingjun and Su Xinmei whispered to each other, and then Su Xinmei said to Han Sen who had already put the silver wolf on his back, \"What is your name? Are you from Steel Armor Shelter?\"\n\n\"Yes,\" replied Han Sen and quickly left Mystery Island with the silver wolf’s body.\n\nSu Xinmei bristled, \"Should we just let him go like this? We had fought the sacred-blood creature for a long time, and he basically took advantage of us.\"\n\nMa Mingjun shook his head and said, \"This person was using the secret skill of Ares Martial Hall. Not a lot of students could use the skill. He should be a very important person in the martial hall.\"\n\nAfter Han Sen returned to the ground, he summoned Meowth and put tornado wolf’s body on its back. They traveled a long way to find a clean lake and Han Sen made a barbecue out of the wolf.\n\nThe tornado Wolf was the same size as a bull. Han Sen could not finish it himself, so he summoned holy angel to join him. It was too heavy for him to travel with anyway.\n\nHoly angel had been in the great mood these two days as she was fed first the mushu and then the tornado wolf. She became so excited that her eyes were sparkling.\n\nThe tornado wolf had a lot more meat than the mushu. Even with her shocking appetite, holy angel could not finish it in a short amount of time. It took Han Sen and her three days to finish the entire tornado Wolf. As for the bones and inner organs, Han Sen fed them all to the worm king.\n\nThe worm king was exhilarated. It was never fed sacred-blood meat before, and was happy to taste some bones and gut.\n\nHan Sen gained another sacred geno point from the tornado wolf and now had 80 sacred geno points.\n\nSoon, they had traveled across Dark Swamp. Han Sen made a fire at mealtime and decided to heat up some of the mushu meat he preserved. Since it was not a lot, he did not summon the two pets.\n\nJust as he started to eat, he saw two persons arriving on their mounts, who turned out to be Ma Mingjun and Su Xinmei.\n\nHan Sen was not surprised. He was always cooking these days and it was natural for them to catch up with him.\n\nMa Mingjun and Su Xinmei were surprised to see Han Sen. Since Han Sen was in Steel Armor Shelter, they did not understand why he would be traveling to Glory Shelter.\n\n\"What a coincidence! Good to see you again. Can we use your fire to cook?\" asked Ma Mingjun.\n\n\"Help yourself.\" Han Sen did not mind and continued to eat his barbecue.\n\nMa Mingjun and Su Xinmei regarded Han Sen, puzzled. It was easy to tell that the meat Han Sen was eating did not come from the silver wolf. Next to Han Sen, there was no large parcels either, which was strange.\n\nThe silver wolf was as big as a bull. It had only been a couple of days since they parted, so it would be amazing if Han Sen could finish one fifth of the meat, let alone the entire wolf. However, to their shock, the silver wolf had disappeared.\n\n\"I am the head of the Glory Gang, Ma Mingjun, this is my girlfriend Su Xinmei. How shall we call you?\" As Ma Mingjun started cooking, he started to make small talks with Han Sen.\n\n\"Han Sen, a nobody in Steel Armor Shelter,\" replied Han Sen casually.\n\nMa Mingjun did not know much about Steel Armor Shelter. He thought about what he knew and said, \"Dollar from Steel Armor Shelter is such an impressive figure. It is a shame that the only participated in one contest for the Chosen and did not even compete in the last round. Do you know him?\"\n\n\"Everyone knows him in Steel Armor Shelter. However, he does not know me,\" said Han Sen with a smile.\n\n\"Where did that silver wolf go? You couldn’t have finished that in these two days, could you?\" After chatting for a while, Ma Mingjun voiced his doubt.\n\n\"I fed it to my Pet,\" said Han Sen indifferently.\n\nAhem!\n\nMa Mingjun choked on the water he just drank. It was the first time for him to hear someone would feed sacred-blood meat to a pet.\n\nSu Xinmei looked at Han Sen incredulously and asked, \"You fed sacred-blood meat to your pet?\"\n\n\"What’s wrong with that?\" asked Han Sen.\n\nMa Mingjun quickly said, \"Since Brother Han would use sacred-blood meet on his pet, this pet must be extraordinary. Can we have the honor to see it?\"\n\nMa Mingjun and Su Xinmei did not believe someone would do such a thing. However, the silver wolf did disappear, and it was impossible for Han Sen to have finished that on his own. It seemed feeding his pet was a plausible explanation.\n\nHowever, what a pet it must be for someone to be willing to feed it sacred-blood meat! Even if Ma Mingjun had a sacred-blood pet, he would not spare any sacred-blood meat to feed it.\n\n\"It’s just a pet, nothing special about it,\" said Han Sen, smiling.\n\n\"We are so curious to know what kind of pet it is to deserve sacred-blood meat.\" Su Xinmei still did not believe that Han Sen actually did it.\n\n\"That’s okay, but my pet has an appearance fee of a mutant beast soul. If you could afford it, I could show it to you as you wish,\" said Han Sen arrogantly."
}