{
    "chapter": 977,
    "title": "White Dragon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_977",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nA cloud of red and purple mist obscured Han Sen’s sight. Fortunately for him, he could still use his dongxuan aura to keep track of the man.\n\nWith no hesitation, Han Sen stabbed the man again.\n\nHe knew the time he could keep super king spirit mode activated was limited. If he didn’t take advantage of that time to heavily damage his pursuer, he’d be in dire straits when it was over.\n\nBut the man used his legs to kick and propel himself out of the water. Han Sen sought to follow him, but by the time he could emerge from the stream in pursuit, the man was already one hundred meters away.\n\n“I’ll be back,” the man said, as he ran.\n\nBut Han Sen did not chase him. He decided to turn the opposite way and flee while he had the chance. Even if he managed to catch up with the man in black, his super king spirit mode would have most likely ended by then.\n\nKilling that man wouldn’t be easy, not in Han Sen’s current state and with the current length of his super king spirit.\n\nHan Sen flew for a while, but he noticed he was still in super king spirit mode. He thought it should have ended far sooner.\n\nAfter ten seconds elapsed, super king spirit mode came to an end. And at this point, Han Sen had just reached the waterfall.\n\n“It looks like I can last around ten seconds, after achieving my first open gene lock.” Han Sen was delightfully surprised.\n\nBut now was not the time to sit back and be happy over this advancement. Right now, Han Sen wanted to make his way out of this hellish labyrinth and go home.\n\nUnder the effects of super king spirit mode, he was able to stab the man in his heart twice. But still, it wasn’t enough to kill him.\n\nHan Sen only wanted to get back to his shelter. If he moved his underground shelter, he did not believe the man would be able to find him, either.\n\nBut before he scaled the waterfall, the man appeared out of nowhere. The man in black caught up to him with alarming speed.\n\n“You almost had me fooled. I knew you could not remain like that forever!” The man actually spoke a composed sentence, but the tone was monotonous, and there was a metallic reverb in his voice. He was not a pleasant person to hear talk.\n\n“You want to go again?” Han Sen stopped moving and floated motionless in the air.\n\nThe man’s chest had already healed. It was too late for Han Sen to run right now, but he thought bluffing might be the ticket.\n\n“Quit your embarrassing attempts at fooling me. I can spy a lie, for I am Yaksha.” The man in black then jumped towards Han Sen without hesitation.\n\n“Crap!” Han Sen had no choice but to run, he thought. And so he did, summoning the snake to do its best in blocking his ravenous assaulter.\n\nThe snake had already been heavily injured, but now, it was hit by Yaksha once again. It heaved blood following the blow and fell down into the black waters below.\n\nHan Sen quickly returned it, in case it actually died.\n\nSeeing Yaksha catch up, Han Sen thought, “If this wasn’t underground, I could just fly away.”\n\nSomehow, Han Sen believed Yaksha’s speed was actually increasing. The man seemed to be faster than he had been before.\n\nIf Yaksha looked likely to hit Han Sen, he couldn’t use super king spirit mode to save himself. All he could do was rely on Taia.\n\nHan Sen’s speed was not as good as Yaksha’s, so the man was able to evade Han Sen’s attempted strike, spin, and try to grab him by the neck.\n\nHan Sen unleashed his strength in a fiery display, propelling himself into the water. But suddenly, an aqua dragon was coming for him from ahead.\n\n“Crap! How could I forget about this thing being here?” Han Sen now realized the waterfall in front of him was the one with a chained aqua dragon below it. Unwittingly, he had just served himself up as the dragon’s prey.\n\nYaksha froze at the sight, while Han Sen leapt up and dove over the aqua dragon’s head to land on its body.\n\nHan Sen grabbed it and tried to attack it. But the aqua dragon ignored the human crawling on its back, and instead looked ahead at Yaksha. It roared in his direction.\n\n“I can’t believe you have not died,” Yaksha said to the dragon.\n\nWhen the dragon heard his words, it only seemed to be more infuriated. It splashed the water violently, as the clanking of chains echoed loudly through the caverns.\n\nThe power this beast possessed was incredible, but its arms were chained up. The forging must have been exceptional, as they bound the dragon to the point it could not make use of its powers or do anything to get free.\n\nHan Sen lay on the dragon and held on tight. The ride he was in for was like a rodeo times ten.\n\n“White Dragon, I only want that boy’s life. Do not get in my way.” Yaksha jumped towards Han Sen.\n\nThe dragon roared and threw Han Sen away. But then, it attempted to catch Yaksha in its mouth.\n\nHan Sen tried his hardest to keep his orientation under the disturbed, thrashing waters of the underground lake. When he breached the surface again, he saw Yaksha punch the dragon’s head.\n\nThe dragon roared and attempted to fight the man, but the chains prohibited it from doing anything.\n\nHan Sen hid himself beneath the water again. Aside from the dragon, there was nothing else out there to help him.\n\nBut then, hearing the chains being pulled in the dragon’s futile attempts at freedom, Han Sen suddenly had an idea. He decided to swim downstream."
}