{
    "chapter": 1238,
    "title": "Dangerous",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1238",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen’s face was not looking good. If you touched Saint Fan Emperor’s body, your limbs could sink and become one with him, and any subsequent hits meant bringing damage to yourself. This was what had occurred to them.\n\nSaint Fan Emperor did not feel any pain, and amidst all this, he smiled and said, “Xie Qing King, that is a name not unfamiliar to me. I heard of the power you wielded back when I was first born. I must say, the claims of your talents are overrated.”\n\nSaint Fan threw a fist to punch Xie Qing King’s belly.\n\nXie Qing King had one of his hands in Sant Fan’s chest, and his other was lodged inside his opponent’s head. There was nothing he could do to dodge.\n\nSaint Fan Emperor’s fist began to boil with an eerie silver light, as if he was absorbing Xie Qing King’s power.\n\nPang! Pang!\n\nSaint Fan’s fists, imbued with silver light, began to pummel Xie Qing King repeatedly, until his chest caved-in.\n\nHan Sen was shocked, thinking they really had become a part of Saint Fan, and now, Saint Fan could make use of their powers.\n\nWatching Saint Fan punch Xie Qing King, Han Sen tried to throw fire at the wretched spirit to end the madness. But Saint Fan knocked away the approaching fire, and he did not allow his fist to stop there. The fist went onwards to punch Han Sen in the head, making him suffer a great deal of pain.\n\n“D*mn it!” Han Sen wanted to activate his super king spirit mode, but just as he resolved to, he heard a barking sound.\n\nSnowball had snuck behind Saint Fan, and with his ability to trap beings inside white spheres, it tried to do the same to the spirit.\n\nIt worked, but Han Sen and Xie Qing King were trapped inside, too.\n\n“Good job, Snowball!” Han Sen thought trapping the spirit would be the best course of action, first and foremost.\n\n“Woof!” Snowball barked.\n\nBut their new glimmer of hope was brief, and their faces soon became grim once more. Saint Fan was able to throw his fist through the previously-thought-to-be-indestructible skin of the white sphere.\n\nA ball that could withstand the number sixteen of Saving Money had been broken in a single punch by Saint Fan.\n\nSaint Fan’s body exited the ball, with it attached to his back.\n\n“Everything and everyone can become a part of me, and all control can be submitted to me!” Saint Fan proclaimed.\n\nSnowball barked and ran off, jumping into a sphere of his own in the process.\n\n“What a wimp!” Xie Qing King said.\n\nHan Sen found it funny that Xie Qing King had initially believed Snowball had saved their lives.\n\nSaint Fan then threw a punch towards Han Sen, with another fist that had been imbued with a silver light.\n\nHan Sen knew how strong Xie Qing King was, and he knew full well if Saint Fan was going to place all his strength in that punch, he’d be dead in the next couple of seconds.\n\nBut he was stuck and unable to go anywhere. He had no choice but to brace for impact and accept the incoming hit.\n\nPang!\n\nHan Sen grabbed his other talon and slashed Saint Fan Emperor’s waist, but it was only one last, futile attempt of trying to get away. It really was impossible to get free.\n\nBut then, the Purple Emperor appeared. He hadn’t wished to attack because he didn’t want to deal damage to Han Sen as he attacked Saint Fan.\n\nSaint Fan’s punch met with Han Sen, and it hurt. He then punched Xie Qing King. And repeatedly, Saint Fan continued to beat them both black, blue, and bloody.\n\nHan Sen knew he had to think of something, and that this couldn’t be allowed to go on much longer. Now, he had no choice but to use super king spirit mode.\n\nHan Sen returned from his triple-talon gold raven status, but he noticed his arms were still attached to Saint Fan.\n\nHan Sen did not know if super king spirit mode would allow him an escape, but he did know he had to try. If the likelihood of death seemed strong, he might as well do all he could, after all.\n\nAnd currently, Dry Bone King was not faring too well in battle. Snowball had managed to imprison two of the creatures that had attacked him, but there were still five more to go. With the tide not changing, things had to drastically improve for everyone, if they were going to achieve victory.\n\nThorn Queen was still capable of trapping enemies, but the vines wouldn’t hold them forever, and it was only a matter of time before they could indeed escape.\n\nSnowball ran over to Bao’er and cowered behind her back, not wanting to move. It was not like anyone could break his sphere and force him out, either.\n\nQing Jun tried to grab hold of Snowball and go around the field with him, as he was an invaluable asset in trapping the super creatures and king spirits that dominated the field of battle. Its nerves had been rattled so much, though, that did not seem likely to happen.\n\nBao’er held her gourd and looked at the chaos afore her, and particularly at Han Sen and Saint Fan. She wished to make use of the item, but she was afraid of bringing harm to Han Sen. She was also unsure whether or not she could truly suck Saint Fan into the gourd.\n\nRegardless of what was going on, Han Sen was now determined to do things his way. He was going to activate super king spirit mode and combine with Little Angel.\n\nHan Sen only needed to get his hands free, so he could escape.\n\nBut before he could become a super king spirit, a long howling sound came from a nearby forest. Something scary was quickly headed their way.\n\nHan Sen was shocked, thinking they were reinforcements belonging to Saint Fan. After all, Han Sen had brought everyone, and there was no one else who could come to his aid.\n\nBut even Saint Fan Emperor looked disturbed upon hearing that howl."
}