{
    "chapter": 2352,
    "title": "Ancient God Origin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2352",
    "text": "“A creature that terrifying lives in the geno hall?” Han Sen felt a chill prickle his skin. The hideously powerful Ancient Water God had been killed by little more than a slap.\n\nThe black crystal armor’s behavior worried Han Sen, but he tried not to let it show. The armor was probably connected to the creature inside the geno hall, he surmised. If the armor was discovered, Han Sen could not fathom the consequences he might have to endure.\n\nThe Ancient Water God had been killed by a single blow. Han Sen would be annihilated by a small fraction of that force. He would probably be crushed into jelly.\n\nThe Ancient Water God’s blood rained down on everything around them. The blood rushed into the sea, giving the dying creatures another chance at life. The oceans filled in once more, albeit in a bloodier hue.\n\nHan Sen noticed the green growth as small plants spread across the nearby rocks, and he allowed the blood rain to fall on him. The rain soaked his clothes, and it felt like lifeforce was falling directly onto his skin. He also detected traces of the Ancient Water God’s presence. It was quite faint, however.\n\nMost of the creatures on that planet were primitive, with only a few xenogeneics among them. With the blood rain’s nourishment, though, the ordinary creatures started to change. Their genes were upgraded, and they evolved into lower class xenogeneics immediately.\n\nAlthough they were at the bottom of the food chain, they had been given the opportunity to grow.\n\n“Ancient Water God failed after all?” Xius sighed.\n\nThat result was actually expected. Many elites from the Ancient God, Very High, and Extreme King had failed in the past.\n\n“Where is the Ancient God Origin?” Han Sen searched through the rain. He couldn’t see anything that might resemble an Ancient God Origin.\n\nXius said, “Ancient Water God leaked the news about his own attempt to ascend. He wanted to attract water element elites so that if he failed, one of those elites could carry on with his Ancient God Origin. He must have selected someone before he tried to ascend. The Ancient God Origin will most likely be inside the person or creature he selected. Perhaps in a few hundred years, there will be a new Ancient Water God.”\n\nHan Sen nodded. He didn’t think he stood a chance. Given how badly he had p*ssed off Ancient Water God, he was lucky the Ancient God hadn’t killed him. It was unlikely he’d be given the Ancient God Origin.\n\nAs Han Sen was deep in thought, something fell from the sky in the blood rain. It began to curve as it fell, heading directly toward them like a meteor.\n\nHan Sen was shocked. The wall of water came to a standstill directly before Han Sen. It turned into a water tornado that danced around him in a slow circle.\n\n“The Ancient God Origin!” Xius whispered hoarsely.\n\nHan Sen stared at it in shock. Despite the grudge between him and Ancient Water God, the deified had actually given him the Ancient God Origin. It didn’t seem possible.\n\nThe water flew around Han Sen a few times, taking a shape that vaguely resembled a dragon. It spoke to Han Sen quietly, then went to rest in his right hand.\n\nHan Sen opened his hand as the water drop fell into his palm. It became a water orb that looked rather like an egg. It solidified pretty quickly, turning into a perfect crystal orb.\n\nThe crystal orb had a watery pattern on it. As the orb touched Han Sen’s skin, his Original Water King Body reacted. The Original Water King Body had previously been affected by the Kingese, but now it was erupting like a volcano under the vibrations of the crystal orb.\n\nHan Sen was so happy. If the mere vibrations of the Ancient God Origin could help his Original Water King Body, then crystal orb was even stronger than Han Sen had realized. If he could eat it, perhaps the Original Water King Body could level up.\n\nBecause Han Sen had used the Blood-Pulse Sutra to refine the Original Water King Body, it didn’t consume any of his energy. Thus, the Original Water King Body would remain at the first tier of King class, which was as far as Bai Yi had developed it. It would be incredibly difficult for Han Sen to level it up further.\n\nBut the crystal orb’s power blended into the Original Water King Body, and under that power, the Original Water King Body had a bit of a breakthrough.\n\nHan Sen didn’t have time to explore all the potential uses of the water orb, for he soon saw a few shadows headed his way. They must have belonged to the people and creatures in the vicinity. They had seen the Ancient God Origin descend in that direction, so they had come looking for it.\n\nHan Sen hid his crystal orb, but it was too late. The shadows were approaching rapidly, and after they saw Han Sen, they swooped in to attack him without saying a word.\n\nThe King class elite leading the charge activated his water area around Han Sen, then sent a slap toward him. The attack was nowhere near the power displayed by Ancient Water God, but it was enough to throw up some tumultuous waves.\n\nThe other attacking elites also possessed water powers. Elites who had affinities to other elements wouldn’t benefit very much from the Ancient God Origin.\n\nHan Sen coldly grunted. He activated his Original Water King Body, instantly releasing his own king area. He threw a punch towards the King class elite.\n\nThe two king areas collided, and the attacker’s third tier area was suppressed by Han Sen’s first tier area. The rival king area cracked immediately.\n\nPang!\n\nHan Sen broke the enemy’s king area, then thrust his hand forward, driving it right through the enemy King’s chest.\n\nThey were both using water powers, but normal King class elites lacked the bodies of the Extreme King.\n\nThe other elites coming to attack Han Sen stopped, shocked by his violent display of strength. They pulled back slightly, not daring to come any closer.\n\nIf they wouldn’t come to him, then Han Sen would go to them instead. He cut down three Kings in under a second. People were as infuriated as they were shocked.\n\n“The Original Water King Body is too strong!” shouted a voice. But as everyone else ran away, Han Sen saw someone emerging from the blood rain. They were holding an umbrella, and they exuded a smothering sense of pressure that was now bearing down on Han Sen.\n\n“Thousand Chance Umbrella… It’s the Pirates’ Nine-Headed Bird!” someone screamed out loud.\n\nHan Sen focused his gaze on the newcomer, turning his back on the elites who were now running away.\n\nThe newcomer moved with deceptive slowness. At least a hundred miles separated the person from Han Sen, but the newcomer crossed that distance in only a few steps. Their umbrella was raised. They looked at Han Sen and smiled.\n\nWhen Han Sen saw the person’s face, he could tell it was a very ordinary one. But while the slender face was unremarkable, the eyes were beautiful. They were like two crescent moons.\n\nHan Sen didn’t know anything about this “Nine-Headed Bird,” but Han Sen could tell that they were King class from the energy they were emitting. They might have even been half-deified.\n\nThe Nine-Headed Bird stopped. They looked at Han Sen through the blood rain and smiled. “Prince Sixteen Bai Yi, am I correct?”\n\n“You know it is me, and you still dare to approach? You are brave!” Han Sen growled.\n\n“We Pirates have never lacked guts.” The Nine-Headed Bird stopped smiling, and their expression became unreadable. “So, leave your Ancient God Origin behind and get lost. Either that, or I’ll have to call King Bai to come pick up your dead body.”"
}