{
    "chapter": 2465,
    "title": "Sacred Leader’s Secret",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2465",
    "text": "The woman held the white dragon lance loosely in one hand. She swung it almost casually, sending it to strike Meng Lie. The dragon fire of the lance was just like the fire Meng Lie himself had been employing.\n\nMeng Lie’s face paled. He didn’t dare fight the wrathful power of that dragon lance. He stumbled back and cast some gold substance chains, creating a gold shield in front of himself.\n\nBut the power of that dragon lance was too scary. It pierced right through the shield, and it was headed for Meng Lie.\n\nHan Sen wasn’t surprised that the woman could use these abilities, though. He had heard about this before when he saw the woman read the Shocking World Record of the Extreme King. The Extreme King had stolen her Geno World Speech and combined portions of it with the Blood Pulse Spirit Body.\n\nEven the Extreme King’s basic Shocking World Record had been stolen from the woman. It was not weird that she was able to employ the Gold Soldier King body.\n\nBut the proficiency with which the woman wielded the Extreme Purple Demon Dragon was intimidating.\n\nMeng Lie was considered quite strong among the deified elites, but upon meeting a monster like this woman, he lost his cool. After losing his lance, he stopped fighting. When he found a chance to flee, he took it. He didn’t dare to continue fighting the woman. He wasn’t going to get the Extreme Purple Demon Dragon back, either.\n\n“Why did you let him run?” Han Sen asked quickly when he saw that the woman hadn’t stopped Meng Lie from escaping.\n\nAs soon as the words left his mouth, he clamped his jaw shut. He had been watching the fight so intently, he had forgotten about the fact that he wasn’t supposed to be talking.\n\nBut nothing bad happened after Han Sen spoke. The woman landed in the garden, and she said smoothly, “My body has just been freed, and I’m still very weak. If he kept fighting, I doubt I would’ve been able to kill him.”\n\n“So, this is you in a weak state?” Han Sen was frozen.\n\n“Weird. I spoke out loud, and yet nothing has happened. Is this the real woman? Why didn’t she recognize the stone book? And what happened to her OCD?” Han Sen looked at the woman. Try as he might, he couldn’t determine if she was real or fake.\n\nThere was something else Han Sen was wondering about, too. The fight had been conducted on a mind-blowing scale, and Han Sen was still feeling the aftershocks. But despite that, the demon spirit hadn’t appeared. Why didn’t it show up?\n\nThe woman returned to the wooden house and placed a crystal shield over it.\n\nHan Sen had seen the woman use this skill several times, but as he watched her use it now, he realized that he had underestimated its utility.\n\nThe crystal shield enveloped the wooden house, and then it became smaller. The wooden house shrank, as well. A few seconds later, the crystal had become an egg-sized ball resting in the woman’s hand. The wooden house was inside it, safe and sound.\n\n“Let’s go,” the woman said, lifting her lantern and speaking to Han Sen. She turned to leave the island.\n\n“Such a ruckus… Why didn’t the demon spirit show up?” Han Sen asked casually as he followed the woman.\n\n“I am free. He won’t dare show himself to me now,” the woman said flatly.\n\nHan Sen couldn’t be certain if she was telling the truth, so he asked her directly, “Why were you freed so easily? Was this the first time you asked someone to help you?”\n\nThe woman’s hands moved, and the dragon lance turned into a white dragon boat. She sat on the dragon boat and said, “You think Two World Mountain can be accessed by just anyone? I don’t know how you gained access, but if other people could do what you did, I would have been released long ago.”\n\n“You don’t know how I got here?” Han Sen looked at the woman strangely.\n\nThe woman smiled and said, “Is that odd? Two World Mountain is between two worlds. Although the other woman was my clone, I was unable to interact with her while I was bound. I don’t have her memories. And when I was freed, she should have become a doll whose strings were cut. I cannot recollect her memories.”\n\n“How did you know it was me who saved you, then?” As soon as Han Sen asked that, he realized that the question was stupid.\n\nThe woman still answered. “If it wasn’t for my clone, how would you have known that you needed to follow my Two World Lantern? And how would you have known not to talk on the Two World Path? You really would have died, otherwise. The Two World Mountain restrictions had broken, which was what allowed you and the Extreme King guy to gain access to Two World Mountain.”\n\nHan Sen eyed the woman, trying to see if she was telling the truth. Her story did sound rather plausible. He went silent for a while, and then he brought out the stone book.\n\n“Your clone said that if I saved her, the bindings of this stone book would be broken. Why is it still closed, then?”\n\nThe woman looked at the stone book and said, “The book has a World Print, so it wouldn’t open automatically. Even if the book was destroyed, no one could open it. No one aside from me, that is.”\n\n“Then, can you open it?” Han Sen didn’t understand what she was saying, but if she knew how to unlock the book, then that would be great.\n\nWithout speaking, the woman casually cast a small World Print. A stamp appeared on the stone book’s cover. A mysterious symbol glowed briefly, and then the stone book’s invisible power was broken. The book could now be opened.\n\nHan Sen couldn’t wait to open the stone book. The words inside the book jumped around as if they were alive. They looked like fairies, and they flew towards the woman’s forehead. They all vanished into her eyebrows.\n\nWhen the woman saw the fairy-like symbols, she appeared surprised. And then, she understood. She sat upon the boat, allowing all the words to flow into her forehead.\n\n“Oh, sh*t! I have been tricked.” Han Sen suddenly understood.\n\nAfter the stone book’s words all flew out, the stone book crumbled into sand that slipped through Han Sen’s fingers.\n\nThe woman absorbed all the words and then smiled at Han Sen. “Thank you for bringing me my clone’s memories. You want to know what test the Sacred Leader conducted, right?”\n\nHan Sen nodded. The stone book hadn’t contained his answer; it was filled with the memories of the clone.\n\nThe woman was sitting at the front of the boat. She put a hand under her chin and looked up to the sky. “The Sacred Leader was very powerful, but his lifespan was quite short. He would only live a few hundred years. It couldn’t be compared to those that could live for ten thousand years, a million years, or even a billion years. He tried his hardest to find a way to live forever, even forcing himself through multiple rebirths. But eventually, he still reached his life’s end. Trying to stay alive, the Sacred Leader conducted many tests. Then one day, a man who called himself God came to Sacred Leader.”"
}