{
    "chapter": 2552,
    "title": "A Hero to Save the Beauties",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2552",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen had no interest in humiliating Ji Yang Sheng, and he didn’t really want to get in the carriage. He just wanted to see if he could draw out some of the Demons that might be nearby.\n\nIf they wanted to save Ji Yang Sheng or eliminate Han Sen, it would be hard for them to do that in the core area. It would likely prompt would-be saviors to use their Demon Dolls.\n\nHan Sen’s true purpose was to lure out more of those Demon Dolls so he could take them for himself. It would be great for him to have a few deified Demon Dolls in his back pocket.\n\nThe existence of the Demon Dolls was a very strange thing. The Demon Doll Han Sen had already obtained had a lifeforce and could think for itself a little. It never looked like it was truly alive, though.\n\nIts mind only came alive when it received commands via the purple horn. If it wasn’t being controlled, it would stand in place like a deactivated robot.\n\nPlus, people were supposedly unable to travel to the core area with another living thing. Despite that, the Demon Dolls could be brought into the core area. That meant it wasn’t a living thing on its own.\n\nHan Sen didn’t know if a deified Demon Doll could come through, though. If that was possible, then the Demons should have surely been stronger in the core area than the Extreme King were.\n\nOf course, all of this was just Han Sen’s line of thinking. These were his guesses. It might not even be possible to bring deified Demon Dolls into the core area. Even if they could enter, the Demons might only use them in secret to avoid word of them spreading to other races.\n\n“Come and take a look. New things happen every day, and this is assuredly the latest. The Demon’s Ji Yang Sheng is pulling a rickshaw.”\n\n“Ji Yang Sheng is loved by the Demon alpha. He was so cocky, and now, he has been reduced to a rickshaw boy. Who is on the carriage he is pulling? It cannot be a King of the Extreme King, can it?”\n\n“What King class of the Extreme King could do that? Such a feat is beyond any of them.”\n\n“You must be joking. In this universe, who could be stronger than the Extreme King?”\n\n“You’re forgetting God’s Daddy.”\n\n“Oh, you mean Han Sen? That guy isn’t dead?”\n\n“Dead? He is living just fine. He’s somehow forced Ji Yang Sheng to do this, and he has two very beautiful women next to him. Don’t you see those two girls? They are so beautiful. I don’t think anyone else, out of all the races in existence, could be more beautiful than those two. I’d be willing to die for just one turn in the sheets with them.”\n\n“Really? They’re that hot?”\n\n“I’m not kidding. I saw a princess of the Extreme King once upon a time, but compared to these two… she was nothing. These girls are so much hotter. The Extreme King princesses are hardly fit to be their handmaidens.”\n\n“In that case, I must get a closer look.”\n\nJi Yang Sheng lowered his head and continued to pull the carriage. He didn’t say a word. He was so angry, and he thought to himself, “Han Sen, that *sshole. Don’t let me find a chance to kill you, because I will be ready to pounce the moment an opportunity appears.”\n\nSomeone took a video of the scene and distributed it. The entire universe came to know that Ji Yang Sheng was a rickshaw boy for Han Sen. The leaders of the Demon were about to start retching blood out of shame.\n\nFurthermore, the elites that had once been around Ji Yang Sheng had been killed. The backup elites were far away, and it would be a long time before they could get in range.\n\nHan Sen planned on drawing many Demons out, but the Demons didn’t come. Gu Qingcheng and Elysian Moon were very angry about the fact that they were attracting many horny men.\n\nLuckily, they only showed themselves in the beginning. After a while, the girls hid their faces. They wore armor so that no naughty people or creatures could see what they looked like.\n\nBut even so, many Kings still came over to watch.\n\nOf course, some of the Kings came to see the women, but most of the Kings were just there to see Han Sen. They wanted to gain his blessing or capture him.\n\nBut seeing this half-deified Demon Ji Yang Sheng pulling a rickshaw for Han Sen, no one dared to try anything provocative. If they were going to take him by force, they would prefer waiting for stronger elites to come.\n\nHan Sen traveled for half a day before someone was bold enough to try to bar his way.\n\n“Look, someone is here. Film it quickly. Let us watch and see who is looking for Han Sen. Isn’t that Autumn Wind of the Aichi race?”\n\n“Teehee. The Aichi are very famous for being womanizers. Autumn Wind must be going after those two girls.”\n\n“The Aichi are pretty well-respected out of all the high races. They have many elites in their ranks, and they are particularly proficient when it comes to wielding bows. There are many archers in their race. Still, aside from all that, the Aichi are pretty lazy. Most of their elites are just hired by other races. There are few races that don’t have an Aichi archer to help them. This Autumn Wind is probably the best archer they’ve had for many centuries. He is half-deified, and he might one day become deified. This guy might actually take down Han Sen.”\n\n“I’m afraid his target isn’t Han Sen; it is actually those two girls.”\n\n“I don’t think that Autumn Wind has what it takes. Han Sen’s title of God’s Daddy isn’t a mere joke. Even the Extreme King deified elites failed to catch him, so I doubt there is much Autumn Wind can accomplish.”\n\n“Maybe not. The Tianxia System and the systems of chaos are too complicated. Those deifieds would obviously run into trouble if they were after Han Sen and he hid well. In the core area, it isn’t so easy to hide.”\n\nWhile everyone was talking, Han Sen’s bronze carriage moved right in front of Autumn Wind.\n\nHan Sen looked at Autumn Wind. He looked just like a human. He was shorter and skinnier than Han Sen, but his face was very delicate. His ears were long and sharp, in particular. He had long, silver hair with transparent wings on his back. He was like an elf out of legends.\n\n“Why are you getting in my way?” Han Sen asked, looking coldly at Autumn Wind.\n\nAutumn Wind looked at Gu Qingcheng and Elysian Moon and said, “I had heard that there were two beautiful women here. It said their image can stun the entire universe. So, I have just come here to take a look. I thought the tales must have been exaggerated, but before I could even see them, their presence alone was enough to make me drunk. These intoxicating feelings are surely worth the trip. I wonder if these two women are willing to reveal their faces to me. I am willing to die for the sight.”\n\n“You should go home while you still can,” Han Sen said flatly.\n\n“I’m serious about this. Ladies, if you will allow me to see your faces, I’m willing to be a slave for you. Heck, I would kill myself immediately and not even be upset about it.” Autumn Wind ignored Han Sen, begging Gu Qingcheng and Elysian Moon for a look.\n\nDespite his monologue, it didn’t seem like he was looking for a fight.\n\nHan Sen was about to tell Ji Yang Sheng to continue past Autumn Wind, but Elysian Moon suddenly said, “You can see our true selves, but only if you beat him. Do that, and you can see us.”\n\nElysian Moon’s words shocked many of the Kings that were present. They thought those two women were Han Sen’s friends, but she had suggested something very different.\n\nThey started to believe the women were being held hostage by a demon. It made people’s blood boil. They wanted to save the beautiful women."
}