{
    "chapter": 1285,
    "title": "Attacking Saint Fan Shelter",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1285",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nXie Yuxin returned to Yu Shaoqing’s side and saw Yu Qianxun beside him, also. She asked, “Qianxun?”\n\nYu Qianxun stroked her head gently and told her, “It’s fine. There is no need for shame; you have merely encountered a genuine professional, that’s all.”\n\n“Did he pretend to be a noob to trick me? Did he hustle me?!” Xie Yuxin’s sadness started to develop an undercurrent of frustration and anger.\n\n“Not really,” Yu Qianxun said. She looked over to the holographic machine and then said, “But let me give him a go.”\n\n“Yes! Avenge my defeat,” Xu Shaoqing proclaimed.\n\n“There is no vengeance to be had,” Yu Qianxun rebutted.\n\nBut before she reached the machine, Han Sen came strolling out as casually as he had first entered.\n\n“Han Sen…”\n\n“Yu Qianxun?”\n\nWhen they crossed paths, they spoke each other’s names in startled surprise.\n\n“You two know each other?” Xu Shaoqing asked.\n\nXu Qianxun said, “Don’t tell me you don’t know about humanity’s first super aristocrat?”\n\nThe expressions of the two young ones now turned to shock, and they both squealed, “This guy is the Han Sen?”\n\nYu Qianxun said nothing more to them. Instead, she merely waved to Han Sen and spoke to him like the old friend he was. “Long time, no see.”\n\n“You haven’t changed a bit,” Han Sen said.\n\nEveryone was now fighting amongst each other to talk to Han Sen, and Xie Yuxin’s bitterness had turned to complete sweetness.\n\nShe would have felt terrible, losing the way she had to some commoner. But she was happy to let a superstar like Han Sen pound her all day.\n\nMatching with a person like that, she felt she had been extremely fortuitous. Winning or losing did not concern her at all if she was going up against him. It was privilege enough to share the same air with him, she thought.\n\nFurthermore, she was still just an evolver. Han Sen, on the other hand, had managed to take down an emperor shelter in the Third God’s Sanctuary.\n\nYu Qianxun then introduced her friends to Han Sen, while he also introduced to them his wife, Ji Yanran, and his companion, Zero.\n\nHan Sen felt very relaxed after that, and he had a good time in the company of his new acquaintances. Pressure was omnipresent back in the sanctuaries. This vacation came at the right time, he felt. It had really done him a lot of good, having a holiday like this, after the trials he had recently overcome.\n\nAfter the holiday was over, though, he decided to return to the sanctuary.\n\nHan Sen: Super Body Super King Spirit\n\nLevel: Surpasser\n\nLifespan: 400\n\nEvolution Requirement: 100 Geno Points\n\nOwned Geno Points: 100 Ordinary Geno Points, 100 Primitive Geno Points, 100 Mutant Geno Points, 100 Sacred Geno Points, 93 Super Geno Points\n\nHan Sen only needed seven more points to completely max out. His fitness was 3700, a staggering sum.\n\nWhen Han Sen eventually reached demi-god status, however, he’d do so at the number of 7000.\n\nHan Sen asked Dry Bone King about Saint Fan Shelter.\n\nHan Sen had Little Silver, Purple Emperor, and now Serpent Throne for diligent companions, and he believed it would be enough to take on Saint Fan.\n\nHan Sen actually had an advantage over the spirits. While he only lived once, he had no spirit stone. And having no spirit stone meant nothing worthwhile could be stolen while he was away. Even if Thunder Hell Shelter was claimed by another force, in the time he would be gone, he could return and promptly reclaim it.\n\nDry Bone King told Han Sen everything he could about Saint Fan Emperor and his shelter.\n\nHan Sen could paint a greater picture and imagine how well-fortified the place would be, with the super creatures that protected it. It would be a fight more difficult than what had previously taken place on the plains.\n\nThe primary problem with assaulting the place, though, would be securing the initial insertion point. Han Sen could not walk right up to the shelter, as there was a broad, moat-like lake of holy water encircling it.\n\nTo get across, he’d need—at the very least—the protection only Water Fairy could provide.\n\nHan Sen approached her and asked if she also had the ability to bring Blue Dinosaur.\n\nWater Fairy answered his request by telling him, “I can do that, but none of you will be able to do battle across the holy water. If Saint Fan attacks us as we cross, there will be nothing I can do to stop him.”\n\n“Is there another way we might be able to get in?” Han Sen asked, with a frown.\n\nWater Fairy suggested, “You could always blow up the lake it sits at the center of.”\n\n“Blow up… the lake?” Han Sen paused for a minute, then rephrased her request to see if he understood. “You mean to suggest we drain the water, or at least get it away, by… blowing it up?”\n\n“Precisely! The holy water is a purified substance; it’s not actually water. It conducts raw power. If we feed it enough power, and go beyond what it can naturally hold, we can blow it all up,” Water Fairy said.\n\n“I love this idea! Blowing things up never gets old.” Han Sen was keen on the idea, and so after hearing that, he hastily rallied his troops and set off on a march to Saint Fan Shelter.\n\nThe lake that encompassed the shelter was further encircled by a wide emerald expanse.\n\nRodman hailed from East-Crack Planet. He had been stuck at that shelter ever since he became a surpasser, and that was seventy years ago.\n\nThe only thing he was allowed to do there was water the flowers every day. The holy flowers resided in the center of the shelter like a big parasol. They were like some shield generator, too, as they kept the holy water from penetrating the shelter.\n\nThere were two hundred humans there, suffering in the same conditions he was. Some had been there two years, whereas others had been there an entire century. Regardless of their circumstances, they were practically one and the same. Once they entered the shelter, they were completely robbed of their freedom.\n\nRodman often thought about ending his own life, but he could never muster up the last bit of courage required for the act."
}