{
    "chapter": 2629,
    "title": "The World Moves Because of Her",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2629",
    "text": "As Exquisite stood in the arena, she looked more like a piece of machinery than a living being. Her expression was utterly placid, as if she could see through everything. Even sages and prophets wouldn’t be so calm and controlled.\n\n“No matter how many times I see this, I’m always struck by both the power and the cruelty of the Very High Eye. They have managed to combine the sky with their body. They should be the real Sky people. But combining with the Sky makes them a part of the universal ruleset. Does the real Exquisite still exist?” Sky Palace Leader looked at Exquisite and sighed.\n\n“Our alpha worried about that, too. That was why he insisted on interbreeding with another race to create an entirely new people It brought about very special changes for the Very High Eye. Our Very High Eyes might have weakened now that they are no longer perfectly aligned with the universal ruleset, but the changes did open the door for other, grander opportunities. It has more possibilities than the Very High Eye.” The woman paused and went on to say, “But anyway, we are part of the universe. There is no way for us to disconnect from it, no matter what we do. From that perspective, the path of the Very High is the correct one. They are the race that is closest to the weave that composes the universe.”\n\n“Right or wrong, it doesn’t matter. We should just take the path we feel is right. Results are something only time can tell us,” Sky Palace Leader said with a shrug.\n\nHan Sen was admiring Exquisite’s power. He watched her use this ability once before, but seeing it again was just as moving.\n\nPeople weren’t perfect; everyone had their flaws. When Exquisite opened her Very High Eye, however, she no longer seemed like a mortal being with failings and frailties. It was as if she wasn’t even a person. She was like some art piece created by none other than God himself.\n\n“Use all your strength, or else you won’t stand a chance,” Exquisite told Han Sen. Her words might have sounded cocky, but there was no cockiness in her tone. It was more like she was just speaking facts.\n\nHan Sen smiled. He lifted his hand like a knife and used Fang to slash toward her.\n\nThe last time they fought, they had been using the water of a nearby pond. It was like a practice session for him, and Exquisite hadn’t used all her Very High power.\n\nThis time, it was different. She wasn’t holding back. Exquisite’s battling power was firing on all cylinders.\n\nPurple knife air flew out of his palm like the fangs of a toxic snake that was leaping forward to bite her. It was a quick, cruel, and accurate slash. The strike was almost too fast to track.\n\nYisha saw Han Sen use Fang, and she couldn’t help but nod. Han Sen’s Teeth Knife was different from her own, but it had already reached the skill ceiling. This display of his had asserted his position as one of the greatest Teeth Knife elites.\n\nSky Palace had many elites that made use of knives, and when they saw Han Sen’s attack, they were surprised. Even people who didn’t know about knives could tell how strong that attack was. It had reached an unbelievable level. It was no worse than the skill of a deified elite.\n\n“Although I don’t want to admit it, talent really does determine how far a person can go. Like Brother Han, for example. He can perform a knife skill as impressive as that. In Sky Palace, I am afraid only Lone Bamboo and Yu Shanxin can be compared to him,” a Sky Palace student said with a sigh.\n\nThe next second, that same Sky Palace student felt his eyes widen. He couldn’t believe what he was seeing.\n\nHan Sen’s shocking strike had missed.\n\nAs the attack flew forward, Exquisite stood where she was and didn’t move. Han Sen’s attack just flashed right through her, and it didn’t even ruffle her hair.\n\nExquisite’s white clothes didn’t even flutter in the wind as she calmly looked at Han Sen and said, “Continue. Use all your power.”\n\nHan Sen didn’t move. Then he summoned his power and began to use all of his skills from Teeth Knife.\n\nTo be honest, Han Sen never really focused on knife skills, but he had tried very hard to practice them. All of his skills had become very powerful, and not many people at his level were so skilled.\n\nBut over the next few minutes, he used every Teeth Knife-derived skill that he knew. And that entire time, Exquisite stood where she was. She was unmoving. She didn’t even wiggle her toes. Han Sen’s knife airs flew past her harmlessly.\n\nThe Sky Palace students knew the Very High were strong, but they were still frozen. They couldn’t imagine what sort of skill was being used against Han Sen. Exquisite had somehow made her opponent miss every strike without moving a finger. She hadn’t been damaged in the least.\n\nNo one would think that Han Sen would make the mistake of missing his opponent, but even if he did, there was no way that all of his knife skills would fail to touch her.\n\n“Brother Lone Bamboo, what power is Exquisite using? How can she avoid taking any damage when she’s just standing there?” Yun Suyi asked Lone Bamboo, who was beside her.\n\nLone Bamboo waited for a while before saying, “She might not have moved, but in a way, she’s still hiding.”\n\n“What is the difference?” Yun Sushang couldn’t help herself from asking.\n\nLone Bamboo thought for a minute and then said, “We know that movement is relative. When you’re flying a ship and you look out the window, it might look like the things outside are going backward instead of the ship going forward.”\n\nYun Sushang heard this, and with a trembling body, she said, “Do you mean Exquisite isn’t the one moving, but it is actually the whole world?”\n\n“Something like that. Since she is only a ninth-tier King, her ability isn’t that powerful yet. But the arena is shifting because of her, at least.” Lone Bamboo nodded.\n\n“The whole world is being altered by her. That must mean that Brother Han is going to lose,” Yun Suyi said with worry.\n\n“Maybe not. I was just explaining what she’s doing. Exquisite is still only a King class fighter. She isn’t as strong as a deified creature. There is a limit to how much she can influence the world. If Han Sen goes beyond that limit, he can be the train that stops moving in a scene,” Lone Bamboo said.\n\n“They are both ninth-tier Kings? Can Brother Han’s power exceed what Exquisite’s strength can control?” Yun Suyi looked at Lone Bamboo, expecting an answer.\n\n“Yes,” Lone Bamboo answered with certainty.\n\nAfter Lone Bamboo said yes, Han Sen cast Fang again.\n\n“Repeating that same geno art? There’s no point in using it twice,” Exquisite still stood where she had started. But as she said that, she suddenly stopped and looked down.\n\n“Huh?” The arena echoed with the sound of clothing being torn. Exquisite’s left sleeve had been ripped off. Purple Teeth power spread across her garment.\n\n“You said using the same skill wouldn’t work?” Han Sen smiled at Exquisite as he spoke."
}