{
    "chapter": 2244,
    "title": "Woman in the Palace",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2244",
    "text": "Peering into the pool that looked to have been made of white jade, you could see a woman in knitted clothing. The white yarn of her threads in the water looked transparent, and you could almost see every aspect of her body.\n\nHan Sen had seen many beautiful women in his time, but very few ever attracted him. This woman, however, was so attractive. It was the first time he had felt this way.\n\nAny man who laid eyes on that woman would love nothing more than to breed with her.\n\nThe little creature he had been following swam up to the woman. Then, the woman held it up and stroked it. It looked as if it was enjoying it, but that just made onlookers want to kick the animal away so they themselves could be caressed by her boobs.\n\n“Come.” The woman’s clear eyes spoke. She had not said a word, but a signal and invitation was most certainly issued.\n\nHan Sen’s heart jumped. He froze in the sky and looked at her nervously.\n\n“I did not mean to accidentally access this place. Please forgive my intrusion. I will be leaving now.” Han Sen said that, and proceeded to make an effort to leave with Little Star.\n\n“But since you are here, why be in such a rush to go?” The woman finally spoke. Her voice was very seductively toned, and hearing her speak made Han Sen’s entire body shiver.\n\nHan Sen did not dare stay, though. He went atop Little Star and readied himself to run. Little Star activated Starsea Travel to go through the walls, but then, Han Sen heard a pang as they started to run. Little Star hit a wall and so did Han Sen. It resulted in Han Sen’s nose bleeding.\n\nLittle Star was not feeling too good after that, either. It used its claws to clutch its nose, as tears began to roll from its eyes.\n\nThe woman laughed and said, “Where do you think this place is? Do you think this is somewhere you can freely come and go?”\n\n“I have not offended you, so why not go a little easy on me?” Han Sen stared at her and frowned.\n\nThe woman coldly laughed, “When did I not go easy on you? Leave if you want, for I will not stop you.”\n\n“If you are not going to stop me, then turn off the boundaries of these walls.” Han Sen frowned.\n\nThe woman laughed so hard; her body started to shake. Her boobs in the water made people’s hearts jump and stare at intensely.\n\n“Did I say something funny?” Han Sen coldly said.\n\n“If I could break the boundaries, why would I still be here?” After that, the woman walked out of the pool.\n\nHan Sen was shocked. He could see that the woman’s neck, wrists, and ankles were shackled with metal chains. At the end of the chain was a lock that was as small as a hair. The lock went all the way to the bottom of the pool. There were a few holes, and each chain went through each. Where they went, none could guess.\n\nThe woman walked away from the pool and went to lie on a jade bed. She held her neck and looked at Han Sen seductively. “When you came in, I tried my best to break the locks. You would not have been able to get in, had I not.”\n\n“In that case, please help us again by letting us out.” Han Sen looked depressed.\n\nHan Sen thought the woman had released that creature on purpose, in a deliberate attempt to lure them to her.\n\nBut looking at her face, it did not seem as if she was in cahoots with Edward. But that just made her identity even more of a mystery.\n\n“No. I have not seen anyone else in a long time. It is rare to have a visitor here, so I cannot let you go so soon.” The woman smiled as she looked at him. “I used all my power to only just about open the boundaries. Now I don’t have strength to do the same again, even if I did want to help you. So, just stay here with me.”\n\nHan Sen could see that the woman had a hairy white tail. It made him think and then ask, “You are a shapeshifting fox?”\n\nThe woman smiled. “You can call me Fox Queen.”\n\n“What?” Han Sen did not understand what the woman said.\n\n“Fox Fox. Queen Queen.” Fox Queen stroked the creature in her arms as she spoke.\n\n“Which king’s queen are you?” Han Sen’s face changed. Judging from the races that wished to live alone, Extreme King had to be the most famous one.\n\nFox Queen smiled. “I am the queen that belongs to Ghost Bone King.”\n\n“One of ten generals of Sacred? General Ghost Bone?” Han Sen thought, and he knew exactly who she was talking about.\n\nEveryone called General Ghost Bone and the others the top ten generals. This one’s name was General Ghost Bone. Han Sen hadn’t guessed his name was actually Ghost Bone King. Han Sen gleaned this from what she had said.\n\n“Nice. You are familiar with my husband?” Fox Queen smiled and look at Han Sen as she asked.\n\n“No. I only know his name. If you are his wife, then why are you locked here? Did General Ghost Bone not make an effort to save you?” Han Sen looked at the palace as he asked.\n\nHe did not know if General Ghost Bone was still alive or not, but if his wife was still alive, there was every chance that General Ghost Bone was not dead as presumed.\n\n“He locked me up here. Why would he come and save me?” Fox Queen laughed. It was as if she was saying it was not any of his business.\n\n“Are you not his wife? Why did he lock you up here?” Han Sen looked at Fox Queen with much surprise, and he couldn’t understand why this might have happened.\n\n“It was because he feared me.” Fox Queen’s squinted with her eyes.\n\n“He was scared of you?” Han Sen checked her out. It was difficult to imagine this woman might have been stronger than Ghost Bone General.\n\n“Yes. He was scared of me, and that is why he locked me up here. He wouldn’t let anyone come and pay me a visit, either.” Fox Queen smiled, and she then went on to say, “You know I am a shapeshifting fox, yes? And you know I can turn into any creature I desire to? I can turn into any pretty woman of any race. So, it is possible for me to seduce any man that lays their eyes on me. If you were my husband, would you be afraid?”\n\n“Yes, I would be.” Han Sen gave a wry smile.\n\n“Haha, at least you are honest.” Fox Queen looked at Han Sen. “Are you one of the crystallizers or one of the Extreme King?”\n\n“I am one of the crystallizers. Do you earnestly think I look like the Extreme King?” Han Sen looked surprised.\n\n“My race is very good at gene shaping. I can tell your body has some Extreme King genes in it. Perhaps I am mistaken, but the Extreme King shouldn’t be breeding with ones of a lower race such as the crystallizers,” Fox Queen said after a think.\n\nWhat Fox Queen said made Han Sen flinch. “Humans are a hybrid of the crystallizers and another race? Are the Extreme King included in that equation? It seems like it is a possibility. The structure of an Extreme King does look an awful lot like a human.”\n\n“Since you cannot leave, would you like to see something fun?” Fox Queen suddenly winked at Han Sen"
}