{
    "chapter": 2391,
    "title": "King Class Dongxuan Battle Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2391",
    "text": "Han Sen could feel two powers battling inside him, but even so, his facial expression remained unchanged.\n\nHe had thought of a way to deal with the power invading his body some time ago. Instead of the unimaginably horrible force that Fox Queen considered it, Han Sen had realized that it was just power like any other. It wasn’t too bad.\n\nHan Sen used his mind to summon Spell. She appeared in the form of a young lady.\n\nHan Sen was casting the Dongxuan Sutra as hard as he could. At that moment, he couldn’t spare a thought for anything else. Spell was sort of like a living being, and so she could cast The Story of Gene alone. And she didn’t require Han Sen’s body for the control.\n\nHan Sen and Spell’s minds were connected. She knew what Han Sen wanted, and so she cast The Story of Genes. One of her hands pressed against Han Sen’s forehead.\n\nA symbol of light appeared on Han Sen’s forehead, then melted into his flesh. At that instant, Han Sen’s body stopped changing. It was like the Sacred Blood Statue and the Nine-Tailed Fox were frozen in place. Everything just stopped.\n\nBut after a single second, the Sacred Blood Statue and the Nine-Tailed Fox started to move again. They raged through Han Sen’s body just as they had before.\n\nSpell pulled out her pistols and fired at Han Sen. Each bullet was imbued with the powers of Eternity, and they peppered across Han Sen’s skin. They froze each part of Han Sen’s body in turn.\n\nHan Sen ran his Dongxuan Sutra at max power. And he started pushing it toward King class.\n\nThe whole world was like a gigantic machine comprised of cogwheels, their teeth interlocked. And Han Sen’s cogwheel was oversized. It had the rigidity of steel, and many surrounding cogwheels were too small to fit into it. Even so, it connected with many cogwheels. If he wanted to move his self-universe cogwheel, he would have to spin all the cogwheels around him, as well.\n\nHan Sen pushed his Dongxuan Sutra to run at an insane level. He tried to push the self-universe cogwheel using every scrap of strength he could gather, including the Sacred Blood Statue and Nine-Tailed Fox powers.\n\nSpell fired continuously, and most of Han Sen’s body had been solidified. But that solidifying power wasn’t enough to stop the Sacred Blood Statue or Nine-Tailed Fox markings. But Spell wasn’t planning on keeping them trapped, anyway.\n\nSpell used Eternity’s solidifying powers to forge a path inside Han Sen’s body. It was the path that the Dongxuan Sutra would take. Aside from that path, everything else would be frozen.\n\nTwo scary powers were coming, surging into that tunnel like a raging river. With the guidance of Han Sen’s Dongxuan Sutra, the flow of power was headed directly for the self-universe cogwheel.\n\nBoom!\n\nThe horrendous collection of powers hit the self-universe cogwheel. The cogwheel vibrated gently. It didn’t spin, but Han Sen spotted the small seeds of hope.\n\nHan Sen had tried his hardest before this, but it had always proven fruitless. He had never been able to move the self-universe cogwheel the slightest amount. Now, after a single hit, it had reacted, if only barely. It gave him hope.\n\nHe closed his eyes and continued casting the Dongxuan Sutra. He guided the two powers into the cogwheel again and again. Every hit made the cogwheel jump.\n\nWith the Dongxuan Sutra guiding more and more power, the cogwheel’s shivering developed into a loud rattle. The cogwheels around it were also starting to move. It was like a machine that had been abandoned many years ago was now being reactivated. Dust fell away from the gears as the hum of a dormant power started to come to life.\n\nSpell’s face was impassive as she kept shooting. She had to keep the tunnel in Han Sen’s body intact.\n\nThe flesh Eternity had solidified was somewhat like a dam. The Sacred Blood Statue and Nine-Tailed Fox markings were like flash floods. They followed the course of the river, washing up against the dam and banks that guided it. Those restraints could not be allowed to break. If they broke, the power would spill and spread, turning into a destructive force that could ruin Han Sen.\n\nEternity’s solidifying power was Duke class, so the dam wasn’t enough to trap all the water. Spell had to keep solidifying the dams repeatedly so that they wouldn’t crumble under the onslaught.\n\nBoom! Boom! Boom!\n\nHan Sen kept hitting the self-universe cogwheel. The cogwheel spun little by little, but it only moved a small distance with each strike. When the hits stopped, the cogwheel stopped.\n\n“My self-universe cogwheel is too big. I’m afraid that making it spin might be too difficult,” Han Sen thought in surprise.\n\nThe two powers kept colliding with the cogwheel, but they had proved insufficient to get the cogwheel moving continuously. This was a much harder task than Han Sen had believed it would be.\n\nFortunately, Han Sen had chosen to break through with the Dongxuan Sutra. He could see the self-universe cogwheel clearly, and that enabled him to strike with precision and at an angle that would deliver the most force. If he had chosen to use a different geno art, he would barely be able to see his connection with the universe at large. Without being able to see the cogwheel, it would have been even harder for him to level up.\n\n“These two powers are too spread out. If they keep hitting like this, it will be impossible to truly start up the self-universe cogwheel.” After another moment, Han Sen came up with a solution.\n\nHe thought about it in his mind, and Spell understood what he meant. Her pistols shifted slightly, changing the course of the tunnel she had crafted inside Han Sen’s body.\n\nThe two powers had been guided on different paths through Han Sen’s body, but now they were brought together into a circle. That cycle of powers was then pushed into a new pair of trenches that interlocked in a figure eight, allowing the power to cycle continuously. As the powers cycled, they passed over Han Sen’s self-universe cogwheel.\n\nKatcha-cha!\n\nWhen those two powers moved together in perfect unison, the chains that pulled the cogwheel started to move. The self-universe cogwheel started to move along with it. The other cogwheels that were connected to it started to spin, as well.\n\nPure joy shot through Han Sen. He kept guiding the two powers to turn the cogwheel.\n\nIt was slow going in the beginning, but as the cogwheel started to move, it also began to accelerate.\n\nKatcha-cha! Katcha-cha!\n\nWhen the cogwheel started to turn, Han Sen felt as if his entire body was waking up from the embrace of a deep slumber. It was like a generator had been started, and an endless power began to rise.\n\nAs the cogwheel spun in a blur, Han Sen could see behind the cogwheel that light was growing brighter. The faster the cogwheel spun, the brighter that light became.\n\nBoom!\n\nWith the Sacred Blood Statue and Nine-Tailed Fox power combining to form a chain, the self-universe cogwheel was given what was needed for it to spin on its own. Inside the cogwheel, the light was burning brighter than any sun. The light looked like it could melt anything. Han Sen’s body felt as weightless as a feather, and the self-universe cogwheel no longer required his power. It could now run on its own.\n\nAn invisible area opened, expanding its radius outside of Han Sen. It created a weird, invisible bubble.\n\n“Dongxuan Battle Body has leveled up to King class first-tier area.”\n\n“It worked!” Han Sen grinned like a fiend. He had finally become King class. Although he was only on the first tier, what was most important was the fact that he had succeeded.\n\nAs the cogwheel continued to spin, Han Sen heard a metal door get pushed open. The dimension around him began to shake. A door had been opened by the cogwheels, and Han Sen’s body was sucked inside."
}