{
    "chapter": 42,
    "title": "Dollar",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_42",
    "text": "In the beginning, Zhao Boshan’s video didn’t attract much attention. After all, there were so many videos online about the robot channel test.\n\n7.88 seconds was also considered a gimmick, as those who could pass the test within ten seconds would be among the very best of the unevolved.\n\nEven stars like Tang Zhenliu could finish the test in just under ten seconds and couldn’t improve any further. If someone really finished it within 7.88 seconds, he or she would surely be a star. Therefore, it would be impossible for it to be uploaded by an unknown account.\n\nAlmost everyone who saw the title would choose to skip the video, and it could soon be lost in the massive number of videos. Only a few who were bored would play the video.\n\nHowever, those who had seen the video were all impressed by the brutal method used to pass the test and chose to forward the link to their friends.\n\nCoincidentally, someone from Steel Armor Shelter also watched the video and recognized the man in the video as Dollar from Steel Armor Shelter. Immediately after he finished watching the video, he posted a new thread titled \"SSS-level, Dollar Conquered Robot Channel in 7’88’’ to the section of Steel Armor Shelter.\n\n\"That Dollar who robbed Son of Heaven of the beast soul?\"\n\n\"Is the title for real?\"\n\n\"Is Dollar’s real identity exposed?\"\n\nThe name Dollar was so well-known in Steel Armor Shelter that the post soon got a lot of attention, and many watched the video with a skeptical attitude, which turned into admiration when they finished watching.\n\n\"Dollar is my idol.\"\n\n\"This is how real men should pass the test.\"\n\n\"Ha-ha, the combat robots were all crushed.\"\n\n\"His beast soul was stolen from Son of Heaven, and he is nothing without beast souls.\"\n\n\"Dollar is invincible.\"\n\n\"Idol!\"\n\nThe video was watched so much in Steel Armor Shelter that the administrator soon noticed it and put it on the front page.\n\nAt this point, this video became viral in the entire alliance, and almost all unevolved now knew about Dollar.\n\n\"It must be fake.\"\n\n\"No way! Did you not see it’s an official video?\"\n\n\"This is not possible. The robots in the beginning were not that strong, but it was so incredible that he knocked away the ones close to the end as well.\"\n\n\"No way this looks too fake. It is definitely modified. If it’s not, I’ll eat s*#t.\"\n\n\"Who is this man? One of the Chosen?\"\n\n\"This is Dollar from Steel Armor Shelter.\"\n\n\"What Dollar? I have not heard of him.\"\n\n\"That is because you are ignorant...\"\n\nDollar brought honor to the entire Steel Armor Shelter. Many people in the shelter were telling the story all over the Skynet of Dollar robbing the beast soul from Son of Heaven.\n\n\"Zhenliu, come and look at this,\" a good-looking young man waved to Tang Zhenliu, who was training.\n\n\"Lin Feng, what is it?\" Tang Zhenliu approached the young man while wiping his face with a towel. Taking a look at the video the young man was watching, he commented, \"7.88 seconds, robot channel conquered. This is crap. It took me ten seconds. How can anyone finish it in 7.88 seconds?\" Tang Zhenliu played with his hair casually.\n\n\"Just watch this.\" Lin Feng played the video.\n\n\"No way! This can’t be… Who is this guy? Where is he from?\"\n\n\"No idea. But according to my analysis, he must have maxed out on all geno points except for sacred geno points. He also has practiced advanced hyper geno arts. His armor and shapeshifting beast souls were all sacred-blood.\" Lin Feng paused the holographic video and continued to analyze, \"His shapeshifting beast soul is fast and... \"\n\n\"Enough with the analysis. I just want to know who he is. Finally, all the top guys have gone to Second God’s Sanctuary, and I now have a chance to rank second among the Chosen. And now here’s this guy!\" Tang Zhenliu gritted his teeth. \"Find out who he is. I’ll have him killed before he can ruin my chances.\"\n\nLin Feng rolled his eyes, \"First, this video is from the official physical test center, so there is no way you could find out his identity. Second, someone with this fitness level must be from a prominent family or even have something to do with the military. You think you dare to have someone like that killed?\"\n\n\"Ahem, I was just expressing my anger… Don’t take me seriously...\" Tang Zhenliu was embarrassed.\n\n\"Who could he be?\" Lin Feng frowned, staring at the golden figure in the video.\n\nThere were many who shared Lin Feng’s question and wondered about the background of Dollar. Due to the limited information available, no one had any clue.\n\nSome people also tried to ask Zhao Boshan, the poster of the video. However, Zhao Boshan had no idea who that man was. So, all people knew was that Dollar took the test on Planet Roca.\n\nBut interplanetary travel was so convenient that many people were even working on a different planet from where they lived. Hence, no one knew whether Dollar was passing by or lived there. Plus, there were a dozen billion people on Roca, so it was impossible to locate a single individual anyway."
}