{
    "chapter": 2883,
    "title": "The Decision to Light a Lantern",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2883",
    "text": "“I am finally back! Home is good.” Han Sen returned home. He took a deep breath and accepted the heartwarming fragrance of home.\n\n“Dad!” Upon seeing Han Sen, Ling’er ran over to him in search of a hug.\n\n“Ling’er. Good Ling’er. Let Dad kiss you.” Han Sen picked up Ling’er and kissed her on the head. He rubbed her face and commented on how spongey her cheeks felt.\n\n“You remembered to come back. If you were not yet back, Ling’er was going to forget what you looked like.” Ji Yanran rolled her eyes at Han Sen.\n\nHan Sen picked up Ling’er. He used his nose to rub hers as he said, “Ling’er would not forget Dad. Isn’t that right?”\n\nLing’er’s eyes were wide open as she replied, “Ling’er would never forget Dad, and Dad would never forget Ling’er. Right?” Han Sen held Ling’er and said, “Of course not. Ling’er is daddy’s baby. Daddy can forget everyone except for Ling’er,” Ling’er was holding Han Sen’s neck. With a squeaky voice, she asked, “Ling’er and Daddy will be together forever, right?”\n\n“Of course.” Han Sen nodded.\n\n“Kindergarten is on a break. Mother said Ling’er can go play.” Ling’er blinked and asked, “Can you take me to the big universe to play?”\n\n“What?” Han Sen was surprised. It was now revealed that she was being so nice solely for the reason of Han Sen taking her out.\n\nHan Sen sighed. If this was before, he would have hesitated and outright refused to take Ling’er to the big universe. It was too dangerous.\n\nNow, Han Sen had the power to protect himself, so he had the option to consider it.\n\n“If there is no danger, you should take her,” said Ji Yanran, who was nearby. “The teacher gave her a lot of homework that requires the assistance of a parent. You never spend time with her. Take this as a trip to finish the homework.”\n\n“Why not? Out there, I have a place to stay. Bao’er and Little Red Bird are there. I bet they miss Ling’er a lot.” Han Sen nodded. He looked at Ji Yanran and asked, “Are you coming with\n\nus?!\n\n“I am not going,” Ji Yanran said. “Recently, I have been researching Xuanmen skills. I have discovered something interesting. I want to achieve something with the Xuanmen skills first, then I will take Ling’er to the universe. I will be living there from now on.”\n\nHan Sen was surprised. Xuanmen skills were a bit complicated and more than a bit boring. It was difficult for ordinary people to learn, and the results were never obvious. It was a skill that took a long time to learn. He was surprised to hear that Ji Yanran was interested in learning a Xuanmen skill.\n\nThe next morning, Han Sen took Ling’er with him on his teleportation back to the universe. He said goodbye to Kong Fei and used Galaxy Teleportation to return to Space Garden.\n\nLing’er was very good at adjusting. The universe’s powerful pressure did not affect her. She was able to adjust to its environment pretty quickly. It was surprising. “How powerful is Ling’er’s body? When I just leveled up and came here, it took me a while to adjust to the pressure of this universe.” Han Sen looked at Ling’er with a strange expression. She was merrily jumping around. Her two pigtails were swinging.\n\nHan Sen was feeling cocky and said, “I cannot blame her. After all, her daddy is the one-and-only Han Sen.”\n\nThe Holy Baby was released by Han Sen again. With a look of depression, he waddled over to sit next to him.\n\nThere were not many changes in Space Garden, but there were many changes in the people there. Bao’er, Little Red Bird, Little Angel, Zero, Huangfu Jing, Qin Xuan, Tang Zhenliu, and Wang Yuhang were all there.\n\nMost importantly, many people had already used the resources of Space Garden to become deified class. Aside from the few that showed up on the geno god list, Moment Queen and Little Star Star were deified too.\n\n“This is all because of Little Red Bird,” Wang Yuhang excitedly said. “If it was not for him, we would not be able to start hunting plant xenogeneics so fast. We would not have as much geno fluid to use. By the way, this is such a great place. Deified xenogeneic plants are all over the place.”\n\nBao’er pulled Ling’er away to play elsewhere. Little Red Bird shook its butt and followed from behind. After following them for a bit, it went back. It flapped its wings and flew around Han Sen. It circled him a few times. It kept looking at him. It seemed as if he was searching for something.\n\n“Are you looking for this?” Han Sen’s heart jumped. He brought out the metal egg that Tai Yi had given to him.\n\nLittle Red Bird was excited and screamed. It flew over to Han Sen and opened its mouth, obviously wanting to eat the metal egg.\n\n“I cannot give this to you yet.” Han Sen smiled and put the egg back. Little Red Bird was disappointed.\n\nHe was not going to allow Little Red Bird to gobble it up before he figured out what the little metal egg did.\n\nSpace Garden was not very big right. They were mostly human creatures and spirits there. Their powers were not bad.\n\nHan Sen thought, “It looks like we can bring more interesting guys here. Space Garden has so many resources now. I can bring a few hundred more people and we’ll still be fine.”\n\nThe next place Han Sen planned on going to was the realm of the Buddha. He was still hesitant about choosing whether or not to challenge the Buddha and knock them down from being one of the higher races or just going to their lands and stealing the knife back.\n\nTaking down the Buddha was the best choice, but Han Sen did not want to do it as a human. If he used his crystallizer’s name, he did not know if humans would benefit from the act.\n\nOrdinarily, after a race’s lantern was lit, the creatures of the same race would receive a buff via the lantern. The genes in their bodies increased.\n\nHan Sen and the others were not pure crystallizers. If he used the name of the crystallizers to light up a lantern, he did not know what the outcome might be.\n\n“So far, the name of the crystallizers to light up the lantern might yield better results,” Wang Yuhang said. “Things about humans should not be too obvious. Plus, the ranking of the Buddha is low. It is not worth risking humans to take.”\n\nEveryone thought using the name of the crystallizers to fight the Buddha was better. After seeing the geno god list, they knew their powers were much weaker than others in the universe. It was not enough for them to keep a grip on their throne. “Alright.” Han Sen nodded. He planned on using Dollar’s identity for humans to light up a lantern. To do that, he was not going to select a low-tier race to target. He was going to make sure that when the humans were ready to make themselves known to the universe, they would immediately get into the top five.\n\nXi Qing King, Qin Xuan, and Han Sen were talking about the details. They confirmed that they would take down the Buddha as crystallizers and replace the lantern.\n\n“Bao’er, you take good care of Ling’er. Dad has some things to do.” Han Sen gave Ling’er to Bao’er. He used Galaxy Teleportation to go where the Buddha were.\n\nUpon seeing Han Sen leave, Holy Baby looked very happy and had a murderous expression. He walked over to Bao’er and Ling’er, who were playing together."
}