{
    "chapter": 1144,
    "title": "Ten Steps of the Holy Door",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1144",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe stone door hovered in the air, adamantly remaining closed.\n\nThe underground cavern was a mighty place, but the door seemed so far away. With Xiang Yin’s speed, it looked like she could reach it in the space of a second. But with everyone’s bated breath, it felt like she’d never reach there.\n\nThe mist that was a pleasant smell began to stream towards the door and Xiang Yin followed in its wake. The tallest point of the cavern’s ceiling was ten-thousand meters high, but to Han Sen, Xiang Yin felt like she was an entire galaxy away from him.\n\nWhen Xiang Yin reached the door, she placed her hands against it and pushed it partially open.\n\nThe scary power that came from that small gap immediately frightened Han Sen and flattened him down on the ground.\n\nIt wasn’t just Han Sen like this, but the creatures all around were pushed down to the ground, as well. Only the super creatures could manage to somewhat stand in defiance of that new gravity.\n\nAlthough the super creatures could fight it back, they still looked terrified before that power.\n\nXiang Yin’s clothes violently waved in the wind of a phantom typhoon that seemed to stem from that partially-opened door.\n\nBut Xiang Yin still managed to stand strong against it all, maintaining her grip on the door she pushed against.\n\nAs the door slowly opened, more and more of that wind entered the cavern. Soon after, not even the super creatures could stand.\n\nWhere Xiang Yin was, the wind was even more terrifying. The gusts were so sharp, they cut her like blades and knifed through the mist.\n\nXiang Yin frowned and summoned a flute. She blew a few notes towards the door, which manifested as a wall of snakes to aid her in withstanding the force of that invisible storm.\n\nShe continued her defiance of the door and pushed it with all her might, but soon after, not even the snakes could withstand the gusts.\n\nSo then, she summoned her lute. Notes emerged from the instrument without it even being played, and the notes took on the form of birds. Like a raven shield of gold, they stood against the fierce phantom winds as a bulwark before her.\n\nIt did not last forever, though, and each time her protection broke, she’d summon another instrument to create a shield. Over the time it took for her to open the door, she ended up summoning eight different instruments and eight different creatures.\n\nBoom!\n\nEven the stone door itself quivered. She had managed to open the door fully, but no spirit came through from the other side.\n\nIn the black on the other side of the stone door, there were stairs. Where they led, none could tell. The dimension inside was distorted and twisted, preventing any clear view by the onlookers.\n\nXiang Yin placed a foot on one of those steps, and the moment she took a step, a transparent fire blazed to consume her.\n\nThe beasts that accompanied her were useless, and they all turned to soot in the hungry flames that licked them.\n\nXiang Yin’s clothes and instruments became cinders and ash in the flame, and she looked to be in agony. The fire was making her suffer, but her resolve was not swayed. She pushed on to take a second step.\n\nMore fire blazed to envelop her, as all the items she possessed disintegrated into nothing. With Xiang Yin’s clothing gone, her flesh was seared through to expose bones that were then catching on fire.\n\nThat mist began to seep out from the seams and tears of her composition, and so too did magical musical notes. The forces tried to form a veil of protection around her, against the most brutal fire that sought to put an end to her ascension.\n\nWith every step she took, it seemed like a century had elapsed. And each time she took a step, another one would appear.\n\nThe transparent fire did not relent as she ascended, and it continued to ravage her as she went. But while it did indeed hurt her, it morphed and warped her super body’s genes.\n\nHan Sen was shocked. When she reached her seventh step, her super body began to collapse. He could not tell how many more steps awaited her.\n\nWhen she reached the ninth step, her entire body was vaporized. Han Sen could only see a blurry light reach that ninth step, and the notes and mist that accompanied her had drawn faintly.\n\n“Ten Steps of the Holy Door. I did not expect you to reach the ninth step; you must be the greatest of the eight generals,” a weird voice boomed throughout the underground. Quickly, it tried to follow Xiang Yin.\n\nHan Sen was shocked when he saw who it was. It was Yaksha!\n\nHe looked different than the last time Han Sen saw him. Yaksha looked strange, but as murderous as ever. Han Sen knew exactly what he was up to.\n\nBut with Xiang Yin focusing on her ascension of those brutal steps, she couldn’t turn her attention away to focus on anything else.\n\nYaksha had appeared at the perfect time to prevent her ascension. He was there now, bitterly seeking to stop her. Han Sen realized Yaksha must have been hidden there the entire time. He had waited for this paramount moment to reveal himself and make her fail.\n\nBy doing that, he hoped to achieve the powers of the Fourth God’s Sanctuary and flesh easily.\n\nPrior to this moment, Xiang Yin would have had no trouble exterminating the villain Yaksha was, but she was on the final step of that excruciating climb. She could not be distracted.\n\nBut it did seem like Xiang Yin herself now acknowledged Yaksha was there. She was shocked by his sudden appearance, and it immediately made her quiver. As she took notice, her notes appeared weaker.\n\n“Oh, no.” Han Sen looked at his xun and sought to stop Yaksha."
}