{
    "chapter": 2231,
    "title": "The Crisis Is Close",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2231",
    "text": "“You guys took the item. Shouldn’t you be leaving now? Stop bothering the resting place of Undying Bird.” The old woman did not look happy. She waved her hand.\n\n“You take it,” Bai Wei said to Han Sen as she let go of the item.\n\n“How could I do this?” Han Sen looked very guilty, but on the inside, he was as happy as a flower on the verge of blooming. “This is something that is as good as a deified thing. I may not know what it does, but it has to be something good.”\n\nBai Wei rolled her eyes. I am only asking you to hold onto it temporarily. Don’t think too deeply about it.\n\nHan Sen shrugged his shoulders. Without saying anything, he just moved to grab the Undying Bird Nest. The Undying Bird Nest was like a deified item, but without its approval, not even a deified elite could make use of it.\n\nHan Sen was surprised he had earned the will and approval of Undying Bird. Now that he had been approved to be able to make use of the Undying Bird Nest, it was useless for others. Even Bai Wei would not be able to take it.\n\n“You can’t put the blame on me for stealing it. You are the one that did not finish the Way of Life and Death,” Han Sen thought to himself.\n\nThe old woman did not seem very happy about the fact they had taken the Undying Bird Nest, and now she wished them gone.\n\nHan Sen was holding the bird nest, and as he was, he left Extreme Dead. He went back the way he came, and as he did, he soon came before the coast.\n\nThere were many lava bugs spread out across the lava sea. They were like little burning lava fairies. Their heat was hotter than the lava, and they were only resting. If they unleashed their heat all together, even a Duke’s armor would be melted.\n\nHan Sen tried to fly, but he realized he was still unable to. They would have to tread across the lava sea.\n\nBai Wei suddenly smiled at Han Sen, which sure gave him a surprise. Seeing a cocky person give someone a smile elicited a different feeling to the witness of an average smile.\n\nBai Wei pulled out a leaf. She put godlight into it and then threw the leaf into the lava sea.\n\nThe leaf expanded in the air. It looked like a small ship in the lava sea when it came down. It was green like jade. The leaf floated atop the lava sea. The lava bugs, however, started to avoid it in the lava. They did not dare draw close to the leaf.\n\nBai Wei stepped on the leaf, turned around, and looked at Han Sen. “If you guys are willing to be my knights, I am willing to take you away from here safely.”\n\n“Thanks, but no thanks.” Han Sen smiled. The woman was drunk on her own pride. She did not bother to find out who Han Sen was exactly, and the only threat before them were a few lava bugs. They weren’t going to stop him.\n\nBai Wei saw Han Sen and his friends huddle together, then Han Meng’er summoned a blue shield. It shielded them all just as they moved to walk across the sea of lava.\n\nBai Wei frowned and advised Han Sen, “When the lava bugs are shocked, they will explode. The heat they create can melt a Duke class defensive item. Even King class armor can break with the heat. Don’t say I didn’t warn you.”\n\n“Thank you for the tip,” Han Sen replied, but he did not stop walking across the sea.\n\nThey were walking across the lava sea with the Demon Bug King Bai Sema for protection when suddenly many of the lava bugs approached. Their bodies were like burning steel, and they launched themselves against the surface of the Bai Sema. They exploded with a searing heat. The heat was able to melt any kind of steel, but the Bai Sema did not melt at all.\n\nBai Wei looked quite surprised seeing this. Her facial expression was a complicated one. Bai Wei was operating her leafy vessel. She watched the others cross the lava sea. She was surprised by the level of defense the Demon Bug King Bai Sema had. She couldn’t help but stare at it.\n\n“How many tricks does this guy have up his sleeve?” Bai Wei looked at him weirdly.\n\nThey walked one mile from the shore of the island, and when crossing the threshold, their abilities to cast air powers returned. Han Sen and his companions started to fly up and away from the sea of lava.\n\nThe lava crocodiles that attacked did nothing to the Demon Bug King Bai Sema, either. Bai Wei had to put the leaf away and use her own powers to fight her way out of the lava sea’s region.\n\nHan Sen laughed at her, but he did make an offer for others to join him inside the shield; she just didn’t reply to him. She left by her own means.\n\n“This woman is way too full of pride.” Han Sen shook his head. He continued to investigate the Undying Bird Nest as he did so.\n\nHan Sen used the Purple-Eye Butterfly to examine it, and he could see how the Undying Bird Nest was full of mysterious cause substance chains. There were a lot of them, and there weren’t any gaps. It was scarier than the core substance chains on the stairs.\n\nHan Sen tried, but he failed to activate the nest’s power. He researched it for a while, but he could not figure out what its purpose was.\n\n“I will have to try some more when I get home. This bird nest’s power cannot be any less than Purgatory Heaven,” Han Sen thought to himself.\n\nWhen they left the underground cave, Han Sen and his companions returned to go for the Lava Valley again.\n\n“Break the camera. Pretend nothing happened today. If you guys dare speak a word about this, you’ll know what will happen, don’t you?” Bai Wei looked at Bao’er, who was intently filming her with the camera.\n\n“This is bad. We just destroyed a camera the other day. Now we’re going to destroy another one?” Han Sen looked terrible.\n\n“I will talk to Ice Blue Knight King. Just do it!” Bai Wei said.\n\nHan Sen was delighted, but his face still looked very bad. He said, “Alright, but there is still a while to go before we head back to base with this mission. How about we destroy it right before we return?”\n\nHan Sen did not want anyone to see any of that either, but if Bai Wei was willing to take responsibility, destroying it would be good.\n\nBai Wei stopped talking. She kept walking ahead through the valley. She was there because of the deal, but she was being punished. She could not go back to the Extreme King just yet.\n\nBai Wei’s punishment was because of Han Sen. Bai Wei lost the Destroyed Bible she had been tasked to recover all because of Dollar. That was why she was being punished by King Bai, but the punishment was for Bai Wei to retrieve the Undying Bird’s item. No one probably expected Bai Wei to not dare ascend the steps. Han Sen was the one who had earned the approval of the Undying Bird instead.\n\nHan Sen and the others continued their search through Lava Valley. After three days, someone else was in Lava Valley who had been following them.\n\nNight River King looked cold. Although he had been forced to go, his mind to kill Han Sen wasn’t."
}