{
    "chapter": 2580,
    "title": "The Snakes Are Coming",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2580",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen immediately loved his new bow. He had recently used Autumn Wind’s Wind String, but the bow already possessed an owner. Forcing it open hadn’t felt good.\n\nBut this Six Core Snake Bow was different. Han Sen held its body and pulled the string effortlessly. The cogwheels across it spun as he drew the string back, and it didn’t cost him any strength to make use of it. And the power the bow could unleash was just as great as he had hoped. In fact, this bow was capable of shooting projectiles with more power than Wind String could have managed.\n\nHan Sen could feel the space power coming from the bow, but he didn’t know how that space power would affect the use of the Six Core Snake Bow.\n\nThis was the first time Han Sen had gotten the opportunity to make use of a deified beast soul weapon. It was difficult to gauge the amount of power it possessed.\n\nHan Sen didn’t plan on trying it out immediately. He was willing to save this bow for his true identity as Han Sen. For Dollar, the gold general already provided enough power to battle deified beings. Plus, it wouldn’t even be possible for Han Sen to use the bow while he was using the gold general. Therefore, keeping the bow as Dollar would be pointless.\n\nHowever, the weapon couldn’t be more perfect for Han Sen’s identity. The peacock king’s soul robe wouldn’t affect his use of the bow, and it would actually give the bow even more power. It would definitely give him more security.\n\nEven if deifieds came for him, with the peacock king’s soul robe and the Six Core Snake Bow, they wouldn’t be able to kill Han Sen.\n\n“If those Extreme King guys dare to come after me again, I will feed them arrows. I’ll let them know I have feelings, too.”\n\nHan Sen put the Six Core Snake Bow away. He would use it later.\n\nHe had used the Dongxuan Area to hide himself and the small Crocodile God while he looked over the bow. Not even Exquisite and Li Keer could see what he was doing now. The Six Core Snake Bow wouldn’t be noticed.\n\n“All that I’m missing now are deified arrows. Having a bow without arrows isn’t perfect,” Han Sen thought greedily.\n\nExquisite and Li Keer were going to chase after Han Sen, but they soon realized he had vanished from their abilities of detection. They could no longer detect his presence, no matter what method they used. They ran to the place where Han Sen was last seen, but he seemed to be long gone. Not even the Very High Sense could find a trace of him.\n\n“This Dollar is a very mysterious individual,” Exquisite said with a frown.\n\n“Not just mysterious. Everything he does is a little beyond belief, but it will be hard to convince someone like that to become my silkworm.” Li Keer sighed.\n\n“No matter how strong he is, he cannot elude the Very High forever. If you really want to pick him, we can go back home and have the elder unearth his identity. Then, we can formulate a plan to take him,” Exquisite said.\n\nLi Keer shook her head. “He will be my silkworm. It is best if I try to bring him in myself.”\n\nExquisite said nothing, but she didn’t have much hope for Li Keer’s efforts.\n\nBefore she met Dollar, Exquisite would never have expected that a potential silkworm might refuse an offer from the Very High. But Han Sen was so amazing that she was even double-guessing the prestige of her race.\n\nIt would be very difficult to convince someone like that to become a silkworm. Plus, Li Keer’s Very High Sense wasn’t perfect yet.\n\nBut Li Keer insisted, so Exquisite saw no reason to argue.\n\nHan Sen brought the small Crocodile God around with him to hunt. They killed a few core King xenogeneics. The small Crocodile God was happy at first, but now he was growing tired.\n\nHan Sen brought out some wine to make the creature happy again, but the small Crocodile God was becoming harder to please. He wanted to see the outside world more and more.\n\n“The place I told you about exists, but you can’t see it in the core area. You are a creature of the core area. You cannot leave. So, how can I take you to see what is out there?” Han Sen was annoyed by this prospect, too.\n\nFortunately, the bronze furnace was there. It was able to help Han Sen by making the small Crocodile God much happier.\n\nThe small Crocodile God had killed many xenogeneics for the bronze furnace, and now, there were many swords inside the furnace.\n\nHan Sen used Glasses to examine the furnace. Its potential was five stars, too. That was the max a King class could be before becoming deified.\n\n“What a shame. The xenogeneics from the core area cannot leave. If they could, I could keep them by my side at all times.” Han Sen sighed.\n\nHan Sen had the bronze furnace lead them around. Han Sen soon left the core area, though, and he returned to the white whale.\n\nIn the past, whenever Han Sen returned, the pirates would happily welcome him. But this time, no one even noticed when he appeared. Everyone was watching something outside of the white whale, and they seemed to be frozen with shock. Even Bao’er was.\n\nHan Sen didn’t know what was going on. He followed everyone’s gazes and found that there was a group of snakes coming to the land. They were emerging from the black sea, and the white tiger was trying to fight them off.\n\nThese battles had happened many times before, but this time, it was different. There were too many groups of snakes coming out of the black sea. There were many times the number of snakes that had appeared on any previous occasion.\n\nThe snakes slithered onto the island in hordes and began munching on the mushrooms. They were scarier than a swarm of locusts.\n\nThe white tiger was killing them, but there were too many snakes. It was unable to kill them all. The snakes slithered onto the island in greater and greater numbers.\n\n“Oh no!” Fang Qing Yu suddenly breathed upon seeing the snake hordes.\n\n“Oh no, what?” the pirates looked at Fang Qing Yu.\n\nFang Qing Yu looked terrible, and he said, “If the white tiger cannot stop the snakes, all the mushrooms here will be eaten by the creatures. That means we will have no food for ourselves.”\n\n“Pah, I thought you meant something more severe. That is no big deal. We can trade for food in the core area with others,” a pirate said.\n\n“It’s not that simple. Listen, if all the mushrooms are gone, then the white tiger might get hungry and come after us. And how about the snakes themselves? Aside from the mushrooms out there…” Before Fang Qing Yu finished, everyone knew what he meant.\n\nThey all looked at the mushrooms on each other’s heads. They felt a chill. If the snakes treated them like food, they would have to stop the snakes’ advance. And that probably wouldn’t go too well for them.\n\nThey had seen how scary the snakes were, as many of them could be King class. But the snakes also came in seemingly infinite numbers; it would be impossible to kill them all.\n\nIf the white tiger couldn’t stop the snakes, there was little they could do.\n\n“Little red bird, go out and help,” Han Sen said to the little red bird. If the snake group took over the island, it would be quite the annoyance for them. That was why Han Sen allowed the little red bird to help the white tiger fight off the snakes.But before the little red bird did anything, a harsh wind blew across the black sea. It created giant, tumultuous waves as a giant monster emerged from the black water."
}