{
    "chapter": 1180,
    "title": "Skill of Love",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1180",
    "text": "Editor: Nyoi-Bo Studio\n\nHan Sen took Dragon King’s advice and followed his instructions. He tried to extract the thing from his body.\n\nBut it turned out Han Sen didn’t have the thing inside him. He initially thought Dragon King must have gotten something wrong or had taught him incorrectly. But when Han Sen tried it on Zhang Yuchen and the others, the method worked. For some reason, the thing just couldn’t exist inside Han Sen’s body.\n\nDragon King was shocked by the discovery, too. He expected Han Sen to show much appreciation and reward him; little did he expect that Han Sen wouldn’t even need such knowledge.\n\n“Not bad.” Han Sen still gave him a small compliment for the tip.\n\nWhile Han Sen might have been okay, there were still many humans inside Immortal Shelter. He wanted to save as many of them as he could. Han Sen went out to find Zhang Yuchen and many of the others, and he helped them break the contract with their spirits.\n\nWith Han Sen’s reputation and status, and the backing of Dry Bone King and Baby Ghost, everyone was freed except for Qiu Ping. Everyone else had signed a contract with a royal spirit, but Qiu Ping had signed a contract with Qing Jun King directly.\n\nHan Sen sent them all to his underground shelter, while he remained inside the Sky Tree. This was because Qiu Ping was still under contract, and Han Sen wanted a few more goodies before leaving. If the tree grew, everyone there would be food—super creatures included. And with seven mighty super creatures there, Han Sen thought it’d be a waste.\n\nOne more question lingered on Han Sen’s mind, as well: who left him the slip of paper? He asked all the humans he had rescued, but none were likely candidates.\n\n“Did a king spirit or super creature write it, maybe?” Han Sen didn’t have a clue, much to his annoyance.\n\nBut Han Sen was also willing to stay due to Little Angel’s finished evolution. Seeing the halo ring’s buff, Han Sen knew she had to be incredibly powerful.\n\nAnd with Disloyal Knight also there for backup, it gave Han Sen the courage to hang around.\n\nIn his private room there, Han Sen was practicing when all of a sudden, someone barged through his door. It was Qing Jun King, and she approached with great anger.\n\nShe immediately shouted, “Where did you hide Zhang Yuchen?!”\n\n“You are a king spirit, aren’t you? Why do you care so much about a human?” Han Sen responded.\n\n“That is none of your business. Give him to me!” Qing Jun King said.\n\n“I don’t have him,” Han Sen said.\n\n“Do you really want me to become your enemy?” Qing Jun King asked.\n\n“I’m not your enemy, but it’s true. I really don’t have him,” Han Sen said.\n\n“Fine.” Qing Jun gave Han Sen one last cold stare, then marched out.\n\nDry Bone and Baby Ghost had arrived just in time to see the commotion. Dry Bone looked at Han Sen and said, “You really made her mad this time.”\n\nHan Sen asked, “Why does she care about him, a human, so much?”\n\nDry Bone answered, “You may not understand. It has to do with her practice of a skill; it is called ‘Love.’ Humans can become far more emotional than spirits, so Qing Jun selected Qiu Ping and Zhang Yuchen as her target for this. If Qiu Ping kills Zhang Yuchen on her behalf, and she then kills Qiu Ping, her practice with the skill will be complete. But…”\n\nDry Bone King broke out in laughter.\n\n“But what?” Han Sen asked.\n\nBaby Ghost continued the speech, saying, “But Qiu Ping is smart. He genuinely liked her, but he wasn’t willing to kill Zhang Yuchen for her. He knows about her plan, and he has known for a very long time. He just pretends he doesn’t know anything. This entire thing has been going on for twenty years. She has grown impatient, over the course of that time, due to her being unable to finish the skill herself.”\n\nDry Bone then said, “She knows she has failed, but she is a spirit. Pride is as important for her as it is for us. She will never admit it. Now that you have sent him away, though, the slim chance for a future success may have well-and-truly disappeared. It angers her, and she won’t let you slip away so easily.”\n\nHan Sen now fully understood why she cared about the humans so much.\n\n“What do you think she’ll do? What can she do? Is she going to try to kill me with her seven super creatures?” Han Sen wondered out loud.\n\nQing Jun King was only a spirit with nine of her gene locks open. With Little Angel ready to be unleashed, Han Sen wasn’t afraid at all.\n\n“She can’t do that. Mister Immortal won’t allow her to hurt anyone. The extent of her command starts and ends with manual labor. They aren’t her pets or anything,” Dry Bone reassured Han Sen.\n\nHan Sen knew Sky King needed them as food, so it was likely true. He wouldn’t allow them to kill each other over squabbles of their own.\n\n“Then what is there to worry about?” Han Sen said.\n\nDry Bone King answered, “To be honest, me and Baby Ghost don’t have what it takes to fight her together.”\n\n“She is that good?” Han Sen was surprised upon hearing this.\n\n“Yes. Why else would she be the one in charge? It’s why you need to exercise some caution and be careful,” Baby Ghost replied.\n\n“Thanks for the information, you two. I’ll definitely try to be more careful,” Han Sen said. After sending Dry Bone and Baby Ghost away, Han Sen noticed another slip of paper on his table.\n\n“Did one of them just leave this without me realizing it?” Han Sen looked on the back of the paper first and saw another Nine-Life Cat symbol."
}