{
    "chapter": 1846,
    "title": "Survivor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1846",
    "text": "Upon hearing what Black Steel said, Han Sen knew that the man must know something about this. But now was not the time to ask, so he was going to wait until Black Steel arrived.\n\nBut soon, Han Sen’s worries became reality. More people in the base began to develop strange egg markings on their foreheads. It seemed to be spreading.\n\nPeople could be isolated easily enough, but that wasn’t a proper solution to the issue.\n\nAs time went on, more and more people developed that same strange mark. In the beginning, it only spread amongst the people who were at the gate when the Viscount died. Then, it started to happen amongst the mothers and children who hadn’t even been there.\n\nOver the course of a few hours, half of the people in the base developed the same mark across their foreheads.\n\nLuckily, Han Sen, Little Angel, Zero, Xie Qing King, Gu Qingcheng, and Little Silver had not yet been infected by the strange affliction. It was very fortunate.\n\nXie Qing King and Gu Qingcheng had examined the infected people and noted that there didn’t actually seem to be anything wrong them. But the whole base was so scared that those who were not yet infected wanted to abandon the place. If Han Sen hadn’t just killed two Viscount creatures and enlisted the aid of Deep Blue Viscount, the base would have descended into chaos.\n\nOut of the four Viscount Nobles, Wind Viscount was dead. Deep Blue Viscount was helpful, whereas Lake didn’t do anything. The other Viscount had been missing for the past two days. Where he had disappeared to, no one knew.\n\nHan Sen contacted Black Steel to update him on the situation that was currently unfolding. Han Sen didn’t want him to end up getting infected as well.\n\n“Wait for me,” Black Steel said, before hanging up again. It sounded as if he was doing something in a rush.\n\nBefore Black Steel arrived, Deep Blue Viscount came over to see Han Sen.\n\nWhen Deep Blue Viscount arrived at Han Sen’s house, he immediately stripped off his armor. His forehead now had the egg-shaped marking, too.\n\n“Do you feel anything?” Han Sen frowned.\n\nDeep Blue Viscount was calm, and he merely shook his head. “I don’t feel anything. If I hadn’t looked in the mirror, I wouldn’t even have known the mark had appeared.”\n\n“Then, what do you plan on doing?” Han Sen asked.\n\nDeep Blue Viscount went quiet, and he said, “I told you I wanted to speak with you alone. Do you have the time to do so, right now?”\n\nYeah.” Han Sen nodded.\n\nDeep Blue Viscount sat down and dropped into thought for a minute before speaking. He said, “I know that most Nobles here have ulterior motives. I do, as well. But I am different in one way; I don’t work for anyone.”\n\n“Then, why are you here?” Han Sen asked him.\n\nViscounts were of a high rank, and he’d be a wanted asset anywhere he went. There wasn’t a reason for him to follow Han Sen.\n\nDeep Blue Viscount gave a wry smile. He pointed to the mark on his forehead and said something that shocked Han Sen. “I am here for this.”\n\nHan Sen really was shocked, and he replied by saying, “You are here for that? Do you know what it is?”\n\nHe nodded, then shook his head and sighed. “This is not my first time on Planet Eclipse.”\n\nYou have been here before? Were you with the Earl?” Han Sen immediately asked.\n\nDeep Blue Viscount smiled and said, “Yes. I got this mark when I was here the last time.”\n\nHan Sen was shocked, but at the same time, he was delighted. It had been many years since the Earl’s mission. And despite that, Deep Blue Viscount was still living. The infected would be safe, for now, at least.\n\nDeep Blue Viscount suspected these were the thoughts running through Han Sen’s mind, and he smiled wrily. “It is not like that. Ordinarily, when you get this, you die in a short time. It could be two days, or it could be two weeks. People will ultimately end up like Wind Viscount did. There is a reason why I survived, and that is the reason for my return.”\n\nHan Sen did not say anything, wanting him to continue explaining. Since Deep Blue was volunteering information, he might as well learn everything he could.\n\n“When I was taken here by Chiron Earl, I was just a commoner. I was just like those kids, really; but a little bit bigger. I already had my geno armor and everything.” When Deep Blue Viscount said that, he looked weird. Han Sen did not understand.\n\nDeep Blue Viscount went on to say, “I followed Chiron Earl everywhere, including his final trip into the northern mountains. I was there.”\n\n“I thought that none of those who went returned,” Han Sen said in shock.\n\n“I was the only one who made it out. Back then, only normal people resided at the base. No one was aware of the fact that I had followed him. The Rebate investigator never considered that Chiron Earl would have bothered to bring an ordinary Kate.” Deep Blue Viscount wore a complicated expression.\n\n“What happened there? And what is up with the egg mark?” Han Sen asked.\n\nDeep Blue Viscount shook his head. “I do not understand what happened. Back then I was a kid that possessed geno armor. My powers and my knowledge were very limited.”\n\nAfter that, Deep Blue Viscount went on to say, “And in regards to the egg mark, you will only contract it after you touch something. Aside from me, everyone who got this mark died. And that included Chiron Earl. When I made it out, I did not infect anyone. I am not sure what Wind Viscount did, but it is clear that his affliction is contagious.”\n\n“Where did the Earl’s group encounter it, exactly?” Han Sen asked.\n\nDeep Blue Viscount said, “There is a palace up in those mountains, and it is very big. It was so strange inside there. I did not know much back then, so I only followed Chiron Earl. Many people died, and when we were in front of a certain hall, Chiron Earl seemed to become incredibly happy. We waited outside while he went in alone. We waited half a day, and eventually, he returned with something.”\n\nHan Sen knew the most important part of his tale would be this, so he didn’t interrupt. He kept on listening.\n\n“It was an egg. A black egg that was as tall as a person. It looked just like the markings do. He brought it out and allowed us to carry it. And when we were just about to leave the palace, something scary happened. Our foreheads began to develop that black mark.” Deep Blue Viscount looked scared, as if he was remembering something bad."
}