{
    "chapter": 2275,
    "title": "Thirteen Bridges",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2275",
    "text": "The third checkpoint was completely different from the two prior checkpoints they had visited. Although it was a palace, too, it was much larger than the others. The floor of the palace wasn’t covered in stone, but water. It was a large lake, with many bridges running across it.\n\nThe jade bridges were in the shape of a crescent moon, and there were thirteen of them. They spanned the entirety of the palace, and each one seemed to connect to a separate teleporter on the opposite side of the lake.\n\nEach of the thirteen bridges was made of a different type of jade.\n\nStone statues stood along the railings of each bridge. Some of the statues seemed to depict devils, whereas others seemed to depict angels. Some were in the shape of vicious beasts, and others looked like gentle creatures.\n\nHan Sen was now looking out across a purple jade bridge. Its railings had a line of evil-looking stone statues, but that wasn’t why Han Sen was observing it.\n\nHan Sen was looking at the highest point of the purple bridge, where there was a ten-meter-tall statue that looked like a devil. It was squatting in the middle of the bridge with its wings folded. The devil’s eyes were looking down, as if they were scanning the area below for something to eat.\n\nPurple-and-blackish nails adorned its fingers, and they were long and sharp like talons. A woman was clutched in its hand, and the woman was quite familiar to Han Sen.\n\n“Yisha!” Han Sen almost screamed out.\n\nThe purple devil’s stone hand gripped Yisha firmly. Although her body was covered by its fingers, her face was clearly visible. She was very pale, and blood dripped from her mouth. It looked as if she was in a coma, and her hair had turned bone white.\n\nHan Sen recognized her even so, and he was certain of her identity. She was in horrible shape, but her face still looked exactly the same as he remembered it. She was still that almighty queen. No one else could ever look like she did.\n\n“Why is Yisha here? I thought she had been swallowed by Under Overbearing.” Han Sen’s heart jumped as he thought of something. “Is this the palace that sits on Under Overbearing’s back?”\n\nThinking of this possibility, Han Sen’s heart started to pound like mad. “No wonder the Sacred Leader wasn’t afraid of people stealing his treasure. He invested a lot to secure his possessions.”\n\n“My Queen!” Han Sen shouted to Yisha from across the bridge, hoping to wake her up. He could tell that she wasn’t dead.\n\nHan Sen imbued his voice with a sonic wave, but the call prompted no reaction from her.\n\n“Stop shouting. Even if a deified elite was shouting at her, she wouldn’t be able to hear the call,” Mister White said.\n\n“Ah. I see.” Han Sen looked at Mister White and bowed.\n\nMister White pointed at the jade bridge and said, “These thirteen bridges contain thirteen different powers. Stepping onto a bridge locks you onto it. This must be the other test that was left behind by the Sacred Leader. We are going to have to choose the right bridge if we are to go through this safely.”\n\n“What is the power of that bridge?” Han Sen pointed at Yisha’s purple jade bridge.\n\n“If I’m not mistaken, then the devil statues on the bridge are the legendary Hell Ghosts. The statue at the center must be Hell Ghost King. It represents hell power,” Mister White said, looking at the bridge carefully.\n\n“Is hell power a death element power?” Han Sen asked.\n\nMister White shook his head. “Hell is where the dead go, according to the legends, but hell is not actually associated with the death element. It is another branch of space and time. You can understand it this way: hell is another dimension that exists separately from our world. The axis of space and time is different there than in our world. So, hell power comes from that difference in dimensional structure. It is not about death or darkness.”\n\n“Then how do we save her?” Han Sen asked.\n\nMister White pursed his lips. “Aside from forcing our way through, I cannot think of a way we can. Space and time are very mysterious elements that are extremely difficult to control. The legends say that the Sacred Leader mastered space and time powers. Knife was unlucky to select the jade bridge that is aligned with those energies.”\n\nHan Sen frowned. If Yisha had failed to force her way across the jade bridge, then that meant it would be even more difficult for him.\n\nAfter all, most of Han Sen’s geno arts were Marquise. His fighting power wasn’t as strong as Yisha’s half-deified abilities.\n\nHan Sen looked at Yisha in the grip of the devil’s hand, and when he looked closer, he saw that the devil’s nails were actually digging into Yisha’s flesh. Ever so slowly, Yisha continued to bleed. The blood ran across the statue’s nails, and the tips of those nails were dyed red.\n\nIf that continued, Yisha wouldn’t have much time left before she bled to death.\n\nThe power of the hell bridge blocked Han Sen’s connection with Yisha, so he could not determine her lifeforce. But he could see clearly that she didn’t have much time left.\n\nMister White examined the thirteen jade bridges and then came back. He made a number of calculations. Han Sen thought he must have been trying to pick the jade bridge they could all cross safely.\n\nBut quickly, Mister White’s face started to look gloomy. “These thirteen bridges are dead ends. They all have a scary power guarding them, so none of them can be crossed safely. Did the Sacred Leader not plan on letting anyone leave this place alive?”\n\n“No! There must be a way!” Mister White started to sweat. His fingers flashed with a symbol as he continued to make his calculations.\n\nHan Sen’s eyes kept drifting over to the purple jade bridge. The Purple-Eye Butterfly in his right eye spun, analyzing the structure of the purple jade bridge.\n\nHan Sen knew that Yisha was very brave and sometimes arrogant, but she was never stupid. There was no way she would have decided to take the most difficult path.\n\nHan Sen thought Yisha selected the hell bridge for a specific purpose. He just didn’t know why she had failed.\n\nThe Purple-Eye Butterfly’s four-flower purple pupil kept spinning, but not much could be gleaned. The purple jade bridge was wrapped up in some sort of power. Han Sen could see a very complicated substance chain around it, woven like a bird’s nest. Han Sen couldn’t understand this. He couldn’t tell what sort of power it was.\n\n“This is it! If we walk this bridge, we can make it through alive.” Mister White suddenly pointed at a jade bridge triumphantly.\n\nHan Sen looked at where Mister White was pointing. He was indicating a jade bridge that was pitch-black like ink. The bridge featured some crow-like bird statues. A giant bird statue stood in the middle of the bridge on a stone pillar, coldly overlooking the entire bridge."
}