{
    "chapter": 168,
    "title": "God Cannot Save You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_168",
    "text": "\"Han Sen, come up and spar with Yu Mingzhi in black and white boxing practice.\" Professor Yan did not want to waste any time and directly called Han Sen.\n\nHan Sen had to stand up and go up the stage.\n\nTang Zhenliu saw it and said, \"Professor Yan, since Yu has chosen a student, should I do the same?\"\n\nHe did not want to play black and white boxing with Han Sen and ask for trouble. Yu Zhiming could enjoy that himself.\n\nProfessor Yan had no objection and agreed to Tang’s proposal.\n\n\"Who is willing to practice black and white boxing with me?\" Tang Zhenliu felt relieved and asked with a good looking smile.\n\nThere was a great show of hands. Tang smiled and said, \"I am going to benefit myself and you guys by picking a pretty girl. Miss, would you practice with me?\"\n\nThe students laughed, and the girl asked by Tang blushed a little and went on the stage.\n\nTang Zhenliu learned her name and asked Professor Yan first, \"Professor Yan, should we start first?\"\n\nProfessor Yan agreed. Tang Zhenliu and Miss Jing started to practice black and white boxing. Tang did not really use all he had, but followed the professor’s instructions and demonstrated a variety of movements before he beat Miss Jing. The process was delightful, and the students all applauded.\n\n\"Han Sen, it is our turn.\" Yu Mingzhi could not wait to go up. He smiled and waved to Han Sen.\n\nTang returned to his seat with a faint smile, waiting to see Yu Zhiming embarrassing himself. Tang did not know Yu well and was not a fan of his. There was no way Tang would stop Yu.\n\nHan Sen smiled, walked opposite Yu and stood with a starting position like Yu did.\n\nThe so-called black and white boxing practice was, in fact, a training of the judgment of yin and yang forces. Two players stood opposite each other face to face, one arm’s length apart. One was to swing one’s arm to attack, and the other was to defend oneself.\n\nThere were two ways of making the attack, a black fist was a yang blow and a white fist was a yin blow.\n\nThe one on defense needed to determine whether the opponent was using a black or white fist. If it was black, it should be dodged; whereas if it was white, it should be blocked with an arm.\n\nBlack and white boxing was an entry-level martial art to train psychological gaming and yin and yang forces. All military school students would learn it in the first three months of training. Therefore, all military school students had practiced black and white boxing.\n\nThe black and white fists were thrown in similar manners in black and white boxing. It was not easy to tell one from the other. Observation, judgment and psychological gaming were the key factors. And reflexes were less important.\n\nIf one’s judgment was not accurate, it did not matter if one’s reflexes were good.\n\n\"Han Sen, would you throw the punches first?\" Yu Mingzhi said generously. The one who attacked would enjoy certain advantages.\n\nYu was confident in his accomplishments in black and white boxing, and believed that he could tell from Han Sen’s micro movements which fist Han Sen was using.\n\n\"Can we start now?\" Han Sen looked at Yu and asked.\n\n\"Sure... Ouch...\" Yu Mingzhi had just agreed when a punch hit his chest before he could react. Yu stepped back and became furious.\n\nProfessor Yan was explaining seriously, \"Han Sen did very well. This is a classic psychological gaming technique—taking advantage of the weaknesses in the opponent's mind and hitting hard. However, Han Sen could have improved by hitting the vital parts of his opponent’s body, such as nose or eyes, which would disable his opponent and help himself in the future rounds.\"\n\nThe students nodded, while Yu Mingzhi was very pissed. Then he had to suppress his anger, since the professor had put it like this.\n\n\"Han Sen did very well. Now we will continue.\" Yu Mingzhi squeezed a smile, and went back to his position.\n\nTang was laughing so hard inwardly. \"Yu Mingzhi, you really did ask for this. It is just a demonstration, have fun with a girl! Why did you have to provoke a monster? Even God cannot save you now.\"\n\nYu Mingzhi, of course, did not think so. He thought he was just being careless and it had nothing to do with his skill level. Once he became serious, Han Sen would stand no chance.\n\nHow could a military school student be compared to the Chosen?\n\nIn fact, most of the students also thought so. Although they felt that Han Sen should be great, they believed that against one of the top unevolved individuals in the Alliance, Han Sen would still fall short.\n\nAfter all, Yu basically ranked sixth in the First God’s Sanctuary, while Han Sen was only the champion of a school-wide warframe game—not even a martial arts game.\n\nTherefore, the students still felt that Yu would do better than Han Sen.\n\n\"Han Sen, go ahead.\" Yu Mingzhi finished his sentence and immediately became alert, staring at Han Sen.\n\nHan Sen directly threw his fist at Yu Mingzhi’s face, since Professor Yan had instructed him to hit hard in the vital parts.\n\nYu Mingzhi looked at Han Sen's standing position, angle of his body, and the ups and downs of his shoulder. Soon Yu easily made his judgment.\n\n\"Such exaggerated acting. Clearly there is no momentum. He clearly seems to be bluffing, but it is a yin blow for sure. I was better than this in kindergarten.\" Yu Mingzhi raised his arm with some contempt, ready to block this white fist from Han Sen. He even used only one arm to show off his self-confidence and accurate judgment."
}