{
    "chapter": 2918,
    "title": "A Fish Hostage",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2918",
    "text": "Han Sen clutched the sword tightly and did not let go. He rode on the back of the little goldfish. No matter how much it struggled, he did not let go.\n\nUpon witnessing this scene, the big goldfish was angry. All of its metal scales straightened and turned into 10,000 gold-scaled god lights. It was like there was a sky full of knife lights heading for Han Sen. They were going to slice and dice him into little pieces.\n\nHan Sen was not worried, nor was he in a rush. He held onto the Cold Light Sword’s handle. He pulled it hard, which significantly hurt the little goldfish. The fish writhed around uncontrollably. The sword was still inside it, and its belly was now facing up.\n\nThe 10,000 gold-scaled god lights that were heading for Han Sen suddenly went toward the belly of the small goldfish.\n\nThe big goldfish was stunned and pulled its gold scales back. It stopped the gold-scaled god lights. They were only a few feet away from demolishing the small goldfish.\n\nHan Sen’s hand holding the Cold Light Sword started moving. The weapon had hurt the small goldfish, and it continued doing so. The small goldfish kept writhing around in the water with its mouth releasing countless bubbles. The big goldfish was furious as it watched, but it was unable to do anything. If it wanted to attack, Han Sen would have likely used the small goldfish like a shield. The big goldfish did not want that to happen.\n\n“You stupid fish! Don’t you want to turn me into food? Come on…” Han Sen kept waving the Cold Light Sword. He was pointing at the big goldfish trying to make it even angrier.\n\nThe wounds on the small goldfish were bleeding, but the blood was strange. When the red blood came out and touched the water, it turned into a copper-like metal.\n\nHan Sen was deliberately trying to make the big goldfish mad. No matter what creature it was, even if it were a true god class, it would start showing its flaws when angered. Even if its power were unleashed at a more frightening and powerful level, its flaws would be exposed. Despite being stronger, no longer being careful meant it would be easier to kill.\n\nThe method used was a bit cheap, but the rules of the big universe made it a dog-eat-dog world. It was survival of the fittest at all times. If Han Sen were not strong enough, he and Bao’er would become food for the little goldfish. When it came to survival, it did not matter what method was used to deal with enemies.\n\nAlthough the big goldfish was being driven mad by Han Sen, it did not rush forward. It opened its eyes wide and straightened its scales. It simply stared at Han Sen.\n\nPop! Pop! Pop! Pop!\n\nThe big goldfish kept firing out a stream of bubbles. The bubbles were different compared to before. These bubbles did not fly toward Han Sen. Instead, they just kept exploding around him.\n\nWhen those bubbles exploded, they created some high- and low-toned sounds. Han Sen shockingly discovered that the bubble sounds were not just an explosion but a language.\n\nThe big goldfish seemed as if it wanted to say something. While Han Sen understood it a bit, he did not understand it completely. He did not understand what the big goldfish was trying to communicate.\n\nHan Sen used his Dongxuan Sutra to look into the big goldfish’s mind. Although the big goldfish’s mind was very powerful, Han Sen could still understand what it was thinking.\n\n“Let my child go! I am willing to give you treasure in exchange for the life of my child…” Han Sen knew that was what the big goldfish was telling him.\n\nHan Sen’s heart jumped. He looked at the big goldfish and asked, “What treasure?” He wasn’t sure if it would understand.\n\nAfter all, every creature had its own language. The common tongue of the universe was used by most creatures, but not every creature could speak it.\n\nHan Sen did not expect the goldfish to understand, but it spat out more bubbles. The volume of its thoughts was even stronger.\n\n“Very big… Very big treasure…” Han Sen sensed that was what the big goldfish said, but he still wasn’t exactly sure if that was what it meant.\n\n“What is that thing?” Han Sen asked. The thoughts of the big goldfish were too fast. There was too much it wanted to express. Han Sen’s Dongxuan Sutra could not just entirely read its mind. After half the day, he had yet to figure out what sort of treasure the big goldfish was talking about.\n\nHan Sen stopped moving the Cold Light Sword, and the little goldfish eventually felt better. It stopped feeling pain and was able to roll around. It was then that the big goldfish started to calm down.\n\nEven so, Han Sen had yet to figure out what it was trying to say. It was only able to communicate some strong ideas, specifically that it was willing to give up the treasure to save the child’s life. Han Sen still had no idea what sort of treasure it was.\n\nBao’er tried to understand. She told Han Sen, “He said the treasure is very, very powerful. Having that treasure would make you fearless.”\n\n“You can hear what it is saying?” Han Sen was happy.\n\n“I can understand a little,” Bao’er said with a nod.\n\n“Excellent! Can you help me ask it what use the treasure is and where it can be found?” Han Sen asked.\n\nThe big goldfish was able to understand what it was saying. It did not need Bao’er to translate. After Han Sen said his piece, the goldfish heard him and spat out more bubbles in response.\n\n“He said the treasure could save your life and is very powerful. With that treasure, you can travel here freely.” Bao’er paused and observed the bubbles again. She then said, “He said the treasure is someplace far away, but he will instruct you on how to obtain the treasure.”\n\n“You go get me the treasure, and I will spare your child’s life,” Han Sen said to the big goldfish.\n\nThe big goldfish sounded as if it was in a rush. It spat out a lot of bubbles. It went on like that for a while. It was like it was trying to explain something.\n\nBao’er watched it for a while. When the bubbles completely broke, she said, “It said it could not take the treasure. It has to be us.”\n\nHan Sen looked at the big goldfish and asked, “Are you trying to trick us? If there is no danger, why can you not go and get it?”\n\nThe big goldfish spat out a whole lot more bubbles. Bao’er translated and said, “He says the thing has a scary guy guarding it. If he goes, the scary thing will spot it from afar. He can’t get close. Otherwise, everyone dies. If we go, he has a way for the monster to be unable to find us. That way, we can find the treasure.”\n\n“Really?” Han Sen looked at the big goldfish. He was very suspicious about it. He then thought, with the big goldfish’s brain and intelligence, it was unlikely it knew how to lie.\n\n“Dad, I think this fish can be trusted. See how poor they are! Let the small goldfish go.” Bao’er begged him.\n\n“Fine. If you can honestly tell me where to get the treasure, I will spare the life of your child,” Han Sen said while coldly looking at the big goldfish.\n\nThe small goldfish was only larva class. It was not useful for Han Sen anyway. He also did not think he had what it took to defeat the big goldfish. It was good enough to get some treasure out of the situation."
}