{
    "chapter": 2630,
    "title": "Practicing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2630",
    "text": "At that moment, the Sky Palace students felt as if giant boulders had been lifted from their shoulders. They breathed deep sighs of relief.\n\nHan Sen was the best in the Sky Palace, but Exquisite faced him calmly. For some time, Han Sen hadn’t been able to harm a single hair on her head. The woman had stood against his attacks, as steady as a mountain. Seeing Han Sen’s attacks fail had crushed the Sky Palace students and prevented them from breathing. It made them think Exquisite was a god that couldn’t be beaten.\n\nBut then, Han Sen’s knife was able to cut Exquisite’s clothing. Seeing that small victory calmed the anxious audience.\n\n“Continue,” Exquisite said. She waved her sleeves, and the Teeth power was extinguished like someone had tossed a bucket of water over a campfire. Han Sen waved his hand again, using Fang to attack Exquisite. This time, he used even more power and speed.\n\nExquisite finally moved, but she only took half a step. That was enough for Han Sen’s Fang to go wide and miss her. Even so, it didn’t look as if she was going to fight back.\n\nHan Sen pushed himself to release even more power, making the next move a few times stronger than the last. He used his Teeth Knife once again. Exquisite’s feet moved gracefully, lightly sliding her to the side and letting her dodge every Teeth Knife attack Han Sen launched. Han Sen’s Teeth Knife was unable to touch Exquisite’s clothes a second time.\n\n“Although Han Sen’s speed can break through the effect that Exquisite is casting on the arena, he cannot catch up to her. This isn’t a good situation for Han Sen to be in. Han Sen needs to overcome both the skill she is using and her own innate speed,” Thousand Feather Crane said, as he understood Han Sen’s situation.\n\n“Very High powers are so scary. It’s like they’re cheating. The whole universe is helping her,” Yun Suyi said with depression.\n\n“Of course. Otherwise, the Very High wouldn’t have become the best race, would they? Even born-deified Ancient Gods envy their power,” Lone Bamboo said.\n\nAs this was going on, Sky Palace Leader observed Han Sen with great interest. He smiled and said, “The Very High are known for their strength. To fight against the Very High is to fight against the whole universe, in a sense. Although Exquisite’s level is low and she cannot change the universe much, any of her other peers would be at a severe disadvantage against her. Unless you are one or two tiers higher than the Very High, it is difficult to fight them. How Han Sen seeks to deal with this will be interesting.”\n\n“You think Han Sen actually stands a chance in this fight?” the woman asked in shock. She turned to the Sky Palace Leader with a quizzical expression on her face. “I thought you always liked him, too,” Sky Palace Leader said.\n\n“I liked him because of his powers of blessing and the deified weapons he wields. His talent isn’t bad. It’s probably better than those of anyone else on his level, but his skill alone won’t be enough to deal with the Very High. I’m not saying that Han Sen is weak; it’s just that the Very High are too strong,” the woman said.\n\n“And yet, maybe this will work out for Han Sen anyway,” the Sky Palace Leader said thoughtfully as he watched Han Sen.\n\nHan Sen cast another strike with Teeth Knife. Then, he stopped attacking.\n\n“What other geno arts do you have? Use them,” Exquisite commanded. She still wanted to see more of Han Sen’s powers, so she didn’t attack yet.\n\nAs the Sky Palace students watched Exquisite, it was as if they were looking at a Valkyrie that couldn’t be defeated. Once again, she had become untouchable.\n\nHan Sen wasn’t intimidated, though. He had seen Exquisite slave away as a maid to the crocodile gods, so he couldn’t think of her as some unbeatable creature.\n\nPlus, Exquisite’s power didn’t seem entirely unbreakable to Han Sen.\n\nMany Sky Palace students froze as they looked at Han Sen. If they were in his shoes, they knew how desperate they would feel. They wouldn’t even be able to ruffle Exquisite’s clothes. They just wanted to know if Han Sen had a sufficient amount of power to break Exquisite. If he was unable to break her, and Exquisite unleashed a strike, she would only need that one skill to beat Han Sen. After all, the universe was strengthening her might. It was hard to imagine how crippling that strike might be.\n\nHan Sen swung his hands and spoke to Exquisite. “I’ve finished warming up. Now we begin.”\n\n“Holy sh*t! Warming up? That was just him stretching?”\n\n“Brother Han… this bluffing of yours is a bit too much.”\n\n“Haha! Brother Han is Brother Han. His bluffing is so fresh.”\n\nHan Sen had been using power that only the best ninth-tier Kings could match. There was no way that he had been holding back the majority of his strength.\n\nBut even so, the Sky Palace students began to grow a little excited again. When they looked at Exquisite, she no longer seemed quite as untouchable as she had before.\n\nWhen Exquisite had first turned on her Very High Eye, her emotions seemed to disappear. She had seemed perfectly calm since then, but now she frowned.\n\n“This guy’s poker face is too good…” The Sky Palace Leader wanted to laugh.\n\n“He’s just like you when you were young,” the woman said.\n\n“When I was young, I was really strong. I didn’t pretend like he is,” the Sky Palace Leader immediately corrected her.\n\nThe woman rolled her eyes at him. She didn’t say anything further, but scorn seemed to drip off of her.\n\nThe Sky Palace Leader was very smart, and he stopped talking. After all, that woman knew everything about his past. “Since we’re done practicing, let us begin,” Exquisite said very calmly. She had only shown her emotions for the tiniest moment, and what Han Sen said didn’t affect her much.\n\nVery High’s Forget Love was no joke. Exquisite’s level with it was low, but a deified Very High could watch her husband and children be humiliated and killed in front of her without feeling a single thing. “Then you must look closely.” Han Sen slowly raised his right hand. He clenched his fingers together to make a fist.\n\nEveryone could see Han Sen preparing to unleash a punch, but he suddenly stopped. “Have you heard the old saying?” “What saying?” Exquisite asked.\n\n“I am the greatest of my league,” Han Sen said. He said each word slowly.\n\n“No.” Exquisite knew what Han Sen meant, but her expression never wavered. Actions spoke a lot louder than words.\n\nWhen the Sky Palace students heard him, they thought this was too much. But judging from Han Sen’s situation, it wasn’t too much.\n\n“Then you should learn it now.” Han Sen swung his fist.\n\nBzzt!\n\nHan Sen’s body tore through the fabric of space, disappearing from everyone’s vision. When he appeared again, he punched Exquisite square in the face. Exquisite’s nose fountained blood as her body was sent soaring away. She crashed into the sealing of the arena with such force that even the protective shielding shimmered.\n\nAs this happened, all of Sky Palace fell silent. The students were so silent that they could have heard a rat fart."
}