{
    "chapter": 2878,
    "title": "Getting Into the Geno Hall",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2878",
    "text": "Han Sen was on the geno god list. He understood what Golden Growler meant. Thus, he conceded and gained the geno god list’s first-place position.\n\nAlthough he knew Golden Growler wanted him to go to the geno hall and become a God Spirit, seeing the geno hall instantly made him a bit worried.\n\nThe scene of Ancient Water God attacking the geno hall was still fresh in his mind. If Golden Growler failed, he would probably end up suffering a similar fate.\n\n“Little Mountain Leader… He is going to the geno hall alone.” The green-haired beast and the woman looked worried.\n\nThe old mountain leader had never made it back from the geno hall. Although Golden Growler’s power was stronger than the old mountain leader, they could not measure whether or not Golden Growler would make it back.\n\n“Little Mountain Leader is rushing things a bit. How can he go to the geno hall now? It’s that Dollar’s fault. If Little Mountain Leader did not lose first place because of him, he would not have to go to the geno hall.” The green-haired beast was furious. He was also very nervous because of his inability to do anything.\n\n“If things are this way, we have no choice but to wait and hope for Little Mountain Leader’s return,” the woman said with a sigh.\n\nIn space, the geno hall had already been revealed. The doors that provided access were still closed tight. They did not look like they were going to open.\n\n“Roar!” Golden Growler suddenly roared again. The gold light turned him into a gold, giant beast. It forcefully struck the gate of the geno hall.\n\nBoom!\n\nThe doors were being attacked by the gold light and opened a little. It enabled gold light to seep out from inside the hall. The light was warm. It shone with a vibrant halo. Many scary feelings were coming out from the door. It made the many people and creatures of the universe terrified. Creatures with low wills were already on the ground, not daring to look at the geno hall’s doors.\n\n“It looks like Little Gold Gold is stronger than Ancient Water God. It has just pushed the door open, but…” Han Sen was riding atop Golden Growler’s back. He stared at the door that had opened a little with an expression of worry.\n\nAncient Water God had also pushed open the geno hall doors, but a scary hand had crushed him. Han Sen was scared of the master of that hand.\n\nGolden Growler was carrying Han Sen. He stepped toward the doors of the geno hall. The gold light kept spilling and firing into the sky. They kept hitting the doors of the geno hall. The more times the gold light hit, the wider the opening of doors of the geno hall became. They were opening wider. God light was shining inside. Aside from the god light, one was not able to see anything else.\n\nе\n\nBoom!\n\nWhen Golden Growler went to the geno hall’s doors, they completely opened. The god light inside shone across the whole universe. It was now daytime in the entire universe.\n\nSuddenly, Han Sen looked frozen. He saw a shadow appear behind the open doors.\n\nThat shadow was burning white. It looked as if it was made of god light. The being’s face looked like it belonged to the human, Sky, or Extreme King race, but the god light was too shiny. All Han Sen was able to see was its silhouette.\n\nBased on the shape of the silhouette, it appeared to be a woman. When Ancient Water God attacked the geno hall, he was suppressed by a woman’s hand.\n\nIf the hand belonged to the coming shadow, her hand was one that could kill Ancient Water God. With that threat on the approach, one could imagine how scary she was.\n\nThe shadow stood near the open doors. It did not walk out. Although it was just a silhouette with its face obscured, Han Sen felt that the shadow was looking at him and Golden Growler.\n\nGolden Growler’s eyes looked golden. It stared at the shadow and looked as if it was going to swallow someone. It walked closer to the shadow.\n\n“No. 1 on the geno god list, please level up to God Spirit and go to the hall.” The light silhouette had a woman’s voice. Her tone did not have a single ounce of emotion in it. Han Sen frowned. Before he said anything, Golden Growler quietly growled. He laid down as if he was signaling for Han Sen to disembark.\n\nHan Sen got off of Golden Growler’s back. He was holding Golden Growler’s back while he whispered in its ear, “Are you okay?” “Roar.” Golden Growler roared. It seemed to try and comfort Han Sen and let him know that things were under control.\n\nHan Sen stepped away and watched Golden Growler raise its head. He then went toward the geno hall’s doors.\n\nThe light shadow saw Golden Growler come before the door, which prompted her to raise her hands. Golden Growler’s eyes looked very mad. It opened its mouth to summon the golden door and placed it across the geno hall’s doors.\n\nNo one had seen this before. A door appeared in front of the geno hall’s doors. This had never happened before.\n\nGolden Growler quietly growled. The golden door slightly opened. Shiny gold light came out from within it. The light spilled across the god light coming out from the open geno hall doors.\n\n“Huh?” The geno hall’s door shadows seemed surprised. The raised hand was placed down. She looked at the golden door and suddenly said, “You passed.”\n\nAfter that, the light shadow entered the god light and vanished.\n\n“Roar!” Golden Growler looked at Han Sen and roared before walking toward the geno hall’s doors.\n\nHan Sen understood what Golden Growler was saying. It was saying, “I will wait for you there.”\n\nHe watched Golden Growler walk beyond the geno hall’s doors and slowly disappear with the geno hall. It faded from space, leaving Han Sen with mixed emotions.\n\nThe people in the universe did not know what to think. Golden Growler had entered the geno hall in a surprising way, and the person inside the geno hall did not do anything. It looked as if the golden door had stopped it.\n\nThe Ancient Water God had attempted to fight it, but he was destroyed by a hand. Golden Growler used his golden door like a ticket to enter. The treatment was certainly different.\n\n“It is easy to go in, but whether or not he comes out is the big question,” Sky Palace Leader said with a sigh.\n\n“No matter what happens, entering means he stands a chance,” the woman said. “That is better than no chance at all.”\n\n“Little Mountain Leader… You must come back alive…” The green-haired beast eyes were floating with light. Han Sen watched the geno hall disappear. He turned away and wanted to leave. Suddenly, the geno god list shone. All the names of the geno god list were lighting up with a holy god light.\n\nAt the same time, a video flashed on the geno god list. It was playing back the best scenes of the top 100 fights inside the space battlegrounds. The first 100 xenogeneics appeared. The fights of the first 100 warriors were being shown.\n\nHan Sen appeared at the end. He was in first place, so the final image displayed him. It was a moment that was going to stand for all eternity.\n\nIn the next second, the geno god list released more holy light. It came down to grace Han Sen’s body. His body was showered in holy light. Something suddenly fell from the holy light of the geno god list. It came flying toward Han Sen."
}