{
    "chapter": 2539,
    "title": "We Are Going to Die",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2539",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen wanted to hear the final part of God’s Wander, so he had to continue hanging around Li Keer. But he didn’t speak to her much while he was practicing. When they did talk, Li Keer would either tell Han Sen about God’s Wander or answer questions about herself.\n\n“This person is a fighting freak like Lone Bamboo.” Li Keer had grown a little depressed as they traveled. She planned to take Han Sen as her silkworm, but after spending so much time with him, she realized that there was nothing Han Sen really needed from her. She couldn’t even bring herself to tell him that she was one of the Very High.\n\nLi Keer regretted this. If she had known this was going to happen, she would have told him she was one of the Very High the first time they met. That way, they could have had a more serious discussion, at least. If she revealed her identity now, Li Keer didn’t think it would amount to much. It wasn’t right, she thought. She would even feel lower than Han Sen.\n\nAfter Li Keer finished teaching God’s Wander to Han Sen, she wouldn’t have another opportunity to reveal her identity and convince him to go with her.\n\n“I still have some matters to take care of. We will meet again if fate bids our paths to cross once more,” Han Sen quickly said goodbye to Li Keer and departed the core area. He returned to the white whale.\n\nLi Keer was so upset that she wanted to kick something. She looked so sad when she returned to her ship.\n\n“My Lady, what happened? Did you tell Dollar? Did he agree to be your silkworm?” Little Butterfly asked, looking at Li Keer with confusion.\n\nLi Keer sighed and said nothing. She didn’t want to admit that she had missed an opportunity to reveal that she was one of the Very High.\n\n“My Lady, what is going on? Why are the rumors saying Dollar is one of the Very High? What happened?” Little Butterfly hastily asked.\n\n“It’s nothing. I will claim him.” Li Keer felt annoyed and just waved her hand to indicate she wanted no more questions.\n\n“Dollar, you must become my silkworm.” Li Keer nibbled her lips in anger.\n\nHan Sen returned to the white whale and was shocked to find out what had happened in his absence.\n\nFang Qing Yu and the pirates were hiding in a corner, and Ning Yue was curled up behind Bao’er. She was very scared, but Bao’er was holding the purple ginseng that looked like a big carrot. She chewed on it as she stood in front of the others.\n\nInside the control room, Gu Qingcheng was fighting Elysian Moon. What surprised Han Sen was that they were both using area powers.\n\n“How did they level up so quickly?” Han Sen wondered. “They are already King class.”\n\nAlthough he had given Gu Qingcheng some xenogeneic genes, she and Elysian Moon had become King class much more quickly than he expected. And they were using area powers. That was a bit much.\n\nThat was especially true of Elysian Moon. She had spent less time in the geno universe. There was no way she could have leveled up this quickly.\n\nThe white whale’s control room had become their battleground. Gu Qingcheng stood there with loads of swords coming out of her. All those flying swords were like a river headed for Elysian Moon.\n\nElysian Moon opened her umbrella that was made of paper. The flying swords, upon hitting the umbrella, were sucked into the drawing on the umbrella’s surface. More and more flying swords appeared on the drawing.\n\nElysian Moon spun her white paper umbrella, making the flying swords inside the canvas come back to life. Now under Elysian Moon’s control, the flying swords flew forward to strike back at Gu Qingcheng.\n\nGu Qingcheng frowned. Her area power was put to work again. She regained control of the swords and sent them back at Elysian Moon.\n\nThe two pretty girls were having a stand-off, with one holding a sword and the other holding an umbrella. A storm of swords flew back and forth between them. It was like there was no end in sight.\n\n“What are they doing? Why are they fighting?” Han Sen asked, after jumping over in front of Bao’er.\n\nEveryone other than Bao’er shook their heads. Clearly, they didn’t know why Gu Qingcheng and Elysian Moon were fighting, either. They were also shocked about how fast Gu Qingcheng and Elysian Moon had leveled up.\n\nBao’er was clutching her purple ginseng when she answered, “They are fighting about which is bigger and which is smaller.”\n\n“Bigger and smaller? What does that mean?” Han Sen asked in confusion.\n\n“I don’t know. I heard them fighting. Gu Qingcheng said she wants to be big, but Elysian Moon said no. She said Gu Qingcheng can be small, and she can be the big one,” Bao’er explained, not seeming to understand it herself.\n\nUpon hearing that, knowing expressions crossed the faces of the pirates. “I know. They both must have fallen in love with the same man. So, they both want to be with that man. But they are fighting about which will be the mistress and which will be the wife.”\n\n“Right, right; things must be like that. I’d like to know which man is so lucky to have two pretty girls fighting over him.”\n\n“A family must have been storing up luck for generations for a man to have these two women. I can’t imagine what he did in a past life to earn this. Maybe he saved the universe or something.”\n\n“Saving the universe once wouldn’t be enough. He must have done it twice, at least.”\n\n“I don’t think so. That man must have been a virgin for ten generations, and that was how he was gifted two women like this.”\n\n“If I was able to marry them both, I would be satisfied to live with them as my wives for one day before dying.”\n\n“You want to just die on top of their bellies?”\n\nThe pirates were now caught in a firestorm of discussion. They all wanted to be the man that Gu Qingcheng and Elysian Moon liked.\n\nGu Qingcheng and Elysian Moon looked very similar. They were both beautiful to an almost disaster-inducing degree. The pirates loved them. If Gu Qingcheng and Elysian Moon weren’t Han Sen’s friends, the pirates and the Extreme King knights would have been hitting on them night and day. They’d probably fight for them, too.\n\nWhen Gu Qingcheng and Elysian Moon heard what the pirates were saying, they became even angrier. Gu Qingcheng turned to stare at the men. The swords of the pirates suddenly flew out of their scabbards. Under Gu Qingcheng’s control, they flew toward their masters.\n\n“Gu Qingcheng! Elysian Moon! Stop!” Han Sen reached out his hand to absorb all the swords. All of the swords writhed like snakes, trying to escape Han Sen’s grasp, but they were unable to.\n\nUpon hearing Han Sen, Gu Qingcheng and Elysian Moon stopped. They coldly stared at the pirates, who then felt a chill. They quietly stepped back.\n\n“You both come with me.” Han Sen took Elysian Moon and Gu Qingcheng to his office.\n\n“Tell me what’s going on. Why are you two fighting?” Han Sen sat on the office chair and looked at Gu Qingcheng and Elysian Moon.\n\n“We are going to die.” Gu Qingcheng and Elysian Moon looked at each other and said the same thing to Han Sen. He stared at them in stunned silence."
}