{
    "chapter": 3067,
    "title": "Getting Upset Over Money",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3067",
    "text": "Fang Qi Yuan eventually decided to concede. He agreed to give Han Sen the Holy Wen White Deer.\n\nA tame gene race could be transferred between people that had a God Spirit Blood-Pulse but being able to transfer did not guarantee it could be used.\n\nIf the God Spirit Blood-Pulse was not compatible with the gene race, even if one had the gene race, one could not combine with it. If one was to force a combination, it might harm one’s body.\n\nHan Sen tried to use his Sea of Souls to receive the Holy Wen White Deer Fang Qi Yuan gave him. The results surprised him. The Sea of Souls quickly received the Holy Wen White Deer. After that, people would not have been suspicious of him being from another world.\n\nAt the same time, Han Sen heard an announcement play in his head. “Got god class gene race Holy Wen White Deer.”\n\nHan Sen checked out the information on the Holy Wen White Deer. The results surprised him.\n\nHoly Wen White Deer: God class gene race (adult)\n\nThis Holy Wen White Deer was an adult. It was not in an ultimate body, which was not like what Mister Yang told him.\n\nAn adult god class gene race was not a bad thing to obtain. It was enough for Han Sen to use as a mount to get around.\n\nOf course, Han Sen wanted the Holy Wen White Deer not solely for more than just being a mount. He just did not want to kill Fang Qi Yuan yet. Keeping Fang Qi Yuan was going to be useful.\n\n“Can I leave now?” Fang Qi Yuan gnashed his teeth as he spoke. The seven gene races were his life. Now, Han Sen had taken one. He really hated that.\n\n“Of course, unless you want to stay and have dinner with us,” Han Sen said with a laugh.\n\n“What about the Evil Blood in me?” Fang Qi Yuan asked.\n\n“I only said I wouldn’t kill you,” Han Sen coldly said. “I did not say I would get rid of the Evil Blood I pumped into you. If you want my help with this, give me another gene race that is on the same level as this Holy Wen White Deer. Either that or a gene egg.”\n\n“You…” Fang Qi Yuan was very mad, but he did not explode and reveal it. He did not keep asking Han Sen to remove the Evil Blood inside him.\n\nFang Qi Yuan did not dare turn around. He just looked at Han Sen and retreated. He walked far away and then started running like a lunatic.\n\nSeeing that Han Sen was not chasing after him, Fang Qi Yuan felt relieved. He also felt great regret. “Is he really not an elite sent by the Qin Kingdom to protect Jian Bu Gu? If that was all real, I should have just bought Jian Bu Gu. If I did that, none of this would have happened to me.”\n\nFang Qi Yuan did not want to go back. He had to find a way to remove the Evil Blood that plagued him. If he was unable to use his gene race, he felt very unsafe.\n\n“Fortunately, Evil Blood is not a gene combine skill that can kill you in any short amount of time. I will wait until I recover. Then, I will come back for him.” Fang Qi Yuan madly looked at Han Sen and the other people. He continued running away in a hurry.\n\nHan Sen summoned the Holy Wen White Deer out. He saw a very strong, holy-looking white deer appear before him. The deer’s antlers looked like crystal and jade.\n\nThe Holy Wen White Deer was a little bigger than a horse. Two or three people were easily able to sit on it.\n\n“Old Yang, and you two, the mother and daughter, can sit on the Holy Wen White Deer.” Han Sen wanted to travel faster, but three of them were commoners who did not have a gene race. They walked way too slowly.\n\nBut Mister Yang, the mother, and daughter would not dare sit atop the Holy Wen White Deer. Mister Yang said, “Mister, you should be the one to sit on it. A master should never walk while the subordinates ride. If people saw that, they would think we were very rude subordinates.”\n\nHan Sen tried to convince them otherwise, but he failed. He stopped talking and hopped on it. He spoke to the little girl, You You, and her mother, Jiang Shi, and said, “Allow You You to sit with me. Otherwise, you guys are too slow, and I cannot wait that long.”\n\nJiang Shi nodded and lifted You You onto the back of the white deer.\n\nYou You was only 3 or 4 years old. She had a chicken’s heart. Han Sen put her in his arms, but her body kept shaking. She was shaking like a little cat.\n\nBecause Mister Yang and Jiang Shi could not walk fast, even though Han Sen had a great mount, they traveled slowly.\n\nLi Bing Yu summoned a gene race that looked like a black wolf. She rode next to Han Sen but felt a flurry of mixed emotions.\n\nLi Bing Yu thought, “What is going on? Why would Han Sen have that blood ghost spirit? Inside the stone palace, was there a blood ghost spirit gene egg?” She would have never thought that Han Sen had actually managed to punch the adult blood ghost spirit back into being an egg The few of them reached Qin King City. They traveled to Qin Xiu’s old house, but Han Sen was disappointed. That place had become a modern-day tourist spot. It had nothing to do with the real Qin Xiu and his sister. The buildings had obviously not been built during the time Qin Xiu was alive.\n\nQin Xiu’s era was too long ago. The buildings were probably only a thousand years old. They could not have been from when Qin Xiu was alive.\n\nThat trip to Turin Planet ended up disappointing Han Sen. He was unable to find out anything about Qin Xiu, and he did not find anything out about Qin Wan’er either.\n\n“It looks like I have to go to the Qin Kingdom’s capital. Now, that is the only place where I can likely find a lead.” Han Sen traveled around that city for a few days before deciding to go to the Qin Kingdom’s capital next.\n\nHan Sen was most depressed about the fact that he did not have enough money to buy or charter a ship.\n\nThey had been spending all of Mister Yang’s savings, and Mister Yang was not a rich man. They sold some gene eggs, but the money was almost all gone.\n\nJian Bu Gu, Jian Shi, and You You were so poor that they had nothing to contribute.\n\nHan Sen borrowed some money off Ghost Kill to pay their travel expenses. They stepped onto an airship that would take them to the Qin Kingdom’s capital.\n\nHan Sen thought, “After going to the Qin Kingdom’s capital, we will have to spend a lot more money. I do not know when I will next find the lead I am looking for, but I cannot keep borrowing money.” He wanted to know how he could rake in the big bucks to do well in the Qin Kingdom. He wouldn’t be able to achieve anything without a lot of money.\n\nKilling gene races or finding gene eggs was the fastest way to earn money, but Han Sen was not interested in doing that. To him, it was a waste of time.\n\nHan Sen kept on thinking. He decided that once he reached the Qin Kingdom’s capital, he would open a shop that sold gene eggs. With the power of the Xuan Yellow Sutra, he was likely to earn quite a bit of money.\n\n“Fang Qi Yuan had such power, and the Qin Kingdom Palace has more elites. With my current situation, forcing my way into the palace to find Qin Wanler’s body will likely be impossible. I will have to sneak in.” The first thing Han Sen thought of was Qin Bai, the leader’s stupid son.\n\nHan Sen gave up on the idea to look for Qin Bai. If Qin Bai was a king, perhaps it would have been worth asking him.\n\nQin Bai was just a crown prince. Han Sen did not have much authority, and people would have merely treated him like a subordinate. It would have been hard to quit the crown prince’s employ. “Let’s just open a shop to have some comfy days where I can sketch this out properly.” Although Han Sen was in a rush, it was something he knew he had to take his time with."
}