{
    "chapter": 2956,
    "title": "Astral Instrument",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2956",
    "text": "Han Sen kept wondering what Qin Xiu wanted with him and the jade statue. The jade statue was burning hot. It seemed as if it was flying out of Han Sen’s chest. He knew something was wrong.\n\nHan Sen wanted to take out the jade statue and find out what was going on. Old Vulture was already in the holy palace. It brought black smoke along as it ran toward Han Sen like the wind.\n\nHan Sen avoided the strike and teleported behind the statue of Qin Xiu. Old Vulture was shocked and extremely furious. It put its power away, not wanting to damage the statue of Qin Xiu.\n\n“Get the hell out of there!” Old Vulture angrily yelled. Its black feathers flew out like arrows heading toward Han Sen.\n\nHan Sen did not respond. He moved around the statue to avoid the hit, but it was like the black feathers had a life of their own. They were able to maneuver and continue chasing Han Sen. In their flight, they perfectly curved around the statue.\n\nAlthough Han Sen had not seen what Qin Xiu looked like, the presence exuded by the statue was mistakenly the same. That special presence was just like Qin Xiu’s soul. Other people would have been unable to make it out.\n\nHan Sen still felt a little weird because, in the legend, Sacred Leader wore armor. No one was able to see his face. This statue was wearing cloth. The face was visible, but there was no armor.\n\nHan Sen’s body kept teleporting around the statue. Old Vulture did not want to hurt the statue, so it was very worried. It could not do anything to Han Sen.\n\n“Do not hurt the statue!” The demon lady had chased away the space charms that Bao’er no longer controlled. She was flying through the palace with the eyeless big beast.\n\n“Of course, I won’t!” Old Vulture yelled in an annoyed tone.\n\nIf it was not for the statue, Old Vulture would have pinned Han Sen to the floor. It would not have allowed him to keep bouncing around, which was really ticking him off.\n\nThe demon lady and eyeless joined in the fight, but Han Sen was very good when it came to combat against a group. He had the palace and statues for cover. The demon lady and the others were strong, but they could not do anything to Han Sen. That made them super depressed.\n\nA man with a soft voice approached the holy palace. “Everyone, I have a way. I can help you get Han Sen. Are you interested?”\n\nThe demon lady and the others turned around. The person who was speaking was the Extreme King’s Ancient Abyss Grandmaster. After his escape, he had not left. Instead, he followed them to the palace.\n\nAncient Abyss Grandmaster did not enter the palace. He just stood outside of it smiling.\n\nBefore the demon lady said anything, Ancient Abyss Grandmaster said, “I have a treasure that can solve your current predicament, but I will need your help. How does that sound?”\n\n“Do you want the holy body geno fluid?” The demon lady looked at Ancient Abyss and coldly grunted.\n\nAncient Abyss said with much seriousness, “Senior, you must know that the Extreme King’s king bodies are just testers for the holy body geno fluid, and it was a failed tester. For me, being able to perfect my king body is my sole wish.”\n\n“It is a shame I will have to disappoint you,” the demon lady coldly said. “The holy body geno fluid was never produced. When Sacred was destroyed, the holy body geno fluid had yet to succeed and be finalized.”\n\n“I do not expect to have the product of the holy body geno fluid,” Ancient Abyss said with a bow to them. “I just hope to receive the recipe and information that circulated back in the day so the Extreme King will have a clear direction in which to go and improve. That would be great. I was hoping you might be able to do that for me.”\n\n“If you can help us take down Han Sen, I can give the information regarding the holy body geno fluid to you,” the demon lady said. “But do not expect much. After that battle, most of the information was destroyed. There is only a small part of it left.”\n\n“Thank you for agreeing to this.” Ancient Abyss bowed again.\n\n“Why are you talking so much crap? How are you going to help us capture him?” Old Vulture kept chasing Han Sen while screaming.\n\nAncient Abyss Grandmaster pulled something out of his chest. He threw it at the demon lady and said, “With this treasure, I believe the few of you can kill or capture him with ease.”\n\nThe demon lady picked up the item. It was a circular ball that looked like the model of a planet.\n\nThe demon lady immediately recognized what was inside. “Astral Instrument. Did that servant get it from the laboratory?”\n\nAncient Abyss Grandmaster’s expression did not change. He said, “Back when Sacred suffered its destruction, our ancestors wanted to maintain the power of Sacred Leader to avoid the complete loss of Sacred. He hoped to one day serve Sacred again once they rose from the ashes.”\n\n“Huh.” The demon lady, Auntie Mei, coldly grunted. Although she knew Ancient Abyss Grandmaster was talking nonsense, she was not in much of a mood to fight back. She coldly said, “If this can capture Han Sen, I can assure you that you will receive whatever it is you want.”\n\n“Thank you for doing this,” Ancient Abyss said with another bow.\n\nHan Sen knew that Ancient Abyss Grandmaster was a very suspicious individual. He was not surprised that he had betrayed him, but he did not know what the Astral Instrument was. He did not know what power it contained.\n\nThe demon lady held the astral instrument. She watched as the astral instrument shone with starlight. It was spinning fast.\n\nThe astral instrument was like some light in a pub. It suddenly had so much starlight that it covered the whole holy palace. It made Han Sen’s vision suddenly change.\n\nHe was in the holy palace, but for some reason, he was appearing in space. Everything in the holy palace was gone.\n\nHan Sen suddenly understood that the astral instrument was a space treasure. It was able to pull creatures into space. Unless he was able to break the astral instrument in Auntie Mei’s hand, he would be forever trapped in that space.\n\n“Kid, where are you going to run this time?” Old Vulture coldly laughed and ran at Han Sen. Earlier, in the holy palace, it had been afraid, which was very upsetting. Now, in space, it was no longer afraid. It could release its power and feel good.\n\nSeeing the black smoke like a dark cloud in the sky coming for him, Han Sen did not move. He pulled out a wine bottle and drank it all. He drank everything he could with his hands lifted high.\n\n“If I am going to fight, then let’s fight!” Han Sen’s presence was like a volcano erupting. It covered the whole of space.\n\nIn Han Sen’s brain, an upgrade announcement sounded. “Deified gene +1… Deified genes have reached the max… Battle body evolving…”"
}