{
    "chapter": 2193,
    "title": "You Don’t Know My Eye",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2193",
    "text": "The moonlight was bright, and Han Sen still stood near the jade toad. He quietly absorbed all the moon and cold powers he could draw in.\n\nThe jade toad was treating him well partially because he had proficiency in the practice of Jadeskin. After he absorbed the moon and cold power, his power and aura became closer to the jade toad’s. That was why the jade toad was okay with him being there.\n\nBut still, that wasn’t enough for the jade toad to treat him so specially. The toad’s kindness was mostly because of another important reason: Han Sen had the title Son of Moon.\n\nWherever Han Sen went, the moon presented him with moonlight. The moonlight was very strong, and since the jade toad had to spit out moons to practice its own geno arts, Han Sen’s presence benefitted them all. It was good for the deified toad, and it was good for the smaller toads. So, the jade toad was happy to allow Han Sen to do whatever he wished.\n\nHan Sen knew that the toad’s goodwill depended on his reciprocation. He was useful to the jade toad, and that was why he was being treated nicely. Otherwise, the deified xenogeneic would have forced him to remain on the porch.\n\nHan Sen didn’t think he was prettier than others. Even if he was handsome, he didn’t think the jade toad knew how to determine the beauty of humans for favoritism.\n\nHan Sen only figured that out after sitting down and having a good think.\n\nHan Sen had paid close attention to his relationship with the toad. Otherwise, he wouldn’t have dared fight against Night River King for the moonlight, especially without having the tablet. It was just that the jade toad needed him, and Han Sen had realized it. The toad wouldn’t be angry because he didn’t have the guardian tablet.\n\nWhen the reflection of the moon was on the water, Han Sen’s image seemed to grow crisper and clearer. The moon power and the cold power drifted inside of Han Sen. They made his genes quietly evolve to a better level.\n\nTwenty-two hours later, Night River King was still moving around on the stone porch. Han Sen’s body was wholly blocking the moon. Try as he might, Night River King couldn’t absorb an ounce of that moonlight.\n\nIt didn’t matter how angry Night River King was, all he could do was sit there. He was unable to leave. He had to wait until the jade toad returned to Cold Palace. Once it had fully vanished through the door, only then could he leave.\n\nBut Night River King wasn’t planning on going anywhere. He was waiting for the jade toad to enter Cold Palace. Han Sen was just a Marquise, and he had humiliated Night River King a lot. This was something Night River King wasn’t willing to accept. He had to wait until the jade toad returned to Cold Palace. And when it was gone, he’d kill Han Sen.\n\nEven though Yisha was dead, killing Han Sen would still damage his reputation. But no one would offend Night River King in order to protect the soon-to-be-deceased Han Sen.\n\nNight River King was very confident. He knew his limits. He knew what he could and couldn’t do. Otherwise, he wouldn’t have remained so calm in the days when Yisha was alive and well. He had never brought harm to Han Sen.\n\nOver the course of time, though, Night River King had become calmer and calmer. He paid attention to the time, and he knew each tick of the clock brought Han Sen one second closer to the doom that awaited him.\n\nEventually, the jade toad brought the little jade toads down the frozen waterfall. They went back into the stone cave as they always did.\n\nNight River King stood where he was, not daring to make a move just yet. He stared at Han Sen, his eyes intent.\n\nNight River King knew that to kill someone, you had to remain calm. Blinding yourself with anger would only make you lose control. Mistakes usually arose from careless anger. Even though Han Sen was just a Marquise, Night River King did not want to leave too much in the way of evidence.\n\nNight River King wasn’t the most famous character in the Rebate. His talents were only considered fair. It was rather unique that he had survived and made it to King class, because the geniuses of his generation were all dead.\n\nWhen the jade toads all retreated back into the stone cave, the stone door closed. Then, Night River King went over to Han Sen. He walked with a straight back, as calm as the water in a well.\n\n“Han Sen, you are still too young. You don’t know your place, in that you don’t know what you should do and what you shouldn’t do,” Night River King said as he approached Han Sen.\n\nHe didn’t plan to strike just yet. He just followed the path that would take him to Han Sen. His black robe waved in the breeze of the night.\n\nIt wasn’t as if he couldn’t kill Han Sen. He just didn’t want to do it there, in the event that what he did disturbed the jade toad.\n\nAlthough Night River King didn’t think the jade toad would avenge Han Sen’s death, if he planned to kill Han Sen, he’d have to kill him in one hit. He couldn’t afford Han Sen the chance of a getaway. He’d only have one shot.\n\n“Oh, I don’t? Then tell me: what is it that I should do?” Han Sen asked with a laugh.\n\n“Wait. You have to endure the heaviness and strike in one fell swoop. A mature fighter would have this thought in mind when facing an enemy that is stronger than he,” Night River King said coldly. A black ribbon began to swirl around his hands. It was like a snake that was coiling and slithering around a branch.\n\nYou are right!” Han Sen nodded. He agreed with what he was told.\n\nNight River King laughed and said, “Then it looks like you can still be saved. Let me give you one more opportunity.\n\nLeave now and never set foot on Planet Blade ever again.”\n\nHan Sen stopped. He looked at Night River King with disdain. “What you say might be right, but you don’t know my eye.”\n\n“What about your eye?” Night River King asked calmly.\n\nHan Sen laughed. “In my eyes, you are not strong. Why must I wait?”\n\n“Good point. You must be prepared to accept the wrath of a King.” Night River King had started calmly, but he ground out the final words between clenched teeth. And then, his hand that was surrounded with black water rose.\n\nThe black water became an enormous beast that looked ready to consume Han Sen. Even a mountain could find itself swallowed by the black water beast.\n\nThe sight of that river was unnerving. Night River King was using his strongest geno art. He wasn’t holding back in the least.\n\nAs Han Sen seemed about to be consumed by the black water, a blue light suddenly encased his body. His form was wrapped up by a translucent blue shield.\n\nBoom!\n\nThe terrifying black water beast bit down on it. It swallowed a chunk of the ground Han Sen was standing near. A hole was torn into the soil, as if the planet’s surface was an apple.\n\n“I know you have the power to block a King class attack, but my Night River Beast God is different. Its power may not be the strongest out of King class attacks, but it might very well be the longest-lasting. No matter how strong your treasure is, no one can withstand this attack if they are not of the same level as this strike.” Night River King sounded cold, and his murderous tone seemed like it could freeze all who heard him.\n\nThe black water beast was wrapped around Han Sen’s shield, and it didn’t fall back. Its power was corrosive, and it suffused the blue shield in its energy.\n\nSuddenly, Night River King frowned. The black water was moving, but something was rumbling."
}