{
    "chapter": 1870,
    "title": "An Enemy That Cannot Be Seen",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1870",
    "text": "Han Sen and Gu Qingcheng frowned. The shadow Xie Qing King had drawn had possessed the power of a Viscount. It had been destroyed within one second, so whatever lurked inside the valley was scary.\n\n“There is no need to rush. Watch this.” Xie Qing King flipped open his book and drew something else with his fingertips.\n\nNot long after, another leopard came leaping out of the pages. It didn’t run straight into the valley, and instead came to heel and crouch near Xie Qing King.\n\nXie Qing King kept wagging his finger across the book, and after a few minutes, another four leopards joined the first. When done, he said, “Okay! This is the maximum I can do.”\n\nHe commanded the five leopards to enter the mist of the valley, all in a horizontal line.\n\nEach leopard ran forward at the same time, all together, but they kept a few yards of space between them. When they entered the valley, there was a movement from within the fog.\n\nBut then, all too quickly, the valley echoed with the sounds of squealing again. The red mist of the valley rumbled and swirled, as the pictures on Xie Qing King’s book began to disappear, one after another.\n\nWithin a mere few seconds, the pictures of all the leopards had been erased. It likely indicated that the shadows that had been spawned and sent into the mist had been destroyed.\n\nXie Qing King’s face turned pale. The death of the leopards meant nothing to him, but he had exerted a lot of his own energy by summoning so many. That had cost him a lot.\n\n“So, did you find out what’s going on inside the valley?” Han Sen asked Xie Qing King, looking right at him.\n\nXie Qing King told him, “I don’t know what’s going on. I didn’t see anything, but when the leopards were killed, one second elapsed between each death. So I assume the leopards were all killed by a single entity. I can also guess that if a creature can kill my shadows so quickly, the creature must have four times our potential speed. It could be an Earl or higher, but with a hidden power.”\n\n“If it is an Earl, that’s nothing to sweat about. I have the Teeth Rabbit shoes, remember? The speed of those is no worse than an Earl, and I also have the new Marquise xenogeneic armor. I may not be able to activate its full potential, but it can most certainly protect me from the attacks of an Earl.” Han Sen looked up to the sky and noticed another magnetic storm that was raging. He could not see the moons of Narrow Moon from where he was, so it was unlikely he’d be gifted their strength.\n\n“Wait here.” Gu Qingcheng stopped Han Sen, who was on the verge of entering himself. She pulled out Pure, and a green aura danced across the blade. Then, the sword came alive in a swirl and flew forward into the valley.\n\nDong!\n\nPure flew right into the mist, and shortly after, a crunchy noise sounded. Then, Pure flew back out and right back into Gu Qingcheng’s hands.\n\n“My sword was attacked once,” Gu Qingcheng said, then sheathed the weapon.\n\n“Okay, I’ll go and take a look.” Han Sen donned his Marquise armor and put on his rabbit shoes. He clutched Ghost Teeth Knife in one hand and held his Knife Blank firmly in the other. Then, with much care, he started to step inside.\n\nIt was times like this that Han Sen actually started to miss Wang Yuhang. If the man was there with him, all Han Sen would only have to get Wang Yuhang to stand outside the valley and shout. He would probably draw whatever was inside out, and there’d be no need to go inside.\n\nHan Sen carefully walked into the mist. While the mist had color, he didn’t feel anything when it brushed across him.\n\nAfter a few steps, that changed. All of a sudden, he felt horrid. He wanted to go forward, but he was struck in the back. It was a powerful strike, and he staggered forward.\n\nBefore Han Sen was able to stabilize himself, something else came at him again. It got his arm.\n\nThe creature in the red mist traveled quietly, and actually catching sight of it seemed impossible. Han Sen was very fast, but he didn’t know where he should move until the attacks had already happened. By the time the strikes came, it was too late to dodge. By the time he moved, he’d already been hit.\n\nLuckily, though, Han Sen had the Marquise armor on. It meant the attacks didn’t actually hurt him.\n\nHan Sen ran out of the valley after getting hit again, but the thing inside the mist did not follow. He took a look at what had happened and noticed the scratch marks across his suit. Surprisingly, they weren’t very deep.\n\n“What is it?” Xie Qing King and Gu Qingcheng ran up to him to ask.\n\n“Old Qing is right. There is an Earl creature there. Its speed and power aren’t too shabby, and it uses the red mist for cover. It’s practically invisible. I got attacked before I even saw it, every time. I was hit a few times, but even then, I wasn’t able to catch a glimpse. The red mist might have the added ability of masking the senses, because I wasn’t even able to hear its movements,” Han Sen said.\n\n“This is bad news. If it’s in there and it won’t come out, then we can’t fight it. Entering the mist is pointless, even with the armor that you’re wearing.” Gu Qingcheng frowned.\n\n“It’d be great if there was some way to draw him out,” Xie Qing King said.\n\n“If he dared to come out, he’d have followed either my sword or Han Sen.” Gu Qingcheng shook her head.\n\n“It shouldn’t be too hard to draw him out, but we’ll need the help of a specialist,” Han Sen said.\n\n“Wang Yuhang?” Xie Qing King and Gu Qingcheng had thought about him, too.\n\n“There is something awfully strange about this valley. There are creatures guarding this place for a reason. I am afraid that something important might be about to happen here. We can’t delay this,” Gu Qingcheng said.\n\n“I gave Wang Yuhang some xenogeneic genes, and after he ate them, he managed to break through. He was able to absorb Life Geno Essences, and after he maxed out, he went to the Alliance. We should be able to bring him here fairly easily. But the people out there know how many people Planet Eclipse currently holds, and the documents are all in files. If someone else shows up, it might be difficult to explain. I have to use the recruitment excuse to bring him here,” Han Sen said.\n\n“Then let’s go quickly and bring more people over. Planet Eclipse has a lot of resources, so the more people the better. With the small amount of us here, there’s not enough to pay the taxes we must pay in a few years,” Gu Qingcheng said.\n\n“This is what we can do, then. You guys can stay and hunt in the vicinity, just don’t go too deep. And also, keep an eye on the valley. I’ll be right back,” Han Sen said that, then returned to base.\n\nAfter returning, Han Sen gave Knife Queen a call. Knife Queen knew he’d need more people, so she agreed to his request and sent him an airship. After Icebird Duke picked him up, they left Narrow Moon to recruit.\n\n“Where would you like to recruit people this time?” Icebird Duke was sounding much friendlier with Han Sen now.\n\nHan Sen had been number one in the Moon God Festival, and he was the very first person to have ever been personally blessed by the Moon God. So, that had certainly boosted his reputation and goodwill.\n\nLearning Teeth Knife and Teeth powers in such a short time wasn’t something that could be accomplished with luck alone. However he had done it, it made Icebird Duke look at him differently."
}