{
    "chapter": 1911,
    "title": "Sharpen",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1911",
    "text": "Han Sen’s body could not move, and despite the fact that he still had control over his senses, he couldn’t tell what element the green light was. He wasn’t in a rush, though. The xenogeneic’s power was amazing, but at the end of the day, it was only a Viscount. Han Sen had Marquise armor on, and that meant he had no reason to be afraid.\n\nPlus, he had his super king spirit body to rely on. All things considered, Han Sen was feeling pretty secure.\n\nWhen the centipede approached, Han Sen noticed that it was skittering around small orchid-like plants. There were no flowers atop them, but small shapes like gold rats grew from them.\n\nNo, they weren’t rats. After a good look, Han Sen noticed it was something quite familiar. The things growing on the plants were very small Red Mist Minks.\n\nThere were seven of them, and their eyes all looked so big. They looked very spiritual, but even so, they all vibrated together in fear. Because their tails were grown into the plants, they could not run. They all looked so scared as they stared at the centipede.\n\nNow, Han Sen knew that the centipede had come for the red mist spring. It had come for the minks. What Han Sen didn’t know was who the creature was going to attack first.\n\nThe centipede quickly skittered up to Han Sen with its blade-like claws. It attacked Han Sen, making repeated ding dong noises. The claws were unable to break Han Sen’s armor, but they left marks on its surface. That was very impressive for a Viscount class pair of claws.\n\nThe Viscount xenogeneic should have found it impossible to damage a Marquise armor.\n\nThis xenogeneic is a bit creepy.” But even so, Han Sen still felt safe. It was creepy, yes, but it could not harm him.\n\nThe centipede wreathed itself around Han Sen, trapping him in the grip of its body. Its feet were also like blades, and they kept scrabbling against him.\n\nFortunately, only a few white scratch marks were left on the armor. The attacks still couldn’t damage him.\n\nThe creature did not have a mouth, and its head was very flat. It had two long beard-strands, too. Aside from the claws and the blade-like legs, there was no other way for it to attack Han Sen.\n\nIt kept slashing Han Sen for quite some time, but it was unable to hurt him. The centipede eventually gave up. It climbed over to the plants that were growing minks, instead.\n\nIt circled the minks, but it did not seem to hurt them.\n\nBut the minks were still frightened. They were shaking in fear.\n\n“What is it trying to do?” Han Sen was confused, and so he resumed trying to break through the green light.\n\nJadeskin, his mutant blood, and The Story of Genes were all useless. When he cast his Dongxuan Sutra, he could sense something from the light. But it was just Baron class, and one level lower than the green light. He could not get it to break through.\n\nHan Sen kept using his Dongxuan Sutra to battle the green light. He also watched the xenogeneic. He was interested in learning what it was up to.\n\nAs he fought the green light, Dongxuan Sutra’s power flowed through him like it always did. But Han Sen felt as if the power was changing slightly. He felt as if he was on the precipice of breaking through.\n\nHan Sen was so happy about this, seeing as he had used the Dongxuan Sutra to fight against the green light. He wanted the green light to sharpen the Dongxuan Sutra, and perhaps prompt a level-up.\n\nRight now, the most effective thing about the Dongxuan Sutra was the Dongxuan Aura. Han Sen did not have the power to unleash Dongxuan Sutra-fueled skills. If he made it reach Viscount, he could cast attacks with the Dongxuan Sutra. Han Sen had been waiting for this moment for a very long time.\n\nHan Sen kept using his Dongxuan Sutra to fight the green light, but it was one level lower. The power was being used up very quickly.\n\nHan Sen could only take very minor breaks. Whenever he regained some of his power, he’d get right back into fighting.\n\nAfter two hours of this, the cave was shining with red light. Some of the mist had drifted into the cave like a river. The entire cave was full of this red mist now.\n\nAs Han Sen wondered why the red mist was coming in, he realized that the red mist in the cave had begun reducing.\n\nThe red mist was flowing as if it was being blown away by a fan. It didn’t exit the cave, though. So, Han Sen had a peep at where the red mist was going. It was seeping into the plants with the red minks.\n\nAfter half an hour, the red mist had become very thin. It no longer hindered Han Sen’s senses.\n\nThe plants that absorbed the mist were releasing a light. Especially the seven small minks. They looked so shiny, like little treasures. They looked very golden.\n\nAfter the mist was absorbed by the plants, no more mist entered the cave. The shiny look on the plants and the minks began to dull.\n\nHan Sen took a closer look, and he noticed that the fur of the minks was much fuller. Their eyes were brighter, too, and their lifeforce had grown stronger.\n\n“That centipede must be waiting for the minks to grow. I wonder how much longer this might take?” Now Han Sen knew just what that xenogeneic wanted.\n\nHan Sen kept using the Dongxuan Sutra to battle the green light. Every time Han Sen used up all his power in combat with the green light, his powers grew stronger as they recovered. It was a process that delighted him.\n\nAfter a while, the mist entered the cave again. Just like last time, the plants absorbed it. And then, the minks grew bigger.\n\nThe third time the mist was absorbed, the mist was absorbed by the Red Mist Minks themselves. Han Sen’s body then moved. He lowered his Ghost Teeth Knife, which he had been holding in the air.\n\nHan Sen could not break through the binding of the green light, but the Dongxuan Sutra’s power was starting to work. And he knew this because he could now move his body a minute amount.\n\nThe centipede sensed his movement, though. It turned around and shone many of its eyes at Han Sen. It increased the power of the chains it had locked around Han Sen, prohibiting him from moving any more.\n\nThe xenogeneic had not been able to hurt Han Sen, and he didn’t consider it much of a threat. So, Han Sen kept using the green light to practice with the Dongxuan Sutra. And over time, he developed a resistance to the green light.\n\nOn the twenty-third time the mist started pouring into the cave, the plants’ light was growing again. They were becoming brighter than the red mist. Amidst that heavy fog, the outlines of the plants were visible, shining brightly. The seven plants each had a Red Mist Mink growing on them."
}