{
    "chapter": 2988,
    "title": "Holy Palace Changing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2988",
    "text": "“He…” Auntie Mei wanted to say something, but a hand squeezed her head. It twisted her head, ripped it off, and threw it to the ground like trash.\n\nAuntie Mei’s head rolled across the floor. Her eyes were wide open. They were full of misery and appeared as if she did not want to die yet.\n\nHan Sen stared at the figure and asked, “Who are you? Why are you killing them?”\n\nThe figure looked like a human. It looked very young too. The person seemed to be about 20 years old. He was weirdly handsome. He had some weird presence that could not be described. His eyes were very small. They were like the eyes of a fox.\n\n“A group of useless stuff. They could not even guard the holy palace. What was the point of keeping them alive?” The young man licked his lips. He smiled and looked at Han Sen. “You are Littleflower’s father. I did not expect a guy who did not practice holy body could earn Qin Xiu’s approval.”\n\nHan Sen looked at that young man and asked, “Who are you?”\n\n“You do not need to know who I am, but I must thank you. If you did not break the holy palace and put out all the race lanterns Qin Xiu made, I could not have killed those four watchdogs.” The young man smiled at Han Sen and went on to say, “Now, I just need to kill you and find Old Cat and the son that has practiced holy body. I will kill them all. I will slay all who placed their faith in Qin Xiu. He will never make a comeback.”\n\nUpon hearing those words, Han Sen frowned. Judging from the person’s voice, it did not sound like he was with Old Cat.\n\nWhy had Auntie Mei warned Han Sen about Old Cat before she died?\n\nHan Sen looked at the young man and asked, “Are you an enemy of Qin Xiu?” “I am, and I am also not.” The young man came down from the ruins of the holy palace. “What is that supposed to mean?” Han Sen asked.\n\nThe young man laughed and said, “Qin Xiu treated me like a student. He taught me geno arts. He gave me resources. I cannot say he is my enemy. The grudge we have stems from the fact he hated me, and he ridiculed me. I think he will never expect that Sacred was finally destroyed by me.”\n\nIt sounded like a betrayal. The words naturally flowed from the young man’s mouth. It sounded like something he was proud of.\n\nHan Sen looked at the young man and spoke coldly, “I understand what you are saying. You are Sacred’s traitor.”\n\nHan Sen had heard about many people betraying Sacred Leader before the collapse. The people he used to meet, such as Nine Thousand King and others, were loyal to the end. That was why he forgot about that.\n\n“What? Have you come to seek vengeance on Qin Xiu’s behalf?” The young man looked at Han Sen. His face bore a smile, but his eyes looked murderous.\n\n“I have nothing to do with Sacred, and I am not interested in seeking revenge on Qin Xiu’s behalf.” Han Sen shook his head. He was not interested in seeking revenge for Qin Xiu.\n\nWhen the young man heard that, he laughed incredibly hard and said, “Qin Xiu, Qin Xiu… You were a hero all your life. I did not expect the person you chose, at last, to turn out to be a wimp. You really were blind.”\n\nAfter laughing, the young man looked at Han Sen and said, “It is a shame. You and I have no grudge, but you were chosen by Qin Xiu. Cutting weeds without removing the root will result in them growing again. Qin Xiu must have really hated me. How can I let the chosen person remain alive?”\n\n“It looks like you are the one who wants revenge and not Qin Xiu,” Han Sen coldly said.\n\nThe young man looked gloomy. His eyes opened wide. He was like a bolt of lightning coming before Han Sen. He raised his hand and reached out for Han Sen’s neck.\n\nDong!\n\nThe cause karma knife appeared in Han Sen’s hands. The knife was burning with holy spirit power. It struck the young man’s hands.\n\nHan Sen felt power come through the knife. His body lost control, which made him fall back. His legs were on the stone floor. The push made him cleave two trenches.\n\nThe young man coldly said, “That is because Qin Xiu is dead. He does not have a chance to care about revenge.”\n\n“Really?” Han Sen clutched his knife. His body entered the mind of a chess game. His whole body blended into the broken universe. His eyes were like darkness as they peered at the young man. “You would not understand. You are just an ignorant, poor worm that was used by Qin Xiu.” The young man seemed to think of something. The murderous look appeared even harsher. He laughed. “I am afraid you have no idea what Qin Xiu was like. You are still dreaming that you can replace him to become the new Sacred Leader. I can tell you that is impossible. It does not matter if it is you or your son who practices holy body. You are all just chess pieces. Qin Xiu would do anything to get what he wants. Your life, in his eyes, is worse than just one of his sister’s hairs. After being used, you will be thrown away like trash.”\n\nHan Sen winked and said, “It sounds like Qin Xiu did something bad to you.”\n\nThe young man’s face suddenly looked very contorted. It even looked twisted. He gnashed his teeth and smiled. “It was nothing! I was just like you. I was made a chess piece. I was a test subject.”\n\n“But I am different from you. You are all chess pieces. You are just lab rats. You cannot change your fate all the way to the grave, but I am different. I escaped the fate of being a chess piece. I became a player and defeated Qin Xiu. I am now scrubbing away Qin Xiu’s last hope. He will never come back. Even in hell, all he can do is cry without hope.” While the young man spoke, his teeth chomped hard. He suddenly laughed very hard.\n\ncan\n\n“So, what was Qin Xiu’s last hope? The holy spirit?” Han Sen looked at the cause karma knife that was burning with holy spirit power. The young man looked at him with disdain. “That half-broken product is not Qin Xiu’s hope. I want the gene prototype. Qin Xiu must have found a way to give you or your son the gene prototype. He died, so he had no choice. I just need to kill you both, and Qin Xiu will become a loser.”\n\nHan Sen pretended he had never heard of it before. He looked shocked and asked, “Gene reason? What is that?”\n\nThe young man was already 15 feet away from Han Sen. He had not stopped his advance. He walked toward Han Sen saying, “Very funny. You are Qin Xiu’s chess piece, yet you do not even know what a gene prototype is.”\n\n“If we have the same problem, can you explain it?” Han Sen did not move as he spoke.\n\n“Shut up!” the young man shouted. “I am a replacement that Qin Xiu created, and one he put a lot of effort into. Who are you? You are not like me.” His body sped up like a ghost in front of Han Sen.\n\nHan Sen suddenly saw the young man’s hand move. He felt the whole of space flip as he faced-off against the young. Time slowed down, which made Han Sen slow.\n\n“Today, I will let you know what a real holy body is. I will show you what is better than Qin Xiu.” The young man let out an evil laugh as he grabbed Han Sen’s neck."
}