{
    "chapter": 2792,
    "title": "Controlling the Garden",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2792",
    "text": "“If you listen to what I say, perhaps you won’t suffer much. Otherwise, you will end up like this thing.” Han Sen waved his hand and cut the xenogeneic plant next to them in half.\n\nThe red-robed child quietened down. He nibbled his lips and stopped screaming and struggling, but his eyes were still red with tears. He was looking at Han Sen as if he had just been bullied.\n\n“Get those xenogeneic plants out of the way,” Han Sen commanded the red-robed child.\n\nThe red-robed child did not speak or move. Han Sen raised his hand to pretend he was going to hit the boy and shouted, “Yeah!” He saw the xenogeneic plants simply part to pave a way. Even the deified xenogeneic plants were doing it.\n\nHan Sen thought, The power to control these plant xenogeneics is weird. I wonder if he can control plant xenogeneics of an even higher level. If he can, that would surely be awesome. He then addressed the Flower God Leader and said, “Leader, can you please take a look if the flower seed is still there?”\n\nThe Flower God Leader quickly ran to the vine tower that held the flower seed. Everyone followed him. The vine tower was a mess inside, but there was no flower seed.\n\nWhile looking directly at the red-robed child, the Flower God Leader said, “It is gone. I would wager that he is the flower seed. His body bears the presence of that flower seed.”\n\nHan Sen nodded and looked at the red-robed child. He was thinking about how best to deal with the child. First and foremost, it all depended on whether or not he could control the Space Garden.\n\nAlthough the red-robed child did not like this, his power had been restricted by Han Sen. He was not able to defeat him or escape. He now had to listen to Han Sen’s commands.\n\nHan Sen let the red-robed child find all the Flower Gods there. With the red-robed child present, all the plant xenogeneics in the Space Garden listened to him. It was easy for them to gather the rest of the Flower God people.\n\nHan Sen used his phoenix flame to clear away the vegetation that had claimed their heads to bring them back to normal.\n\nUpon seeing what Han Sen had done and with the red-robed child adhering to what Han Sen told him to do, the Flower God people did not dare break their promise or raise qualms with the new sheriff. They had to stay, listen, and do whatever Han Sen and Xie Qing King ordered them to do. They had become a subordinate race. There was no doubt about that.\n\nHan Sen rounded up the displaced deified elites and commanded the red-robed child to open the Space Garden’s door to send them away.\n\n“Farewell.” Before Long Bamboo left, he smiled at Han Sen. It seemed as if he knew who San Mu really was but simply did not want to expose him.\n\nWhen all the deified elites departed, Han Sen did not worry too much about others learning about the Space Garden.\n\nEven if they knew about it, the knowledge was pointless to them. The Space Garden was a scary xenogeneic ganoderma lucidum. Even true god elites were not able to overcome the power of the ganoderma lucidum. As long as Han Sen kept a tight leash on the red-robed child, no one else would be able to enter the Space Garden.\n\n“From now on, we have a territory to call our own. Now, all we need to do is light up a lantern.” Xie Qing King and Han Sen were relaxing in the garden. They were having a barbecue and drinking beer.\n\nThe red-robed child was sitting next to Han Sen. He was holding some grilled meat, and he really enjoyed it.\n\n“Breaking the door and lighting a lantern would not be difficult, but we need to think about which lantern we should replace,” Han Sen said.\n\n“Do we need to think about it?” Xie Qing King asked. “The Flower Gods and Tree Men already have a grudge. We can use the name of the Flower Gods to get rid of the Tree Men.”\n\nHan Sen shook his head and said, “By doing that, we will be helping the Flower Gods light up the lantern. It would have nothing to do with humans and spirits. We will have to light up our own lantern. We cannot use the name of some other race.”\n\n“Does it really matter?” Xie Qing King asked with a laugh.\n\n“From what I can tell, there is a problem with the human name. Many scary people in this universe are in search of humans. If I use that name to light up the lantern, it will probably attract many disasters and bring danger to the Space Garden.”\n\nAfter pausing, Han Sen said, “There is no rush. I have another plan. We should use this time to get our people to the Space Garden. I need to watch this little guy in case he tries to stir up some mischief. I suppose you will have to do the people-ferrying service.”\n\nXie Qing King agreed and said, “That will be easy. I will go to Sky Palace and pick up Bao’er and the others. As for the other guys, I will just have to let them know.”\n\nHan Sen nodded. He really missed Bao’er, Zero, Little Angel, and Han Yan. Previously, he did not have a territory of his own, but now he did. He was going to bring them there.\n\nHan Sen was worried about one thing. The Sky Vine Radish’s gene power was too strong. After it had been absorbed by the Space Garden, the Space Garden was continuously evolving. Many plant xenogeneics and the flower fields leveled up to become humongous. And, they did so quickly. There were many deified xenogeneics around. Han Sen thought, If things keep going like this, there will be transmutation or even larvae class deified xenogeneics running about. If he was not able to claim the red-robed child to keep everything under control, he was sure to end up in trouble.\n\nUnfortunately, that red-robed child did not accept anything. He was listening to Han Sen’s commands for now, but Han Sen sensed that as soon as he had the chance he would revolt.\n\nHan Sen thought, It looks like I will have to wait until Bao’er gets here. I can’t wait to see what Bao’er will do to this little guy. If Bao’er is unable to tame him, we’ll have no choice but to lock him up.\n\nAfter the Flower Gods lost the flowers on their heads, their levels had significantly dropped. Now, even a King class Flower God was rare to find. Luckily, they only had to make geno fluid, and that never cost them much power.\n\nBecause the Space Garden had mutated, many of the xenogeneic plants had leveled up. They used their old formulas to make geno fluids because the ingredients were now better. That meant the effect the fluids had on geno arts was able to increase. That greatly surprised them.\n\nWith the talent the Flower Gods had for synthesizing geno fluids, they could reproduce the genes of the xenogeneics. One geno fluid was able to concentrate a few or even a dozen xenogeneic genes. After humans used them, their genes increased quickly. They did not have to waste time by digesting flesh.\n\n“Technology really does make things much easier,” Han Sen said. “If I knew there was a skill like this, I would never have had to practice a digesting geno art.”\n\nBut Han Sen’s deified genes had already reached 100. He did not need to drink geno fluid anymore.\n\nWhich battle body should I increase first? Han Sen was in his room. He was thinking about which geno art he should evolve first.\n\nBy having 100 deified genes, it made one’s battle body evolve. Han Sen did not hesitate much. He leveled up his The Story of Genes.\n\nThe Story of Genes was the hardest to evolve. Therefore, Han Sen chose it. Now that he had the Space Garden, it was easy to collect more deified genes. He did not have to worry too much."
}