{
    "chapter": 2785,
    "title": "Killing Sky Radish",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2785",
    "text": "The white phoenix fires ravaged the wound. This injury was so small that it clearly mattered little to Sky Vine Radish and his god body, but to Han Sen, it was a very important step on the path to taking down Sky Vine Radish completely. If he was unable to harm the god body at all, how could he even think about killing a god?\n\nHan Sen had now focused his awareness on the phoenix flame that the phoenix had given him. He had originally wanted to get rid of it, but he hadn’t expected that the phoenix flame used in conjunction with the phoenix feather would unleash such devastating power. It was able to slice open a god’s body.\n\nBut right now, Han Sen didn’t have the time to sit idly by and think through all the ramifications of what he had just done. He continued to swing his phoenix feather with the ferocity of a furious stormcloud. Sword lights flew everywhere, slashing here and there across Sky Vine Radish’s god body. As Han Sen cut Sky Vine Radish again and again, the flow of blood increased.\n\n“Stop or I will bury you!” Sky Vine Radish bellowed angrily.\n\nHan Sen ignored the warning. He kept slashing Sky Vine Radish’s god body without relenting. He let the god blood splatter him.\n\n“This is blasphemy against god! Your sons and your grandsons and the rest of your filthy race will be cursed now and forever! Great disaster will fall upon you!”\n\nSky Vine Radish released an enraged roar into the sky, but over time, it slowly turned into a scream. And still, he couldn’t move. Han Sen continued to slash the god body like a madman.\n\nAlthough each slash only cut a little bit into the god’s flesh, after Han Sen slashed his enemy 1000 times, then 10000 times, he was able to open Sky Vine Radish’s flesh to the bone. God blood poured out.\n\nKatcha!\n\nAs Sky Vine Radish’s voice kept up an unending stream of curses and profanity, Han Sen lost count of how many times he had slashed the god. But before long, he was able to lop the god’s head off.\n\nThat big jade head fell to the ground, creating a big crater in the earth when it landed. The jade skull’s face was turned up toward the sky. The eyes that had been closed were now finally open. They glared at Han Sen right before the head shouted, “Gods can never die! Today, you have destroyed my god body, but I will ensure that your sons and your grandsons pay me back millions and billions of times more. All the women in your race will become whores, and all the men will become slaves.”\n\nKatcha!\n\nHan Sen thrust his feather sword into the god’s eye, blinding it. God blood sprayed up like a freshwater spring, splattering all over Han Sen’s body.\n\nHan Sen had nothing to be afraid of. Han Sen knew that his family was meant to fight these gods. He would not be intimidated by the empty threat of some ominous curse.\n\nHan Sen had seen how Sky Vine Radish treated the Flower Gods, so he knew that the gods never treated the people of the universe as equals. Gods thought of the people in this universe as little more than livestock. They would kill and eat the people that Han Sen knew for nutrition.\n\n“If gods can eat people, then why can’t people eat gods? Today, I, Han Sen, will be the first person to dine on the flesh of a god.” Han Sen licked the god blood around his lips. It felt as hot as boiling water.\n\n“Deified Gene +1… God Body Evolution +1…”\n\n“Just one drop of blood can raise my tally by one whole deified gene… No wonder you are considered a god.” Han Sen looked at his fallen enemy with disdain. He didn’t stop moving his sword. He kept slashing the corpse over and over. Every slash parted flesh and broke bones.\n\nThere was a reason that these gods were creatures of legend. Even with a heavily damaged body, it was still so strong. Its strength was difficult to comprehend. Han Sen had decapitated the creature and perforated its heart, but he still couldn’t kill it.\n\n“I don’t believe you can still live if I wholly dismember your god body.” Han Sen continued to hack his way through the creature’s flesh. He made sure to consume the blood that sprayed him.\n\nIt was like he was swallowing lava into his belly. Han Sen felt as if his entire body was on fire. It was so hot, he wanted to take off his skin just to cool down a little.\n\n“Deified Gene +1… Deified Gene +1…”\n\nThe announcements kept adding up. A single drop of god blood granted a deified gene. The body of a god could bring an unimaginable bounty of wealth to someone like Han Sen.\n\n“God evolution 100%… can evolve…”\n\nFinally, Han Sen heard the announcement that he had been waiting for. But he didn’t have the time to evolve right now. He was determined to kill Sky Vine Radish and do it soon. He couldn’t give the monster any chance to reassemble itself and regain its fighting strength.\n\nDong!\n\nHan Sen had been cutting his way through Sky Vine Radish’s giant skeleton, but his blade had come up against a bone that it couldn’t cut through. The other bones had snapped with relative ease, but he couldn’t even leave a mark on this one.\n\nHan Sen was shocked, and he leaned closer to the bone to get a better look. Han Sen didn’t understand much about how these god bodies worked, but it was clear that this bone didn’t resemble any of the structures in a human body.\n\nThe bone snaked its way around the heart and lungs like a crooked vine. It was green, and it was only two meters long. A bone like that, in a giant god body like Sky Vine Radish’s, was truly tiny. Interestingly, the bone was shaped differently than the rest of the god’s skeleton, as well.\n\nAlthough most of the bones looked like they were made of a green stone, this one was rather transparent. Inside that bone, it looked like there were strange symbols floating. The bone seemed like something out of a dream, some mysterious item that could exist only in Han Sen’s imagination.\n\n“Let’s make a deal. If you stop this, I can help you conquer the universe…” Sky Vine Radish’s voice quivered with something that resembled fear.\n\nKatcha!\n\nHan Sen acted as if he hadn’t heard Sky Vine Radish. He slashed at the bone that connected the giant’s heart and lungs, and it was sliced open.\n\n“Argh!” Sky Vine Radish screamed like his heart was being ripped out and his lungs torn open. He hadn’t even moaned when his head was cut off, but now, he was squealing like a pig.\n\n“That must have been your weak spot.” Han Sen grinned in delight. He swung his phoenix feather at the strange bone even faster. Every slash struck the tether between the bones, the flesh, and the organs. He cut that tether slowly.\n\nSky Vine Radish kept screaming and cursing Han Sen, but Han Sen remained undeterred. Han Sen might obey God, but not this sort of god.\n\n“You will die!” Sky Vine Radish suddenly screamed when he saw that Han Sen was on the verge of slicing through the strange bone. His god body flashed with a green light. His flesh began to glow like superheated steel.\n\n“Oh, no!” Han Sen suddenly understood what Sky Vine Radish was doing. The god knew that he didn’t stand a chance against Han Sen, so he was going to self-destruct.\n\nHan Sen couldn’t stop the god from self-destructing, so he pushed himself to strike even faster with his sword. He wanted to dig out the bone before the monster blew itself up.\n\nBut Sky Vine Radish’s body detonated far too quickly, and Han Sen didn’t have enough time to cut the strange bone free. A scary power suddenly exploded from Sky Vine Radish’s god body. It was like a nuclear bomb going off.\n\nBoom!\n\nAt the top of the Space Garden, a green light shot into the sky like a volcanic eruption. Once it entered the sky, it spread out and began to shower the area. The light rain rained down across the flower fields, and the xenogeneic plants that touched the light rain started to grow at an accelerated rate. The whole of the Space Garden changed. It was like the sky and the earth had been flipped.\n\nHan Sen exited his super god spirit mode, and then, he heard the announcement play in his head.\n\n“Killed God Spirit. Obtained God Spirit. Found God Spirit Gene.”"
}