{
    "chapter": 2480,
    "title": "Making a Deal",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2480",
    "text": "Lando opened his eyes and instantly froze. The person who had grabbed him was Han Sen, the same person that he had just hurled out of the area. “Why did you come back?”\n\n“I came back to ask you why you would save me,” Han Sen said casually.\n\nHan Sen wasn’t afraid of evil, but he was afraid of kindness. If someone took advantage of him, he’d always pay them back threefold. But if he owed someone a favor, he never knew quite how to return it.\n\nWhile Han Sen was fleeing the area, he suddenly realized something. The invisible shield that confined them had been broken, but the scary deified who had placed the shield was still around somewhere. If Han Sen couldn’t sort out that little problem, escaping might be impossible whether the invisible wall was there or not. The hostile deified probably wouldn’t let them go.\n\n“Save you? I’m not nice enough to do that. I just didn’t want my prize to get stolen,” Lando said, rolling his eyes.\n\nLando’s body was riddled with injuries, but despite that, he didn’t feel pain. He didn’t feel anything. He just looked pale.\n\n“I see.” Han Sen nodded. He hadn’t really thought that Lando was saving him just to be magnanimous. This answer made sense.\n\nWhile they were talking, the Tianxia Unicorn had turned to head toward them again. It knew Lando was dying, as well. It flew over to them, but it didn’t finish Lando off. The creature wanted to revel in its victory.\n\n“How about we make a deal?” Han Sen suggested, looking at Lando.\n\n“I’m dying. What sort of deal could we possibly strike?” Lando asked wryly.\n\n“If we kill this unicorn together, how about we both live?” Han Sen said, pointing at the Tianxia Unicorn.\n\n“We can live. At least for a while,” Lando replied emotionlessly.\n\n“Then you and I can kill it together. If we succeed, will you let me go?” Han Sen asked, looking at Lando.\n\nHearing Han Sen’s question, Dragon One raised an eyebrow in scorn. “Is this guy insane? How can he say something so ridiculous at a time like this?”\n\nEveryone who heard Han Sen’s words shared Dragon One’s opinion. Lando was heavily injured and on the precipice of death. Although Han Sen wasn’t injured, he was just a second-tier King. He was far from being deified. Two people like them working together to slay a deified was like two ants teaming up to take down an elephant.\n\n“Has the shock of battle ruined Han Sen’s mind? He actually thinks they can kill the Tianxia Unicorn?”\n\n“That is so pathetic. It proves that any person can become delusional if they’re desperate enough. This is no different than seeing the mirage of an oasis while crawling through a desert with no water, about to die of thirst.”\n\nMany elites sighed. Seeing the desperation of the two young elites was saddening. Some of the viewers even sympathized with them.\n\nUnless they became deified, they wouldn’t control their own fates. All the elite Kings and half-deifieds felt a pang of empathy in their hearts as they looked at Han Sen and Lando.\n\nWhat was happening to Han Sen and Lando today could end up happening to them tomorrow. There was no guarantee that they wouldn’t encounter a cruel deified being by chance.\n\n“Sure,” Lando answered simply. He just nodded and looked at Han Sen.\n\n“This is so pathetic! Lando was invincible against others of the same level. He is the man who slew his master. And now he has fallen this far, to put stock in such a ridiculous hope?” Dragon One, seeing all this, looked full of hatred and disdain.\n\nKlose frowned, too. He didn’t know much about Lando. Although Lando joined the Destroyed, he was a very solitary individual by nature. Plus, he wasn’t really one of the Destroyed. They didn’t have much inclination to associate with the disgraced Dragon.\n\nBut even if he didn’t understand Lando well, he knew that anyone who could slay a deified must possess a considerable amount of mental fortitude. Lando’s mental health shouldn’t have deteriorated like so, even under that sort of pressure.\n\nBut Lando seemed to accept Han Sen’s ludicrous suggestion. Clearly, the strain had gotten to the man. That was why he put hope in something so silly.\n\n“Death is a very interesting thing. No matter how strong a person might be, they will always appear small at the hands of death.” Klose sighed.\n\nHe was the same, too. Even though he was a deified, he would still fight to live for the sake of living.\n\n“Then we have a deal,” Han Sen said, his face completely serious.\n\n“What do you want to do?” Lando asked Han Sen with a curious look.\n\nLando didn’t actually believe Han Sen could do what he had suggested. Lando was just curious about what Han Sen was planning.\n\nIn fact, Lando had always been curious about Han Sen. Han Sen was like his complete opposite.\n\nLando’s life had never given him many good memories to look back on. He stayed alive more out of habit than anything.\n\nHan Sen was different. Han Sen was a man who possessed a fierce desire to live. Han Sen would employ any method necessary, including betraying his promise by trying to escape Lando, in order to survive.\n\nBut the moment that Han Sen came back to save him, Lando began to wonder just who Han Sen really was. Somewhere in his heart, Lando had the suspicion that he had misjudged Han Sen in some fundamental way.\n\nHan Sen didn’t answer Lando. He wasn’t looking at the Tianxia Unicorn, though, which was hovering over them like some victorious warrior.\n\nHan Sen helped Lando get back to his feet. He reached out his hand and placed it down on Lando’s forehead. He looked like a priest that was about to bless his congregation.\n\nHan Sen calmly looked at Lando. In a very calm voice, he slowly said, “I… Han Sen… by the name of all the gods… grant you… Lando… holy power forever… open the door of destiny…”\n\nHearing what Han Sen had just said, Dragon One and Klose almost spat out the tea in their mouths.\n\nThe Dukes and the nobles that watched the stream stared at their screens. They looked at Han Sen as if they were watching someone retarded.\n\nAt that moment, Han Sen’s actions were no longer ridiculous. Now they were simply idiotic. The approach of death must have made him lose his mind.\n\nEven if they sympathized with Han Sen earlier, this was too much.\n\n“This is crazy! By the name of all the gods? Han Sen must have gone insane.”\n\n“This is so funny. I think I overestimated him. He was someone impressive before, but I cannot believe his will is this weak. He has clearly gone crazy.”\n\n“Haha! By the name of all the gods… This is so funny… This is the funniest joke I have ever heard!” Dragon One laughed so much that tears were welling up in his eyes.\n\nAfter hearing what Han Sen said, even the Tianxia Unicorn looked amused. Mirth crossed over its horse-like face, and it whinnied in a way that sounded a lot like a human chuckle.\n\nSo many elites populated the geno universe. Even if they were deified elites, they wouldn’t call upon the gods for aid. Using the names of the gods for help was something no one would do, not even Sacred Leader in his time of power.\n\nBut Han Sen, as a second-tier King, had dared to call on the gods. It made everyone think this was all a comedy."
}