{
    "chapter": 2722,
    "title": "Good Guy Uncle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2722",
    "text": "“Can’t do what? I’m offering you a true god item that can foretell the future, but all you want is to read comics and win the lottery,” Empty God muttered bitterly. “The item itself is its own benefit. You can predict what is going to happen in a certain place in the future.”\n\n“That has nothing to do with me. If it doesn’t let me get lots of delicious food and great-looking clothes, then it is useless to me.” Bao’er was no longer interested. She returned to playing on the Star Fruit, swinging her body around it. She no longer wanted to talk about it.\n\nThis conversation was making Empty God feel terrible. The mirror was the treasure he most cherished, but Bao’er had made it sound like a piece of worthless junk. It annoyed him, and he couldn’t accept it.\n\n“Kids really are the worst.” Empty God was furious, but dealing with this child was probably still easier than dealing with Han Sen would be. So, he kept his rage in check. He wasn’t going to leave just yet.\n\n“Bao’er, don’t go yet. I have only mentioned one part of the Star Gauge Mirror’s power. There are actually many more things this can do,” Empty God said. He did his best to remain patient.\n\n“What powers does it have?” Bao’er asked with much reluctance. She really wasn’t interested in continuing down this avenue of conversation.\n\nEmpty God quickly said, “You will know it when you see. You’re going to like it, too.”\n\nThe glance that Bao’er cast toward Empty God was filled with boredom. She had only replied to him out of simple politeness.\n\nUpon seeing Bao’er’s expression, Empty God knew that he would really have to knock it out of the park this time. Otherwise, it would be difficult to deal with the naughty kid any longer.\n\nLifting the Star Gauge Mirror once again, Empty God started to look a bit more serious. He had been treating Bao’er as a kid, not believing she was all that important.\n\nBut Bao’er had reacted in ways that he hadn’t expected. She had thrown him off his game, and that made him take this matter a little more gravely.\n\nHe brushed the back of the mirror with his fingers, which set the compass spinning again. Light appeared from the surface of the mirror and shone on Bao’er. It turned Bao’er’s cowboy clothing into a shiny set of armor.\n\n“Wow! So powerful.” When Bao’er saw the armor she was now wearing, she couldn’t help but squeal in delight.\n\nWhen Empty God saw Bao’er’s sudden happiness, he started to behave a bit more cockily again. He turned the Star Gauge Mirror in his hands and said, “This is the Star Gauge Mirror’s Mirror Armor power. It can make your armor’s defense deified.”\n\nBao’er looked as if she really admired her new wardrobe, and Empty God was about to show off the mirror’s Mirror Armor power some more. Before he could continue, Bao’er walked over in front of Empty God. She stared at the Star Gauge Mirror and said, “It is so powerful. I can change my outfit in the blink of an eye? This is a good item for changing clothes. With this clothes-changing mirror, I won’t have to wash my clothes or change them myself anymore. Using this mirror, I’ll be able to change how I’m dressed with ease. This is so good.”\n\nEmpty God’s expression darkened. The child before him was incomprehensible. The Star Gauge Mirror could show the future and gift its user with extreme defensive qualities, but she didn’t seem to care about any of that. All she cared about was the fact that she could change clothes.\n\n“Still, it was lucky I’ve got her on the line,” Empty God thought with a wry smile. He went on to say to her, “You like it? Just tell me that you want it, and I will give it to you. You can always use the armor… I mean, you can always use it to change clothes.”\n\n“Can I change my clothes into the dress of a beautiful princess? I love princess dresses, but daddy thinks they are annoying. He doesn’t let Bao’er wear them,” Bao’er said, her expression forlorn and downtrodden.\n\n“Um…” Empty God once more found himself at a loss for words. Luring this child was proving to be more difficult than tempting an old, evil behemoth that had lived for a billion years.\n\nThose ancient creatures would at least have some sense. Empty God could guess what they wanted and needed. But after all this time talking to little Bao’er, he still couldn’t figure out how her mind worked.\n\n“I can’t? Then that is a shame. If I can only let me change into one set of clothes, then there’s no point. That would be pretty boring.” Bao’er looked very disappointed.\n\nEmpty God was on the verge of giving up. Tricking Han Sen suddenly seemed easier than dealing with this little girl any longer.\n\nEmpty God thought about it for a bit, then decided that he should just change targets. He had no idea why Han Sen was keeping Bao’er as a companion, but there was no reason for him to waste his time with a naughty kid that had a mind that could not be understood.\n\nLifting the Star Gauge Mirror and shining it on Bao’er once more, Empty God removed Bao’er’s armor and returned her cowboy clothing to her.\n\n“Don’t move!” Bao’er shouted at Empty God, her eyes suddenly wide.\n\n“What is it?” Empty God remained stock still.\n\nBao’er’s face turned from shock to pleased surprise. Then, she flew toward Empty God and said, “This is so awesome. How can this mirror be so good?”\n\nWhile she was talking, Bao’er jumped in front of the Star Gauge Mirror and stared into it happily.\n\n“What do you mean by powerful?” Empty God still didn’t understand what Bao’er was talking about. He hadn’t triggered any of the Star Gauge Mirror’s powers. It shouldn’t have been doing anything right now.\n\nBut based on the shocked expression on Bao’er’s face, it really did look as if she had discovered something awesome.\n\n“Do you not see it? This mirror is awesome. Here, look.” While Bao’er was talking, she had already put her hands on the Star Gauge Mirror.\n\nAfter Bao’er’s continual rejection of the second gem and now his precious Star Gauge Mirror, Empty God actually became excited when she appeared to show genuine interest in the item.\n\nHe let her pull the mirror out of his hand, curious about what she had discovered.\n\nBao’er was holding the Star Gauge Mirror and examining it closely. She mumbled over and over, “This is awesome. This mirror is so awesome.”\n\n“What is so awesome about it?” Empty God put his head next to Bao’er’s to try to figure out what she was seeing. He could see the mirror, perfectly polished as always, but there was nothing special going on. He could detect no weird powers within the item. It was acting just like it had when it was lying around without any active powers. He really couldn’t tell what Bao’er found so enthralling.\n\n“Uncle, haven’t you noticed? This mirror doesn’t show my face,” Bao’er said while looking at the mirror.\n\nEmpty God wanted to laugh as much as he wanted to cry, and he said, “Of course you cannot see yourself. This is not an average mirror. The mirror is incredibly powerful, and unless you have a power greater than that of the mirror, it will not show your reflection. Therefore, you cannot see a reflection in it as you currently are.”\n\n“This is awesome. Dad told me only vampires don’t have reflections. Now that I don’t have a reflection, Daddy will be so shocked!” Bao’er exulted. She wrapped the Star Gauge Mirror in her arms, bowed to Empty God, and shouted, “Thank you, Uncle. You really are a very good man. You have given me such awesome treasures. I’m buying you lunch.”\n\nAfter that, Bao’er leaped off the tree, still holding the Star Gauge Mirror. She ran forward, shouting, “Dad! Dad! Look! I have a very awesome treasure. A good uncle gave it to me.”"
}