{
    "chapter": 1056,
    "title": "Giving Up Victory",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1056",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhat Han Sen had just performed was not exactly like Bai Yishan’s Yin Yang Blast. It was a modified variant which employed twists Han Sen had decided to incorporate himself. One new component was a simulation of Bao’er’s energy flow.\n\nYu Tuoshan’s punch was supposed to hold the power of a bulldozer, which should have annihilated his opponent. And in essence, it was. Through a simulation of Bao’er’s energy, Han Sen was able to absorb all of the strength the shura had put into his strike and reverse it. It was very promptly returned to the sender.\n\nStill, this should have come as no surprise; after all, the skill was based on Yin Yang Blast.\n\nThe royal shura was strong, and he hadn’t been wholly defeated yet. After crashing into the audience, he stopped for a moment to get a sense of what had happened, and then immediately hopped back into the arena.\n\n“Since I was thrown off the stage, does that result in an immediate victory for you?” Yu Tuoshan asked, with surprising decency.\n\nYu Tuoshan did not believe he had lost. And he believed he had somehow been tricked by Han Sen, and the window for this to occur was through his own recklessness and underestimation of his opponent.\n\nBeing a prince of the shura, there were certain behavioral standards he had to uphold. So, before striking again and resuming the fight he did not believe he had lost, he had to ask Han Sen’s permission first.\n\nEveryone then looked at Han Sen, to see what response he’d give. The judge wished to declare that leaving the arena should have made the shura forfeit, but these circumstances were more than unexpected, and so he hesitated.\n\n“Of course not,” Han Sen answered.\n\nThe shura all felt relieved. It would have been far too embarrassing for them, if Yu Tuoshan was to lose in such a way.\n\n“At the very least, this Han Sen fellow is quite honorable,” Lou Lan said.\n\n“Yes, but our prince needs to be more careful henceforth. Even if that doesn’t count as losing, it was still an ugly and embarrassing thing to witness,” Lian Chan said.\n\nIn the stream, others were feeling relieved, as well. But their confidence in victory had most certainly been sapped by some degree.\n\n“This guy is strange. The prince needs to be careful.”\n\n“He has some balls, though. I’m surprised they’re not weighing him down.”\n\n“Tricks and nothing more. The prince, being wise to them now, should have no problem defeating that human.”\n\n“Beat him, My Prince!”\n\n…\n\nMany of the shura watched intently, as did a number of humans who had tuned into the same stream. Everywhere, there was a sudden surge of excitement for this battle.\n\nAlso tuning into the stream were peacekeepers of the planet, who had previously been stationed there to ensure nothing ill came from any flared tempers between visiting humans and the shura that originally inhabited the place.\n\nZhou Ping had been on the planet for many years, and in that time, he had dealt with a tally of negotiations higher than he could count. He had also been the victim of constant bullying and disrespect by the shura.\n\nThe planet was shura territory, after all. As such, he knew he should have expected less-than-favorable treatment.\n\nThe only thing that ever brought a smile to his face was seeing a shura lose to a human in some capacity. Needless to say, the stream was quite thrilling to watch.\n\nHumans always had to appear intimidating to be successful in negotiations.\n\nBut now, with the truce in play, their days on the planet had actually become more difficult.\n\nWhen Zhou Ping had nothing to do, he’d often watch the streams of beautiful shura women.\n\nLian Chan was a beautiful and powerful royal, and the source of many men’s fantasies.\n\nOn this day, when she began streaming, Zhou Ping tuned in to watch. There, he saw Yu Tuoshan engaged in a fight with a human.\n\nImmediately, he recognized the human on-screen was Han Sen, and so he called for all his workmates to gather and watch the fight alongside him.\n\nWhen Yu Tuoshan was thrown away, the boisterous shura all fell silent and the stream was dead. Zhou Ping and his crowd, though, were the complete opposite; they felt immeasurable excitement.\n\n“Awesome!” Zhou Ping exclaimed.\n\nAlthough they were not formally acquainted with one another, they felt a great pride in watching Han Sen do what he did.\n\nOverall, what they felt was strange, and it was a feeling that only came from circumstances in which a triumph was achievable against all odds or if you were hopelessly outnumbered.\n\n“Wait a minute; why is he giving up his chance of a guaranteed victory?” An officer did not understand Han Sen’s decision to give the shura prince another chance.\n\n“If he stops fighting now, he will have just won the match. The shura would not believe it to have been a fair fight, or a victory for Han Sen brought on through actual battle,” a white-haired officer explained. Then, he went on to say, “If Han Sen carries on fighting and can keep up a similar performance, he will be admired all the more.”\n\n“But if…” A younger officer tried to speak, but his words immediately dropped into miserable silence. His meaning was clear to all there, however.\n\nThey were worried Han Sen might not be able to engineer another win.\n\nHan Sen was too young, they thought. Many humans could beat high-level shura, but they were all far older than he was.\n\nAt the same age, it was far more difficult for a human to triumph in such fights. For someone as young as Han Sen, it was nigh impossible.\n\nIf Han Sen gave up his chance of victory now, could he do it again?\n\nThe elderly officer said, “If a victory was achieved through luck, and it was perceived that way, it’d reflect worse on the person than if they were to simply lose.”\n\nUnderstanding his actions more, the officers all looked at Han Sen with greater admiration. In unison, they said, “What a lad! We need more humans like him.”"
}