{
    "chapter": 996,
    "title": "Ancient Shura Text",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_996",
    "text": "Han Sen was incredibly overjoyed, watching his space king spirit geno point tally increase one-by-one.\n\nSplit-Space King, before it was all over, became numb. Eventually, he gave up completely. Whenever he respawned, he stood there silently, awaiting death. Again and again, he allowed this to happen.\n\n“Oh my spirit! The King is terrifying. What element does he wield?”\n\n“Physical, maybe? But if that is true, can plain, physical power even reach such heights?”\n\n“Unless someone has more gene locks open, The King is unbeatable.”\n\n“The King won’t be a king much longer. He is sure to become an emperor!”\n\n“This is the sort of spirit that will bring great change to the Third God’s Sanctuary.”\n\n“The King is indestructible.”\n\n…\n\nThe quiet chattering between the spirits soon turned into a frenzy of praise and fawning, and whenever they looked at The King, their faces fell slack in complete awe and admiration of him.\n\nBoom!\n\nAfter killing Split-Space King ninety-nine times, Han Sen’s space geno point tally reached a hundred. He couldn’t increase it anymore.\n\n“I’ve gone up against many king spirits in my time here, and still, none are able to defeat me. Is this to continue forever?!” Han Sen spoke aloud and put on an expression of disappointment. Then he turned to leave.\n\n“Only The King can say something like this. And to be honest, he has every right to.” The spirits all looked on him in amazement.\n\nHan Sen did not really mean what he said. His primary goal was to provoke the ire and hatred of the other spirits even more, and perhaps draw out another challenger. Unfortunately, none were willing to.\n\nUnexpectedly, the spirits all agreed with his words and deemed them appropriate.\n\n“These spirits are lame. Humans are fearless; they wouldn’t act like this,” Han Sen thought to himself.\n\n“I can’t believe Split-Space King was unable to defeat The King.” Flower Empress was in shock.\n\n“If nothing stops him, he’s well on his way to becoming an Emperor. He’s got the makings of a spirit that’ll reach the Fourth God’s Sanctuary, without error,” Heavenly Empress said.\n\n“The Emperors have had no luck so far, but they won’t relent in their pursuit of him. And when they do find The King, they’ll kill him.” Flower Empress spoke with a soft and worried tone.\n\n“I don’t think that is necessarily true. If they find out where he is, I’m not sure they’ll be able to do much,” Heavenly Empress commented.\n\n“I wonder who is parents are. I’d sure like to meet them!” Flower Empress said.\n\n“You want to be their daughter-in-law? You’re thinking that far ahead, are you?” Heavenly Empress jested with a laugh.\n\nFlower Empress said, “Well, there’s no denying it’d be great if I could marry a spirit such as that. The baby we’d conceive would be something quite special, for sure. And regardless of that, I still owe him kisses!”\n\n…\n\nMoment Queen had been sent out to retrieve creatures, and when she entered the spirit base, she heard the news.\n\n“Whoa! That sounds like a scary spirit. I wonder where he came from?” Moment Queen did not think highly of herself, and she did not even reckon she could defeat space king spirits of her own tier.\n\nAfter hearing the tale of The King, she thought to herself, “If I can ally with him, I can most certainly exact my revenge! Hmm, but I’ve only opened one gene lock… I doubt I’ll be able to catch up with him.”\n\nWhen the image of Han Sen’s smug face flickered across her mind, Moment Queen said to herself, “Ugh, this is that asshole’s fault! If it wasn’t for him, I’d have opened a multitude of gene locks a long time ago. When the time for my revenge comes, I won’t just kill him. No, that’d be too merciful. I’m going to enslave him. I’ll make him my thrall!”\n\nMoment Queen did not know The King was Han Sen, the person she hated most in all the world.\n\nAs this was occurring, Han Sen was dining on a meal Zero had prepared. At the same time, he fiddled with the scale.\n\nWith Moment Queen’s fruitful hunt, Han Sen no longer had to worry about mutant geno points. All he had to do was eat his fill.\n\nBut the dragon scale troubled Han Sen.\n\nThere were many small words inscribed upon it, and he had no clue what they meant. Dragon King told him it was a transcript of his own secret skills.\n\nBut Han Sen did not believe this, and he found it difficult to imagine someone randomly carving their skills out on such a unique scale.\n\nWhen Han Sen pestered Dragon King for a more profound explanation, he translated the text for him. But due to Han Sen not being able to understand the source text, he couldn’t be sure whether or not to trust the translation.\n\nAnd still, Han Sen believed he was lying. He asked Thorn Baron and Moment Queen what they thought, and they both told him the same thing: the words on the scale were not written in any spirit language.\n\nHan Sen then went to do some research, and he found a few languages that possessed similar runic systems to the ones on the scale.\n\nAfter a deeper analysis, Han Sen was surprised to discover an exact match with a shura language.\n\nHan Sen had learnt how to read, write, and speak the shura language. But he had learned a modern variant of the language. The dialect written across the scale was ancient, and it was almost entirely different.\n\nNot wanting to jump the gun, Han Sen spent some time with his research and was careful to confirm his findings. It wasn’t long before he realized he really wasn’t mistaken. The text on the scale belonged to an ancient shura writing system; it was prehistoric.\n\nIt was a shocking discovery, to say the least. The shura could not enter the sanctuaries, so why in the universe would their runes be inscribed on the scale?\n\nHan Sen attempted a translation with his computer, but there was little he could uncover. Although there were a few words here and there the system could translate, not a single sentence could be completed.\n\nAt the very least, Han Sen had now learnt that whatever had been written upon the scale was not one of Dragon King’s skills. And when he translated a word that was clearly the title of the text, it read: Asura."
}