{
    "chapter": 2372,
    "title": "Play Off",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2372",
    "text": "While the rainbow raged the bottle, the bottle itself started to float.\n\nHan Sen’s face paled. A bad feeling suddenly washed over him. He hastily backed away from the altar and returned to the blood kirin.\n\nLan Haixin was still staring at that shining Siren Bottle. Not recognizing the danger rising before her, she was still waiting for the Siren Bottle to select its master.\n\nWhen the other Sirens saw that the Siren Bottle had been activated, they knelt and began to bow before it. They also mumbled words Han Sen didn’t understand. He assumed it was the language of the Siren.\n\nBoom!\n\nThe Siren Bottle’s rainbow light exploded out. The bottle’s halo expanded, looking like a pillar of light reaching for the top of the Crystal Palace.\n\nAfter the blurry rainbow touched the Crystal Palace’s ceiling, it began to spread. It started to seep all across the Crystal Palace. The entire structure started to shine brightly, as if the whole thing had been doused in the morning light.\n\nThe altar’s secret substance chain was affected by the blurry rainbow, too. It started to shine, as well. Many magical spells began to play across the top of the altar.\n\nLin Haixin finally noticed that something was wrong. They all turned to look at Han Sen. Lan Haixin abandoned the altar to ask Han Sen, “Bai Yi, what is this?”\n\n“You are asking me? How am I supposed to know? I told you earlier that there was a problem with this thing, but you guys chose to ignore the warning.” Han Sen wanted to leave the Crystal Palace, but the main door had been barred by rainbow-colored light. Han Sen tried to open it a few times, but each attempt ended with him being tossed back by the power of those rainbows.\n\nAlthough the light fountained everywhere, it didn’t hurt anyone. But Han Sen was unable to go out, and so he was still stuck there with the rest of them.\n\n“You and your mother planned this so you could trick us!” the old Siren woman screamed, pointing at Han Sen.\n\nHan Sen ignored her. She was obviously a moron, and there was no point in trying to understand her.\n\nThe Siren couldn’t leave the hall. The old Siren woman pointed at Han Sen and said, “Grab him! I don’t believe that b*tch would leave her son behind.”\n\nHan Sen stared at the idiotic old Siren woman for a long moment. “Are you having a stroke or something?”\n\nThe Siren still surrounded Han Sen, though, and he didn’t know what they were thinking.\n\nThe half-deified old woman was their strongest member. The others were all King class. Han Sen’s blood kirin had half-deified powers. He didn’t understand how the old Siren woman could have thought that command was a good idea.\n\nThe Siren looked a little hesitant, though. They surrounded Han Sen, but they made no attempt to attack him.\n\n“Take him! That is the only way we will survive,” the old Siren woman screamed. She lifted her coral staff and gathered up a watery power. It became a water dragon that shot out towards the blood kirin.\n\nThe other Sirens moved to help the old Siren woman. They wanted to take Han Sen down together.\n\nThe blood kirin had a very short fuse. It spat out some blood air that destroyed the old Siren woman’s water dragon, then it activated its blood area and stepped forward to attack the Sirens that surrounded them.\n\nHan Sen placed Lilly on the blood kirin’s back, then touched the blood kirin’s head. He shouted, “There’s no need to attack them. She’s the problem.”\n\nThe Siren were given a shock. Han Sen was indicating the old woman.\n\nThe old Siren woman coldly grunted. “Even now, you still try to divide us? You are evil. We were blind, and unable to tell you were this evil. You better tell us what conspiracy you and that b*tch cooked up. Don’t be angry with us that we’re about to harm a member of our own family.”\n\nAfter that, the old Siren woman used her staff against the blood kirin.\n\nThe blood kirin roared in return and ran forward to fight the old Siren woman. The old Siren woman couldn’t compete against the blood kirin, though. The area she created wasn’t enough to block the pervasive blood area unleashed by the blood kirin. She was at an immediate disadvantage.\n\n“What are you waiting for? Take them down! This is our only chance of living,” the old Siren woman screamed.\n\nThe Siren Kings moved forward to fight, but Lan Haixin’s face looked hesitant.\n\n“Lan Haixin, think about this. Who was the one that allowed you to open the relic? Who is the one that brought you here? Who was the one that said the bottle was the relic? Who was the one that provoked this fight?” Han Sen shouted to Lan Haixin.\n\nHis hands clutched the head of the blood kirin. He wasn’t going to allow the blood kirin to attack anyone aside from the old Siren woman.\n\nHan Sen wasn’t trying to be nice by sparing their lives. Instead, he was reasonably confident that the old Siren woman wanted him to kill all the Siren there.\n\nThis ploy was way too obvious. The old Siren woman knew that they would be unable to fight Han Sen and the blood kirin, so she was being stubborn. Han Sen didn’t believe that this half-deified woman had survived the destruction of her race while remaining this stupid. That was, unless there was something she wanted.\n\nIf the old Siren woman really wanted to kill Han Sen, she would have attacked Han Sen herself. But her target was the blood kirin. This decision drove the blood kirin’s bloodlust to even greater heights.\n\nThe whole of the Extreme King knew that the blood kirin was a cruel and ill-tempered beast. Otherwise, it wouldn’t have murdered someone in King’s Garden.\n\nThe old Siren woman’s behavior wasn’t natural. Even if she convinced the Siren to fight, they still wouldn’t be able to defeat Han Sen and the blood kirin. At the very best, they might achieve a draw. And that wouldn’t be a very good result for the Siren. The only possibility was that the old Siren woman wanted to do harm to the Siren as a whole. It wasn’t about him exclusively.\n\nHan Sen didn’t want to be used as a tool to kill the Siren. That was why he held the blood kirin’s head to keep it from killing them.\n\nBut the blood kirin’s temper was too cruel. Han Sen couldn’t control it. The blood kirin kept being provoked by the old Siren woman, and because of this, the blood air got scarier and scarier. The creature couldn’t hold in its emotions.\n\n“Argh!” The blood kirin landed a blow on the old Siren woman. Her body flew away and crashed into one of the palace’s crystal walls. She coughed up some blood.\n\n“Holy Virgin, do you not understand? If we don’t kill to survive, the Siren will all be murdered here and now. Bai Yi and his b*tch mother are going to ruin our race.” The old Siren woman was covered in blood. Her hair was messed up, and it looked as if she was on the verge of crying.\n\nThe blood kirin didn’t hesitate, though. It roared and went toward the old Siren woman. Han Sen couldn’t stop it.\n\n“Stop!” Lan Haixin shouted. The Siren Kings moved to fight Han Sen and the blood kirin, too. They wanted to stop the blood kirin’s advance."
}