{
    "chapter": 2331,
    "title": "The Change of the Extreme King Pavilion",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2331",
    "text": "“Master, Bai Yi has entered the Pavilion,” Cher said with a bow to Bai Ling Shuang.\n\nBai Ling Shuang was seated on a sofa. Her beautiful legs were up, and she was holding a wine glass that she slowly twirled. Her expression changed to disdain, and she said, “Now that Bai Wuchang has used his pass, the Pavilion only has the statues of the alpha, the second king, and King Bao. The alpha and the second king’s statues have been there for billions of years, as no one has been able to understand them. And as for that King Bao, he was a strange king. Many royal children have tried to understand his statue, but they left empty-handed. There is no way Bai Yi will be able to understand anything about the statue.”\n\n“Instead of asking for a reward that he could use more easily, Bai Yi insisted that he be given a Pavilion Pass. He does think a little too highly of himself,” Cher said.\n\nBai Ling Shuang’s lips tasted the wine. Then, she set the glass down. “In this world, the hardest thing isn’t understanding the enemy; it’s understanding yourself. Bai Yi isn’t the only person who struggles with that. Even with all the elites in our race, how many of them can truly claim to understand themselves? Bai Yi is just an ordinary man. It isn’t surprising that he asked for something beyond his capabilities. He won’t learn his limitations until he has tried it for himself.”\n\n“You are correct, master. After all, there are not many people in this universe who are as insightful as you,” Cher gushed.\n\nBai Ling Shang looked at Cher and coldly said, “Your Fox tricks do not work on me.”\n\n“I apologize,” Cher said immediately.\n\nBai Ling Shuang waved her hand, and she was about to respond when a look of shock crossed her face. She went to the balcony and looked up into the sky.\n\nFrom another planet, a beam of light was shooting across the universe, casting shadows across entire planets.\n\n“The Pavilion… That is impossible!” Bai Ling Shuang stared at the light in utter disbelief.\n\nEvery person of the Extreme King was in shock as they turned their heads up toward the beam of light coursing through the skies.\n\nThat light seemed born from powerful magic. As people looked at it, it seemed less like a king than a god or a devil. The scary presence was felt all over King’s Kingdom.\n\nUnder the gaze of all those royals in King’s Kingdom, the light moved. It started punching. It was the Extreme King’s most basic skill: Extreme King Punch.\n\nThe Extreme King’s geno arts were all derived from the Extreme King Punch. Even Bai Wei’s Extreme King Final Punch was an improved version of Extreme King Punch.\n\nBut this basic example of Extreme King Punch was shown through a shadow. It was hard to imagine how scary it was. Every punch seemed to hold enough power to break the universe.\n\nAs the nobles watched those punches, their hearts leaped in their chests. They were suppressed, and they found it difficult to breathe. It felt as if every punch they saw was going to cripple the whole universe, crushing them in the process.\n\nJust watching that power coming from the punches was enough to put everyone in a daze. Those with weak wills found blood trickling from their noses and ears.\n\n“This… our alpha… is it…?”\n\n“Has someone claimed the alpha statue?”\n\n“Who… who is this…?”\n\nAlmost everyone was wondering, especially the royal children. Even the nearby nobles were shocked.\n\nIt had been billions of years, and in all that time, no one had been able to claim it. The opening of that statue would shake the very foundation of their society.\n\nNo matter which prince or princess claimed the alpha statue, this was going to draw King Bai’s attention. If the royal child was already known to be incredibly talented, then this might be enough for them to usurp the place of the current crown prince.\n\nAfter all, the crown prince wasn’t really very famous. The current crown prince had been selected only because he was the eldest son of the king. King Bai could boot that crown prince off his pedestal whenever he wanted to.\n\nBai Wei watched the alpha’s shadow of Extreme King Punch. She seemed to learn something as she stared. She followed what she saw in the sky and started to move, punch after punch. Her punches started off very complicated, but they became very simple. Her final punch became the most basic Shocking Sky Punch.\n\nBut her body was becoming stronger. It was becoming closer with the shadow of their alpha.\n\nKatcha!\n\nSome sort of lock inside Bai Wei appeared to have been broken. Her original body became an astral body, but the development didn’t end there. Following the alpha’s shadow punch, Bai Wei’s body continued to increase. She was fast going to have a celestial body.\n\nThis wasn’t just happening to Bai Wei, either. The whole of the Extreme King—every single person that practiced Shocking Sky Punch or something similar to it—began to gain strength because of that shadow. Many elites broke their boundaries, and even King class and deified sorts gained more power.\n\n“So this is the power of our legendary alpha… He is so holy… Who did this? Who is the one that claimed the alpha statue?” Everyone was both shocked and exuberantly delighted by this turn of events, and they discussed rabidly between themselves.\n\nThe most likely candidate, they presumed, was Bai Wuchang. But he had already claimed a statue for himself. There was no way he would be allowed to go back to the Pavilion to grab another, so it couldn’t be him.\n\nOthers of royalty were powerful, too. No one could guess who it might have been.\n\nOnly Bai Ling Shuang’s expression was conflicted. She knew Bai Yi was in the Pavilion at that moment, but she was unable to fathom how Bai Yi, of all people, could have opened the alpha statue.\n\n“It cannot be Bai Yi. There is probably some other royal child inside the Pavilion.” Bai Ling Shuang gritted her teeth as she spoke.\n\nThe light that came from the Pavilion began to fade, taking the alpha shadow with it. Many nobles and Extreme King elites looked towards the Pavilion. They wanted to know who had claimed the alpha statue.\n\nKing Bai was inside the palace, playing a game of chess. He held one of the pieces in his hand, forgotten, as he stared toward the Pavilion.\n\n“Congratulations, my king, on having such a good son.” The person who was playing with King Bai smiled.\n\n“Teacher, which prince do you think it is?” King Bai asked levelly, putting down a white chess piece.\n\nIt was the Extreme King’s National Teacher, known as Ancient Abyss, who was playing chess with him. The teacher looked like a forty-year-old man. He looked quite handsome with his little beard, but it did make him look older. Despite that, he looked quite dreamy and light.\n\nAncient Abyss bowed and said, “I do not know.”\n\nKing Bai didn’t ask any more questions. He looked in the direction of the Pavilion, waiting for the prince or princess that claimed the alpha king to emerge.\n\nHan Sen, in the Extreme King’s Pavilion, was shocked. He’d only wanted a small reward for his efforts with the statue. He hadn’t intended to draw much attention, and now he frowned worriedly.\n\nIf he really was Bai Yi, he’d have been overjoyed. But he was only masquerading as Bai Yi, and now that he had caused so much of a disturbance, everyone was sure to turn their focus on him. His chances of being exposed were now incredibly high.\n\n“What’s done is done, so there’s no point in worrying about it now. I’ll just take the item for now.” Han Sen looked at the space within the alpha statue. The opening had been revealed."
}