{
    "chapter": 1079,
    "title": "Battling Evil",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1079",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWith the powers of the Blood-Pulse Sutra and the Dongxuan Sutra, Han Sen tried to suppress and push back the energies that sought to empower him.\n\nHad he continued to accept the light and chant of strength, his powers would have grown and developed even further—but Han Sen did not want to cheat. He did not want things to be accomplished this way.\n\nWhen the power had almost been pushed out, the person bathed in light on the stone platform turned his attention to Han Sen.\n\nAnd then, all of a sudden, Han Sen’s brain felt as if it had been thunderstruck. The demonic language he had been hearing increased in volume, and it boomed inside his head.\n\nThe light broke through his attempts of defense, penetrating the Dongxuan Sutra and the Blood-Pulse Sutra.\n\nIt wasn’t only Han Sen’s Qi Gong and energy that were being warped by this intrusive power, it was his very genes. They were morphing to the will of the light.\n\nBoom!\n\nHan Sen became a gold raven, and in this form, he activated nine of his gene locks. He wanted to leave this area at once.\n\nBut even then, Han Sen could not move. He felt physically incapable. He couldn’t flap his wings or move his legs.\n\nThe light was forcing its way into his blood and bones, wanting to become a part of his very being.\n\n“D*mn it!” Han Sen was unsure whether this entire offering was a good or bad thing; all that mattered were his principles—the same principles that compelled him not to cheat.\n\nHan Sen had to kick things up a notch, he now acknowledged. With the ignition of all his energy, his hair grew silver and long.\n\nHis eyes turned white and his body glowed.\n\nHis holy light merged with the intrusive force. In this form, Han Sen could fight back the attempted invasion, but there were still remnant cascades of light rattling around inside him. And yet, try as he might, he could not extinguish or remove these renegade volumes of light.\n\nThis was the first time he had encountered a power he could not wholly defeat with super king spirit mode.\n\nA power had to be supremely wretched in strength to defeat Han Sen’s super king spirit mode.\n\nHan Sen thought he was now encountering a super creature that had unlocked ten gene locks, and that was why his power was proving insufficient.\n\nHe wanted to leave more than anything. But the eyes of that light-bathed figure were still fixed on him, and the gaze felt physical. The eyes were pinning him in place.\n\nThe demonic language was deafening, and it began to occupy Han Sen’s every thought. The light inside him became thicker, like an abhorrent mucus that wanted to drown him.\n\nThe closer one got to the light, the stronger it would be. But now, Han Sen noticed that the overall brightness that surrounded the creature was lesser in volume than his own light.\n\nHan Sen’s white light did not cease its battle with the other light, and eventually, it became the more dominant force.\n\nBut whatever lack of strength the opposing force might have now had, it made up it with persistence and volume. Whenever Han Sen was able to break a part of the encroaching light, more would simply take its place. It was exhausting work, and Han Sen knew it was something he could not keep up for very long.\n\nHan Sen might have been able to make a run for it in this form, but he feared he’d be attacked if he left now.\n\nIt was like he was encountering a hungry wolf. If you fought it, it might end up not biting you; but if you turned tail to flee, it might take advantage of your fear and strike with a deadly attack from behind.\n\nIf he was attacked by the monster that did this, Han Sen reckoned he could not survive it. But he also knew he’d most likely die by remaining there.\n\nThe power of the evil light felt unlimited in its reserves, and yet, Han Sen’s super king spirit mode could only last one hour. And if he did end up remaining in this form, fighting back with such effort for the entire duration, he’d be so weak when it was over, he might not even be able to move.\n\nHan Sen was sweating bullets. He was in quite the predicament, knowing he might not survive whether he chose to fight or flee.\n\nThe shattered shards of holy light were mounting, and they were now building up inside Han Sen. Eventually, they would clog his veins.\n\nBut Han Sen was determined not to give in. He gritted his teeth and focused even harder.\n\nThe creatures all around were uncaring, and they received the light happily. They were addicted, enjoying the light like they were getting their next fix after a long time jonesing. And what’s more, this would only end up with them becoming stronger.\n\nWith the gene locks of all the creatures behind opening, and the bursts of light that accompanied them, the shelter was obscenely bright right now.\n\nMeanwhile, Bao’er was still asleep on the back of the sheep, holding her red bird.\n\nDragon King was very much like the other creatures in the area, in that he was merrily accepting the bounty of light. He had more of a reason to, though, as his body had been in an awful state for quite some time. Now, Han Sen noticed, the spirit had recovered a bit.\n\nHan Sen was starting to realize there was nothing he could do, and neither was there anyone else he could rely on for aid. Even summoning Disloyal Knight would have been useless.\n\nThe clock was ticking, and Han Sen knew he’d have to decide on a course of action before he ended up dying right there.\n\nBut just as Han Sen was about to summon Disloyal Knight, anyway, a black mist flashed in front of his eyes. It was so fast, Han Sen initially believed it to be a trick of his vision.\n\nBut after the flash, the light was shut-off and the demonic language silenced.\n\nHan Sen felt the pressure release, and with the accompanying relief, almost collapsed to the ground.\n\n“Let’s go! When they wake up, they will not be happy,” Dragon King said.\n\nHan Sen picked up Bao’er and took off running. He used his white light to try to exhaust the remaining light inside. Unfortunately, the active time remaining on his super king spirit mode depleted, and he was unable to flush it all out of his system. What’s worse, the gross volume of light had ended up crystallized inside him.\n\nHan Sen’s face went pale. He was no longer just weak; the crystallized light was actively hurting him and making his situation all the more dire."
}