{
    "chapter": 2196,
    "title": "Sound",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2196",
    "text": "As he spoke to Huangfu Jing, Han Sen had a look at the route and estimated the travel time it would take for him to get there. “Don’t register it just yet. Wait for me on Planet Jade Drum. I’ll be there in four days; can you wait that long?”\n\nSince the entry pass for Planet Jade Drum was only valid for ten days, visitors would be forced out if their allotted time expired. That was why Han Sen had to confirm that he would make it in time.\n\nYes, I am still eligible to be here for another six days,” Huangfu Jing answered.\n\n“Okay, then. Wait for me.” Han Sen sighed with relief.\n\nHan Sen hung up the phone and readied himself to go to Planet Jade Drum. With Huangfu Jing’s ability-level and intelligence, he wouldn’t worry too much for her safety there. But bringing the Jade Drum back safely would be difficult.\n\nPlanet Jade Drum was named after the Jade Drums, but Jade Drums were rare. Many sonic Kings wished to locate a Jade Drum in order to grow their powers.\n\nIt would be rather magnificent if they managed to get a King class Jade Drum for themselves. But Huangfu Jing, who was only an Earl, had managed to secure a Jade Drum for herself. It was going to be hard to get it away from there without attracting unwanted attention.\n\nHan Sen had his Demon Bug shield, so he wasn’t afraid of any King class enemies. All he feared was the prospect of more than one King on the lookout for him. That could go badly.\n\nHan Sen packed up his things and told Han Yan and the others not to leave the base while he was away.\n\nHe took Bao’er with him as he left Narrow Moon, and they used a wormhole to get to Planet Jade Drum.\n\nHan Sen had only just left Narrow Moon when Night River King received word of his departure.\n\n“Han Sen, you know what? It’s fine if I can’t kill you. I can still make you suffer a fate worse than death.” Night River King’s face was all twisted, and his eyes shone with a malevolent hatred.\n\nA Duke came and bowed to Night River King. “My King, I have done everything you asked me to.”\n\n“Good. Very good.” Night River King waved his hand to excuse the Duke. He then turned his attention to the screen that displayed Planet Eclipse. With a twisted smile, he said, “Han Sen, I can’t wait to see the look on your face when you come back and realize all your friends are dead. I will be looking forward to that.”\n\nThe day after Han Sen’s departure, a fleet of ships entered Narrow Moon. They were cargo ships that delivered produce. They were outsiders to Narrow Moon, so they had to pay taxes to enter.\n\nThere were many resources aboard, with many hailing from a variety of different planets. There were many xenogeneics, which made for their primary load of cargo.\n\nWhen the ship went by Planet Eclipse, one of the ships broke down. Many of the xenogeneics escaped from the ship and scattered across Narrow Moon. The people of Narrow Moon attempted to capture them again.\n\nAs this occurred, someone snuck into Planet Eclipse and placed one of those xenogeneics atop a mountain there.\n\nIt was a xenogeneic that looked like a queen bee. Instead of the expected yellow and black, however, its body was dark red. When that xenogeneic regained its freedom, it killed a whole host of xenogeneics all across that mountain. Then, it placed eggs inside the bodies of the slain. The eggs were red, as well.\n\nThose eggs incubated quickly, and as this happened, the corpses dried and shriveled into husks. It was like the eggs were absorbing all the nutrients that the bodies had to offer.\n\nNot long after, the bees began to hatch and journey to a single mountain amidst a vast range. Together, they hollowed it out. There were many entrances all across the mountain’s slopes. It was like a huge beehive, and many of those red bees came in and out.\n\nAs all this occurred, no one in the base took notice. Han Sen had told everyone to stay inside the base when he left, so his people did as they were instructed; no one went hunting and no one left.\n\nThis situation made the murderous Night River King frown deeply. He quickly said, “Han Sen is evil! After he left, he told all of his friends to hide in the base. But hiding away won’t do them any good. They’re all going to die. We just need to lure the Shadow Queen Bee their way with an incense she likes. If we guide her toward the base, she is sure to kill all of them. Han Sen! When you come back and see all your friends and family have been implanted by the eggs of the queen bee, I wonder what the look on your face will be like!”\n\nHan Sen followed the designated route and arrived at Planet Jade Drum in time. Four days wasn’t a long time, but to Han Sen, the delay was quite worrying. He was afraid Queen and the Jade Drum might have been discovered by this point.\n\nLuckily, all that he feared had not come to pass. He paid the Thousand Treasures some cash, then entered Planet Jade Drum.\n\nWhen flying over Planet Jade Drum, the planet was visibly covered in grey mountains. No life was visible. There was no countryside, and there were no xenogeneics.\n\nBut that was just the surface of the planet. Inside a large mountain on Planet Jade Drum, there was a slew of mines. The Drum xenogeneics lived there.\n\nTo look for them, people had to explore the mines and dig. The level of creature they found, however, was determined by a combination of luck and their own abilities.\n\nEven King class elites might only be able to locate a low-level Bronze Drum or Silver Drum. Jade Drums were incredibly rare. The rate of finding them was often below one per year.\n\nHan Sen used his phone to give Queen a call, but the call didn’t go through. She had turned her communicator off, and that made Han Sen frown.\n\nBefore entering Planet Jade Drum, he had been talking to Queen. But now, the phones weren’t working. It suggested to him that something must have happened.\n\nFortunately, Han Sen already knew her last location. So, he summoned his red cloud and went right for her with Bao’er.\n\nInside a specific mountain on Planet Jade Drum, there was a Taurus Marquise clutching a strange treasure weapon. He looked murderous. He looked at Huangfu Jing and laughed. “I was just coming here to search for a Jade Drum and see if I could steal it. Thanks to you, I have found it right here. Give it to me, and I will let you leave here alive.”\n\nHuangfu Jing didn’t move, and she calmly looked at the Taurus Marquise. She was confused, unsure how he knew she had managed to find a Jade Drum.\n\nWhen Huangfu Jing spoke to Han Sen, they used their human language. It was very different from the common tongue of the geno universe. Even if they were overheard, no one should have been able to understand what they were saying.\n\nThe Taurus slowly neared her. He grinned proudly and said, “You must think it is weird that I understand your language. But I think it’s the most natural thing in the universe, because I study sound. No sound can escape my ears. It is a power that allows me to understand any language I hear, even if I have never heard it before. Nothing you say can escape my ears.”"
}