{
    "chapter": 1251,
    "title": "Calculation",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1251",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen shouted, “Don’t go yet! I am going to take down Blood River Shelter and save you all!”\n\nXue Yucheng heard him say this and said, “You have no idea how powerful a king-class shelter is. Simply sending a message will do.”\n\nAfter that, he continued driving the boat away.\n\nHan Sen did not blame him for thinking this way. He might not have even heard of Han Sen, and it was highly unlikely he had learned that Han Sen had taken down an emperor shelter.\n\nHan Sen remained in that place and waited for nightfall. Then, he donned the Night Cloak to sneak into the shelter.\n\nHan Sen had an advantage for now, but if he called for his companions to come, he’d lose it. Furthermore, he’d be risking the loss of Thunder Hell Shelter.\n\nAnd if Saint Fan had been biding his time, waiting for the moment Han Sen left the shelter unguarded, he could take over and ruin the teleporter inside. If that occurred, the shelter would indeed be rendered useless.\n\nHan Sen planned to observe the goings-on of Blood River Shelter for a bit and come up with a viable plan of attack.\n\nIf he could one-hit-kill Blood River King, that would be wonderful.\n\nHan Sen snuck to the island as unnoticeably as he could. The river was a few hundred miles wide, and the island itself was rather large. The castle there was not all that different from Devil’s Nest.\n\nNear the river, Han Sen saw a giant tentacle making waves.\n\nHan Sen was not sure what it was, but it had to be around fifty meters long. The tentacle came out from the water and kept patting and splashing the surface of the river.\n\nInside the shelter, there were many strange fish with legs. Their mouths were filled with crocodile-like teeth, too. Luckily, Han Sen had the Night Cloak to shield him from their vision. Then, not long after, Han Sen felt the presence of a familiar lifeforce nearby.\n\n“Yaksha.” Han Sen saw two people walking through the castle’s garden; one of them was Yaksha.\n\nIt had been a while since Han Sen last saw him, and he clearly hadn’t been idle in the time since. He was now much stronger, and he’d be a far more formidable foe this time.\n\nYaksha was one of the eight generals and had been, once upon a time, at the same level of strength as Xiang Yin and Sky King. It was only a matter of time before he recovered, and if he recovered any further, defeating him would be far more difficult.\n\nBesides Yaksha, there was a king spirit. He was clad in red armor. He had a red cloak, and two swords crossed behind his back.\n\n“That must be Blood River King,” Han Sen thought to himself.\n\n“I hope you can give me an answer. If you let this opportunity to pass you by, it may be tens of thousands of years before you get another,” Yaksha said.\n\nHan Sen leaned closer in an attempt to hear what the two were discussing.\n\nBlood River King said, “Emperor treasures are good, but that vine has no difficulty eating berserk super creatures on a whim. Even with our spirit stones intact, ’tis a dangerous venture to consider.”\n\nYaksha said, “I am well aware of how powerful the Aqua Vine is, but we can just go there to steal the kill.”\n\n“What do you mean?” Blood River King asked, with visible surprise.\n\n“Do you know the flying dragon fish?” Yaksha asked.\n\nBlood River King said, “You mean, the flying dragon fish that has opened ten gene locks in the Empty River?”\n\n“Yes, it has ten gene locks open. And what’s more, it can go past the Ten Steps of the Holy Door. It can go there, but it is intent on searching for the Aqua Vine. If it ate the Aqua Fruit, it could become a demi-god, no problem.”\n\n“You mean…” Blood River King began.\n\nYaksha said, “We have to wait until they are both injured. We can get the fruit without issue. And if we play our cards right, we might also get the fish.”\n\n“If this is as easy as you say it is, why do you implore my assistance with this? Why do you want me to join you so badly?” Blood River King wasn’t entirely trusting.\n\nYaksha said, “The Aqua Vine can restrict my powers. And it can self-destruct before anyone gets what it holds. But you, you are fueled by the element of blood. You might be able to pick them up.”\n\nYaksha also went on to say, “There are seven Aqua Fruits for the taking. If you grab them all, I’ll keep two. If you obtain fewer than four, I’ll have one.”\n\n“We can give it a try. But when will the dragon fish be back on the move?” Blood River King said.\n\nYaksha smiled and said, “I know the answer to that. If you are truly interested, come with me.”\n\nYaksha did not tell him the exact time, as he was worried Blood River King might abandon him.\n\nHan Sen thought to himself, “Are they talking about the lantern fish and the purple vine? This is great!”\n\nThe vine on the peak had almost killed the lantern fish. And what’s more, the fruit or treasure that might have been up there was of great interest to him."
}