{
    "chapter": 1680,
    "title": "I Have Become God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1680",
    "text": "Han Sen couldn’t find Ancient Devil. All he found was Destiny’s Tower, hanging in a corner of the hallway.\n\nIt was the only geno core that hadn’t been destroyed after leaving his Sea of Soul. Han Sen went over to grab it and return it to his Sea of Soul. Fortunately, there were no barriers inhibiting this, and he returned it to its rightful place. He could still use it, as well.\n\nHan Sen looked inside Destiny’s Tower and noticed Armored Man was still there. Surprisingly, Meowth was hanging out on the first floor of Destiny’s Tower. Han Sen wasn’t sure how he had managed to get inside.\n\nHan Sen thought Meowth must have been killed, as his fitness was far worse than Little Angel’s and Golden Growler’s. It could most certainly not have been rebuilt.\n\nHe never expected it to have been able to run inside Destiny’s Tower for shelter. It was its same old self, though. It was a beast soul, and it hadn’t undergone any transformation or rebuilding.\n\nLittle Angel and Golden Growler had their own bodies now, though. They were no longer beast souls. They could not enter his Sea of Soul anymore. Fortunately, they recognized who Han Sen was. And together, they all traveled as one. Bao’er was included in that equation, too.\n\nOn a planet in the Alliance, in a system residing in the Barrens, a naked man appeared on an island. He shouted to the sky, “I have become a god!”\n\nThat voice was so loud, it made the seas lash and the clouds part. All the birds flew away, as well. It was overbearing.\n\nThat man was Ancient Devil, who had successfully ascended. It was a trial-and-a-half for him, but he had been successful.\n\nBecause Han Sen had not been rebuilt in the beginning, and he had five geno cores to rebuild his body, he had been much slower. This allowed Ancient Devil to reach the Alliance first\n\nAncient Devil did not have geno armor, though. He could not see the path to make his way out of the crystal hallway. He came out right after his successful rebuilding, unaware of what had happened to Han Sen who slipped in with him.\n\nAfter Ancient Devil shouted, he noticed there was a man, a woman, a child, and a golden-haired lion sitting next to him. They looked at him as if he was a complete idiot.\n\nAncient Devil’s face fell when he saw Han Sen. All his possessions had been destroyed when he leveled up. He did not have an ounce of armor on him. But Han Sen and the others were all geared up, not naked like he was.\n\nHe quickly wanted to scamper away, but he realized his powers were not as strong as they had been when he was a demigod. He was weak and slow.\n\nHan Sen grunted, and then appeared directly in front of Ancient Devil. He delivered a firm punch into Ancient Devil and sent him hurtling into the sea.\n\nWaves rushed away from Ancient Devil’s body when it hit the surface of the ocean. Han Sen was already next to him once more, though. He gave Ancient Devil a good kick.\n\nAncient Devil’s went at a speed that parted the sea wide. He was sent traveling a few miles.\n\nPang! Pang!\n\nHan Sen’s body teleported to Ancient Devil once again. He punched him in the side, he punched him in the front, he kicked him in the side, he kicked him in the front. And then, one extra strong kick in the backside. He treated Ancient Devil like a punching bag. The spirit was left bleeding, with an awfully swollen face.\n\nLeveling up to the Alliance was different from reaching a new tier of sanctuary, and that was because your body was fully rebuilt. Your strength ended up lower.\n\nAncient Devil and Han Sen were practically newborn babies right now, and it’d take a while for them to redevelop. It’d take a while before they achieved the strength of a demi-god again. The process was only considered a genuine success if you generated a geno armor.\n\nHan Sen already knew about all this, though. Han Yufei and Stay Up Late had explained most of it to him.\n\nAncient Devil, on the other hand, was clueless. He had no armor. He didn’t stand a chance of fighting Han Sen, who did. He was beaten up severely, with no hope of fighting back.\n\nHan Sen was angry, though. He had been forced to level up and reach the Alliance. He hadn’t prepared for any of that, and he had lost many beast souls and geno cores.\n\nAncient Devil, suffering this new pain, roared. But Han Sen just punched him in the face and prevented him from doing it again.\n\nThe gulf of power separating the two was massive. They had both just leveled up, but Han Sen’s body was far stronger than Ancient Devil’s. And with the geno armor, much stronger again.\n\nEverything Ancient Devil tried to do to combat Han Sen was useless. Nothing worked. He was almost dead when Han Sen summoned Destiny’s Tower and imprisoned him on the seventh floor.\n\nDespite his many calculations, Ancient Devil had never expected to become a prisoner upon leveling up.\n\nHan Sen tried to summon his unicorn beetle and had no problem with that. It floated up before him and did not seem to have been affected by the powers of ascension, at all.\n\nHan Sen touched his body, but he noticed his Nine-Life Cat pendant was gone. Perhaps it had been destroyed in the hallway.\n\nAfter entering the unicorn beetle, Han Sen examined the map to find out where exactly he was. He wanted to get back to the Alliance.\n\nHan Sen: Unknown\n\nGeno Body: Not Created\n\nLevel: None\n\nLifespan: 600\n\nGeno Body Evolution Requirement: Unknown\n\nHan Sen was unable to get a clearer comprehension of his current status, as everything was now showing up as unknown. And that was because he had not generated his geno armor.\n\nHan Sen was confused. The Alliance did not have creatures, so how would one collect genes to level up?\n\n“I need to ask Stay Up Late about this. Perhaps he will know,” Han Sen thought to himself.\n\nThe Han family home had been attacked by the black tiger, but it was destroyed alongside many of the buildings around it. Many innocents died because of the attack.\n\nJi Yanran had to pay a lot in return for all that. And fortunately, the manor was old and few people lived there. If the death toll had been any higher, she’d have felt even more guilty.\n\nS, Ji Yanran made plans to purchase a planet for the family. In the event such a thing occurred again, there wouldn’t be innocent casualties.\n\nBut because of Han Sen’s accident, Ji Yanran could not do this. So, she was with Luo Lan, Zero, and Han Yan, waiting for news of Han Sen.\n\nEntering another person’s God’s Door was difficult to survive. They heard he had done this, but they were still hopeful he’d pull through.\n\nAfter Stay Up Late heard about what had happened, he thought regretfully, “Entering the God’s Door of someone else is deadly. There is no way he will succeed.”\n\nWhen Han Sen returned to the Alliance, however, he was able to contact Ji Yanran. And this made Ji Yanran and the others very happy. Stay Up Late was shocked, and his face was full of surprise.\n\n“How is that possible? Using the path of someone else? The rebuilding powers should not have matched him. How could he succeed? This family is strange!” Stay Up Late wore a complicated expression."
}