{
    "chapter": 1189,
    "title": "Killing Sky King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1189",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nKatcha!\n\nHan Sen felt as if his body had been freed from the clutches of chains he never knew existed. The holy light enveloped Han Sen’s entire body, wings, and greatsword. He felt as if he was submerged beneath water, floating free.\n\nSky King warped the dimension again and threw a punch with the illusion of near-teleportation levels of speed. Seeing another punch head his way, Han Sen readied his greatsword. But even though the fist was only a meter away, it felt like it was miles away.\n\nIn the next second, he was swinging his greatsword as if it was weightless. It cut through the twisted, perverse dimension and struck Sky King’s wrecking fist.\n\nIt was too late for Sky King to pull back, as half of his fist was lopped off.\n\nSky King bled profusely from his fist, which made him reel back aghast. He couldn’t believe what had just happened, and truth be told, neither could Han Sen.\n\nBut Han Sen was happy at the sudden turning of the tides. Little Angel had helped Han Sen open his tenth gene lock for super king spirit. Now, Han Sen could not be suppressed by the warping of dimensions.\n\nHan Sen wasn’t yet sure about the extent of his power with ten gene locks open. He didn’t exactly have the opportunity to thoroughly test it, due to the current circumstances. Neither did he know if this was a permanent opening of a gene lock, and if it would remain open if Little Angel exited his body.\n\nRegardless, Han Sen now had what it took to fight back. Victory did not seem impossible now, and so he had to focus on ending the current threat.\n\nHan Sen flapped his wings. In a flash of holy light, he teleported directly before Sky King.\n\nSky King frowned and raised a golden palace in response. It was a few hundred meters away to begin with, but now it had blinked forth to separate the two.\n\nBut Han Sen was able to flap his wings again, and with the greatsword, he sliced through the new distortion of the dimension. Then, Han Sen cut through the palace.\n\nSky King did not expect his Sky Palace to prove ineffective in protecting him from Han Sen. He had not expected the tables to turn so quickly and turn so dramatically, and Sky King now wanted to flee and return to the safety and comfort of his tree.\n\nSky King was incredibly fast and agile, and with his abilities of dimension-distortion, he was able to manipulate his movement so that one step could account for a thousand meters.\n\nBut Han Sen flapped his wings again. Immediately, he was able to catch up with Sky King so he could swing his sword and strike him down.\n\nSky King frowned, and he wasn’t going to make things that easy. He turned, holding up a wooden spear that looked like the Sky Tree.\n\nDong!\n\nThe transparent greatsword struck the spear and left a deep cleft in it.\n\nHan Sen was even happier now. He drew the Phoenix Sword in one hand, while transparent greatsword remained in the other. Then, he unleashed a barrage of strikes against Sky King.\n\nSky King was able to keep his spear raised in an attempt to block the attacks, but the dual-wielding barrage proved too much. The shockwaves generated by Han Sen’s flurry of attacks soon began to collapse and devastate the golden palaces that littered the ruined landscape.\n\nDong!\n\nSky King’s spear was no longer able to withstand the attacks, and it eventually broke in two. Han Sen flew around behind Sky King and cut his face.\n\nSky King’s desperate bid to flee now escalated. With a wretched face of disgust, he turned towards the tree and took off.\n\nBut Han Sen was no longer afraid of anything, now that he was imbued with the holy light. With the glowing halo, too, he flapped his wings and followed Sky King wherever he went.\n\nSky King bled, and the skies were dyed red, as if in response.\n\nSky King’s blood began to cascade like rainfall.\n\nIt shocked Sky King, and his bleeding face robbed him of any intention he had to fight back. All he wanted to do now was return to his tree and cower within.\n\nHan Sen did not relent in his chase, and he smirked at seeing how much Sky King’s behavior had changed. All his cockiness had vanished.\n\nHe got in another strike, and this time, Han Sen managed to not only cut Sky King’s crown in two, but also give him a less-than-fashionable haircut.\n\nThe gold armor Sky King wore was all broken, and it had turned the color of rusted, aged steel.\n\nHis wounds leaked blood like broken faucets.\n\nSky King flew inside the tree and closed himself inside. Han Sen was determined not to allow this to stop him, though. He struck the tree once, creating a dozen-meter-long mark across the surface of the tree.\n\nUnfortunately, it didn’t do much. The tree seemed able to heal itself, too.\n\nSo Han Sen began striking the tree fiercely. He hoped he could keep up the DPS to outpace the healing.\n\nAnd all the while, Sky King was inside, cowering in fear over his nemesis.\n\nAs Han Sen excitedly fought against the bark of the tree, it soon revealed itself to be a futile endeavor. But Han Sen suddenly smiled in the remembrance of something. He turned around and went after the golden peacock.\n\nThe golden peacock wasn’t expecting Han Sen back, and it really wasn’t expecting his newfound strength. With its beak, it attempted to block Han Sen’s greatsword.\n\nKatcha!\n\nThe gold peacock was no match, and it was promptly cut in half.\n\n“Super Creature Sky Peacock killed. Beast soul gained. The flesh of this creature is inedible, but you may harvest its Life Geno Essence. Consume its Life Geno Essence to gain zero to ten super geno points randomly.”\n\nHan Sen grabbed the yellow Life Geno Essence from its body and put Disloyal Knight back inside the Sea of Soul. Then, he returned to the underground shelter.\n\nHan Sen’s super king spirit mode could last one hour, but after combining with Little Angel, he felt drained of all energy within the space of a few minutes.\n\nAs Han Sen flew back home, Little Angel departed and returned to the Sea of Soul looking equally tired and drained of energy.\n\nHan Sen was feeling worse than usual. He was in very poor condition, and he had to make use of his Blood-Demon Dragon wings to return home. He couldn’t even fly home by himself, he was so weak."
}