{
    "chapter": 1322,
    "title": "Let’s Go",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1322",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe three-eyed spirit observed Han Sen closely now, paying more attention to him than anyone else. And as he watched him intently, the young man turned around and smiled. This gave him a shock.\n\n“He knows we are here?” the three-eyed spirit gasped in surprise.\n\nGu Demon Emperor said, “Never; that should be impossible. We’re so very far away, and on top of that, we’ve hidden our lifeforces.”\n\nThe three-eyed spirit was still unnerved by the smile he had received, though. He said, “Well, if he’s as tough as No God Emperor has been saying, it wouldn’t surprise me if he knew we were here. If anything, it gives credence to his claims. If that’s true, we might have a greater problem on our hands than we initially assumed.”\n\nThe three-eyed spirit paused for a moment, then went on to say, “Pah, and here I thought we were the problem on their hands. But Godslayer Luo was so strong, and we still forced him to ascend to the Fourth God’s Sanctuary. With the combined might and power of ourselves and the emperors still to come, there is no hope for the heir or the young man to escape death.”\n\n“Is Ruin Emperor here yet?” Gu Demon Emperor asked.\n\nThe three-eyed spirit answered, “He set off two days ago.”\n\n“Then the fate of this lot is sealed. Each and every one of those people will be brutally murdered when Ruin Emperor arrives.” Gu Demon was speaking with a bitter contempt for Han Sen and everyone with him.\n\nMany other spirits were slowly starting to arrive at the shelter now, all doing so in the belief they were hidden from the awareness of the shelter’s occupants.\n\n“Is that a spirit fighting Giant God Emperor?”\n\n“Are you telling me you don’t know who Xie Qing King is?”\n\n“Why? Is he supposed to be famous?”\n\n“He was, one hundred thousand years ago.”\n\n“That’s a little before my time, but why would he be helping Godslayer Luo’s heir and the others?”\n\n“I don’t know. He always was a bit of an oddball.”\n\nA colorful ship was on its way, sailing across the broad reaches of the nearby sea to its ultimate destination. Two ladies were engaged in chit-chat, and their names were Flower Empress and Heavenly Empress.\n\nThey weren’t the shipmasters, however. The captain was currently helming the vessel.\n\nAnother emperor was on its way to the shelter, soaring not too far above that same blue. This spirit was riding atop a dragon, and as it went, an abundance of frightening sea creatures followed in its wake.\n\nAll these creatures arrived near the shelter and remained in hiding.\n\nNothing was escaping Han Sen’s notice, though. He knew every single thing that was coming to his shelter, and despite that, he was not afraid.\n\nSnowball appeared to have just as much knowledge as Han Sen did, but its reaction was slightly different. Shivering in fear, it was cowering behind Bao’er’s back. Although the creature resembled a dog, it was a scaredy-cat, more than anything. It was allergic to the mere concept of danger.\n\nPerhaps it was a glutton for punishment, but being with Bao’er made it feel a touch safer. Despite her frequent bullying, there was something about her presence that made it feel better.\n\nBaby Ghost was not looking too good, either. He had only opened seven gene locks, so his strength was still far below all his peers. There’d be no hope of him competing with any of the spirits or creatures that had come, mouths drooling with a bloodlust.\n\n“How can this nincompoop acquire so many enemies?! We’re doomed! Yes, we’re doomed!” Baby Ghost was not fond of the idea of staying there to fight it out, as he thought there was no chance of victory. His mind feverishly searched for a way in which he might escape his current predicament and live to see another day.\n\nMoment Queen’s life was in Han Sen’s hands, as it had been for a long time. But now, it was teetering near the space between his fingers. This was a decisive moment for them all, with repercussions that could shape the future of the Third God’s Sanctuary. She had to fight, despite the slim chances of survival. And while she had had her fair share of ups and downs with Han Sen, she was going to do all she could to see him through.\n\nShe knew of the enemies that were closing in, but she also knew that was not the brunt of it. The worst had yet to come.\n\nAnd this was a thought that planted a seed of unsettling emotions in her mind. Despite her determination to try, she and the others successfully defending the shelter and emerging victorious was not something she could see happening.\n\nEven though Zero had an infinite vat of power, and she’d undoubtedly bring down more than a grand count of spirits and creatures during the fight, she was not invincible. Her body was still that of a frail young girl. It was a numbers game now, and the odds were stacked against them tenfold.\n\nAnd to make matters worse, she wasn’t even there. Ever since Han Sen took her back to the Alliance, she had yet to show up again.\n\n“He wouldn’t keep his best weapon locked up. What is he planning to do? This is Han Sen, after all. He always has a trick up his sleeve,” Moment Queen said to herself, pondering the events to come.\n\nHan Sen knew the spirits had all come for one target in particular, and that was Godslayer Luo’s heir. If they did not see Zero there, he believed, they would not begin an all-out assault.\n\nIf they did proceed forward with an attack, despite her absence, then Han Sen would give Zero a call so she could come and catch them all off-guard.\n\nBoom!\n\nGiant God Emperor began to stumble and fall, as a sharp silver light plunged deep into his chest.\n\nGiant God Emperor had been killed, and with Xie Qing King’s typical cockiness, he stepped forward to ask, “Who’s next?”\n\n“Me! I hope you’re ready to meet your maker.” A spirit answered the call, pointing a wheel at Han Sen.\n\n“He kind of looks like The King,” Flower Empress said.\n\n“Maybe, but that’s not him,” Heavenly Empress said.\n\n“Heavenly, where is Godslayer’s heir?” A female voice sounded, from someone else on the ship.\n\nHeavenly Empress turned and gave a bow. She said, “I scanned the entire shelter, but as far as I can tell, she is not yet present. She must be in the Alliance.”\n\n“Then we wait,” the empress said.\n\n“Yes,” Heavenly Empress said, returning her gaze to the battleground.\n\nXie Qing King had taken down five emperors himself by this point, but tiredness was starting to catch up with him. He finally needed a breather.\n\n“It’s my turn to show off, don’t you think?” Han Sen said, stepping forward to provide Xie Qing King with a rest.\n\n“Okay, bossman. Have fun up there.” Xie Qing King went to sit down next to Bao’er.\n\nHe was sweating profusely, knowing he exhausted too much power in those few fights.\n\n“Who wants to fight me, then?” Han Sen had learned to say it with the intimidating confidence Xie Qing King would use. He knew it would be best to thin the herd one-by-one now rather than later.\n\n“You’re just a small human. Let me come over there and swat you like the bug that you are!” Four spirits leaped out from the sidelines, wanting to squash the pompous human underfoot.\n\nHan Sen did not know why Xie Qing King could fight them one-by-one, while he couldn’t.\n\n“Maybe it’s because they know I’m too hot for them to handle solo,” Han Sen thought.\n\nThat was incorrect, though. Han Sen didn’t fight alone when he took on other shelters. He always attacked with the silver fox and Purple Emperor by his side. Without them there, they thought he’d be an easy target. Hence why so many emperor spirits were so eager to take him on at once.\n\nThe four spirits themselves were surprised they had all jumped forward to fight in tandem. It wasn’t as if they had planned that.\n\n“Let’s go,” Han Sen said."
}