{
    "chapter": 235,
    "title": "Monster",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_235",
    "text": "Yang Manli also saw the video. Because of the timestamp of the video, it was easy for her to tell that it was Han Sen in it.\n\nLooking at Han Sen, Yang Manli got goosebumps. This kind of performance would be any archers ultimate pursuit.\n\nHe was more than accurate. It was like he could predict everything.\n\nNo matter for archers or snipers, the toughest thing was never the accuracy, but the judgment under complex situations. Obviously, Han Sen was one of the best archers she had seen in this aspect.\n\nHe did not aim at any target when he made the shot, but was able to tell where the target was going to be.\n\nYang Manli felt a chill. If she and Han Sen were shooting at each other, she might not even be able to make a single shot.\n\nIt was a feeling hard to describe.\n\n\"Qin Xuan was right. He is a natural,\" thought Yang Manli, after finishing watching the video.\n\nThe video was very popular in Sagittarius, but its popularity ended among archery lovers.\n\nArchery was, after all, a less popular skill. And Sagittarius was just one of the circles of archery.\n\nAfter going back to school, Han Sen wanted to call his girlfriend when his comlink suddenly rang. Situ Xiang was summoning all the archery team members.\n\nAt the training field of the school team, Han Sen saw Shi Zhikang, Lu Meng, and Zhang Yang, who were also summoned by Situ Xiang.\n\n\"Han Sen, so you're also in school team?\" asked Shi Zhikang with a smile.\n\n\"I have to contribute to my department. Why are you here?\" said Han Sen casually.\n\n\"Same reason.\"\n\nWhen Situ Xiang reviewed Han Sen's file, she studied the profiles of all the other specially recruited students again, wondering if she could find anyone that had escaped her attention like Han Sen did. In the end, she decided to ask Han Sen's roommates to join the team and get them a training. Even if they were not good enough this year, they would excel next year.\n\n\"Do you know why the coach have called us here?\" Han Sen asked his roommates.\n\n\"Who knows? We are on the same page,\" said Shi.\n\n\"The coach has of course called us here to train. Now that we are all in the school team, we have to earn honors for Blackhawk.\" Zhang Yang was positive as ever.\n\nWhen Han Sen wanted to say something, Situ Xiang blew the whistle to call them over.\n\n\"Today I have summoned you to show you some recordings of a student, who will become one of your rivals this year.\" Situ Xiang turned the holographic device on and projected the video.\n\nIt was an edited video of one person shooting at different times, and most of the scenes were shot in the venue of the military school league tournament.\n\nIn more than 40 minutes, the entire school team was so quiet that one could even hear a needle dropping on the floor.\n\nAfter the video ended, Shi Zhikang wiped the cold sweat on his forehead and said, \"OMG. Are you sure this guy is just a military school student instead of an evolver professional archer?\"\n\n\"We are against him?\"\n\n\"Impossible. We'll definitely lose.\"\n\n\"He must not be human.\"\n\n\"He is our opponent and absolutely a military school student,\" Said Lu Meng casually.\n\nSitu Xiang was interested in Lu Meng's answer and said, \"since you know this person, please introduce him to your teammates.\"\n\nLu Meng said naturally, \"I believe you have all heard of him, Jing Jiwu, the captain of the archery team of Alliance Central Military Academy. People call him monster. In his freshman year, he had led their archery team to become the champion of the tournament.\"\n\n\"Since his sophomore year, he had helped the Alliance Central Military Academy win every competition from warframe to martial arts to Hand of God, with no exception.\"\n\n\"In his junior year, he did exactly the same thing. The military Academy league had changed its rules because of him. Now one player is only allowed to participate in one field.\"\n\n\"Such bad luck. How come Jing Jiwu happened to pick archery?\"\n\n\"You're getting ahead of yourself. Based on our strength, it is not likely that we would ever compete with the Alliance Central Military Academy. It does not even matter how strong Jing Jiwu is.\"\n\n\"That is true. We could barely enter the second round in the previous tournaments.\"\n\n\"I really hope to encounter him. We will lose anyway. Better to him than to someone else.\"\n\nThe senior members of the school team commented casually. Obviously they had lost confidence and spirit in years of failure.\n\n\"You know a lot about Jing Jiwu, so how likely do you think we could beat the Alliance Central Military Academy?\" Asked Situ Xiang.\n\n\"We stand absolutely no chance. They not only had Jing Jiwu, but two of their team members rank top 10 and the other two rank top 20. However, we do not have anyone that ranks top 100,\" said Lu Meng bluntly.\n\nThe senior team members all felt Situ Xiang's question was not practical. They would not even have a chance to face the Alliance Central Military Academy, so the presumption would not even happen.\n\nSitu Xiang nodded and did not say anything. She turned to Han Sen and asked, \"Han Sen, what do you think?\""
}