{
    "chapter": 1166,
    "title": "Trade With a Dragon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1166",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“What is this?” Han Sen frowned, seeing Dragon King cackle like a maniac.\n\nDragon King managed to recompose himself and respond, “Kid, I have quite the opportunity for you. I’m keen to see if you’d dare accept.”\n\n“What is it?” Han Sen guessed it’d be related to Immortal Emperor, but he wasn’t entirely sure what the proposition might be.\n\nIf Dragon King was going to suggest Han Sen should conquer and claim Immortal Shelter, his answer would be an immediate no. Han Sen didn’t believe he was strong enough to tackle such a place.\n\n“The walnut tree you mentioned? That is the Sky Tree. It’s an emperor geno tree. Sky King uses it to level up.”\n\nDragon King went on to say, “The tree was supposedly destroyed amidst the battle I mentioned. But you just said the tree had no lifeforce, which would also indicate it was dead. I think he is currently attempting to revive the tree. I know what he is up to, but I must applaud him for the difficulty of the task he has undertaken.”\n\n“And what does that have to do with the opportunity?” Han Sen frowned.\n\nDragon King said, “If I am correct, he is growing another Sky Tree inside the original Sky Tree. These things are supposed to take millions of years to grow, though. He must be using the remains of his dead one to jumpstart the growth of a second. A suitably parasitic approach for him.”\n\nDragon King looked directly at Han Sen and told him, “I have a way in which you can get your hands on that new tree. Even at the stage it’s probably in right now, a seedling, it can greatly benefit you. If you grow it successfully, well, it would be priceless.”\n\n“And what would you require in exchange?” Han Sen asked.\n\nHan Sen didn’t think Dragon King would help him for nothing. For Dragon King to tell Han Sen the tree was that good, there had to be a catch.\n\nDragon King smiled and said, “You know I only have a tiny piece of my soul remaining. If I continue to stay inside this ring, even that will be extinguished. I’m on a leash, tethered to a ticking time bomb. I’m living on borrowed time.”\n\n“Get to the point.” Han Sen didn’t want to waste time, hearing him beat around the bush.\n\n“If you can find me a body, I can evolve a bit. Do that, and I’ll tell you what you need to do to get a hold of that tree,” Dragon King said.\n\n“How would I help you? You want the body of a king spirit?”\n\nDragon King shook his head said, saying, “I’m not doing too good. Even with a king spirit’s stone directly in front of me, I could not take it.”\n\nDragon King went on to say, “I just hope you can find me a super creature’s egg. A super creature is at its weakest when its egg is about to hatch. If you provide me such an egg, I’ll be happy to forfeit my spirit-life and take over the super creature’s body and live as one.”\n\n“A super creature’s egg? They aren’t easy to find. Where do you expect me to find one around here?” Han Sen said.\n\n“You don’t have to get one for me right now. Just make me a promise that if you stumble across such an egg in your travels, you will keep it for me,” Dragon King said.\n\n“If the tree is as good as you’re making it out to be, then you have my word,” Han Sen said.\n\n“It won’t disappoint you,” Dragon King said.\n\nAlthough Dragon King could not entirely trust Han Sen would help him, it was a chance at something better than his current state of existence.\n\n“Now, tell me how I can get my hands on that Sky Tree.” Han Sen was ready.\n\n“The new Sky Tree will be growing on top of the old one. Right now, Sky King is probably trying to amass a number of subordinates to help break down what remains of the old tree, to aid in the growth of the second. You will have to get close. With the Night Cloak, you can sneak in unnoticed and steal it,” Dragon King explained.\n\nHan Sen thought it’d be worth a shot. The Night Cloak made a person wholly invisible while it was nighttime. It could even hide one’s scent.\n\nThe Night Cloak was an item of many layers, and it was difficult for Han Sen to get a complete grip on all of its functions. He could, however, use it as an actual cloak of invisibility, and he was content with that function for the time being.\n\nHan Sen stuffed his belly with more walnuts and went to visit the Sky Tree.\n\nEntering the tree hole shelter, he looked around for Zhang Yuchen. As a “thank you,” he provided him the lifewater vials.\n\nHan Sen asked Dragon King what he thought of the lifewater, and he was told that the vials of lifewater could indeed be beneficial, but they were low-tier items. For an elite such as Han Sen, they were useless. As a result, Han Sen was happy to give them away.\n\nZhang Yuchen, seeing the lifewater, was shocked. He exclaimed, “Whoa! Are you really giving those to me?”\n\n“You helped me, even when you were injured. It’s the least you deserve,” Han Sen explained his reasoning for the generosity.\n\nZhang Yuchen wished to say something, but someone called him.\n\nHe quickly pushed the door and went out, as Han Sen followed.\n\nThe man who called him was the guy who had worked alongside Han Sen. His name was Cheng Hu.\n\n“Brother Zhang, you must hide. Qui Ping has returned!” Cheng Hu quickly spoke, not noticing Han Sen there.\n\nZhang Yuchen shook his head, and with a dismal look said, “Where? Where can I run? Let him come for me.”\n\n“What’s going on?” Han Sen frowned.\n\nCheng Hu was surprised to see Han Sen there.\n\nZhang Yuchen gave Han Sen the lifewater back, saying, “I appreciate the gift, but it would be wasted on me. Run. If others say you know me, pretend we never met.” Zhang Yuchen then pushed the two away and told them both to leave him."
}