{
    "chapter": 2719,
    "title": "Empty God’s Decision",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2719",
    "text": "“Yes, I am God. I can do anything,” Empty God confirmed, his face unchanging.\n\n“But my parents told me that this world has no God and that science is the truth.” Han Sen gave Empty God a look that was very skeptical.\n\n“In that case, your parents are ignorant.” Empty God looked at Han Sen and went on to say, “You are a crystallizer. It is no surprise that you think this way. You learn a thing or two about how the universe works, and then poof! You think you know it all. What a foolish bunch of people.”\n\nEmpty God clearly thought Han Sen was stupid. He coldly went on, “You can make any wish you want. You can, for example, wish to become deified. You can wish for a deified treasure that is of a very high level. Or you can even wish to become the master of Outer Sky. I can satisfy your wishes and show you what a real god can do.”\n\nHan Sen blinked. He looked innocent and said, “I don’t need any of that stuff.”\n\n“Don’t you want to be the strongest fighter of your lifetime? Do you not want to claim the universe for yourself? For me, giving you such power would be a piece of cake. If you make a wish, I can make it come true for you,” Empty God said, trying to tempt Han Sen.\n\n“Yes, but what would I need any of that stuff for?” Han Sen asked Empty God again, looking confused.\n\nEmpty God seemed prepared to answer the same question many times. “Then you can have anything you want. The pretty women of every race will become your toys. The elites of every race will become your slaves. You can be the leader of the entire universe. The creatures in the universe will obey you and fear you.”\n\n“This sounds pretty lame. I don’t want any of that.” Han Sen didn’t want to make a wish like that. Not to mention that if he did make such an expensive request, Empty God would probably pick his bones clean in taking payment.\n\n“Then, what would you like?” Empty God asked with a frown. This man in front of him seemed pretty dumb, but the simpleton was harder to tempt and convince than most.\n\n“I’m very happy with the way I am now, thank you. I don’t need anything. If you really are God, you should save these wishes and spend them on the people who are really suffering and require the help,” Han Sen said to Empty God in the most condescending tone that he could manage.\n\nHe knew that gods like King Jun couldn’t directly attack beings of the universe, so he wasn’t really afraid of what Empty God could do to him.\n\nEmpty God’s face darkened. Whenever he encountered people of this universe, he always found a way to make them wish for something. But on this particular day, he was intent on finding the geno protoplasm. He wasn’t in the mood to waste time talking to Han Sen. After staring coldly at Han Sen for a second, he turned away and ignored Han Sen. He wanted to walk around and see if he could find a lead on the geno protoplasm.\n\nWhen he saw Empty God taking his leave, Han Sen suppressed a sigh of relief. But the black crystal was still keeping his Sea of Soul and body locked down. It was too soon to be happy, because Empty God was still around.\n\n“If you are refusing to leave, then I will instead,” Han Sen thought. He would stay away from the Star Tree until Empty God decided to leave as well.\n\nBut Han Sen hadn’t been flying away from the Star Tree for long when he saw Empty God appear in front of him again. He was coming toward Han Sen.\n\nEmpty God had found no sign of the geno protoplasm anywhere, so he had come back for Han Sen.\n\nHan Sen was the only person in the area. If there was geno protoplasm in the vicinity, Han Sen was the likeliest person to have seen it. Empty God wasn’t happy about being unable to read Han Sen’s mind.\n\nHan Sen’s face remained expressionless. He kept going forward. He was neither fast nor slow. He didn’t want Empty God to become suspicious of him.\n\nWhen Empty God was near enough that Han Sen could hear him, he spoke again. “Have you considered my offer? You still have the chance to make a wish.”\n\n“I really don’t have a wish I want to make right now. You should go and ask someone else,” Han Sen said. Then, he tried to maneuver past Empty God.\n\n“I’ve asked you to make a wish, so make a wish. Stop talking crap!” Empty God’s face looked icy. He waved his hand, tearing a frightening rip in the fabric of space. Han Sen felt as if the world was shattering in front of him.\n\nEmpty God was a rather foul-tempered individual. At least King Jun usually tried to trick Han Sen, but Empty God couldn’t even be bothered to make the effort. He was just trying to blackmail Han Sen.\n\nHan Sen wasn’t about to let himself be intimidated, though. He understood the nature and some of the limitations of these self-proclaimed gods. He wouldn’t be pushed around that easily.\n\n“It seems that you don’t know me very well. It doesn’t matter how badly you want me to make a wish, because I’m not going to do it. What can you do to me, huh? If you really are God, you should be able to kill me pretty easily,” Han Sen growled, his expression unyielding.\n\nEmpty God looked surprised. Tearing space open with his bare hands should have startled Han Sen out of his wits. Even deifieds would be shocked speechless by Empty God’s power. But somehow, this brainless person was wholly unfazed by his display of strength. It made Empty God unsure of what to do.\n\nIf he had been able to attack, Empty God would have slapped Han Sen to death and stolen his memory. But he couldn’t attack Han Sen like that. Not in this universe, at least.\n\n“Very good.” Empty God didn’t say another word. He turned and left, vanishing after a few steps. And then, the broken space returned to normal.\n\n“These guys really can’t do anything in the geno universe. Maybe there are certain conditions that render them unable to attack. But even so, it means I’ll be alright even if all the gods become my enemies. As long as I don’t make a wish, they can’t do anything to me,” Han Sen thought to himself.\n\nBut the black crystal armor still hadn’t released the seal on his body, so Han Sen knew that Empty God hadn’t truly left the vicinity. Han Sen returned to the Star Tree, but Empty God remained hidden.\n\nNot long after, Exquisite and Li Keer brought Bao’er with them to the Star Tree. Han Sen’s stomach sank instantly. Empty God hadn’t been able to get anything from Han Sen, but the god might try to collect wishes from the people around Han Sen. Exquisite and Li Keer would be easier to break.\n\nHan Sen put his worries into the small jade figure so Exquisite and Li Keer could feel his worries and be wary.\n\nExquisite and Li Keer felt Han Sen’s concern, and so they asked what was going on. Han Sen told them about meeting Empty God and advised them to remain wary.\n\nWhile the three of them were talking, Bao’er climbed up the Star Tree. She was playing on the surface of a Star Fruit when suddenly, a man appeared on the branch next to her.\n\n“Little kid, do you want this?” Empty God was holding a beautiful gem. He smiled at Bao’er and swung the gem around as he spoke to her.\n\nHan Sen had been right to expect that Empty God would target the people around him, but he had misjudged which person Empty God would go after. The god hadn’t chosen Exquisite or Li Keer. He was aiming for the innocent Bao’er.\n\nBao’er looked at the shining gem in Empty God’s hands. Her eyes opened wide with surprise."
}