{
    "chapter": 1028,
    "title": "Ghost-Sword Comes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1028",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nNow that the ghost fox had been slain, Han Sen believed he could ransack Ghost Mountain alongside Little Silver.\n\nBut the silver fox, after receiving the Life Geno Essence, disappeared for a few days.\n\nHan Sen was still awfully weak, and was in no condition for solo travel. He thought the silver fox might have gone to the ghost fox’s den, but Han Sen had no idea where that might have been. Since it was too dangerous for him to venture there in such a weak state of body, he didn’t dare leave the shelter.\n\nAfter a period of rest and recovery, Han Sen found himself nearing full recuperation. But just as he was, he was alerted to the nearby presence of a swathe of angry creatures and spirits.\n\nThe leader was clad in black-iron armor, and he wielded a black-iron greatsword. He rode atop a lion, whose fur was also black.\n\nMany powerful creatures and spirits trailed behind him, as a wake.\n\nThey had come to the front of the shelter once before, but this was while Han Sen was back in the Alliance. The silver fox had been there at the time, and he managed to ward them off by incinerating a few.\n\nLearning a high number of creatures and spirits had come for them, Lin He and Lin Weiwei returned to the Alliance so they could fetch Han Sen.\n\nAfter returning to the sanctuary, Han Sen picked up Bao’er and ascended one of the shelter’s watchtowers. There, he used his Dongxuan Aura to measure the strength of those that sought to oppose him.\n\nAmongst the collective that had now gathered in front of the shelter, Han Sen espied the presence of a small sacred-blood creature that looked like a pigeon. This pleased him.\n\nSacred-blood creatures that were small in size were quite a rarity. He could finish that pigeon in one sitting, easy.\n\nThere were a few other sacred-blood creatures there as well, but they were too big and none tickled his fancy in particular. The second smallest was the black lion, but a preliminary examination suggested it would be inedible for him.\n\n“Contemptible humans; how dare you assault and claim my shelter for your own? Lay down your arms and submit to slavery and I will spare your lives. This is the only offer for such mercy you will receive,” Ghost-Sword Prince coldly proclaimed.\n\n“What do we do? Should we return to the Alliance?” Zhao Xin’s face seemed disturbed.\n\n“Don’t worry; it’s only a royal spirit.” After that, Han Sen turned his head to address the spirit below. He said, “Hm, this seems rote. How about we spice things up with a duel? If you defeat me, then by all means, enslave us all.”\n\n“Fine,” Ghost-Sword Prince agreed.\n\nHan Sen had embarrassed him, directly in front of his father, no less. Killing them all in a crude siege would have been too simple for Ghost-Sword Prince, so a duel for the regaining of the honor he thought he had lost was a concept he rather enjoyed.\n\nGhost-Sword did not think much of humans. He thought they weren’t very powerful, due to most of the human population being mere slaves in the Third God’s Sanctuary.\n\nAnd he wasn’t entirely wrong. Humans had become slaves to the overwhelming strength of spirits all across the Third God’s Sanctuary, and humans of some renown were in very short supply. / update by\n\nLuo Haitang was a human of renown, but his time had come and gone.\n\nHan Sen drew his Taia sword and leapt down to the grassy fields below. He said, “Come on, show me what you’ve got.”\n\nNo human could talk to him like that, or so he thought. Being addressed in such a boorish fashion enraged him, so he spared no time in trying to swing his black-iron greatsword down on Han Sen.\n\nIt was a geno weapon he wielded. It might not have had the glow or sheen that was typical of such weaponry, but it had a dark and imposing figure. The sword itself looked powerful and unbreakable.\n\nDong!\n\nHan Sen used his Blood-Pulse Sutra to perform a guard with Taia.\n\nThe force that came down on the sword was tremendous, and it knocked Han Sen back about ten feet. Still, Taia was left without a scratch.\n\n“You must have a death wish, to willingly fight one such as I.” After Ghost-Sword Prince finished speaking, he lunged forward for another strike.\n\nHan Sen knew his power was weaker than the Prince’s, who seemed reliant on the use of raw, physical damage. But since that was only one element of the fight, it didn’t concern him.\n\nHan Sen could have used super king spirit mode, but he didn’t want to. He thought it’d be a waste of time and strength, using it on a foe he didn’t deem worthy enough to be the recipient of its might.\n\nHan Sen used Aero and Double Fly, and attacked like a dive-bombing phoenix.\n\nSword-Ghost’s power was no joke, and each strike could have proven fatal if they met with their target. Fortunately, Han Sen was able to dodge each and every one, using stealth to insert hits of his own.\n\nGhost-Sword Prince felt as if he was doing battle with the air. Try as he might, he only broke the sky—he couldn’t touch Han Sen!\n\nHan Sen was silent the entire time, though. He was focused right now, and he was in the zone, entirely concentrated on honing and improving the skills he employed to fight the spirit.\n\nIt was difficult to find an opponent that was of a similar level as him, but here one was. If Han Sen had to take a guess, he’d assume the spirit had managed to unlock eight gene locks. He was nigh the perfect opponent to train and spar with.\n\n“Weiwei, it looks like Han Sen can make use of both Heavenly Go and Seven Twist,” Lin He said, correctly determining what moves Han Sen was making use of.\n\nLin Weiwei nodded, saying, “He learned Heavenly Go from Queen. As for Seven Twist, I have no idea where he learned that or from whom.”\n\nLin He, as he continued to watch, said, “Little Han is quite a talented young chap. Even though he has opened one gene lock less than the spirit he battles with, he can keep up just fine and surpass his opponent. Han Sen is clearly winning. He really is the best of the best.”\n\n“Where did that fox go, I wonder?” Lin Weiwei was worried about Ghost-Sword Prince not keeping to his promise if Han Sen won the fight. If the creatures in his command still attacked, she thought the fox would be of great service to them.\n\n“The fox isn’t here, and if that spirit does not stay true to his word and attacks us anyway, I’m not entirely sure we can hold this place.” Chen Hu had the same worry.\n\nAnd just as Chen Hu said this, Ghost-Sword Prince commanded his followers to commence an attack on the shelter."
}