{
    "chapter": 1901,
    "title": "Before the Testing Gold Rock",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1901",
    "text": "“If no one can compete against No Flower, this round will be over,” Moon Wheel King said, as he stood up.\n\nHe understood the thoughts of those from Moon Garden, though. He knew no one else from Moon Garden could compete with what they had just witnessed. So, he did not want to waste any further time. It’d only reflect poorly on the Rebate and Moon Garden.\n\n“Moon Wheel King, I would like to suggest a friend that may be able to compete against No Flower.” Du Lishe suddenly bowed before Moon Wheel King.\n\n“Lishe? What are you doing?” Rebecca pulled her sister back, unsure what preposterous thing her sister was about the attempt.\n\n“Lishe? Which student are you recommending?” Moon Wheel King was shocked by this. Du Lishe was his daughter, but he couldn’t imagine who she might be hoping to suggest.\n\n“Who I recommend is not someone privileged to be a member of Moon Garden. It is the student of Knife Queen, however. It is Han Sen of Planet Eclipse.” Du Lishe smiled.\n\nAfter that, Han Sen was frozen. Thus far, he had only been spectating. The rest of Narrow Moon was frozen, too. No one expected Du Lishe would request Han Sen like that.\n\nQing Li was taken aback, too. She pulled Du Lishe close and said, “What are you doing?”\n\n“Did you not say Han Sen’s words were far better than No Flower’s? If that is true, then I recommend he be the one to compete against No Flower. If he wins, he will only make the Rebate look better,” Du Lishe said.\n\n“That’s just what I thought. I don’t know for a fact that Han Sen really is better,” Qing Li said quickly.\n\nDu Lishe wore a mystic smile and said, “It does not matter, even if he does lose. He is not one of the Rebate, and he is not a member of Moon Garden. He can’t embarrass us, even if he fails.”\n\nQing Li did not know what to say to that. She stared at Du Lishe and said, “If he loses, it will embarrass Knife Queen. That’d be even worse!”\n\nBefore Du Lishe could say something more, Moon Wheel King frowned on stage and said, “Han Sen is not on the member list.”\n\n“Moon Wheel King, I have heard about Knife Queen’s student. If we can truly compete and compare our techniques, I would relish the chance.” No Flower bowed before Moon Wheel King.\n\nWhen Speechless and No Flower returned from Planet Eclipse, they talked between each other about how they might get to know Han Sen more. The best way to do that was to force him on stage and challenge him to such a competition.\n\nHearing Du Lishe suggest Han Sen, the eyes of Speechless and No Flower gleamed with radiance. They wouldn’t let this opportunity slip away. Before Speechless herself agreed, No Flower was agreeing.\n\nSince No Flower agreed, though, Moon Wheel King had no choice but to ask, “Is Han Sen even here?”\n\n“Yes, I am.” Han Sen stood up and bowed before Moon Wheel King.\n\n“Are you willing to compete against No Flower?” Moon Wheel King asked.\n\n“I am willing to,” Han Sen answered. And it shocked everyone around the stage.\n\nEven Yisha, who was on Planet Blade, was flabbergasted to hear Han Sen agree to compete against No Flower.\n\nHan Sen thought that Yisha had let him come so that he could prove himself. He thought this had already been prearranged, and that’s why he accepted the challenge so quickly. So, he had already prepared to show-off again and make Yisha take him even more seriously as a student. He hoped she would be willing to spend even more resources on his development.\n\nYisha actually wanted Han Sen to earn her some extra reputation, but No Flower’s Touching Flower Finger was incredibly strong. It’d be difficult to find a King class person to compete with that. So, she didn’t expect this would be what Han Sen would agree to so soon.\n\n“In that case, you can come on stage and compete against No Flower.” Moon Wheel King thought Du Lishe was trying to prank Han Sen, and that was why he asked Han Sen if he was willing to do it. It’d also give Han Sen the chance to avoid participation.\n\nBut Han Sen was really willing to go on stage, and that shocked Moon Wheel King. Han Sen walked toward the stage, then stepped up to the testing gold rock.\n\n“Amitabha! Mister Han, we meet again! To be able to compete against you in the display of geno arts is a grand honor,” No Flower nodded and said.\n\n“Are you being polite?” Han Sen asked, as he walked closer to the testing gold rock. He wasn’t keen on talking too much with the Buddha.\n\nSpeechless looked at Han Sen. She really wanted to see how Han Sen would choose to compete with No Flower. She didn’t believe he could actually have a skill that exceeded what they had just witnessed, though.\n\nNo matter what the case might be, this was a fine opportunity to observe Han Sen. Speechless watched intently, not wanting to miss out on a single detail.\n\nMany Nobles of Narrow Moon were not happy with the concept of Han Sen actually going on stage.\n\n“He is just a Baron. He is actually going to compete with No Flower? Even if you used your *ss to think, you’d know that this won’t end well.”\n\n“Yeah, he’s not a member of Moon Garden. To hear him actually be recommended… Why would Du Lishe invite him? Does she want to embarrass him?”\n\n“And why didn’t Han Sen just say no when Moon Wheel King asked him? It’d be better than being humiliated here.”\n\n“Yeah, I don’t know what he is thinking. He is just a Baron, after all. He actually thinks his skills can rival those of No Flower, which were learned from a Buddha King? He’s just asking to get beaten.”\n\n“He is cocky. Far too cocky. He got a King class knife and practiced Teeth knife, but so what? His confidence grew way too quickly, and he is acting far too big for his britches.”\n\n“He is brave, but obviously stupid.”\n\n“This will be very embarrassing. Han Sen going up against No Flower is like a fake product being taste-tested in a face- off versus the real thing.”\n\n“If he can go up there, I can do it, too. At least I’m a Viscount!”\n\n“Not even an Earl would be able to do much versus that. I felt the will earlier, and it was really crushing.”\n\nRebecca frowned and scolded Du Lishe. “This has gone too far! Although Han Sen is not a member of Moon Garden, he is now representing the Rebate in this competition. It will be embarrassing for us if he loses.”\n\nDu Lishe shrugged and said, “You can’t blame this on me. He is the one who decided to come up here. He could have said no. It’s not my fault that he insisted.”\n\nQing Li thought about things for a moment, and then said, “If Han Sen was willing to go, that also means he is confident about winning. Maybe he really does have a mind that was stronger than No Flower’s.”\n\n“Impossible!” Rebecca and Du Lishe said at the same time. They did not believe Han Sen could beat No Flower. No Flower was so strong, it was like he was cheating.\n\nDu Lishe recommended Han Sen just for fun, though. She didn’t expect he’d win.\n\nIt wasn’t just Rebecca and Du Lishe thinking this way, however. Most of the Rebate didn’t think he’d win, either. Not even Moon Wheel King and Yisha herself.\n\nHan Sen didn’t trouble his mind with all this, though. He had a plan. He walked up to the testing gold rock and had a look at what No Flower had written. With his finger, he drew on the other side."
}