{
    "chapter": 2499,
    "title": "Ghost Knife Skill",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2499",
    "text": "Han Sen mulled over how Teacher Ancient Abyss could so accurately calculate his proposed escape route. Telling Bai Wuchang where to wait for Han Sen might not have been all that difficult because Teacher Ancient Abyss was a smart person. Especially since Han Sen’s journey hadn’t been particularly leisurely; pursuers had been hot on his heels the whole time. It made him alert.\n\n“Enough of this! Come fight me. I’m going to win this time,” Bai Wuchang’s said, as the power within him exploded. His entire body took on a golden glow. It was his Ghost King Body.\n\n“What a strong power. You leveled up to become half-deified?” Han Sen looked at Bai Wuchang with shock. Bai Wuchang’s leveling speed was too fast.\n\nBai Wuchang coldly said, “Extreme Mountain’s life and death practice. I’m not the old me anymore. I won’t lose this time.”\n\n“I’m sorry if this sounds too straightforward, but even if you are half-deified, I think you’ll end up quite disappointed if you expect to beat me with just your Ghost King Body,” Han Sen said while looking at Bai Wuchang.\n\nBai Wuchang stared at Han Sen. He responded slowly, word by word. “Come fight me. As I said, I’m not going to lose.”\n\nHan Sen didn’t say anything. He just drew his Ghost Teeth Knife. He used Fang and slashed toward Bai Wuchang. In addition to the Teeth power in his knife, he also used Spell’s Eternity solidifying powers.\n\nBai Wuchang’s Ghost King Body could ignore all physical and energy attacks. It couldn’t block the Eternity solidifying power, though.\n\nFang Qing Yu brought out the Wanjie Rubix Cube that Han Sen had given back to him. He began filming the fight between Han Sen and Bai Wuchang. It was merely a recording, though. He wasn’t streaming it right now.\n\nFang Qing Yu knew he couldn’t risk exposing their location. If he did, the Extreme King would come, and they would all end up very dead.\n\nBai Wuchang frowned upon seeing Han Sen’s slash. He reached out an empty hand and pulled a long blue knife out of nothing. He swung it to collide with Han Sen’s Ghost Teeth Knife.\n\nHan Sen saw the rival knife coming to hit Ghost Teeth Knife, and his eyes narrowed suddenly. Instead of continuing his strike, he spun his Ghost Teeth Knife to shield his left side.\n\nFang Qing Yu and the pirates stared with wide eyes. They thought that Han Sen must have gone insane. Han Sen had chosen not to block Bai Wuchang’s knife; Han Sen had no guard, and he just used his knife to protect the left side of his neck.\n\nNo matter how they saw it, Han Sen looked crazy. Blocking like that was bound to get him killed.\n\nDong!\n\nBut the next second, they heard the sharp sound of metal knives colliding with one another.\n\nBai Wuchang had seen Han Sen slashing forward, but then the knife had appeared next to Han Sen’s neck just in time to block Bai Wuchang’s real strike. If Han Sen’s Ghost Teeth Knife had been any slower, the attack would have come down on Han Sen’s neck.\n\nFang Qing Yu and the others were shocked, and their mouths were wide open in awe. They didn’t understand what they were seeing.\n\nAfter that knife strike, Bai Wuchang used his other knife skills. His long knife was so weird, and it was pointless to follow the trail of the knife. Every time a strike was unleashed, it would appear in a different place. It was like the knife could teleport through space.\n\nFang Qing Yu wasn’t fast enough to follow what was going on. He had to film it all, for now, so they could slow it down later. But he still didn’t understand what Bai Wuchang’s knife skills were.\n\nHis knife could appear out of space anywhere. There was no sign of it coming, which made it scarier than a ghost. It was like the reaper’s scythe. It harvested lives before its prey even knew it was coming.\n\nFang Qing Yu slowed down the video, then he slowed it down again, and again, and again. But still, he couldn’t determine how Bai Wuchang was using his long knife.\n\nThe more shocking thing, though, was that Han Sen was able to block all of Bai Wuchang’s attacks. Wherever Bai Wuchang’s knife appeared, Han Sen’s Ghost Teeth Knife could show up in the same place to counter the blow.\n\nIf Bai Wuchang’s knife skills were an unpredictable ghost, then Han Sen’s knife skills were those of a god. A god that knew everything.\n\nBai Wuchang’s body kept appearing and disappearing. He was a raging storm against the wave-breaking Han Sen. His knife flashed everywhere, defying logic and reason.\n\nHan Sen was hovering in space. He used his Ghost Teeth Knife to block left and right. He moved smoothly, somehow perfectly anticipating and intercepting his enemy’s non-knife. He was like a god that knew everything. Those weird knife skills didn’t rattle him at all.\n\n“Mister Captain is too strong! If that was me, my head would have been off a long time ago. I wouldn’t even have known how I died.”\n\n“Mister Captain is like some omniscient god. How does he predict where that knife will show up? He looks like a prophet out there. He is too strong.”\n\n“This Extreme King Prince Bai Wuchang, who is oh-so-professional and talented, is lame when compared to Han Sen. He cannot fight the big captain.”\n\n“Long live Mister Captain… ah… And let us wish Little Captain a long life, too! Long life! Long life!” The pirate, seeing Bao’er stare at him, immediately added her praise.\n\nThrough all of this, though, Bai Wuchang was demonstrating a truly shocking amount of improvement. When he was in Extreme Mountain, risking his life, he had pushed his Ghost King Body to the max. He had broken through under his own power and learned the real Ghost Knife skills.\n\nThose Ghost Knife skills could go through the underworld as easily as they did the real world. People couldn’t predict when and where the knife would land, but Han Sen could see through the dimensions. No matter where the knife came from, he’d be there to block it.\n\nBai Wuchang pushed his Ghost Teeth Knife to the max. He still couldn’t hurt Han Sen.\n\nBai Wuchang suddenly pulled his knife back and withdrew. Still looking at Han Sen, he said, “You’re very strong. You’re much stronger than I expected.”\n\n“You aren’t bad, either. You’re getting good,” Han Sen replied levelly.\n\nNormal people couldn’t see the ghost knife that popped up through the fabric of space, but Han Sen’s Dongxuan Area could see through all the cogwheel changes that transpired in an area. When the ghost knife came out of the nothingness, it would trigger the universal cogwheel that was connected to it. That meant Han Sen was being given a warning each time. So, Bai Wuchang’s Ghost Knife skill didn’t work against him.\n\nIf Han Sen used his Dongxuan Area to lock the universal cogwheels in their vicinity, Bai Wuchang’s knife would never reappear from space.\n\nHan Sen was curious about Bai Wuchang’s Ghost Knife skill, and that was why he had yet to attack. He let Bai Wuchang keep casting his Ghost Knife skill against him so he could observe.\n\n“Now I can use this skill without worry.” Bai Wuchang acted as if he hadn’t heard Han Sen. He looked down at his knife.\n\n“Which skill?” Han Sen asked.\n\n“The skill I learned from the Extreme Mountain peak. It is the one that can determine life or death,” Bai Wuchang said slowly. His eyes looked like they were on fire. A weird power rose in him and his knife."
}