{
    "chapter": 36,
    "title": "Archery Master",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_36",
    "text": "\"Yuan, you can let us go, but according to our contract, this is a breach. You will have to pay us the rest of the money,\" sneered Liu Feng.\n\n\"Just go.\" Yuan threw a few stacks of money at them and didn’t look at them again.\n\nLiu Feng and the rest picked up the money. Although they were angry, they didn’t dare to harm the clients because they knew who these young clients were. They gazed at Han Sen and said, \"Misters, we are far from the shelter, so please be careful, as you are trusting someone unreliable.\"\n\n\"He is a hundred times more reliable than you,\" Yuan replied.\n\nThe hired ones didn’t dare to express their anger in front of Yuan, so they just left.\n\n\"Ass... your arrow was so powerful...\" commended Qing after the rest were chased away. He didn’t want to call Han Sen Ass Freak but awkwardly discovered that he didn’t know his name.\n\n\"His rating must have reached 7.0 to use Doomsday. Of course it was powerful,\" said Yuan.\n\n\"7.0? But they said that he...\" Qing and the other clients looked at Han Sen and his bow, unconvinced.\n\nAfter all, the story of Ass Freak was so well-known that even they knew about it.\n\n\"I mean at least 7.0. He shot so many arrows in practice, and if his strength hadn’t reached 8.0, it would certainly not be so easy for him,\" Yuan said, looking at Han Sen.\n\n\"8.0!\" They were even more surprised and kept looking at Han Sen as if they hadn’t seen him before.\n\nAnyone with an 8.0 rating would be rather advanced in First God’s Sanctuary, so they couldn’t believe Ass Freak would be so strong.\n\n\"Let me try your bow?\" One client still didn’t believe Yuan’s words.\n\nHan Sen smiled and handed Doomsday to him. The young client held it with both hands and tried to pull the string, but the string didn’t even move. He tried a few times more and still failed to draw the string. Although they graduated from top schools and had practiced hyper geno arts as kids, their bodies hadn’t been modified by geno points, so their strength could reach 3.5 at best, which was far below the requirement to use Doomsday.\n\n\"You are so weak. Let me.\" Another client could not stand to watch and grabbed the bow. He too had failed after a few tries.\n\nEveryone gave it a shot except for Yuan, and none could draw the string. Only then had they felt impressed by Han Sen.\n\nArchery was practiced by very few people and required a lot of effort. So most people didn’t know much about bows and arrows, let alone how good Doomsday was. For example, Han Hao and his friends had no idea that Han Sen’s bow was worth millions, or they wouldn’t have ridiculed him like that.\n\nThe clients stopped underestimating Han Sen, not least because Han Sen also had saved Qing’s life. They asked his name and called him \"Sen\" from then on.\n\nAfter all, God’s Sanctuary was a world where only the strong were respected, and Han Sen's archery and strength were truly impressive.\n\n\"Sen, would you show us real archery skills?\" Qing proposed. All the other clients looked at Han Sen with great anticipation.\n\n\"My archery skills are just ordinary,\" Hansen laughed.\n\n\"Don’t be modest. When one is being too modest, one is actually proud,\" Qing said.\n\n\"OK, I will try to shoot then.\" Han Sen also itched to exercise his skills. Since he received Doomsday, he hadn’t tested its limits yet.\n\nThe clients were overjoyed. Han Sen looked around and walked to a hillside. He aimed at something and slowly drew a Saber arrow. As he drew the string, blue and swollen veins popped on his arms. The arrow left the string in the blink of an eye and disappeared in the woods.\n\n\"Did he miss?\" Qing and others didn’t hear any prey being hit and thought he had missed.\n\n\"It is too far away. The woods must be at least 400 yards from here. It is understandable to miss,\" said Qing.\n\n\"Come on, let's go and find out,\" Han Sen said and walked down the hill into the woods.\n\nThe clients followed with suspicion. A hundred meters into the woods, they saw a spotted beast nailed on a tree with an arrow through its head.\n\n\"No wonder we did not hear a thing. The arrow directly destroyed the nerves of the spotted beast and it didn’t even have time to shriek.\" Everyone was so impressed. It was at least 400 yards from where Han Sen had been standing, and the beast was killed with just one shot. Han Sen’s archery must be among the best in First God’s Sanctuary.\n\nAfter that, all the clients worshiped Hansen and did everything he said. Han Sen protected them for half a month and received 150,000 in cash.\n\nThe clients wanted to sign a long-term contract with Han Sen, but he declined. He was only short of money at the moment. In the long run, he still needed to focus on his own evolution.\n\nHan Sen returned to Steel Armor Shelter alone and was stopped by those who had been chased away by Yuan at the gate. These men were led by Liu Feng, and Han Hao was also among them.\n\n\"Ass Freak, you have really pissed me off. How can you make it up to me?\" asked Liu Feng, cracking his knuckles while slowly approaching Han Sen."
}