{
    "chapter": 2260,
    "title": "Haven",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2260",
    "text": "“If the sanctuaries that Fox Queen mentioned are the sanctuaries that I came from, then the undying spirits she mentioned might be the spirits that I’m familiar with. Only the spirits in the sanctuaries are capable of living forever. If they are killed, they can always respawn at their spirit stone. As long as the spirit stone remains intact, they can live forever.” Han Sen believed those spirits were the spirits that the Sacred Leader had researched.\n\nWhen Han Sen considered this research, he thought of two distinct possibilities. One possibility was that the Sacred Leader was merely researching their means of living forever. The other was that the spirits were actually products of that research, created by the Sacred Leader himself.\n\nRegardless of which explanation was true, the Sacred Leader’s research ultimately failed. Otherwise, he would not have died.\n\nXie Qing King was one of the spirits that Han Sen had known longest. In the sanctuaries, he could never die.\n\nHan Sen had once asked Xie Qing King about this, and he was told that when the spirit entered the Alliance’s universe, he became disconnected from the spirit stone. Xie Qing King believed that if he died now, he could never come back.\n\nHan Sen wanted to ask Fox Queen more about the sanctuaries, but that was all she knew. She had learned most of what she knew by overhearing General Ghost Bone’s musings.\n\nHan Sen regretted having killed General Ghost Bone so easily. If he had been able to speak further with the ancient elite, there was the chance that the man might have answered many of Han Sen’s questions.\n\nBut the black crystal’s power was beyond Han Sen’s control. General Ghost Bone had acted rashly, and at the end of the day, Han Sen wasn’t the one to blame.\n\nThey lapsed into silence for a while before Fox Queen said, “I would guess that the Ghost Bone Town you saw was the haven of the Sacred Leader. The place was probably named Ghost Bone Town to disguise its true purpose.”\n\n“What is a haven, exactly?” Han Sen had heard the term mentioned many times, but he was unclear about what it actually meant.\n\nFox Queen replied slowly, “The idea is a little complicated, as it can be used for many different situations. Simply put, the Sacred Leader found a way in which he might live forever. But he hadn’t developed it enough to be usable. It was something that would require some time.”\n\n“But I didn’t see anything special in that town except for a broken pool,” Han Sen said.\n\nFox Queen smiled and said, “It was a secret project. Do you really think it would be so easy to find? The town was probably just some a facade or entranceway to the real haven. There might have been an item there that would allow you to access the haven. You might have to search the place more thoroughly.”\n\n“What Fox Queen said doesn’t match up with what General Ghost Bone told me. He said that the holy monument lies someplace else,” Han Sen thought. Then he asked, “But I saw General Ghost Bone’s statue there, and it was merely guarding the gate. There was another statue inside. Was that the Sacred Leader?”\n\nHan Sen described the human emperor statue once, and then he waited for Fox Queen’s answer.\n\nFox Queen shook her head. “To be honest with you, I never saw the Sacred Leader. I’m afraid that not even all of the top ten generals were permitted to see what the Sacred Leader actually looked like.”\n\n“How is that possible?” Han Sen looked at Fox Queen in disbelief.\n\n“It’s not that strange, really. The Sacred Leader was always clad in armor that hid his face. No one even knew if the Sacred Leader was a man or a woman. All I know is that his shape wasn’t too different from yours or mine. But that was just the shape that could be discerned through his armor, after all. With his strength, it wouldn’t have been difficult for him to change his body or even reshape his genes,” Fox Queen said.\n\nThere was little more that Fox Queen could tell him. Although she wanted to continue the conversation, she didn’t actually know very much. She could only relay the offhand comments and casual references that she remembered from her time with General Ghost Bone.\n\nHan Sen examined the chains that held Fox Queen. When he needed a break, he went to White Bone Hell to practice. He used The Story of Genes to refine the Ghost Bone power.\n\nHan Sen put off practicing his Dongxuan Sutra for the moment, as The Story of Genes required non-native power, and that was what he currently had.\n\nThe blood kirin, when it noticed Han Sen’s return, immediately emerged from the lotus mountain. It grabbed another one of those blood pears and came running over to Han Sen.\n\nHan Sen tried to get closer to the blood kirin, as it didn’t seem hostile at all. It made Han Sen feel rather joyful. “Maybe I really can tame this thing. If I had this King class fighter on my side, perhaps I could square-off against enemies like Edward.”\n\nHan Sen tried to touch the blood kirin, and when he did, the blood kirin didn’t shy away. Still, it was a very withdrawn creature, and getting close to it was difficult.\n\n…\n\nAt the same time, Edward and the others finally found the door of the palace. They were unable to open it, however, so they were still stuck outside.\n\n“Why is there a palace here? Did the Sacred Leader leave it behind?” asked a King class Ice Blue Knight.\n\n“Look at the architecture of this place. I don’t think it belonged to the Sacred Leader. If I’m not mistaken, this place’s style is reminiscent of General Ghost Bone’s handiwork,” Mister White said.\n\n“Regardless of who built this palace, we must find a way to get it open. We cannot go to the monument without the relic that Han Sen took.” Edward looked at Mister White. “Mister White, you are very good when it comes to unraveling restrictions. Do you have a way to open the palace’s gate?”\n\n“This palace’s walls are profoundly special. I have never encountered anything like this before. Breaking it might take a few decades, perhaps even a century!” Mister White exclaimed.\n\n“That would take too long. Is there a faster way?” Ice Blue Knight King asked.\n\nMister White rubbed his chin in thought. “The best way to get inside would be to force open a small section of the construct. If we combine all our power, then that might work. But first, we will have to make some preparations. And for that, I will require everyone’s cooperation.”\n\n“I will listen to whatever it is you have to tell us.” Edward and Ice Blue Knight King nodded.\n\n“I need some things that aren’t currently available in the base, so I will have to go elsewhere to fetch them. It will probably take me about a month. In the meantime, I would like you guys to stay on guard here,” Mister White said.\n\nMister White then took Crime with him and left. Ice Blue Knight King and Edward remained close to the palace, in case Han Sen ducked out and tried to escape.\n\n…\n\nAs Han Sen spoke casually with Fox Queen, he kept his focus on the structure of the prison itself. Almost unexpectedly, he found a way in which he could save Fox Queen, too.\n\nBut Han Sen didn’t really want to save Fox Queen. It would only bring him harm. Who knew if she would wish to attack Han Sen the moment she got free?\n\nThe Shapeshifting Foxes weren’t the nicest of races, and she only spoke to Han Sen so much because she had been trapped there for so long and become profoundly bored. Who knew what she would do when she had her freedom?\n\nHan Sen knew that the beautiful Shapeshifting Foxes had arranged the downfall of entire races. More than a few species had become extinct because of them. That was another reason why Han Sen didn’t want to talk to Fox Queen too much."
}