{
    "chapter": 3034,
    "title": "Legendary Gene Egg",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3034",
    "text": "“Found it… I finally found it… So many people died… We finally found it…”\n\nIn a very dark underground cave, an underground river led to a waterfall. It had a very deep drop. A booming sound echoed to the very bottom of the water.\n\nIf one looked closer, one would see that the underground river’s water was red. Bloody dragons roaring. All in all, there were nine of them.\n\nEight people wearing rugged clothing stood next to the water. They stared into the water. All of them seemed to be extremely excited. As they stood there, their bodies shivered and shook.\n\n“Mister Yang, what is that thing in the water?” A middle-aged man looked at an elderly fellow with white hair. His vocal cords were trembling as he asked the question.\n\nThe elder, who was called Mister Yang, looked around. He looked for a while and said, “This is certainly the place where the blood dragon returned to its nest. It is a place where the pulse is loud and clear. There is no doubting it. There truly must be a top-class gene egg inside there. The only thing I do not know is if it truly is the gene egg King Qin buried and the one that we are searching for. I have no idea, but you will have to figure that out for yourself, Mister Meng.” “I have faith. This has to be the right place. This must be where King Qin buried the gene egg. The gene egg must be in the water. Hurry up, go in there and pick up the gene egg.” Mister Meng saw the red light under the waterfall’s red basin, so hurried the others to go take a dunk and see precisely what it was.\n\nThe people were a bit scared. With Mister Meng’s authority, they had no choice but to jump into the blood pool. They swam to the red light below the surface of the basin. Only Mister Meng and Mister Yang stood away and watched the pool.\n\nNot long later, the six people emerged from the water. Together, they exited the pool and brought forth the fabled item they had been in search of. It was a giant egg that was three-feet big.\n\nWhen the egg-shaped item was brought out of the basin, the water’s light disappeared. Only the egg remained glowing with a red light. The giant egg was like a bloody jade. It looked good.\n\nSeeing the weirdly pretty, big egg, everyone looked at it with greedy obsession. Mister Meng was so excited that he started talking nonsense. “This must be right. This is the gene egg. King Qin was born with bad blood. He was bullied when he was young. His sister Wan’er had very special blood that provided immeasurable talent. To help her brother, Wan’er gave King Qin her own blood. Then, they created the Qin Kingdom. But Wan’er lost her blood and became rubbish that could not practice. She got ill and died. If Wan’er had not lost her blood, she would have never become sick. King Qin blamed himself for that. He was miserable. It drove him absolutely crazy. He tried everything to make Wan’er come back to life. Everyone knew the Qin Kingdom was searching for immortality, but people never knew that it was not for himself. He did this for his dead sister Wan’er. King Qin found this legendary, top-class gene egg. He was hoping the gene power could make Wan’er come back to life.”\n\n“But their people could not come back to life. Wan’er was unable to be brought back to life. Without Wan’er, the entire world seemed to be pointless to King Qin. He threw away the gene egg. My ancestors were royal guards for King Qin. They knew that King Qin wanted to revive Wan’er here in this ancient, big god mountain. He knew that King Qin did not take the gene egg and never returned to this place again. Our ancestors did not really know where it was exactly though. After all, many generations have passed, and all those people died. I have finally found this gene egg. With this gene egg… The Meng family will become very famous…” After finishing talking, Mister Meng laughed. “Argh…” Before Mister Meng could put an end to his cackling, someone in the team screamed horribly. Soon after, it was not just a single person letting out cries. Each of the six people that had collected the gene egg from the bloody basin was on the ground screaming and rolling in tremendous agony.\n\nMister Meng and Mister Yang were in shock by what was happening. People were writhing across the ground. Their bodies were rolling really quickly. They kept going on and on until they melted into blood water.\n\n“Mister… Save… Save us…” A few people reached out their hands. They were feeling extreme pain. They wanted to ask Mister Meng for help. Before they finished, they died.\n\nTheir bones started to rot and become liquid. Within the blink of an eye, the six of them had turned into six puddles of blood water. There was not a single tuft of hair spared from the dissolution of their bodies.\n\nMister Meng and Mister Yang were shocked by this. They tested the river water and did not discover anything weird. For this to happen so suddenly, it really was quite weird.\n\nMister Meng was glad he had not touched the water in the pool.\n\n“Mister Yang, please help me take the gene egg back,” Mister Meng said to Mister Yang. Mister Yang’s face froze. He had a wry smile. “Mister Meng, I am just a mister. I did not practice.” Mister Meng’s eyes glistened as he said, “Do not worry, Mister Yang. They died because they touched the blood water. The gene egg by itself is fine. You do not need to worry.”\n\nMister Yang thought, “If it is fine, then why don’t you carry it yourself?” Although he thought that, Mister Yang could not refuse. Under Mister Meng’s watch, he had no choice but to carefully walk toward the big red jade-like egg.\n\nAlthough the big egg was clean and had no blood water on it, Mister Yang did not attempt to touch it. He took off his clothes and wrapped them around the big egg. He tied a knot and picked it up. He was going to carry the big egg. When Mister Yang exerted strength, a “katcha” noise was heard. The jade-like big egg cracked. The crack was spreading across the egg’s shell.\n\nMister Yang and Mister Meng were shocked. After a second, Mister Meng was excited. “God helped the Meng family. I never expected the gene egg to hatch now. I wonder what creature this legendary gene egg holds inside it.”\n\nMister Yang looked at the cracked gene egg and said, “King Qin was the king of the Qin Kingdom. It was so long ago. Everything about him was just a legend. If the legends are true, this gene egg can hatch us a very rare gene\n\nrace.”\n\nWhile they were talking, there was another “katcha” noise. The big egg’s crack was spreading. The red jade-like eggshell fell onto the floor in pieces.\n\nMister Yang and Mister Meng looked at the broken eggshell with their eyes wide open. They were immediately frozen.\n\nA man who looked about 20 years old was inside the eggshell. He had black hair and crystal skin. He was curled up as if he had been sleeping.\n\n“Human… Humanoid… Gene race…” Mister Meng was so excited that his voice trembled."
}