{
    "chapter": 1013,
    "title": "Human Elite",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1013",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAll the wolves had left. Before the group of travelers also continued their journey, they gathered up the carcasses of the slain wolf kings, and a few mutant ones, to take with them.\n\nThey traveled with greater care from then on, but met no more resistance from the forest’s occupants. Four days later, they found the other end of that place.\n\nWhen it was time for supper, nobody touched the meat of the wolf kings. They only dined on the mutant flesh.\n\nHan Sen offered for them to eat whatever they desired, but Chen Hu told him, “You saved our hides multiple times back there. These wolf kings were slain by your hands only. How could we ever have the audacity to eat your food, on top of what you have already done for us?”\n\nIt was a nice gesture, but Han Sen didn’t really care much for the meat. He could now kill sacred-blood creatures whenever he desired. And besides, with the size of those wolves, it’d most likely take him an entire month to eat them. If they didn’t want to eat them, though, he wasn’t going to push it.\n\nDespite leaving the lightning forest behind, they were still on Ghost Mountain. They reached a valley, eventually, where a rapid river rushed through.\n\nWhile they held a discussion about which way to proceed, they espied the presence of a turtle riding the stream. On its back was a human.\n\n“Is that a human or a spirit?” Lin He asked Han Sen, who was now regarded as their boss.\n\nHan Sen was able to tell them. The turtle was a sacred-blood creature, and the man atop was indeed human. He could tell that the man had greater strength than the creature he was using as a surfboard.\n\nSeeing a human riding a creature in such a manner was a little strange, Han Sen thought.\n\n“He’s human,” Han Sen said as he watched the man.\n\n“Does that mean there might be a human shelter nearby?” Chen Hu’s excitement flared up.\n\nThey had managed to get through the lightning forest unscathed, though not for lack of effort on the part of the wolves. But they still wondered why they had been let go, when the super creature showed up and looked likely to attack.\n\nWhatever had occurred, the timing of the wolves’ withdraw was impeccable. And they did not think such good fortune could arise again.\n\nThe man on the turtle saw the collective watching him, and he decided to approach. When he got closer, he said, “Uncle San and Weiwei; long time no see!”\n\n“You know this man?” Chen Hu asked.\n\nLin Weiwei nodded and said, “Yes, this is Liu Yuxuan from Baojin Mining. He has been in the Third God’s Shelter for only six years, and in that time, he has already opened eight gene locks. He is a genius, and I can’t say I expected him to be here on Ghost Mountain.”\n\nLiu Yuxuan quickly started a discussion with them, while ignoring all the others.\n\n“Tell me, Weiwei; what brings you here? This place is dangerous, even for mighty elites such as myself,” Liu Yuxuan spoke smugly.\n\nLiu Yuxuan was hitting on Lin Weiwei, that much was obvious.\n\nAfter the question, Lin Weiwei explained to him the events that had transpired and put them on their present course. Then, she asked, “Is there a human shelter in the nearby vicinity?”\n\nLiu Yuxuan shook his head and said, “Humans cannot dream of owning a shelter anywhere near this wretched place. There is a king-class shelter, mind you. But it is owned by a spirit, one with whom I signed a contract.”\n\n“Brother Liu, can you tell us which direction we might be able to go to escape this place?” People did not think poorly of him for being the slave of a spirit. It was far more common for humans to sign contracts with spirits in the Third God’s Shelter, than to have absolute freedom with those of your own kind. Survival was the name of the game, after all.\n\nLiu Yuxuan shook his head and said, “You wish to escape this place? I don’t think that’s possible. I’m surprised to see you haven’t been eaten by the wolf king yet, but that’s not the only super creature you should be worrying about. There are quite a few populating this mountain, and to escape their notice will be quite the task. An impossible one.” Liu Yuxuan paused for a moment, and then went on to say, “Weiwei, why don’t you and your fellows come with me? I’m a valued member of the king spirit shelter, and I can vouch for you all. You will be safe there.”\n\nLin Weiwei frowned. Going there would only reduce their chances of escaping that mountain.\n\nThey had risked everything and lost so much, all in the name of maintaining a hold on their freedom. Going into the service of a spirit would be like throwing in the towel, and it wouldn’t feel right submitting now.\n\nLiu Yuxuan looked at Lin He and made an offer, “Uncle San, I believe you are well aware of the dangers this mountain poses. Even our king spirit master would not lurk in the territories ruled by the super creatures of this place. If you come with me, I can assure you that you will be treated well.”\n\nLin He turned around and asked, “What do you think, Little Han?”\n\nLiu Yuxuan saw Lin He ask Han Sen, and thought it strange. He looked at the young man a little more closely, as he had initially believed him to be another random nobody.\n\n“This is…?” Liu Yuxuan asked Lin He.\n\nLin He introduced Han Sen by saying, “This is President Ji’s son-in-law, Han Sen. We joined forces on the slopes of this mountain, after a chance encounter.”\n\n“I have heard of him before, yes. I never expected the name Han Sen to be the label of a young boy such as yourself.” Liu Yuxuan feigned politeness, but the ignorance behind his words was clear to hear.\n\nAfter smirking at Liu Yuxuan for a second, Han Sen turned to face Lin He and answered his question. “I’m not seeking employment with any spirit. I still want to leave this mountain of my own accord.”\n\nHan Sen would sooner die than submit to slavery under some spirit. If anything, he would be a slave-driver of spirits.\n\nOf course, Han Sen knew his powers weren’t the best they could be. What’s more, the instability and imbalance of his powers could be problematic. He didn’t have what it took to conquer a king spirit shelter just yet.\n\n( )\n\nLiu Yuxuan looked at Han Sen with disdain and said, “Pah! A typical noob outlook on things. I’m afraid you have yet to learn the way things go in this sanctuary, and how powerful the spirits of this place truly are. Without the power and support of many, you aren’t likely to last out there. Folks who fly solo never last, and even a person such as I, with eight gene locks open, knows it’s better to get along with spirits than to fight them.”"
}