{
    "chapter": 2462,
    "title": "Real or Fake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2462",
    "text": "Han Sen didn’t speak. He quickly turned around and activated his Area.\n\nHan Sen caught his breath. The woman was standing not too far behind Han Sen, and she was smiling.\n\nHer lifeforce was very strong now, and as far as he could tell, it was identical to that of the woman in the wooden house. He could barely believe that this was the body that had been lying on the ground only moments before.\n\n“What? We parted ways such a short time ago, and you’ve already forgotten me?” The woman smiled.\n\nHan Sen opened his mouth to ask if the woman before him was a human or a ghost, but then he remembered that the other woman had told him that under no circumstances should he speak. He still didn’t understand what was up with this other woman, but he didn’t talk. He simply looked at her.\n\nThe woman laughed and said, “You are being careful. I told you that you couldn’t talk when you were in the presence of the light, but now that I’m free, you can go ahead and speak.”\n\nHan Sen still didn’t say a word. He just stared at the woman, stunned by how similar the two were. Aside from wearing different clothes, they looked precisely the same.\n\nHan Sen really wanted to ask her what was going on, but he didn’t dare speak. He thought about it some more, and he decided to write down some words with his Ghost Teeth Knife. “Why are you here?”\n\n“You are being very careful.” The woman chuckled darkly. “This is my real body. It was trapped here. What you met earlier was just a doll with my spirit inside it. How else do you think I have managed to live so long? Not many beings from the era of Sacred are still alive. Anyone that has survived this long is most likely making use of forbidden skills.”\n\nHan Sen carved more words into the ground. “You suppressed your body here?”\n\nThe woman lifted her lips. “I didn’t want to hurt myself, so why would I bind myself here? Someone else did this to me, and so my real body was trapped here. But because of that suppression, my body didn’t age. It still looks the same as it did back then.”\n\n“Why didn’t you find anyone else to dig up your body before me?” Han Sen asked by carving more words.\n\n“Are you done yet? If you don’t want to go, that’s fine. But I’m leaving,” the woman said. She proceeded to walk down the mountain, ignoring Han Sen.\n\nHan Sen had almost broken through the entire mountaintop, but the woman was descending quickly from the mountain. She obviously intended to leave the island. He didn’t know if he should finish digging or chase after her.\n\nHan Sen gritted his teeth and ignored the woman who was leaving the island. He continued digging into the mountain.\n\nThat woman walked toward the light, and when she reached out to it, the light flew into her hands. Grabbing that light, the woman moved away from the island.\n\nHan Sen was shocked. The light had brought him here, and if the woman left with the light, Han Sen didn’t know if he would still be able to leave.\n\nHan Sen wasn’t a saint, and he wasn’t close to the woman in the wooden house. He wouldn’t give his life up for her.\n\nGritting his teeth, Han Sen went after the departing woman.\n\nHan Sen shook his head but didn’t speak. He looked at the woman’s hand, and he saw that she was still holding the light she had stolen.\n\nHan Sen moved a bit closer, and he noticed that the light was actually a red lantern. The woman held the red lantern before her as she traveled through the clouds.\n\nShe was wearing yellow clothing, but her feet were bare. With the red light shining across her as she flew, she looked very weird.\n\nHan Sen followed her from behind, but still, he didn’t speak. The woman clutched the lantern, continuing to move forward. She was moving much more smoothly than Han Sen.\n\nBut just as Han Sen was wondering if the woman knew where they were going, something bright appeared in front of him. They moved out of the clouds and approached an island.\n\nSince he couldn’t see the peak, Han Sen didn’t know which island he was seeing. So, he didn’t speak.\n\nThe woman made her way up the mountain, and Han Sen followed her silently. When they were halfway up, Han Sen could feel that the mountain would have no peak. He felt as if there would be a wooden house and a garden.\n\n“Are we really back here?” Han Sen thought to himself. He walked all the way to the mountaintop and confirmed his suspicion.\n\nThe woman walked into the garden, heading for the wooden house. Han Sen followed the woman into the house.\n\nHan Sen thought something was amiss. The woman in the wooden house loved to clean, and she had a severe case of OCD. He wasn’t allowed to walk in her garden, let alone her house.\n\nBut Han Sen had followed this woman all the way into the wooden house. She hadn’t said a word, and that made Han Sen suspicious.\n\n“Is she really not that woman? Is this a fake version of the island, then?” Han Sen frowned as he looked around the wooden house.\n\nFrom the first floor to the second floor, there was no one else except for the woman holding the lantern. Han Sen picked up a pen and wrote on a piece of paper.\n\n“Where is your clone doll?”\n\nHe watched her intently to see what her reaction might suggest. Han Sen didn’t really need an answer to this question, but he wanted to see her reaction to him messing with her things.\n\nThe woman looked at the paper and said, “My real self is free. So, my clone is now gone.”\n\n“That sounds untrue,” Han Sen thought. The woman hadn’t been bothered by Han Sen’s use of her pen and paper. That made him really suspicious.\n\nHan Sen looked at the stone book and found that it was still locked tightly shut. He hesitated to do so, but he held the book out in front of her. He wrote on the paper, “Can you take a look at this book and help me break these bindings?”\n\n“Why would I want to help you?” The woman asked with a raised eyebrow. She didn’t accept the book.\n\nHan Sen now knew that this version of the woman was fake. The woman had personally given him the stone book. If this woman wearing yellow clothes was real, she would have recognized this book, and she wouldn’t have said something like that.\n\n“What to do?” Han Sen frowned. He knew that this woman was fake, but the wooden house was the same. Han Sen wasn’t sure how to proceed.\n\nHan Sen didn’t really care who this woman was. Real or fake, it didn’t matter to him.\n\nBut he didn’t want to just leave things like this. There were secrets right in front of his nose, and yet he couldn’t uncover them.\n\nAs Han Sen tried to figure out what to do, he suddenly heard the roar of a big dragon. A giant purple dragon soared through the sky above the island.\n\nAtop the giant dragon was a man from the Extreme King."
}