{
    "chapter": 1914,
    "title": "Give Me Back My Stuff",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1914",
    "text": "“What is wrong with you? Where are you taking us?” One of the Viscounts looked at Wang Yuhang very angrily.\n\nThey’d been waylaid by many xenogeneics on the road, and they had yet to see any hint of the red mist spring. The many injuries they had suffered were taking a toll.\n\nExcept for Wang Yuhang, of course. He was leading them, and he could run from his enemies extremely quickly. Whenever he saw movement up ahead, he’d take cover in the crowd. He was the only one not to sustain injuries.\n\n“Kid, I’m warning you. You better not be playing tricks on us. Even if Han Sen himself was here, he couldn’t save you.\n\nWe can kill you with the greatest of ease,” the Tego Viscount shouted angrily at Wang Yuhang, grabbing him by the collar.\n\n“You have misunderstood me! Why would I play tricks? You know how dangerous this place is, and there is an abundance of xenogeneics. We don’t have many people in the base, either, so the mountains remain uncleared. I am taking a huge risk, leading you guys to the red mist spring. The fear of death is not lost upon me, either. I have picked the safest route for us to take, and even so, there really are just too many xenogeneics.” Wang Yuhang gave them the look of someone who had been wronged.\n\n“Keep going.” The Tego Viscount grunted in dissatisfaction and threw Wang Yuhang forward.\n\nYes. And we have to be careful, because this place is dangerous.” Wang Yuhang smiled and got up. He wasn’t mad, and he just swept the dust off and kept moving.\n\nAs they walked, they went across a mountain, at which point Wang Yuhang suddenly started retreating. He also shouted, “Everyone! There is a bunch of xenogeneics ahead!”\n\nBefore any of them could react, they saw a bunch of xenogeneics crossing the distance. There were so many of them, it was like a sea of foes. One of them was wielding some sort of barrier, which marked it as an Earl xenogeneic.\n\nThe team quickly fell into chaos as the group of Viscounts engaged the xenogeneics. Wang Yuhang ran to the back of them, saying, “Trying to be bossy to me, huh? Now you are going to die!”\n\n“Not bad, Little Uncle.” Han Sen suddenly appeared next to Wang Yuhang and smiled.\n\n“What are you doing here? I told Brother Qing you could stay and absorb the spring while I handle these guys. Later, I was planning on taking them to Marquise xenogeneics.” Wang Yuhang smiled.\n\n“Don’t kill them. They need to reach the spring. Otherwise, we cannot explain the reasons why they all died. But yes, before they go, we can use them to kill a horde of xenogeneics for us.” Han Sen smiled.\n\n“By getting them to kill the xenogeneics, aren’t they the ones benefitting?” Wang Yuhang asked.\n\n“Of course not. This is Planet Eclipse, and this is all ours. They can kill the xenogeneics, but the materials left behind are all ours for the taking. It’s free labor, man. We should take advantage of it,” Han Sen said.\n\nWang Yuhang understood and said, “Okay, I’ll keep leading them as I have been.”\n\nThe people there were Viscounts, and there was just under a hundred of them. But there were three to four hundred xenogeneics, and one of them was an Earl. It was difficult to determine who would be victorious.\n\n“Crap! These guys are so strong. They trapped the Earl xenogeneic,” Wang Yuhang said, with much shock.\n\n“The people here are the best-of-the-best from Narrow Moon. They are very strong, but the red mist spring has yet to erupt. It would be best if you lead them elsewhere for a bit, and perhaps nab a few more Earls.” Han Sen smiled.\n\n“No problem. I have a handle on things.” Wang Yuhang puffed up and patted his chest.\n\n“Wear this, too.” Han Sen gave the Marquise armor to Wang Yuhang. After Han Sen brought up his Dongxuan Sutra to Viscount, he didn’t really need the armor anymore. He only needed his rabbit shoes.\n\nWang Yuhang put on the armor immediately.\n\nThe Viscounts were fighting hard, and it took them half an hour to slay only half of the crowd. Many of them then turned to focus on killing the Earl.\n\nThe Earl was very strong, but it could only use physical methods to fight, and it wasn’t very smart. It was surrounded by elite Viscounts. It was powerful, but it was killed before long.\n\nThe Viscounts all sustained their own injuries, too, but none of them were killed. No one was hurt too grievously, either.\n\n“Han Sen, you are here! I thought you were going to disobey the orders of the elders.” A few of the Viscounts, seeing Han Sen there, walked over to him. The Tego Viscount laughed coldly.\n\n“I am a Rebate, too; I wouldn’t disobey orders,” Han Sen said impassively.\n\n“Good, then take us there,” the Tego Viscount said. Other Viscounts then echoed him.\n\n“Of course. I will take you there immediately, but before that, I hope you give us back what we own.” Han Sen smiled.\n\n“What are you talking about? Since when have we given you what we’ve earned?” The Viscounts sounded angry.\n\n“This is Planet Eclipse. I own all the resources harvested here. You killed my poor xenogeneics. I’m not asking for money, and there you are, going to steal my xenogeneic materials?” Han Sen calmly said.\n\n“Han Sen, you must be dreaming. We killed the xenogeneics. If you want xenogeneic materials, you should go and hunt the creatures yourself!” one of them growled at Han Sen.\n\n“Well, if you don’t give me back these xenogeneic genes, I can’t take you to the red mist spring,” Han Sen said.\n\n“This is an order from the elders and the Kings. Do you dare disobey it?!” the Tego Viscount shouted.\n\nHan Sen looked at him expressionlessly and said, “Planet Eclipse is mine. That is also a decree issued by the elders and Kings. You can disobey these laws, but I cannot? I am sure the Kings and the Queen will support me on this matter.”\n\nThe Viscounts looked pensive. Han Sen’s reasoning was solid. And if they failed to take the spring, how would they explain that to their elders upon returning home?\n\n“The red mist spring is going to erupt any second now. If you’d rather waste time here instead of going there right now, that’s your decision,” Han Sen said.\n\nYou b*stard.M One Viscount threw the xenogeneic materials he had gathered upon the ground.\n\nThe Viscounts weren’t willing to lose the red mist spring, so they had to swallow their displeasure and drop the xenogeneic materials. The Viscount that took the Earl class xenogeneic materials hesitated a great deal, but still ultimately had to discard the items.\n\n“Can we go now?” Sword Know stared icily at Han Sen.\n\n“Yes. Brother Qing, send a few people over to collect the materials.” Han Sen smiled."
}