{
    "chapter": 1112,
    "title": "Lucky Bao’er",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1112",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen’s confidence had been renewed, after grabbing some of the eggs in Bao’er’s pile. And as he clutched one, he shouted to the skies, “This is going to work! Buddha! Laozi! Jesus! RNGesus! Mary! Please, please, please! Bless me with immaculate fortune, as I walk through the valley of shoddy lootcrates… Heeyyaa!”\n\nHan Sen crushed the egg, and he watched the red light that oozed out with a manic stare. With his intense gaze, he waited to see the form it’d take. And then, all of a sudden, a housefly buzzed straight into his Sea of Soul.\n\n“Ordinary-class Blood Fly beast soul obtained.”\n\nHan Sen felt as if his heart had been trampled underfoot, and he had now fallen into a deep depression. He continued tearing through the eggs before him, and he seemed to exclusively receive ordinary and primitive beast souls.\n\nQueen, on the other hand, had managed to receive four sacred-blood beast souls. She never once received anything lower than a mutant-class beast soul, either.\n\nBao’er, although Han Sen could not tell their class, seemed to have been the continued recipient of greater fortune. Beast soul after beast soul rose from the cracked eggs, and powerful and monstrous red forms of light entered her forehead.\n\nHan Sen was down to one single fruit remaining. He wrestled with whether or not he should open it, and ultimately decided not to. He put it away.\n\nHe had suffered a similar misfortune when he squeezed the Dragon-Blood Fruits in the underground shelter. He let Zero crack the final one open for him, and she managed to obtain a wondrous Dragon-Blood Snake for him to use.\n\n“Bao’er, you don’t need those beast souls, so how about you give me yours?” Han Sen gave the creepiest grin as he looked at her. Then, he took her in his arms.\n\n“One,” Bao’er actually answered, putting up one finger as she spoke.\n\n“Come on; you love Daddy, don’t you? All?” Han Sen pleaded pathetically.\n\n“One,” Bao’er insisted.\n\nHan Sen swung his arms around, saying, “Ooh, that reminds me. I heard there’s a new flavor of ice cream. It’s a super jumbo ice cream, too. It’s massive!”\n\nBao’er could not resist the temptation of a new super jumbo ice cream and said, “One for each super jumbo ice cream.”\n\n“Deal.” Han Sen then proceeded to lock his pinky with hers.\n\nBao’er gave Han Sen all the beast souls she had received, and Han Sen could not stop smiling as this occurred.\n\nThey were all sacred-blood beast souls except for one, which was a super beast soul. The super beast soul was that fierce dragon he had seen.\n\nBlood-Demon Dragon: Flying Beast Soul\n\n“Haha! It’s a super class flying beast soul; I love you Bao’er!” Han Sen repeatedly kissed her cheeks.\n\nHan Sen’s fine mood had returned, better than ever. He had now managed to receive two super beast souls from his escapade at the shelter. First, he had managed to receive the super mantis armor, and now he had received super wings.\n\nWith the wings, Han Sen could use phoenix techniques while remaining in his human form. The blood-demon wings increased his speed and power, too; so that was a welcome trait.\n\nHan Sen summoned them, and immediately, giant dragon wings appeared across his back. He gave them a test flight and was delighted to learn he could fly at a speed that was greater than what the super-class mantis could achieve.\n\nFlying speed always came down to the beast soul itself. Although he wasn’t as strong as one, Han Sen at least now had the speed to match any super creature.\n\nQueen thought it was ridiculous, how he had received another super beast soul. Particularly given the manner he received it: bribing it off Bao’er.\n\nShe then planned to give Han Sen the beast souls she had received and not keep them.\n\n“Keep them; I don’t need them,” Han Sen told her. He also provided her with a few more sacred-blood beast souls he did not need. “You might need them to protect yourself, in the event I’m not there.”\n\nQueen did not say anything and just did as he said. She knew she was weak, and she could not hold her own and fight side-by-side with Han Sen as she might have once been able to.\n\nHan Sen then had another idea. He decided to give Queen his Polluted Devilhorn King scimitar. As he did so, he told her, “Take this, as well; I don’t need it.”\n\nHan Sen knew the creatures in the Third God’s Sanctuary were strong, and the emperors there always had super creatures and spirits in their employ. He might need her back-up, as many of the trials ahead might require him not to go solo.\n\nSince he did not need those beast souls, it was best to have a moderately-powerful sidekick accompanying him.\n\nQueen accepted the scimitar but did not say anything.\n\n“Safety first. If something happens to me, my life may be in your delicate hands. This gear will help,” Han Sen said.\n\nQueen was too hard on herself, and even Han Sen thought the wounds she had sustained earlier were far too wretched. He didn’t want to see her in a condition like that again.\n\nShe blushed and simply walked back to the teleporter, returning to the Alliance.\n\nHan Sen also went back, bringing Bao’er with him. He fulfilled his part of the bargain with her and bought her a lot of snacks.\n\nBao’er’s luck was as good as Zero’s. Evidently, he could not open stuff and expect decent results. It seemed he would have to rely on Bao’er, for the time being.\n\nTwo days later, Han Sen planned his next route and set-off away from the barrens.\n\nBefore he left, Bai Yishan gave Han Sen a call, bidding that he come visit him in the Saint Hall.\n\nOn the communicator, Bai Yishan didn’t mention exactly what he wanted to discuss, but it did sound important. Without any elucidation, he just told Han Sen to come see him in the Saint Hall.\n\nBai Yishan had treated Han Sen like a proper student; it was something he was very grateful for. Therefore, Han Sen had no problem adhering to his desire, and went to go see him at once.\n\nThis was the first time he had been to the headquarters, as ordinary people weren’t usually allowed. But Han Sen was not an official student, so he had to wait outside.\n\n“Han Sen, why are you here?” Han Sen heard someone ask."
}