{
    "chapter": 1885,
    "title": "Imprisoned",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1885",
    "text": "The gold fountain unleashed a gold light. The gold light descended on Guna and Guya, quickly repairing their ravaged bodies. When Giant King witnessed this, he ran to the fountain and threw his hands into the water to try and absorb that same power.\n\n“Argh!” Giant King cried. The spring water was like a corrosive acid on his hands.\n\nThe water was good for Guna and Guya, but it was deadly for Giant King.\n\nGuya coldly looked at Giant King and said, “I told you that this is Gana’s Heaven. For you, this place is nothing short of hell. Only the Gana have power here, and can receive the boons bestowed by their goddess. We are practically invulnerable. All your power is stripped, so you are little better than an ordinary creature.”\n\nAfter that, she smiled and went on to say, “It is in thanks to you lot that we are here, of course. Even if we had tried to use our own blood, we wouldn’t have made it here alone.”\n\n“Is this Purgatory Heaven’s Heaven?” Buddha King frowned.\n\nYes. Outside is purgatory, and here is heaven,” Guya said.\n\n“I have heard heaven is in the clouds. Why is it here? We arrived here through a slipspace crack, which we broke open!” Gold Jade King said.\n\n“The ‘slipspace crack* was just a lie that we created about Purgatory Heaven. The gold clouds outside are just a path that can take you to purgatory, through the statue. The clouds won’t kill you, but you can be killed in heaven—by someone with power, of course.” Guna said this, and then punched Giant King in the head.\n\nThe strong Giant King was sent soaring. After his descent, he rolled violently until he came crashing into a wall, coughing up blood.\n\nGiant King stood up in a fury. He was a King who had never been humiliated before, and he really wanted to fight back. Before he could straighten himself up, though, Guna came forward and punched him again. This time, he went flying into the clouds.\n\nGuya did not join Guna, and she simply walked to the palace near the fountain.\n\nNot long after, the clouds rumbled. Many clouds rose, and they each looked like a cage. Many creatures were inside them, and Giant King was one of them.\n\nHan Sen now learned that the creatures that were trapped here were the ones who had been zapped by flying into the clouds. He knew Guya wasn’t lying, as all of those creatures were here.\n\nThey had been trapped in the clouds, and while they had not died, they most certainly weren’t free. Death was still an inevitability for them, though.\n\nMany clouds came towards the palace. Han Sen saw that the clouds that flew there housed Gana.\n\nHan Sen counted their numbers, and he noted that most of the Gana were here now. Han Sen tallied thirty or forty. It seemed as if they had planned to be captured, all so they could end up here.\n\nIt was the same for the other creatures who had been trapped by the clouds. They couldn’t get out on their own.\n\nBut now, things were different. The clouds were supported by some phantom power. The Gana were sent to the palace, and the clouds faded from sight. They were free now.\n\nThe Gana were so happy, and they all bowed to Guna. They then proceeded to speak their own language, which was one that Han Sen did not understand.\n\n“Throw them all in the clouds. They deserve it,” Guna said angrily, pointing at the Kings.\n\nThe Gana headed towards Gold Jade King and the others. They could not use geno armor, so they were pretty much worse than the average commoner. And while they had skills, they did not have the power to make use of them. Quickly, they were taken to the sea of clouds.\n\n“Hey! Hey! We are together!” One Gana approached Han Sen and tried to take them, too. Wang Yuhang was quick to shout. He even turned to Guna and said, “Guna, we meant you no harm. We went through all that together. Doesn’t that make us friends?”\n\nGuna looked at Wang Yuhang, and then Han Sen, and said with a venomous tone, “You guys are not nice people, either. Get moving.”\n\nHan Sen knew he had kidnapped Guna, which hadn’t made her very happy. She wouldn’t consider him a friend.\n\n“You guys are not loyal at all.” When Wang Yuhang saw the Gana approaching, he started to tread backwards.\n\n“This is pointless. Let’s just jump!” Han Sen made it sound easy. He was, of course, referring to a jump into the clouds.\n\nHan Meng’er and Dragon Lady jumped without thinking. Icebird Duke didn’t fancy getting hit, so she did so, too.\n\nWang Yuhang didn’t think there was another way out of there, so he jumped as well.\n\nNot long after, they found themselves floating inside the clouds. They were trapped inside them.\n\nGiant King and Gold Jade King were in a similar situation. This Heavenly power of imprisonment was scary. Aside from the Gana, no King could escape. It was likely only a deified being would be able to break the chains that bound them.\n\nGuya walked out of the palace. Her hands were clutching a piece of golden jewelry. Han Sen couldn’t tell what it was, but Guya could use the power of the gemstones to control the clouds.\n\nHan Sen sat in his cloud, watching Guna and the others. He wasn’t going to just sit there, of course. He was going to figure a way to sort all this out.\n\nIn Gana’s Heaven, all powers other than the Gana’s were suppressed. Even Ghost Teeth Knife had no power. He could not summon geno armaments, either.\n\nBut Han Sen had one thing that wasn’t restricted: the Knife Blank that was currently in his hand. There was still a strange power inside it. Aside from the Knife Blank, Han Sen also felt a power inside him that was not restricted.\n\nGuna and Guya were at the edge of the palace. They looked at the people they had imprisoned, and their gazes were looked. It looked like they wanted to murder their prisoners."
}