{
    "chapter": 2522,
    "title": "Yellow Clothes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2522",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWan’er had been sleeping for a few days straight, and yet, there was no sign of her waking up anytime soon. That made Han Sen feel a bit depressed.\n\nThe white whale was doing the same as it always was. There was still no way for them to escape the dimension they were locked in, and the white tiger pest was still too skittish to get close to them. Still, whenever a horde of snakes approached the island, it would make sure to shoo them off.\n\nEveryone still had a mushroom on their heads. The mushrooms weren’t hurting them, though. Every time Han Sen came back from the core area, his head would grow a new mushroom. Before he entered the core area each time, he used his Original Water King Body’s power to get rid of it and be separated from the mushroom.\n\nBao’er released the knights of the Extreme King to work on the ship as deckhands and the like. They didn’t dare disobey, because doing so would be pointless. Even if they knew their situation, they wouldn’t dare to leave the safety of the white whale.\n\nBao’er had her new toys, so she was no longer bored. She carried around her big carrot that she called ginseng, and she had a bunch of Extreme King knights that she could freely order around. The Kings and even half-deifieds were being bossed around like they were rookies.\n\nThe deckhands became more afraid of “Little Captain Bao’er” than they were of Han Sen or even the little red bird. Whenever her name was mentioned, the men of the ship would tremble.\n\nHan Sen’s tally of King class genes reached a hundred. Without hesitation, he increased his Dongxuan Area to the fourth tier. Now that he had enough King class xenogeneic genes, Han Sen planned on maxing out his Dongxuan Area before anything else.\n\nBecause the Blood-Pulse Sutra and Spell were of little use in combat, he could only choose between Jadeskin and the Dongxuan Sutra. The Dongxuan Sutra was harder to improve than Jadeskin, and it required more power from his self-cogwheel. However, strengthening that geno art’s area would prove more useful in the short term.\n\nWhenever he leveled up an area, his fitness and his area’s power would increase by a lot. Still, Han Sen didn’t notice any changes.\n\nThis lined up with what he had been told about the process. He would only feel the changes when he became half-deified and his nine tiers condensed into one. Reaching that level would be like having all nine tiers of his area combined into one. Stronger than all that, even.\n\nIt was almost time to return to the core area. Dia Robber should have been in a rush to see him by now. Han Sen used the Dongxuan Sutra’s self-cogwheel to open the door to the core area.\n\nHan Sen thought that after fighting the Gold Armor General, many more Kings would come seeking him out. Dia Robber was likely going to be one of many.\n\nYet when Han Sen entered the core area, he couldn’t see a single King. He flew for thousands of miles, and yet he found no hide nor hair of Dia Robber in the core area.\n\n“Weird. Why is no one looking for me? That isn’t normal. Am I too expensive, and my high prices have scared people away?” Han Sen looked around in confusion. His performance was so spectacular, how could others not pay attention and want him?\n\nAlthough Han Sen was depressed by the lonely stretches of space around him, he still had to kill a few more xenogeneics. He wasn’t familiar with the xenogeneics in the core area, and after thinking about things for a while, he planned to call on the bronze furnace. It should have been familiar with the core xenogeneics, so his job would be easiest if it led him to populated areas. It would be better than wandering around aimlessly, all alone.\n\nAfter Han Sen returned to the bronze furnace’s planet, he finally found the bronze furnace. It looked to be in poor condition, though. A yellow-clothed woman of the Sky was beating it up. It was trying to flee from her, and it was in a sorry state.\n\n“This little guy is really unlucky. I beat him up once, and now he is getting beaten up by a woman,” Han Sen thought with a slight smile.\n\nUpon seeing Han Sen, the bronze furnace flew over to him, crying all the while. It hid behind Han Sen’s back.\n\nThe yellow-clothed woman flew in front of Han Sen, looked at him, and said, “Are you going to steal my prey?”\n\n“Lady, you misunderstand. I don’t want to do that.” Han Sen looked at the yellow-clothed woman and then went on to say, “This furnace is my pet. Please, find it in your heart to let him live on my account. This core xenogeneic gene will be a gift for your kindness.”\n\nAfter that, Han Sen pulled out a core crystal for the yellow-clothed woman.\n\nHan Sen had once studied in Sky Palace, and he still planned to seek out their protection while on the lam. That yellow-clothed woman was one of the Sky, and so the last thing he wanted was to make an enemy of her.\n\nThe yellow-clothed woman didn’t accept the core xenogeneic gene from Han Sen. She just looked at him and said, “I need this core furnace’s material to make a treasure. No other xenogeneic gene can replace it.”\n\n“Lady, must you really kill it? Is there no other way?” Han Sen asked patiently.\n\n“There is another way, but it would be annoying,” the yellow-clothed woman said.\n\n“That is good! As long as there is another way, we’re all set. Just tell me what it is, and I will do my best to fulfill your wishes.” Han Sen laughed.\n\nThe yellow-clothed woman pointed at the bronze furnace and said, “You aren’t helping me. You are just saving his life.”\n\n“Right. I was wrong. In that case, tell me what to do to save its life?” Han Sen was still giving her that care-free smile.\n\n“You don’t look like a bad person. If you can hunt a core bronze tripod with me, then I’ll let the bronze furnace go,” the yellow-clothed woman said.\n\n“That is no problem. Do you know where the core bronze tripod can be found?” Han Sen asked.\n\nThe yellow-clothed woman looked at Han Sen and said, “Core bronze tripods aren’t difficult to locate, but they are half-deified xenogeneics. Can you kill one? Don’t just go there and get yourself killed.”\n\n“I don’t think highly of my strength, but I do think I can kill a core bronze tripod. Plus, you will be helping me, too, right?” Han Sen asked.\n\n“In that case, let’s go.” The yellow-clothed woman said that and then flew off in another direction.\n\n“My Lady, might I ask your name?” Han Sen signaled the bronze furnace to follow them and headed after the woman. The bronze furnace was terrified of her, and it wouldn’t dare stay close. It just hid behind Han Sen.\n\n“I don’t know your name, either,” the yellow-clothed woman said.\n\n“My name is Dollar,” Han Sen told her.\n\n“That doesn’t sound like a name. It sounds more like a title,” the yellow-clothed woman said.\n\n“All names are just titles, aren’t they?” Han Sen said.\n\n“In that case, you can just call me Yellow Clothes. It is just a title, anyway,” the yellow-clothed woman said.\n\n“Lady Clothes, are you a student at Sky Palace?” Han Sen didn’t tell her his true name. There was no reason for them to be on a first-name basis, so he picked a name that was easier to pronounce.\n\nThe yellow-clothed woman smiled and said, “What? I’ve never heard your name before, and you are asking about me?”\n\nHan Sen thought the woman’s temper was strange, and that getting along with her would be difficult.\n\nYellow Clothes went on to say, “The core bronze tripod that we’re hunting is different. Normal half-deifieds cannot defeat it. You can die within the blink of an eye. Let me see what sort of geno art and area you are good with. I don’t want you to die and blame it on me.”"
}