{
    "chapter": 2394,
    "title": "Core Xenogeneic",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2394",
    "text": "The bodies were humanoid. They had four limbs, but their heads were unusually small. They were one and a half meters tall, and their whole bodies were shelled in an aqua-blue material. Their shells were so smooth and glossy that Han Sen could see his reflection in them. A pair of blue transparent wings sprouted from each bug’s back. When the bugs flew, their wings moved so fast that they turned into a blur.\n\nThey didn’t appear to be too different from average xenogeneics. Their most outstanding feature was the fact that they were all King class. As far as Han Sen could tell, their high rank and the fact that everyone called them “core xenogeneics” was the only thing that made them unique.\n\nHan Sen made a quick calculation. There were one hundred core xenogeneics ahead, and they were all King class. That amount was a rare sight.\n\nDragon One pointed out two xenogeneics within the horde of bugs and said, “Those two are the half-deifieds of this bug enclave. You and I can take one each. Dragon Eight and the others can deal with the rest. I will kill one half-deified xenogeneic, then help you take care of the other.”\n\nDragon One didn’t expect Han Sen to have the chops to kill a half-deified creature. After all, he was only a first-tier King.\n\n“Okay.” Han Sen nodded, then turned the two bugs Dragon One had pointed out.\n\nThe bodies of those two half-deifieds looked quite similar to those of the other bugs, but their armor was purple-red. Their bodies were also laden with spikes. They were certainly a more intimidating sight.\n\nFollowing their plan, Han Sen and the others moved straight in to attack the group of insects. The space bugs soon noticed their approach, and the entire group released a collective scream. Then, the bugs hurried forward to meet with the invaders.\n\nNear the hearts of the space bugs, something that looked like small lanterns flared to life, giving off a green light. They were like small, cold, nuclear reactors.\n\nWhen Han Sen looked deeply into those lanterns, he could see a spot of light spinning around a core crystal. It was an oddly beautiful sight.\n\n“Those must be their xenogeneic cores,” Han Sen thought. He was about to start drooling. They were King class xenogeneics.\n\nBzzt!\n\nAs the cores of the space bugs lit up, they started to cast blue and green areas. Because there were many space bugs and they were all of the same species, the areas layered on top of each other without conflicting with each other. And because the King areas were stacked and concentrated, their collective power became quite terrifying.\n\nAs more and more King areas were added to the stack, the colors turned from blue and green to black.\n\nThere was no way to know what tier all these space bugs were. Han Sen had to watch the colors of the collective King area instead. The darker a section of the King area was, the stronger it would be.\n\nThere was no need to analyze the two space bugs with purple and red King areas, though. They were the half-deified foes, and their areas had reached the ninth-tier and then been reset to first-tier.\n\n“Stick to the plan!” Dragon One shouted. He rushed into the space bugs, activating his own area.\n\nDragon One’s area was black, and it covered the entire sky. The space bugs were still some distance away, but they were covered by his area anyway.\n\nHan Sen could see a dragon, forged of black air, rising from Dragon One’s area. It was headed for the space bugs.\n\n“What a powerful King area! With an AoE that strong, he could totally solo all the King class space bugs. Why does he even need us?” The dragon made from black air was still rising from the King area. It had King class strength, and it was at no disadvantage against the space bugs.\n\nPlus, even if the black air dragon’s body was torn to shreds, it would just immediately recompose itself. The thing was practically immortal.\n\nBut Han Sen soon realized that he had underestimated the capabilities of the space bugs. Their blue areas continued to stack up, and when the black air dragon came into range, the bugs’ King areas began to absorb the black air. The longer the dragon was there, the weaker it became.\n\nAgainst that massive, collective King area, the black air dragon’s body would be no stronger than a balloon. It would be sucked dry, and the bugs’ King area would only get stronger.\n\n“An elemental consumption area?” Han Sen asked with a frown.\n\n“Yes, it is a consuming area. Any creature that enters will have their powers and lifeforce sucked right out of them. Don’t go into the areas that are stacked up, and you should especially avoid the ones that have turned black. Their consuming power can turn a King into a dried-up husk,” Dragon Eight said to Han Sen.\n\nHan Sen nodded, then headed for one of the half-deified xenogeneics. Dragon Eight and the others were working to lure the bug crowd elsewhere. They hadn’t actually engaged the horde just yet.\n\nCompounded King areas like that were dangerous. If too many areas were stacked up, then their power could rival a half-deified. Fortunately, a horde like that lacked the mobility and agility of a solo creature. Dodging the stacked up areas of the bugs wasn’t all that difficult.\n\nHan Sen flew toward one of the half-deified bugs alone. He threw a coin at it from some distance away. The coin flew forward and entered the bug’s purple and red King area.\n\nThe coin shrank noticeably as it traveled through the King area. Clearly, the area was draining the coin’s power.\n\n“A very strong consuming power, indeed,” Han Sen thought in awe. To close-quarter combat fighters, a creature such as this would be a living nightmare. Even getting close to the beast would cause their lifeforce and power to drain away. The fighter would become weaker, and the bug would become stronger.\n\nPat!\n\nThe small coin finally attached itself to the bug’s shell. Coin’s suppressing and restrictive powers started to work. The bug’s body shivered and started to sink.\n\nBut it only shook a little. The half-deified space bug froze. Its eyes were like the eyes of a fly as it looked at Han Sen. They looked angry, and the creature screamed at Han Sen. Then, it flapped its wings and flew toward Han Sen like lightning.\n\n“So fast! That thing is definitely half-deified.” Han Sen noticed that his own speed, in comparison, was so slow. And the suppression powers of the coins didn’t seem to work on the bug.\n\nIn fact, the coin was still getting smaller. Clearly, the bug’s area was still consuming the coin’s power. Not long after, the coin’s power had run dry.\n\nHan Sen looked thoughtfully at the bug, but he didn’t flee. He used an area, but not the Dongxuan Area. Instead, he made use of the beast soul he had received from the conch: Move Mountain Area.\n\nThe blue area spread around Han Sen’s body, combining with the purple and red areas. It didn’t show any reaction to the contact, and the two different colored areas overlapped. Han Sen prepared to strike the half-deified bug."
}