{
    "chapter": 2327,
    "title": "Cannot Keep Pretending",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2327",
    "text": "Cher’s beauty would make anyone’s heart jump, but in Han Sen’s eyes, she was completely unappealing.\n\nHan Sen had seen many beautiful people in the world. There were countless numbers of them, but he was now past the stage in which he took people for their face value. What was inside was better than what was outside.\n\nCher looked as if she absolutely despised Bai Yi. That attractiveness she displayed was for a specific purpose, and she showed her body to achieve it. Ordinary people might have been drawn to that, but Han Sen thought it was boring.\n\nCher wasn’t Han Sen’s type. Even if he really liked her, he wouldn’t do anything with a woman so easily.\n\nBut right now, if Han Sen didn’t do something, he would raise suspicions about his identity.\n\nThe evil, horny Bai Yi wouldn’t think twice about doing something devilish to that pretty woman.\n\nBai Ling Shuang wouldn’t believe Han Sen’s lie if he showed restraint.\n\nHan Sen picked up Cher by the waist and took her to the bed.\n\nCher lay against Han Sen’s chest. She looked so shy, and her arms were around Han Sen’s neck.\n\nWhen Han Sen put Cher down on the bed, her pretty eyes looked into Han Sen’s own at a very close distance. There was only ten centimeters separating the two.\n\nHan Sen’s eyes shifted away to break the gaze. He wanted to use a geno art, but Cher’s eyes looked very weird. They were magnetic, pulling directly on peoples’ hearts. He was going to get lost in her attractive eyes.\n\nHan Sen’s heart skipped a beat. He gave up on casting a geno art, looking genuinely attracted by her. He had seen these eyes before when he was trapped in Ghost Bone Palace; Fox Queen had tried to trick him the same way. He hadn’t expected Cher to have a command of this ability, as well.\n\nIt wasn’t hard to tell that she was one of the Fox. They were two of the same race, and that talent could very well have been a defining ability of the Foxes. It wasn’t too strange that Cher knew how to do this, but compared to Fox Queen, Cher was an amateur.\n\nCher’s power still surprised Han Sen, though. She was King class for sure, and Han Sen hadn’t been able to tell that before this moment.\n\nThe Fox had a skill that hid their strength, and it was very effective.\n\nBut thinking about how Fox Queen hid herself as a King class guard amidst the Extreme King despite being deified, this wasn’t half as special.\n\nHan Sen was familiar with this geno art, so he knew what the expected reaction should be. Han Sen’s eyes started to look dazed, as if he was frozen. But he sighed.\n\nA while later, Han Sen looked dazed while lying on Cher. He was like a zombie.\n\n“This Cher is using a luring skill to get me to fall under a spell. She is trying to make me think that I’m going to do something with her. Most people wouldn’t realize what was happening. I wonder if this was her idea, or if it was Bai Ling Shuang who ordered her to do this?” Han Sen wondered. He thought it was more likely to be the second option.\n\nCher looked at Han Sen with revulsion as she pushed him away. She sat up on the bed and tidied her clothes. She looked utterly disgusted.\n\nA hidden door in the room opened, and Bai Ling Shuang walked in.\n\nCher bowed to her and said, “My Princess, I used Fox Eye to attract him. He won’t know what happened.”\n\nBai Ling Shuang nodded. “Good job. Take off his clothes and remove everything. I want to get a proper look at him.”\n\n“My Princess, do you think something is wrong with Prince Sixteen?” Cher asked.\n\n“Not quite… I just feel as if something is amiss with him,” Bai Ling Shuang said.\n\n“It looks like my attempts to imitate Bai Yi are failing,” Han Sen thought as he heard Cher approach him. “Why hasn’t blood kirin reacted?”\n\nBai Ling Shuang and Cher were there. Han Sen was worried they were going to expose him. He didn’t dare to use his Dongxuan Aura to get a look around the room. He thought the blood kirin was just lying there and not moving. His presence seemed normal, as if he was just sleeping.\n\nBut Han Sen knew that the blood kirin couldn’t actually be sleeping. Even if it was, Bai Ling Shuang’s entry surely should have woken it. It was just lying there and not moving. Something must have happened.\n\nCher moved calmly over to Han Sen and removed all of his clothes. Han Sen just had to remain still; otherwise, everything would fall apart.\n\nCher brought Han Sen’s clothes and items over to Bai Ling Shuang. Bai Ling Shuang looked through the stuff and said, “This Ghost Teeth Knife is Han Sen’s. This silver thunder blade thing is also Han Sen’s. It could actually be a half-deified weapon. This Jade Drum looks different from the ordinary Jade Drums. Maybe it is a mutant Jade Drum. These items must be Han Sen’s. He certainly got lucky.”\n\n“Why does he only carry Han Sen’s items? Could this be a problem?” Cher frowned.\n\nHan Sen’s heart tightened. He had wanted to carry some of Bai Yi’s items, but they had all been eaten by the blue metal wolf. He had nothing, and there was nothing decent in his house. Han Sen only found some accessories to wear, but there were no xenogeneic treasures or King class items.\n\nBai Ling Shuang coldly said, “Bai Yi is addicted to sex and gambling. His family didn’t lose because he married Lan Haixin. But that Lan Haixin had her own purposes for marrying him. She isn’t really in love with Bai Yi. What she holds onto won’t be given to Bai Yi. Bai Yi should be a prince, but he is little more than a servant. His situation is quite bad. If things weren’t like this, he wouldn’t have been greedy enough to request my Extreme King’s Pavilion Pass.”\n\n“He got lucky that he was chosen to kill Han Sen. That is a lot to be rewarded with. That Han Sen was special, but he was also so dumb. He went for that b*tch Bai Wei. He deserved to die.” Bai Ling Shang looked through everything and tossed the items away. She walked to the secret door and went on to say, “Go and find a woman of the Pig race. We need to make it look legit. Don’t let this *sshole wonder about anything after waking up.”\n\n“F*ck you, lady. Do you have to be this cruel? This is so f*cking cruel!” Han Sen thought. The Pig people had a human body but a pig head. They were so strong, too. They were little more than thralls.\n\nBai Ling Shuang was going to put a Pig in bed with him. Han Sen wanted to jump up and kill her.\n\nCher brought Han Sen’s items over to the bed and threw them down. She brought a leg up and kicked Han Sen’s body hard. She hissed angrily, “You dare to touch me? Wait until later.”\n\nAfter that, Cher turned around to call for the Pig woman. Han Sen thought quickly, and in the end, he could no longer keep this up. The moment Cher turned around, Han Sen jumped up. He grabbed her back and used his hand to cover her mouth as he threw her on the bed.\n\nJadeskin’s ice power and Original Water King Body’s King area-of-effect combined and flowed into Cher’s body. She was caught completely off guard, and she was frozen on the spot.\n\nBut she was King class, and she tried to fight back. Han Sen’s ice power was melting fast due to her resistance."
}