{
    "chapter": 1063,
    "title": "Blasphemy",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1063",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“It’s good that you know about Instructor Han and the Seventh Team.” Sunset nodded as she spoke, and she proceeded to say, “Now, again; listen to every word I tell you.”\n\nSunset told Han Sen, “Our team accepted an order that commanded us to breach another dimension. Things went wrong upon going there.”\n\n“What happened?” Han Sen asked.\n\n“I don’t know.” Sunset shook her head.\n\n“What? How can you not know? Have you not been to the sanctuaries?” Han Sen’s eyes were wild with a desire to know. If she was truly a member, she would know what had happened, surely.\n\n“The sanctuaries? Is that the other dimension?” Sunset asked, almost as if she was speaking to herself.\n\n“How can you not know about the sanctuaries? Upon first spawning in the First God’s Sanctuary, you are given the basics and need-to-knows right away.” Han Sen was starting to believe she was pulling his leg.\n\nSunset looked at Han Sen and asked, “First God’s Sanctuary? The first? Were more discovered?”\n\nHan Sen looked at Sunset in disbelief, finding it difficult to determine whether or not she was joking.\n\n“Just tell me about this other dimension, this ‘sanctuary,’ as you put it. Explain to me as plainly and as concisely as you can,” Sunset asked.\n\nHan Sen noticed her face was quite serious and that this was a genuine question. So, he spared no time in explaining to her what the sanctuaries were.\n\nHe told her how they had been constructed and what the creatures and spirits were like, having adapted to their presence. He explained what he could in a few minutes.\n\nWhen Sunset heard what he had to say, a strange look fell across her face. She then said, “If what you are saying is true, then this is not the place we found. The Seventh Team did not breach this sanctuary.”\n\n“Are you saying you found another dimension, separate from the sanctuaries?” Her words were challenging Han Sen’s ability to believe her, and he was starting to think she was a liar.\n\nHumanity came to know about the existence of sanctuaries through the Seventh Team; they were the ones who discovered them. In the years that followed, humanity started to evolve at an alarming rate.\n\nSunset stroked her hair and said, “Where we went was not the sanctuary you have described. Or at least, it may have been a sanctuary… just not one that is known to you. When we breached this new dimension, we spawned someplace together.”\n\n“Where did you spawn?” Han Sen harbored many doubts about whatever she was going to tell him, but he still wanted to hear what she had to say.\n\nSunset wore a confused look, and she explained, “Where we went to, it was like God’s Kingdom.”\n\n“God’s Kingdom?” Han Sen again thought she was referring to the sanctuaries. The sanctuaries could, after all, be referred to as a place of miracles and could believably be described as God’s Kingdom. Han Sen told her, “Yes, the sanctuaries are amazing. I wouldn’t be against referring to them as God’s Kingdom.”\n\nSunset shook her head and explained, “You misunderstand me. I’m talking about God’s Kingdom. I’m talking about the actual Kingdom of God.”\n\n“Okay, then what does God’s Kingdom look like?” Han Sen’s curiosity had not lessened, despite the pinch of salt he was carrying.\n\n“I cannot describe it,” Sunset said.\n\n“That’s convenient. Then just tell me about the environment there. What did you see?” Han Sen asked.\n\n“If I was able to describe this place and encapsulate it in mortal words, it wouldn’t be a kingdom that belonged to God. The beauty of this place cannot be aptly put into words,” Sunset told him.\n\n“All right. Well, what did you want to tell me earlier?” Han Sen wasn’t really sure how to deal with this entire situation anymore.\n\n“If you find Han Jingzhi, you must kill him.” Her words made Han Sen’s blood run cold, and he was unable to lax the instant stiffening of his muscles.\n\nHan Sen recalled his encounter with Qin Huaizhen, and how he had been told to be wary of Han Jingzhi. He had died before he was able to learn more, but now he had met Sunset, who seemed to be on the same level. What she had just plainly told him was in-line with what he had previously learned, too.\n\nAs to why the Ning family said Han Jingzhi had saved their family, he did not know.\n\nAnd the Qin family as a whole respected him. If Han Jingzhi really was not the likable, respected person Han Sen had previously believed him to be, wouldn’t Qin Huaizhen have warned his family?\n\nHan Sen couldn’t wrap his head around what was going on, so he asked, “Why should I kill Han Jingzhi?”\n\nSunset looked strange, as if she was not expecting this response. Her words in return were simple, but perplexing. She said, “Do you believe in God?”\n\n“I believe in something, for sure. I’m not an atheist, but I don’t follow the teachings of any religion in a devout manner,” Han Sen explained.\n\nSunset then asked Han Sen, “Would you believe me if I told you we saw the face of God?”\n\n“Oh, really? What does he look like? I haven’t seen God before, so I’m curious.” Han Sen wasn’t sure if she should be taken seriously.\n\n“Again, if I could explain it, it would not be God.” Sunset paused briefly, and then went on to say, “Bring this news to the rest of the Qin family; ‘Qin Huaizhen must be told to kill Han Jingzhi.'”\n\n“Do you know who I am?” Han Sen asked.\n\n“I see that you possess what is left of Taia, so I can only assume you are from the Qin family. Are you?” Sunset asked.\n\nHan Sen shook his head and said, “No. I was given Taia as a gift, more or less. But you should know my surname is Han and that my great-grandfather is Han Jingzhi.”\n\nSunset looked at Han Sen in shock, and she exclaimed, “What? But he didn’t have an heir! Even if your great-grandfather is called Han Jingzhi, it has nothing to do with him. Them both having the same name is a coincidence, nothing more.”\n\n“Couldn’t he have had a bastard son?” Han Sen frowned.\n\n“Of course not,” Sunset said, with assurance.\n\n“Then at least tell me why he must be killed.” Han Sen felt as if the conversation was going around in circles.\n\n“He must die because he is blasphemous,” Sunset said."
}