{
    "chapter": 2361,
    "title": "Little Red Bird Shows Off",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2361",
    "text": "The faces of Han Sen and the blood kirin were squashed together. Han Sen hesitated, trying to decide if he should take the blood kirin with him to the sanctuaries. Even if the powers of the sanctuary harmed the creature, it was better than being squeezed into a sausage then and there.\n\nThe rainbow sea conch didn’t move. It kept pushing the glass down on Han Sen and the blood kirin in a cruel bid to crush them. The black sea conch was standing just outside the glass, and it seemed darkly amused. It moved around a little, and small black things emerged from its shell. They were the black sea conches.\n\nThose small sea conches surrounded the glass like a tide of water. There was a countless number of them, and they looked like a cloud of ink.\n\nHan Sen felt a chill as he looked at them. If the glass squashed him to a pulp, he wouldn’t feel safe dying. His dead body would be devoured by the hungry sea conches.\n\nAs Han Sen gritted his teeth and prepared to use his Blood-Pulse Sutra to return to the sanctuaries, a beautiful red light appeared above him, shining down into the depths of the sea.\n\nAfter that, Han Sen saw a burning flame swoop across the sea. It was like a fiery phoenix coming down from the heavens. The strange-looking red light was its flames.\n\nThe black sea conch and the rainbow crystal sea conch noticed the phoenix. The black sea conch was frightening, and it immediately retreated back into its shell. Its blue light appeared a moment later.\n\nThe rainbow sea conch gathered its rainbow-colored substance chains into powerful waves of rainbow glass that went right for the phoenix.\n\nPang!\n\nThe glass covered the phoenix.\n\nThe black sea conch poked its head out when it saw the fire phoenix get trapped. It was so happy that it jumped a little.\n\nPang!\n\nThe next second, the phoenix shrieked, and the red flames of its body rose. The incredibly hard glass turned to lava beneath the strength of the bird’s flames. The melted glass began to run like candle wax.\n\nThe phoenix flapped its wings, and the glass shattered completely. Even the shards soon melted into a red liquid.\n\nThe underwater landscape was smoldering, and the light danced strangely over the seafloor. It was shockingly pretty.\n\nThe rainbow sea conch saw all this, and even more rainbow substance chains lashed out crazily. They became another weird shape of glass that headed for the phoenix.\n\nThe phoenix flapped its wings and spat out some gold fire. The fire pierced through the rainbow sea conch’s glass and kept on going towards the beast.\n\nThe rainbow sea conch’s eyes opened wide. It gathered up power upon its shell, and then its body retreated inside.\n\nThe gold fire splashed atop the crystal conch shell. Instead of breaking the shell, though, the fire burned around the shell and made it shine like a rainbow.\n\nThe phoenix looked at Han Sen and the blood kirin. It spat a fireball toward them and melted the glass that had trapped them.\n\n“Little red bird!” Han Sen and the blood kirin escaped. Han Sen, upon seeing the red phoenix, was ridiculously happy. He exclaimed, “The Sun Raven’s body and the bird’s nest weren’t wasted. The little red bird is good!”\n\nThe little red bird flapped its wings and sent even more fire toward the rainbow sea conch. The scary gold fire wrapped around the sea conch like an embrace of flames.\n\nWhen the fire rose, the rainbow shell became a golden color. The shine dimmed.\n\nHan Sen glanced over and saw the black sea conch trying to escape. So, Han Sen summoned Spell as a sniper rifle and fired a bullet at the conch’s shell.\n\nThe black sea conch hadn’t wanted to draw the phoenix’s attention, so it hadn’t made use of its King area. It was slow, and Spell’s bullet hit the shell and broke it. The beast started to bleed.\n\nThe black sea conch squealed. Its situation had become even more desperate, so it unleashed its blue light and began moving away as quickly as it could.\n\n“You want to run away?” Han Sen pursued the creature, continuing to shoot at it.\n\nThe next bullet went through the blue light area and struck the black sea conch. It flew through the hole made by the previous bullet, and this time, blood flowed out like a spring.\n\nThe black sea conch’s recovery powers were strong, but that bullet hole wasn’t recovering in the least. The bullet hole existed on the beast as if it was a separate entity. It wasn’t healing.\n\nThat was the work of Spell’s Eternity skill. It made a solid wound that was impossible to heal again. That skill was more than a match for the black sea conch, too. Even a deified creature might not be able to break the power of that Eternity skill.\n\nHan Sen got closer to the black sea conch, and he turned Spell into dual pistols. He fired them repeatedly, and every bullet struck that same bullet hole. Ever-increasing amounts of blood poured from the black sea conch.\n\nThe blue light area combined with the sea conch’s shell and created an excellent defense system, but the flesh of the sea conch didn’t have a high level of defense. Plus, it wasn’t nearly fast enough to evade the bullets. Before long, it had been shot many times in that same spot.\n\nThe black sea conch’s body began to tremble. Its flesh shook, and black clouds poured out of its flesh. The black clouds were swarms of little black sea conches.\n\nHan Sen’s body shone with Kingese. The little sea conches tried to drill into Han Sen’s pores, but they all broke against the Kingese.\n\nThe black stone sea conch couldn’t run, and the little sea conches were unable to do anything to Han Sen. The big beast had been shot, and it was rapidly losing blood. The Purple Teeth power kept spreading into it as well, making the wound even worse.\n\nThe black sea conch’s climbing ability slowed. The blue light had weakened. When the blue light was fully extinguished, Han Sen fired his pistols to completely shatter the creature’s shell.\n\nWithout the protection of the blue light, the conch’s shell crumbled under the onslaught.\n\n“Xenogeneic King hunted: Move Mountain Sea Conch. Xenogeneic gene found. Obtained beast soul.”\n\nHan Sen happily went to check out what type of beast soul he had received.\n\nKing class xenogeneic beast soul Move Mountain Sea Conch: Area type.\n\nHan Sen was shocked. He hadn’t expected to receive another powerful area type beast soul. He didn’t know if King class area beast souls were extremely common or if he was simply lucky.\n\nHan Sen summoned his new beast soul to find out what it was like.\n\nHan Sen’s body shimmered with blue light, the same light that he had just seen the Move Mountain Sea Conch use. This delighted Han Sen.\n\nHe wanted to investigate the blue light further, but the rainbow sea conch was starting to emit some strange wheezing noises. Han Sen looked over and saw the rainbow sea conch still being slowly cooked by the little red bird. The creature appeared to be in a frenzy as it tried to run away."
}