{
    "chapter": 1945,
    "title": "Luo Ji’s Guess",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1945",
    "text": "Seven Spirit had four faces. The left one was smiling. The right one was crying. The back one was evil and very scary- looking.\n\nThe eight arms were raised at a variety of different angles. A spirit spell powered his strange body as he flew forward.\n\nHan Sen heard some screaming and explosions coming from behind him. He turned around and saw a few of the Demons—who had been running a kilometer behind him—get ripped apart. Their bodies were scattered all over the sands, splattering blood everywhere.\n\nSeven Spirit, with his gold Buddha body, chased after Luo Ji. He was the only one of his party who was still alive.\n\nLuo Ji knew he could not outrun the villain, and so he roared. His Demon smoke enshrouded the blade he wielded. He sent a full-powered Sky Demon attack towards Seven Spirit.\n\nSky Demon’s shadow swallowed Seven Spirit, but in less than a second, the shadow was torn apart. The four-faced, eight-armed Buddha that Seven Spirit had become escaped and teleported to Luo Ji. His arms grabbed Luo Ji, and Luo Ji watched with shocked eyes as the monster tore him apart.\n\n“That is cruel!” Han Sen was not in the mood to watch, so he kept running through the desert.\n\nAfter Luo Ji’s body was ripped apart, a black smoke came out of the body and landed on Han Sen. Han Sen felt the black smoke go into his Sea of Soul. His body could not prevent it from getting inside.\n\nOrdinary geno universe creatures had a Spirit Sea. Han Sen’s Spirit Sea was his Sea of Soul, and it was unique to beings that came from the sanctuaries.\n\nThe black smoke went in, and when it did, Destiny’s Tower shone. It was like a giant funnel that sucked the black smoke into the tower.\n\n“What is this place? Let me out!” The black smoke was now screaming from the top floor of Destiny’s Tower. The voice belonged to Luo Ji.\n\nHan Sen did not have the time to figure out what the black smoke was right now, though. Seven Spirit had killed all the Demons at once, and that hadn’t bought Han Sen as much time as he had hoped. His nemesis was catching up from behind once again.\n\nLuckily, Seven Spirit’s xenogeneic form had not increased his max speed. He was still unable to catch up with Han Sen, and that was why Han Sen did not feel the need to transform, either.\n\nSeven Spirit was not in a rush, though. He released his xenogeneic transformation and returned to his normal form to chase Han Sen. Becoming a xenogeneic might have increased his strength, but it had three times the energy cost.\n\nRemaining in a xenogeneic form wasn’t a good idea.\n\nThe chase continued, and Han Sen hoped to encounter someone else across the sands. He was hoping for a Duke, but as he ran, he didn’t see hide nor hair of anyone else.\n\n“I don’t know if Hai’er escaped,” Han Sen thought to himself. That was because he had not seen Seven Spirit’s clones return. It made him wonder how Hai’er might have been faring.\n\nHan Sen kept running for the next few days. Most of his power came from the rabbit shoes he used, but he still felt tired.\n\nSeven Spirit’s stamina level was incredible. He was still on Han Sen’s heels, and he hadn’t slowed down.\n\nThis guy is annoying!” Han Sen’s tired body still chugged along. Heaven was like an infinitely large realm, the ends of which could not be reached. The next horizon was always just desert.\n\n“I can’t just keep running like this forever. I have to reach the other end so Seven Spirit won’t attack me. How will I get to the other side, though?” Han Sen had been thinking this over and over for the past few days. He couldn’t come up with a solution.\n\nHan Sen put his mind into Destiny’s Tower. He spoke to Luo Ji, who was now a pillar of black smoke. “Luo Ji, do you know how to reach the other end?”\n\n“You got me killed. I won’t tell you. Go to hell!” The black smoke boomed with Luo Ji’s angry voice.\n\nHan Sen coldly said, “If I escape, you can still live this way. If I don’t, you won’t even be alive as a black smoke.”\n\nAfter that, Han Sen took control of Destiny’s Tower and made it shine. It shone on the black smoke, and the black smoke looked like water that had touched burning steel. The smoke was vaporizing, and Luo Ji was screaming.\n\n“Don’t kill me! I’ll tell you,” Luo Ji shouted.\n\n“Don’t feed me a single lie. If I die, you die. If I can escape, I will keep you alive. You’ll also be a witness for Seven Spirit chasing me,” Han Sen said.\n\nLuo Ji said, “Heaven is not a xenogeneic space. It is a deified treasure, but this treasure came from a deified elite of the Buddha. Even they can’t control it. They can only control a portion. Although they only control a small section, it is not difficult for them to trap people. If you get pinned, it will be impossible to reach the other end.”\n\n“But if they cannot control Heaven totally, we can escape their control somehow, right?” Han Sen asked.\n\n“That’d be difficult. Every time Heaven opens, only ten people can reach the other side. That isn’t a coincidence, you know. The Buddha do this on purpose. I made inquiries into those who did reach the other end, and I discovered that they are all close friends of the Buddha. Not many enemies can reach the exit,” Luo Ji said.\n\n“If you know this, then what were you still doing here? You must know of a way,” Han Sen asked.\n\nLuo Ji paused, and then said, “I have a guess, but I don’t know for certain. I have come here to find out.”\n\n“Tell me.” Han Sen looked back and saw Seven Spirit was still giving pursuit. He wasn’t worried that Han Sen would be able to escape Heaven.\n\nHan Sen thought to himself, “I’m afraid that what Luo Ji says might be true, but if so, then the Buddha have full control over who makes it out the other end. It isn’t random.”\n\nLuo Ji wasn’t certain, but under pressure from Han Sen, he relented and told the story.\n\nMany factions had researched the Buddha Heaven. They had guesses similar to Luo Ji’s, but no one had proven their authenticity. This was primarily because the Buddha forbade King class sorts from entering the Buddha Heaven. Ordinary Nobles could not do much in the Buddha Heaven.\n\nLuo Ji consulted many people that had reached the other side, and people that had gone deep without reaching the end. He gathered a lot of information and came up with a guess."
}