{
    "chapter": 1704,
    "title": "You Don’t Have to Understand",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1704",
    "text": "The sound of breaking flesh felt good to listen to. Seeing the blood cascade from the torn skin, the officer became ravenously excited.\n\nPang!\n\nSuddenly, a fist like cold water slammed across the officer’s face. It broke the fire that enveloped the officer and sent him soaring away with a twisted body. He fell into the ruins.\n\nHe stood up from the rubble and stared up at Han Sen, who was in the sky. He did so with a look of disbelief. He could not believe he had been hit by Han Sen, and his mask had been shattered.\n\nStay Up Late and the others could not believe this, either. They could not believe this had happened.\n\n“I don’t understand Heart Eye, and I don’t need to.” Han Sen licked his lips and looked down at the officer.\n\nThe officer didn’t say anything. He simply drew his sword and started swinging it towards Han Sen.\n\nPang!\n\nJust as the sword was going to land on Han Sen, he managed to punch the officer’s face with his right fist again. The officer’s face looked all mangled, and his body was sent barreling through the sky again.\n\n“How is that possible?” The officer held his face, and his pupils shrank in absolute disbelief.\n\n“It’s fine. It does not matter how strong you are; I will always be faster than you. Before you kill me, I will kill you.” When Han\n\nSen said this, his crystal shoes propelled him like a rocket, bringing him right before the officer.\n\n“This is impossible!” The officer could not believe what was happening, and so he just frantically swung his blade again.\n\nThe results were still the same, though. Just as the sword came down on Han Sen’s body, the officer was punched away.\n\nHan Sen could not understand or learn the officer’s Heart Eye, but that wasn’t a concern anymore. All he had to do was be faster than the officer.\n\nBefore he put on the crystal shoes, he wasn’t as fast as the officer. Now, things were different. The crystal shoes provided him a speed boost that allowed him to rival the officer, and become just as fast as him.\n\nAnd the glove, when it was in glove mode, imbued his right hand with a lot more speed and power. It was far stronger than\n\nit had been when it was protecting him via the armorset mode.\n\nBut the most important thing was Han Sen’s predictions and judgments. When he no longer had to care about countering the officer’s strikes, he just had to be faster than him.\n\nPang! Pang! Pang! Pang!\n\nThe fist and armor kept hitting each other. Han Sen’s hands railed against the officer’s body, breaking it fiercely.\n\nThe once-pretty officer was covered in blood, as more and more oozed from his mouth. His face was swollen and blue, and all semblance of fairness had abandoned it.\n\nThe officer kept on flailing his sword arm in vain, but he kept on getting hit by Han Sen every time he sought to land a blow. He could only damage Han Sen’s skin, and he couldn’t hurt him properly.\n\nThe officer just needed to be faster than Han Sen to kill him, but he couldn’t. He kept on getting hit by Han Sen each and every time.\n\nStay Up Late was in a state of shock. He had never before seen anyone triumph over Heart Eye in this way. It seemed a very risky thing to do, but Han Sen managed to strike first and firmly every single time. It really was quite unbelievable.\n\nBoom!\n\nAfter all those attacks, the officer’s geno armor started to crack. Han Sen punched him again, and he fell to the ground like a meteor. There was a giant crater following his descent\n\n“No… I cannot lose… I cannot lose to a human!” The officer wanted to pull himself out of the earth and fight.\n\nHan Sen swooped down from the sky and punched him square in the head, though. And then again and again, he kept punching his skull into the ground.\n\nThe officer’s head was beaten into a pit, which filled with blood that bubbled and sprayed. Eventually, the officer’s fingers weakened and dropped his sword. The Western King Sword fell to the ground and emitted some ding-dong noises.\n\nHan Sen wanted to keep on attacking, but the flames of the officer exploded like a sun.\n\n“Han Sen, I will be back!” After the explosion, the officer was gone. Only the voice remained, like an echo on the wind.\n\nHan Sen used Dongxuan Aura and attempted to search the vicinity for any trace of the officer. The officer had definitely become an enemy, so he’d feel better if he could kill the man now and spare himself some trouble down the road.\n\nThe officer was already beyond the atmosphere of the planet, though. He was traveling fast\n\nHan Sen wanted to give chase, but Little Angel and Golden Growler were both injured. He looked at the officer, flying away, and knew it would be hard to catch up.\n\nSo, he decided to fly in front of Zach.\n\nBoom!\n\nHan Sen punched Zach’s head. His right gloved fist was driven into Zach’s metal helmet and obliterated his head. His headless body crumpled to the ground.\n\nZagu looked eager to flee, but he was far slower than Han Sen and his crystal shoes. So, Han Sen was easily able to catch up and send his fist right through the escapee’s chest.\n\nAside from the officer who ran off, God’s Organization was out of commission. But even so, Han Sen was still not happy. And that was because of his inability to kill the officer outright.\n\nHan Sen looked at the white metal sword the officer had left behind. He held out his hand toward the metal sword, and the sword flew right into his palm.\n\nThe sword had already left a big impression on him. It was as good as the glove, there was no doubt about that, so it was quite the treasure to have.\n\nHan Sen did not know much about these items. He did not know the sword, glove, and crystal shoes were the armors of crystallizer kings. He did not know where the sword was from, but he sure knew how important it had been for the officer. Therefore, he spared no debate in taking it for himself.\n\nThe crystal shoes slipped off Han Sen’s feet, and then the glove left his hand. That was a surprise.\n\nThe glove and the shoes could move by themselves. He already knew the shoes could, but seeing the glove just flap around on its own was almost spooky.\n\nHe did not need to clean up after all that fighting, as the city had been completely leveled. There were no undamaged buildings anymore.\n\nJi Yanran called for someone to bring over a big airship they could stay in for the time being.\n\nFortunately, while there were many injuries, no one had been killed. Han Yufei met Luo Lan with his true self. When Luo Lan saw him, she didn’t say anything. She merely grabbed Han Yufei by the ear and dragged him into a room. After that, many horrible sounds were heard.\n\nHan Sen got goosebumps just hearing them, but when he next saw Zero, he was shocked. He realized something.\n\nZero was able to follow him into the sanctuary, and it never mattered which one. That meant she could always be near him. Up until now, Han Sen hadn’t been able to understand why that was possible. Now he understood."
}