{
    "chapter": 1873,
    "title": "Gana: Part 1",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1873",
    "text": "A moment later, Han Sen knew exactly what Gia’s power was. He did not hesitate, and he suddenly accelerated when her steel spear approached.\n\nThe steel spear and the horn power it carried were unable to catch up with him. Han Sen flashed past Gia, laying a slash across her neck with his knife. The strike wasn’t enough to completely behead her, but blood vessels and windpipe were severed.\n\nGia couldn’t speak, but she was still active. She swung her steel spear at Han Sen again. Han Sen sped up and dodged the incoming spear once more. Again, he plunged his knife into Gia’s back.\n\nGuna was standing in the cave, and she watched Han Sen’s brutal attacks with an expression of shock.\n\n“The Rebate’s Teeth power? How? He is not even one of the Rebate! How has he managed to use it?” Guna dropped into thought. “If he really is the buyer, an escape might be pretty difficult. At that speed, he’s faster than a Marquise. His power doesn’t seem to match that level of speed, though.”\n\nAs Guna pondered all this, Gia dropped her steel spear to the ground and fell over.\n\nHer wounds were bleeding profusely, particularly the injuries on her neck. Her neck had been halfway severed, and it had swiftly drained her. She hadn’t been able to stay strong.\n\nHer windpipe had been sliced in two, so she couldn’t even scream. All she could do was twitch on the ground.\n\nHan Sen then shoved his knife into her heart with ease, due to her inability to resist. He ended her life just like that. “Thank you for saving me. The Gana will repay this debt with generosity.” Guna bowed before Han Sen.\n\n“And what sort of reward should I expect from you guys?” Han Sen asked, glancing over Guna.\n\nThis was his chance. He wanted to use his powers to impress the Gana so that they might consider joining him. He had previously thought an opportunity like this would be impossible to come by.\n\nBut now, a chance had miraculously shown up right in front of him. He wasn’t going to let this chance pass him by. If he played his cards right, he wagered he could take her to Planet Eclipse.\n\nGuna looked at Han Sen and thought things might be going from bad to worse. She looked at his face and believed she had met someone who wasn’t a good man.\n\nGuna smiled and said, “There’s more of the Kao on Planet Crooked Rock, and the Gana are going to be practically helpless soon. If you do not mind, I would like to bring my family along with you someplace. We can follow you, and we can help you.”\n\nHan Sen was surprised, and he observed her facade of sincere gratitude. It made him laugh.\n\n“Can you take us with you, please?” Guna looked serious.\n\n“I can take you. But only you. Forget about your family. We are poor, so we cannot take care of too many people.” Han Sen smiled.\n\nGuna looked very sincere, despite her obvious anxiety. “Do not worry! We have a lot of savings, and we can give it all to you. Just promise you can take us somewhere nice.”\n\nHan Sen did not bother talking with Guna anymore. He had seen many evil people in the past, and there were far more out there with worse intentions than Guna. He could tell what sort of person she truly was.\n\nHan Sen moved up to her, then brought out something to tape her mouth shut.\n\nGuna’s face changed when she saw this, and she hurriedly tried to say, “I have a way for you to find many Gana that would be willing to obey you. Just let me go!”\n\nHan Sen didn’t stop, and the tape was drawing close to her mouth. She went on to say, “I am the leader’s daughter. You will encounter much trouble if you take me with you. And on top of all that, I don’t know how to produce medicine. You will have no use for me, take my word for that. If you provide me the chance, I can get five pharmacists for you to take with you safely.”\n\n“Tell me more.” Han Sen was interested enough to hear more, and he was rather surprised he had met and saved the leader’s daughter by mere happenstance.\n\n“Good!” Guna said. “You are my savior! If you take me back, my father is sure to provide you with the services of five pharmacists.”\n\n“I’ll give you one more chance.” Han Sen looked at Guna coldly.\n\nGuna bit at her lips and said, “You can take a video of me, and blackmail my father into procuring the services. Just ask for the help of a few, and he is sure to agree.”\n\nHan Sen went ahead and covered her mouth. He picked her up and left the cave, even as she struggled.\n\nHan Sen wouldn’t blackmail a leader of the Gana.\n\nThe Gana were considered kings of the planet, and so it would be quite easy for them to track Han Sen down. And if the Gana did find him, many elites of other races would do their best to save Guna, all in the hopes of earning more of the Gana’s trust.\n\nThe elites would undoubtedly find themselves summoned like Jade Gold King had been.\n\nHan Sen just wanted to take her back to Planet Eclipse. There was nothing she or her family could do once she was\n\nthere. The Gana was merely a small race of no renown, and the strongest amongst them was just a single King. They wouldn’t dare venture to Narrow Moon.\n\nEven if their King went there, it was unlikely he’d come back. The Rebate also required pharmacists like the Gana. It was cruel, yes, but it was also the truth. The Gana were known for their abilities, not their strength.\n\nBefore Han Sen exited the cave, he saw Dragon Lady, Meng’er, and Wang Yuhang all walking out.\n\n“Did you guys evolve a second time?” Han Sen asked Dragon Lady and Meng’er. They nodded, and it brought Han Sen some relief. He said, “Meng’er, follow me. Dragon Lady and Uncle can walk together. My ship is to the south, so Dragon Lady can just go and register. I will also invite Uncle.”\n\nAfter their discussion, Dragon Lady and Wang Yuhang left first. Guna looked upset, and Han Sen thought about how he might sneak her back to the ship.\n\nThe factions were spying on one another. If he brought one of the Gana back to the ship, he would look very suspicious.\n\nBut as Han Sen was thinking, Little Invisible showed up. It jumped on Guna’s head and then disappeared again. Strangely, Guna disappeared too. She became completely see-through like the creature, and it didn’t at all look as if she was standing where she was.\n\n“Good job, Little Invisible.” Han Sen was happy, and he hadn’t expected the little creature to have that sort of power."
}