{
    "chapter": 2373,
    "title": "Killing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2373",
    "text": "Han Sen’s eyes looked cold. He knew that the old woman had successfully provoked the other Sirens.\n\n“Lan Haixin, I hope you don’t regret your decision,” Han Sen said in an emotionless voice. He let go of the blood kirin’s head, then pulled out the Thunder God Spike and Ghost Teeth Knife that were attached to his waist.\n\nThe blood kirin roared and leaped at the old Siren woman. The blood air glowed with a deep scarlet light. It swept forward, looking like it was going to rip the old Siren Woman in half.\n\nLan Haixin and a few of the other Siren Kings came forward in an attempt to stop Han Sen.\n\n“I only want her. This has nothing to do with any of the rest of you. Anyone who tries to stop me will forfeit their life!” Han Sen said grimly. It didn’t look like he was going to fall back.\n\nThere was another way that Han Sen could have resolved this situation, but the direct approach would be much faster. He had no interest in making sacrifices for the good of the Sirens, or in being held responsible for their mistakes and stupidity.\n\nHan Sen slashed and thrust, and the area around him turned into a chaotic blur of knife airs and sword lights. He cut off the Siren Kings while the blood kirin surged after the old Siren woman.\n\nThe old Siren woman screamed, “I will use the Siren Sacrifice to seal them! You guys look for an opening to attack them.”\n\n“Elder… no!” the Sirens were all in shock.\n\nThe old Siren woman gathered herself up bravely. A blue water light spread out like blooming flowers as a scary presence began to rise within her. A Siren-shaped shadow landed on her, and her presence suddenly erupted like a volcano.\n\nThe blue water light slid out of the old Siren woman and became blue tentacles that wrapped around the blood kirin. The blood kirin broke the tentacles, but more were fast approaching. They managed to trap Han Sen and the blood kirin in their knotted grasp.\n\n“Elder, why are you doing this?” Lan Haixin looked pale. She knew exactly what the old Siren woman was doing.\n\nThe other Sirens were feeling much the same way; they knew that using Siren Sacrifice meant spending one’s life. The old Siren woman was laying down her life, and she obviously didn’t mean to bring them harm.\n\nMany of the Sirens looked at Han Sen and the blood kirin with gut-wrenching hatred. After all, it was Han Sen and the blood kirin that had pushed her to throw away her life and cast Siren Sacrifice.\n\nHan Sen knew that his last chance of getting through to them had disappeared. The old Siren woman’s move had been cruelly effective. No matter what he said, the other Sirens would no longer trust him.\n\n“It doesn’t matter anyway. It’s not my job to preserve the lives of these idiots. If they want to die this badly, then not even a saint could stop them. I am just Han Sen.” Han Sen calmly looked at the old Siren woman. He pushed against the blue light tentacles, and the brave-looking old Siren woman gave him a mocking smile.\n\nThis time, Lan Haixin didn’t need to give the order for the Sirens to attack the blood kirin and Han Sen. The Sirens rushed forward to kill them the moment that the old Siren woman trapped them.\n\n“As you wish,” Han Sen murmured to himself. He used his Original Water King Body’s area and the sea dragon area.\n\nMany areas collided within the palace. Han Sen pulled out his knife, and the blood kirin let out a thunderous roar. He ripped through the blue light tentacles to charge at the old Siren woman.\n\nKnives and swords flickered all around them as the Sirens attacked Han Sen and the blood kirin furiously. The Siren Kings were filled with bloodlust, and Han Sen had to deal with them and fight through the tentacles at the same time. The situation was a very dire and dangerous one.\n\nThe Sirens tried their best, and the old Siren woman made sure to look as sad and brave as possible. She was spending her own lifeforce to sustain the demonic Siren shadows, and it looked as if her light was about to fail. She was still struggling to hold on, though.\n\nAll seven of her holes were bleeding. Her hair had turned white, and it looked as if she was dying.\n\nSuddenly, the old Siren woman coughed up some blood. Her body was shaking, and it looked as if she was about to keel over.\n\n“Elder!” Lan Haixin shouted.\n\n“Forget about me! I deserve to die. I cannot allow the Siren to be destroyed right before my eyes. I will protect the Siren and their blood, even if it costs me my life,” the old Siren woman screamed. The blue light exploded again in even greater volume. It looked like she had poured all of her remaining lifeforce into this last blast.\n\nThe Sirens’ eyes were red as they were filled with anger and grief. They used 120% of their power. They wanted to use this final chance to take out Han Sen and the blood kirin.\n\n“Lan Haixin, you can still come back if you stop this now!” Han Sen said from atop the blood kirin. He looked directly at Lan Haixin.\n\nLilly was sitting behind Han Sen and holding tight to his waist. This fight was out of her league. If not for Han Sen, the streams of power would already have torn her apart.\n\n“Why must you and your mother bring harm to the Sirens? Even if we did something bad to you guys, you still have Siren blood inside you. Can you not let go of the hatred in your hearts? Why must you try to kill us?” Lan Haixin looked sad as she spoke.\n\n“I told you! This is none of my business. She is the one who set you guys up.” Han Sen pointed at the old Siren woman as he spoke.\n\n“Bai Yi, why are you still talking like this? Do you think we are idiots or something?” A Siren King bellowed.\n\n“Today, I will kill you on behalf of the elder!” Another Siren King roared.\n\n“Kill him!”\n\n…\n\n“I have given you guys three chances. What happens now is on you.” Han Sen lifted his weapon and thrust it forward. Suddenly, the entire hall was webbed with knife silks. They appeared everywhere, and they were pressing forward.\n\nBlergh!\n\nFresh blood splattered throughout the palace. The knife silks killed the Sirens and sliced through the blue light tentacles. Limbs and blood were flying through the air, and suddenly, the whole hall was turned red.\n\nEveryone in the hall, aside from Han Sen, Lilly, the blood kirin, Lan Haixin, Bao’er, and the old Siren woman, had been killed. The Siren Kings had all been dismembered.\n\nSome of the Siren Kings were still breathing. But having lost their limbs, they could only scream hoarsely as they wallowed in their own blood.\n\nLan Haixin’s eyes widened, and she just stood there. She looked terrified. Hopeless. Disbelieving. A myriad of emotions flickered across her face.\n\n“You…” Lan Haixin’s body was trembling as she pointed at Han Sen. She hadn’t expected this to be the end. She hadn’t expected Han Sen to be so strong.\n\n“I did as you wished. Are you happy now?” Han Sen ignored Lan Haixin and spoke to the old Siren woman.\n\n“Haha! I can see now that you truly are of that b*tch’s blood… Your hearts are deep! But it doesn’t make a difference, even if you did see through my plan. I still played you!” the old Siren woman cackled. She didn’t look sad. And her dying body suddenly looked very alive.\n\nLan Haixin stared at the old Siren woman. She couldn’t believe her eyes.\n\nThe Siren blood on the ground began to move. It raced to the altar and dyed the altar red."
}