{
    "chapter": 2307,
    "title": "King Dragon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2307",
    "text": "Han Sen couldn’t believe that the dragons soaring across the landscape were actually tree roots. They had the heads of dragons, the horns of dragons, the teeth of dragons, and the scales of dragons. They looked so alive, and they didn’t look like plants at all.\n\nAs Han Sen watched them, a flock of birds landed on the back of one of the dragons. The dragon roared, shaking the creature’s beard and exposing its rows of razor-sharp teeth. The dragon’s roar was so loud that it shook the air, scattering all the birds. It really was a living, breathing dragon.\n\nBai Wei explained, “The King Tree grows on a landmass inside the King’s Kingdom, and occasionally, parts of the tree spawn into king root dragons. The king air is hidden inside the king roots. To absorb the king air, you have to sit on one of those king dragons. Every king dragon is different, and each one provides access to a different type of king air. How much king air you can absorb also depends on how far away from the tree a particular dragon is. Sitting on a dragon close to the tree provides the most king air. The further away you are, the less you get.”\n\n“I see. Why is there no one else around?” Han Sen nodded and looked around. He didn’t see any of the Extreme King absorbing king air around them.\n\n“We are at the edge of King’s Garden. These are the ends of the king roots, so the king air isn’t strong here. Those of our race usually sit closer to the tree to absorb the most king air. This is our first time coming here, so let’s find a king dragon here.” After speaking, Bai Wei went towards a king dragon.\n\nThey were a few miles away from the nearest king dragon. As they approached, the king dragon roared at them, as if it was warning them to keep away.\n\nBai Wei and Han Sen ignored the warning, continuing toward the king dragon. The king dragon moved its massive body. It shook the mountain in an attempt to halt Bai Wei and Han Sen’s approach.\n\nHan Sen noticed that he could only see half of the king dragon’s body. The other half of the dragon was somewhere underground. It couldn’t fly, so it just had to shake its body in an attempt to shoo them off.\n\nThe king dragon was powerful, but it couldn’t release its power. Its body was restricted, as well. It had no chance of stopping Han Sen and Bai Wei. They landed easily atop its dragon horns.\n\nThe king dragon thrashed around for a while, but when its writhing failed to shake Han Sen and Bai Wei off, it eventually grew quiet and laid down again.\n\nHan Sen sat on the dragon’s head, but he didn’t feel any of the king air. He looked at Bai Wei.\n\nBai Wei smiled. “You will understand soon.”\n\nHan Sen resigned himself to waiting. The king dragon here was at the periphery of the roots. There wasn’t much king air, but the king dragon’s power was too weak to touch them.\n\nAfter a while, the yellow leaves on the tree started to light up. The Kingese characters were shone gold as the King Tree lit with a holy light. It was like a godly tree that gave life to everything in its domain.\n\nAll of the dragons started to roar as they shifted and roused themselves. Before Han Sen could find out what was going on, the king dragon he was atop put its head into the ground.\n\nThe ground was like water as the king dragon sank into it. Han Sen and Bai Wei were still sitting atop the dragon’s head, so they were carried underground as well.\n\nTheir subterranean surroundings should have been dark, but they could see a light as if it was glowing underwater. Something gold shone like a sun, but it was blurry and distant.\n\nThe King Dragon sat far away from that gold sun. It faced the gold sun, opened its dragon mouth, and spat out a dragon orb. The sun released golden light that shot into the dragon orb. The glow of the dragon orb increased.\n\nHan Sen was frozen. He was still wrapping his mind around the fact that they were underground.\n\n“Come and absorb the king air. What are you waiting for?” Bai Wei reminded Han Sen, as she cast a geno art.\n\nWhen Bai Wei cast her geno art, the golden sun released some gold light into her body. Her form was suddenly surrounded by a layer of golden holy light.\n\nHan Sen cast The Story of Genes to try to absorb that golden light. He felt something hot running into him, combining with his sense of being, but there wasn’t much of it. Refining his Ghost Bone power would be faster.\n\nThe legs of a mosquito are still meat, and so Han Sen did his best to absorb as much of that golden light as possible. But after one hour, the king dragon retrieved its dragon orb. It roared and brought them back up to the surface.\n\n“There’s not enough king air, and we have too little time to absorb it.” Han Sen shook his head.\n\n“This king dragon is part of the outer reaches of the king tree. To get closer to the king pulse and make it last longer, you must find a king dragon that is connected to the primary roots,” Bai Wei said.\n\n“Well, what are we waiting for?” Han Sen was dying to find a source of purer power.\n\n“The primary roots are usually taken. If we get close, we’ll have to fight others for it.” Bai Wei sighed.\n\n“There must be a few of them that arrive late,” Han Sen said.\n\nBai Wei shook her head. “In here, power is the rule that governs everything. If you have the power, you can take over whatever you wish to. If you don’t have power, you have to make use of an ordinary beard. You can do whatever you want, as long as you don’t kill anyone.”\n\n“That father you guys have isn’t very caring. Doesn’t he treat the daughters nicer?” Han Sen looked depressed.\n\n“No,” Bai Wei answered without a second thought.\n\n“In that case, we really will have to go and take what we want,” Han Sen said. Then, he walked deeper into the king tree.\n\nBai Wei said nothing, and she simply followed Han Sen.\n\nThey were both Dukes, and there were only two of them. Getting one of the primary roots would be next to impossible. After all, only King class elites took primary roots, and they always had a team of Royal Guards beside them. It would be difficult to fight people like that for a root.\n\nBai Wei wasn’t planning on fighting, though. She wanted to try her luck and see if she could just find an unoccupied primary root.\n\nAfter all, the royal children weren’t allowed to go there every day. And the Royal Guards had to be accompanied by royal children, so they couldn’t go alone. So, if they were lucky, it wouldn’t be difficult to find a primary root.\n\nThe closer to the King Tree they got, the scarier the king dragons became. Most king dragons were a dirty yellow color. It wasn’t long before they encountered a king dragon that had gold scales. It was just resting on the ground.\n\n“That’s the king dragon of a primary root!” Bai Wei was ecstatic because no one else was making use of the gold dragon. It was obviously not taken.\n\nHan Sen and Bai Wei carefully sat down atop the gold king dragon. The gold king dragon was still asleep, though, and it didn’t appear to have noticed their presence. The two of them just sat on its head.\n\n“These king dragons have just absorbed some king air. They won’t go back into the ground for a while, so let’s wait here.” Bai Wei was in fine spirits, and she smiled at Han Sen."
}