{
    "chapter": 2696,
    "title": "Reversing Bloodline",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2696",
    "text": "“D*mn it! This isn’t the way.” Han Sen felt terrible. His power was no match for the monster’s, and the skills he had were losing their effectiveness.\n\n“I have to try this out!” As Han Sen teleported away, he used the moment’s reprieve to pull out a piece of gear. It was a peculiar bottle. The handle was the tail of two sirens. It was the holy item Siren Bottle from the sirens in the Extreme King.\n\nHan Sen tapped on the left side of the Siren Bottle, but before he could take the next step, the Red Blood Demon was in front of him. Its sharp claws were like knives, and Han Sen was unable to avoid them. He immediately summoned the Shield of the Medusa’s Gaze to block the Red Blood Demon’s scary attacks.\n\nAlthough Han Sen couldn’t use the power of the shield to attack, it still had amazing defenses. The Red Blood Demon’s claws came down on the shield but failed to deal any damage to it. The scary power blasted Han Sen and the shield away, though.\n\nPang!\n\nHan Sen’s body slammed into the back wall of the hall. His entire body felt as if it had been shattered. It was almost too painful for him to stand back up.\n\nHan Sen got control of his pain and teleported away. The next moment, the Red Blood Demon was right where Han Sen had just been. The red substance chains lashed out against the wall and made the spells flash.\n\nThe Siren Bottle that had fallen to the floor was glowing weirdly. It displayed the face of the Siren Virgin.\n\n“Siren Virgin, I’m in trouble. Help me get rid of this guy!” Han Sen quickly shouted at the Siren Virgin when she appeared.\n\nHan Sen had just said that when the Red Blood Demon’s talons flashed toward him again. Han Sen flapped his Apollo Wings and, through careful judgment, decided to veer left. He managed to evade the attack. But the Red Blood Demon’s body flashed again. Those claws were right in front of Han Sen once more.\n\nHan Sen tried his best to dodge, but a substance chain still connected with his shoulder. The blow opened him deeply enough to expose pale white bones inside his flesh.\n\n“The Red Blood Demon?” the Siren Virgin said in shock when she saw the Red Blood Demon.\n\n“It’s good that you know this creep. This is just a doppelganger, though. It is only primitive class. Do you know how to deal with it?” Han Sen immediately asked as he teleported again.\n\nWith a wry smile, the Siren Virgin said, “If my true body was still here, perhaps I could fight it. But right now, I still don’t have a body. There is no way for me to help you. Although it is just a doppelganger, the Red Blood Demon is a doppelganger that carries the battle experience of its true self. It isn’t like an ordinary primitive deified. So, I wish you luck.”\n\nAfter that, the body of the Siren Virgin shrank. She returned to the Siren Bottle.\n\nHan Sen didn’t have any time to be angry. The Red Blood Demon was already on him again. He had nowhere to dodge, so he had to use the Shield of the Medusa’s Gaze to block the strike again.\n\nAlthough the shield protected Han Sen’s body from the creature’s claws, it did nothing to soften the impact of the strike. It made Han Sen’s body feel like it had been struck by a big hammer.\n\nHan Sen was unable to fight the fiend, and he knew he couldn’t escape. He was at a dead end.\n\n“I can’t keep going on like this. If this keeps up, my body isn’t going to last. Even if I find a chance to strike back, I won’t have any strength left to do so. I guess I will just have to try this.” Han Sen gritted his teeth. The Blood-Pulse Sutra inside his body began to surge like mad, but this time, it was different. The Blood-Pulse Sutra’s path ran in complete reverse.\n\nThis geno art was no longer the Blood-Pulse Sutra. It was the Xuan Yellow Sutra Han Sen had fished out of the Underworld Lake. It was a different geno art entirely from the Blood-Pulse Sutra.\n\nHan Sen was desperate. He had to try every option he had before it was too late. If Mister White’s theory of the Xuan Yellow Sutra was correct, perhaps the Xuan Yellow Sutra was the last thing that could save Han Sen’s life.\n\nIf someone else had attempted to practice the Xuan Yellow Sutra, it would have been extremely hard. But to cast it, Han Sen only had to reverse the Blood-Pulse Sutra. He hadn’t even needed to practice with it.\n\nBut this was Han Sen’s first time casting the Xuan Yellow Sutra. He didn’t know what would happen after he used it.\n\nThe Blood-Pulse Sutra’s power was gunning in reverse through Han Sen’s body. It made him feel like his entire body was covered in static. It made him feel as if his body wasn’t coursing with blood, but with electricity instead. The tingling pain almost made Han Sen—a man with a strong will—scream aloud.\n\nThe Blood-Pulse Sutra usually released a red aura. In reverse, though, that color darkened to a red that was nearly black. It was like old, dried-up blood.\n\nThe Red Blood Demon was unbothered by this change. Its eyes still looked murderous, and it swung its claws at Han Sen again.\n\nIt would be too hard for Han Sen to dodge. His body was in so much pain that it felt like he was going to be torn apart. There was no way he could dodge the next strike.\n\nHan Sen gritted his teeth to endure the pain and raised his shield to protect his body. At the same time, he punched toward the Red Blood Demon.\n\nThe Red Blood Demon ignored Han Sen’s fist as the claws came down upon the surface of the shield.\n\nHan Sen clutched the shield desperately. He moaned in pain. The reversed Blood-Pulse Sutra released its power, and it felt as if his body was being torn apart. The pain he felt was too difficult to describe.\n\nPang!\n\nThe Red Blood Demon’s blow came down on the shield. Han Sen’s body flew away with the shield, but the Xuan Yellow Sutra he cast also hit the Red Blood Demon.\n\nHan Sen hit the seal again, and he once more coughed up blood. But he noticed that his wounds weren’t as grievous as they had been.\n\nThen, to his shock, Han Sen realized that the Blood-Pulse Sutra had become half-deified. It had finally completed a key step in its ascension, combining the nine tiers to revert back to one.\n\nHe quickly looked at the Red Blood Demon. He wanted to know if the Xuan Yellow Sutra had worked or not.\n\nThe results were disappointing. The Red Blood Demon didn’t look as if it had been injured. It looked the same as it always had. Its presence was oh-so scary. Before Han Sen could really get a good look at it, the Red Blood Demon was already committed to another attack.\n\n“Oh no, this is the end of the line for the great Han Sen… The Xuan Yellow Sutra didn’t work…” Han Sen thought sadly. If the Xuan Yellow Sutra didn’t work, he would have to use the Shield of the Medusa’s Gaze again.\n\nBut with his body already injured, using the shield would probably end up sucking him dry again. This time he could die, and it was way too big of a risk.\n\nSo, despite the dire nature of his situation, Han Sen hesitated to use the power of the shield. But as he hesitated, something unbelievable happened.\n\nHan Sen could feel the Red Blood Demon’s power and speed lessen."
}