{
    "chapter": 1702,
    "title": "Heart Eye",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1702",
    "text": "Pang!\n\nHan Sen used his dongxuan movements, thinking he could dodge the officer’s strikes. But he was hit, and he fell like a star. When he hit the earth, the impact created a big hole amidst the ruins and rubble.\n\n“Why can’t I dodge?” Han Sen wondered. He had seen himself manage to evade the strike, so it was a puzzle.\n\n“Don’t look at his sword, look at his eyes!” Stay Up Late called to Han Sen.\n\n“Look at his eyes? Why?” Han Sen did not know what that meant, but he did know there wasn’t time to dwell on the matter and think it over. The officer was on his way to strike again.\n\nHan Sen wanted to adhere to the advice and not look at the opponent’s sword, but he found himself unable to do it. If someone was coming at you with a sword, how could you not look at which way the weapon was falling? You’d die if you didn’t. This was instinct\n\nPang!\n\nHan Sen was sent flying again. Even though he was wearing the glove and its protective armor, he ended up coughing blood. The armor hadn’t broken yet, but there were some concerning dents across it. His organs felt ready to give up the ghost\n\n“Don’t look at his sword! Look into his eyes!” Stay Up Late was badly injured, and all he could do was shout at Han Sen from afar.\n\n“Explain it to me; how can I look at his eyes and not his sword? I can’t do it!” Han Sen shouted, as the officer came at him to strike once more. With his dongxuan movements and Heavenly Go, he did his best to try and dodge it.\n\nBut the tragedy continued. Stay Up Late had only learned a bit about Han Sen’s talents, but even through that, he had been able to dodge the officer. But Han Sen had the glove armor and was stronger, yet despite that, his evasions were unsuccessful, and he was repeatedly hit.\n\nThe glove armor was strong, but the Western King Sword and Southern King Wings were, as well. Han Sen couldn’t keep himself from being damaged.\n\n“The hand is the Heart Eye. The eye is the beginning of the hand. You need to see through his eyes to see his sword. That is his trick! If you do not register his eyes, you won’t evade a single one of his attacks,” Stay Up Late called as he healed himself.\n\nWhat does that mean? I don’t understand!” Han Sen shouted.\n\nWhen the officer hit Han Sen, the felon coldly said, “Night, you are too naive. Even under my teaching, it took you three months to begin to grasp the concept. Do you think he will understand in three minutes?”\n\n“How will I know if I don’t try?” Stay Up Late gave a wry smile.\n\nHe knew this would be a difficult concept for Han Sen to grasp, and it’d be a truly incredible thing if Han Sen was able to see into his enemy’s eyes in such a brief amount of time.\n\nBut there was no choice. Han Sen could understand that concept or die. There was no alternative.\n\nHan Sen realized he could not do anything to avoid the officer’s attacks, at all. So, he decided to stare into his opponent’s eye and take his mind off the brutal sword.\n\nHis eyes were nice. He had thin eyebrows and eyes as bright as a rising phoenix. While they were a pretty sight, Han Sen didn’t yet understand why he should be looking into them.\n\nAt least Han Sen had known how the earlier strikes had hit him. Now, if he was hit, he wouldn’t know exactly how it had happened.\n\nPang!\n\nHan Sen fell into the ruins again. He stood up and exclaimed, “Brother, are you playing with me? What is the point of looking into his eyes?”\n\n“You have to learn this and look deep into his eyes. Understand or you will die here.” Stay Up Late was confident about this, and spoke very surely.\n\nSo, Han Sen ran back out into the fray. His armor had a lot of marks and dents now. It was pretty earlier, but now it looked like rugged scrap. If this continued much longer, it’d likely break and leave him exposed.\n\nHan Sen’s body was already badly damaged, too. He had coughed up a hefty amount of blood throughout the fight, and it was fair to say that his body was in a worse condition than the armor was.\n\n“Save me, officer!” That was Yake’s voice. Yake was severely damaged, with his arm all mangled. He was running away.\n\nThe officer hesitated for a moment, but did not shy from his chosen target He was still going after Han Sen.\n\nThe Northern King Gloves were more important to him than Yake’s life. Although Ji Yanran had the crystal shoes, they were only using her to fight. Han Sen was a formidable foe, and he actually made use of the glove. If the officer took Han Sen out of the picture, getting the other item from Ji Yanran would be an easy task.\n\n“Argh!” Yake screamed, right as Bao’er annihilated his brain. He was very dead.\n\nBao’er’s armor broke then, too. Not because the enemy had shattered it, but just because she couldn’t support it anymore. She had eaten a lot of fruit, but it wasn’t enough to sustain continued use of the gear.\n\nJi Yanran then held onto Bao’er, who slumped weakly in her broken armor. As she did, Ji Yanran’s legs still fought and held off Zach and Zagu. Unfortunately, she was still unable to kill them.\n\nNear Little Angel, Golden Growler killed Rudy. Only Zach, Zagu, and the elusive officer were left out of the attacking forces.\n\nGolden Growler wanted to go over and help Han Sen, but Han Sen forbade this. He bid that they help Ji Yanran first.\n\nTheir powers were good, but they had not grown enough yet. And furthermore, they hadn’t generated self geno armor. If they came over to help, the officer would likely kill them in a single strike.\n\n“No… No… It’s not working.” Han Sen tried staring deep into the officer’s eyes, but it was all to no avail. Nothing was working, and he didn’t really know what he was supposed to see.\n\nThe officer’s eyes hadn’t changed. He looked at Han Sen’s body, but he attacked in a different location every time. It was difficult.\n\nHan Sen was good at judgment, but this was the one foe that his predictions did not work on.\n\nPang!\n\nHan Sen’s armor could not withstand the next strike, and it was broken by the Western King’s Sword. The strike almost obliterated the flesh beneath the armor.\n\nHan Sen was knocked to the ground, and he had trouble getting back up. If it wasn’t for the glove armor, he’d have already been rendered unable to fight.\n\nThe officer looked excited. He used his sword to try to stab Han Sen. He wanted nothing more than to kill the human so he could take the Northern King Glove.\n\nHan Sen gritted his teeth, wishing to summon Destiny’s Tower to block.\n\nBut suddenly, a scary power began to emerge. And it landed right on Han Sen."
}