{
    "chapter": 1142,
    "title": "Broken Bone",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1142",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe lady’s voice was like music, and just hearing it made Han Sen happy.\n\n“My name is Han Sen. What about you?” Han Sen asked.\n\nIf she was an emperor, she’d undoubtedly speak her title. And once she did, he could find out what or who she really was.\n\n“Xiang Yin,” the lady said with a smile.\n\n“Xiang… Yin…” Han Sen repeated after her, weirded out that it wasn’t a name typical of any spirit.\n\nXiang Yin looked at Han Sen and pointed at his Dragon-Blood Ring, saying, “Why would you have that? Has he died?”\n\n“You know Dragon King?” Han Sen asked with shock.\n\nHan Sen did not know whether the lady was a friend or foe of Dragon King, so he knew he’d have to tread carefully with his answers on the subject. The last thing he wanted was to have her as an enemy.\n\n“If you know Dragon King, how have you never heard my name?” Xiang Yin asked, with that ever-present smile.\n\nHan Sen was shocked, and so he asked, “Are you one of Ancient Devil’s generals?”\n\nXiang Yin said, “Do not avoid my question. Why do you have that ring? Where is he?”\n\nHan Sen eyed Xiang Yin dubiously, not expecting she might be one of the generals.\n\nBut at least he now knew why she had summoned him over there, and that was due to his possession of the Dragon-Blood Ring.\n\nEven if she was a general, though, she could be an enemy of Dragon King. There was no telling whether or not she was friendly with him.\n\nHan Sen told her, “I stumbled across it at the resurrection sight.”\n\nHe then went on to tell her the whole story, but with a few modifications. He told her he was only watching the entire thing, and he didn’t tell her what had actually gone on between him and Dragon King.\n\nXiang Yin, after hearing it all, sighed and said, “Even Dragon King failed to ascend. Tell me, is he dead?”\n\n“Sister, do you want to become a demi-god, too?” Han Sen, noticing how relatively non-hostile she was, was feeling some relief.\n\nShe nodded and said, “When the flower opens, that is the time.”\n\n“Flower? The jellyfish? They aren’t fruit?” Han Sen asked with shock.\n\nXiang Yin said, “Who told you these were fruit? They’re just the flowers of this tree.”\n\nHan Sen noticed Xiang Yin being quite relaxed, and so he asked, “There are many scary creatures here. Don’t you think they might interfere with your attempt of ascension?”\n\nXiang Yin glossed over them and said, “If I succeed, they are nothing greater than dust compared to me. If I fail, they can have my body.”\n\nHan Sen was shocked. It was then that he understood that the creatures were not there for the tree, but for her. They were waiting to see whether or not she would succeed.\n\nIf she failed, her flesh would be extremely beneficial and a whole lot more valuable to the creatures than any fruit could be.\n\nWhen she ascended, she would receive the powers of the Fourth God’s Sanctuary. If she failed, she would still have a bit of that juice left in her system.\n\nHan Sen no longer wanted to steal anything from the area. Seeing the beautiful woman happily face a life or death gambit, he felt incredibly antsy.\n\nHan Sen knew he could not compete with her, even if he tried his absolute best. But if she had a chance of becoming a demi-god, she was definitely an emperor with at least ten gene locks open.\n\n“I did not expect to meet someone I could talk to, before I departed this place. I would like to provide you with a gift before I depart.” Xiang Yin retrieved something weird.\n\nThe item had been created from bone, and it was oval-shaped. There was a hole on the top, with a number of smaller holes on its body.\n\nHan Sen had no idea what manner of instrument it was, but he knew it had to be incredibly powerful.\n\nHan Sen said he shouldn’t accept such an impressive gift, but his true intent manifested in his hands which lecherously reached out and grabbed it.\n\nXiang Yin smiled and said, “This is the Broken Bone. It was crafted from my collarbone. If I fail, this will be a historical relic, and proof of my existence.”\n\n“I am sure you will succeed,” Han Sen said.\n\nHan Sen was shocked, though. He thought the generals were all spirits, but if she was telling him the item was crafted from an actual bone of hers, it meant she was a humanoid super creature.\n\nOnly creatures could create something like this, as spirits could only craft geno treasures. Han Sen did not despise creatures, and he had many as pets like the silver fox.\n\nShe looked human, besides the fact. She was a stunning woman, and he was hard-pressed to believe she really was a creature. She was no nice and generous to give him a gift such as that.\n\nXiang Yin smiled, and suddenly, the flowers above began to shine and fall.\n\nThey didn’t fall off like flowers, though. They were like jellyfish, floating down deeper into the abyss of an ocean.\n\nThe glowing jellyfish were all around the tree, like a dream.\n\nBut the creatures did not admire the beauty of this scene, they instead stared at the center of the tree.\n\nHan Sen looked to where they did, and noticed there was a hole in the tree. The hole was bright, brimming with an untold energy.\n\nWhen the light from inside it got stronger, it was like witnessing a rising sun. The jellyfish flowers began to change their course and fly towards it."
}