{
    "chapter": 2292,
    "title": "The Prisoner at the Rear",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2292",
    "text": "The prisoner approached Han Sen. Although he walked slowly, he was already very close to them. A second later, he was directly behind Han Sen.\n\nAs the prisoner walked, his cuffs clinked and clanked. When he came to a stop behind Han Sen, he fell completely silent. Han Sen couldn’t even hear the prisoner breathing or his heart beating. It was as if he no longer existed.\n\nHan Sen used his Dongxuan Aura to scan the prisoner, but he was shocked to find that he could no longer detect the prisoner’s presence. Goosebumps flared across Han Sen’s body.\n\nThe prisoner was standing directly behind him, but he could not feel the strange, chained man. His inability to detect the creature deeply unsettled Han Sen. He wanted to just run away as fast as he could. But he was currently casting the red bird spell; if he left his position, then the Four Symbols Seal would break. If any of the four tried to run, they’d all end up dead.\n\nThe bird’s nest still sat on Han Sen’s head. He forced himself not to turn around, and he thought to himself, “So what if you are behind me? You can’t break this bird’s nest. I have nothing to be afraid of.”\n\nHan Sen stood where he was and did not move. He did not dare turn and look behind him. He continued to cast his powers through the red bird spell to keep the trapped xenogeneic suppressed.\n\nBut when Han Sen looked at Mister White and the others, he was given a shock.\n\nMister White’s face looked strange, but Han Sen couldn’t accurately read the man’s expression. Crime’s expression was easier to interpret, though. He was in massive shock. He stared behind Han Sen with wide eyes, as if he had seen a ghost.\n\nThe blood kirin’s response was even more dramatic. It was growling at Han Sen, as if in an urgent warning.\n\n“What is he doing behind me?” Han Sen’s heart felt chilled. He still couldn’t detect the presence behind him. It was as if the chained man wasn’t actually a creature at all, but some specter of death itself.\n\nMister White gulped. He looked pale, but still, he didn’t say a word.\n\nHis expression made Han Sen even more worried. Han Sen could no longer help it, so he moved his head to take a look. He couldn’t turn his head very far, though, because if he moved his hands or body he could disrupt the casting. After twisting his head to the left, he saw nothing.\n\nThen, he looked right. And still, he couldn’t see anything. Han Sen wished he could just twist his body around so he could properly see what the prisoner was doing. But he really couldn’t move his body.\n\nHan Sen couldn’t keep his eyes off the others’ horrified expressions, though. Their vision lingered on the space behind Han Sen, which made his heart tremble in fear.\n\n“F*ck you! I have a bird’s nest to protect me, and I have nothing to be afraid of.” Han Sen gritted his teeth and did not move.\n\nBut suddenly, Han Sen felt a chill run down his neck. It felt as if something was blowing a cold breath over his neck. Han Sen’s skin prickled as his back turned sore and his legs went soft.\n\nHan Sen had seen many scary things in his lifetime, so he didn’t frighten easily. But not being able to see the prisoner was deeply disturbing. He felt a deep chill in his heart.\n\n“Don’t move!” Mister White called to Han Sen.\n\n“What is he doing behind me?” Han Sen asked, his voice tense.\n\nIt was a shame that the blood kirin couldn’t speak. If it had been able to talk, Han Sen would have asked it. Crime wasn’t trustworthy enough for Han Sen to bother asking him, though.\n\n“This is… hard to explain.” Mister White frowned, and he looked poorly. It seemed as if he didn’t know what to say.\n\nSeeing Mister White’s hesitation made Han Sen frown. He had no clue what was going on behind him.\n\nIf Han Sen was in danger, Crime and Mister White probably wouldn’t want to tell him, because they wouldn’t want to risk Han Sen moving and breaking the Four Symbols Seal. However, Han Sen didn’t think that was the reason for their behavior.\n\nIf Han Sen was attacked and wounded, then the Four Symbols Seal would break, anyway. They wouldn’t stay silent and tell him not to move.\n\n“If there is no actual danger, then why can they not tell me what’s wrong?” Han Sen wondered.\n\nHan Sen’s attempts to figure out what was happening were getting him nowhere, but his back felt colder and colder. His worry continued to deepen.\n\nMister White and Crime were still staring at the space behind him. The blood kirin kept growling at Han Sen, as if it wished to tell him something.\n\nHan Sen could no longer resist the temptation. He summoned Bao’er and asked her to take a look at the prisoner behind him.\n\nBao’er appeared on Han Sen’s shoulder. Han Sen spoke to her, “Bao’er, help your daddy take a look at what this thing is doing behind him.”\n\nBao’er nodded. She leaned over his shoulder and took a look behind him. She jerked in surprise and said, “Dad… behind you…”\n\n“What is behind me?” Han Sen quickly asked.\n\n“There is a man drawing on your back,” Bao’er said, after thinking.\n\n“Drawing?” Han Sen’s mind went blank for a minute. He was confused, and so he thought, “The prisoner is drawing something on my back? Is he an artist? Does he love drawing on humans? Is my body too good, and he could not help but use my fine figure for a canvas? No way! If he was fond of drawing on bodies, then he should have gone and found a pretty girl to paint upon. Why bother drawing on me?”\n\n“Bao’er, what is he drawing?” Han Sen quickly asked. Something else had to be going on here. Bao’er leaned further over Han Sen’s shoulder, peering at Han Sen’s back, but she didn’t speak.\n\n“Bao’er, what is he drawing?” Han Sen squeaked. He wasn’t scared, he told himself. He just didn’t like it.\n\nBao’er hesitated, but she eventually said, “It’s like… It’s like the creature is drawing a person… Yeah, a woman.”\n\n“A woman? What kind of woman?” Han Sen was frozen. A skeletal prisoner had appeared out of nowhere, slinked up to his back, and started drawing a woman on him. This was too f*cking creepy, and it made Han Sen feel itchy and uncomfortable.\n\nBao’er didn’t seem to know how she might describe what she saw. With hesitation, she said, “An ugly, ugly woman.”\n\nHan Sen felt his pulse pounding in his temples. An ugly prisoner was now drawing an ugly woman on his back. What the f*ck was happening?\n\nHan Sen’s mouth was wide open. He tried to ask another question, but he had no idea what he should ask.\n\nBao’er observed his back some more, and then she said, “Dad, he cannot draw anymore.”\n\n“Why?” Han Sen asked curiously.\n\nBao’er responded quickly this time. “The blood of the woman coming from his hands is running dry, and there is no more paint left.”\n\n“What? He is using a woman’s blood to draw on my back?” Han Sen felt as if his head was going to explode. He could not imagine the scene behind him."
}