{
    "chapter": 2575,
    "title": "Geno Art Swapped for Fruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2575",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe Very High were admired by all. No matter where Exquisite and Li Keer went, they were as popular as the stars and the moon.\n\nEven when the Extreme King’s princes and princesses met with them, the royal children would be extra polite to them. They would treat the two Very High like VIPs at all times, not willing to do anything that might offend them.\n\nNow, they had been reduced to this. The crocodiles were treating them like lowly slaves, whereas Dollar was able to eat nice food and drink lovely beverages all day long. He made no effort to help them out. He never shared his food or did much with them.\n\nExquisite and Li Keer hadn’t brought much food of their own. After all, they had God’s Wander. They could use Galaxy Teleport to grab what they needed whenever they wanted. They didn’t have to bring simple necessities like food with them. But they had finished all their reserves, and there was nothing more for them in that place. They could last another two or three months by consuming the energy stored in their bodies, but they still wanted to eat food. It was in the nature of their bodies, and they couldn’t help it.\n\nExquisite was faring a little better. She had trained her Very High Sense for a long time, so her detachment from personal connections, known as Forget Love, was at a very high level. It helped her separate herself from worldly desires. Li Keer, however, was in dire straits. She couldn’t control her temptation for food.\n\n“Dollar, can you sell us some of your food?” Li Keer asked Han Sen, chewing her lip distractedly.\n\n“Sure. What would you like to buy? Grilled chicken or grilled goose? Roast lamb or roast pork? You can have something that flies and something that swims. I have everything you could ever need,” Han Sen said expansively, agreeing to the request with haste.\n\n“There is no need to go to such trouble. Just giving us some of that fruit will do.” Li Keer said, eying Han Sen’s plate that was stuffed with fresh peaches.\n\nThe Very High were like a mix between the Sky and humans. They would kill if they had to, but they wouldn’t kill for no reason. They didn’t like to waste or take lives without purpose.\n\nThe chicken that Han Sen was eating smelled nice, but it wouldn’t provide much energy. There was no point in eating it, so eating the fruit would be better.\n\n“Sure. One fruit meal for a geno art.” Han Sen picked up a peach that was bigger than his fist, and he smiled at Li Keer.\n\n“Why don’t you just mug me, instead?” Li Keer’s eyes opened wide at Han Sen. She couldn’t believe her ears.\n\nThe peach was a xenogeneic plant’s fruit, but it wasn’t high-level. Far from it. The fruit was probably ranked no higher than Baron. Swapping a fruit like that for a geno art was practically daylight robbery.\n\n“It’s up to you. I’m not the one who suggested a trade.” Han Sen shrugged and began munching on the peach. Juice dribbled from the peach as he bit into it, and a delectable fragrance came wafting out of it.\n\n“Okay. That branch of fruit for a geno art. I will make the trade.” Li Keer gritted her teeth and thought to herself, “We, the Very High, have a lot of geno arts. I know enough of them to kill you. If I just give you one random art after another, I will take all of your fruit.”\n\n“Wait, I have a condition. The geno art you give me must be one I’ve never learned before,” Han Sen said.\n\nHe was scamming Exquisite and Li Keer, and he wouldn’t feel a tiny bit sorry for doing so.\n\nHan Sen had believed them to be Sky, and he hadn’t minded helping them. Now that he knew they were from the Very High, his feelings toward them had changed.\n\nAny of the Very High in the core area wouldn’t require his help to kill a bronze tripod or a deified xenogeneic. That was just impossible to believe. He knew they were up to something, considering the way they had behaved around him.\n\nIf they had some sort of ulterior motive, then there was no need for Han Sen to be polite with them. He was going to scam them without remorse.\n\nIf he hadn’t learned who they were, Han Sen would have given them the fruit for free. The fruit wasn’t worth much to him, after all.\n\n“How am I supposed to know what you have learned, and how am I supposed to know what you can or cannot learn?” Li Keer lifted her lips.\n\n“Tell me the geno art’s name and what it can be used for. I can figure it out for myself,” Han Sen said without moving.\n\n“Okay. Have you heard of the geno art Dragon Blood Evilbreaker? I can swap that geno art in exchange for your peach,” Li Keer said carefully.\n\nDragon Blood Evilbreaker was a secret geno art belonging to the Dragon, and outsiders were not permitted to read and learn its secrets. The Very High, however, were an exception to that rule.\n\nThe Very High had selected many Dragons for silkworms, and many of those Dragons possessed knowledge of Dragon Blood Evilbreaker. The Very High could sense their progress with it, and see into the secrets shrouding Dragon Blood Evilbreaker.\n\nIn truth, the same principle applied to all races across the whole geno universe. The secrets of each individual race’s geno arts meant little before the Very High. They could see through everything.\n\nIt was just as Li Keer said. The number of geno arts she knew about could kill Han Sen. It would be no trouble, and she could easily bring out a few hundred.\n\nThe Very High had a rule about not teaching others the geno arts that they had collected. They had many geno arts from many races. In some ways, their race was like an encyclopedia of geno arts.\n\nOf course, it didn’t matter how many geno arts she had; Li Keer would not sell them out easily. She knew she would soon have Han Sen as her silkworm, and so she wasn’t all that worried.\n\nEven so, Li Keer was only going to present him with the geno arts of outsiders for now. She wasn’t willing to leak the secret geno arts that belonged to the Very High.\n\nPlus, Dragon Blood Evilbreaker required the blood of the Dragon race to practice. She decided to mention that one in particular because she didn’t think Han Sen could make use of it. She wanted to dishearten him.\n\n“Fine. Then I will accept the Dragon Blood Evilbreaker.” Han Sen agreed to it quickly and tossed her a peach.\n\nHan Sen had seen Dragon One use Dragon Blood Evilbreaker, and he thought it was a pretty decent geno art. It was similar to Saving Money. He didn’t know if he could practice it, but simply hearing about it would be helpful.\n\n“You really want to learn Dragon Blood Evilbreaker?” Li Keer was shocked. She then remembered that Dollar had somehow been able to learn Big Destroyed. With that thought, she considered the possibility that he might actually be able to learn Dragon Blood Evilbreaker. It made her hesitate.\n\nThe Very High were strict about their rules. Although they had thousands of geno arts, with many coming from other races, they weren’t allowed to leak them to others. Teaching someone an ordinary geno art would be okay, but Dragon Blood Evilbreaker was a secret skill of the Dragons. If the details of the geno art became common knowledge, it could affect the Dragons. That was something the Very High didn’t want to see.\n\n“Are you just saying whatever you can to get the fruit? Are you hesitating because you don’t actually know Dragon Blood Evilbreaker?” Han Sen saw Li Keer hesitate. His expression looked something like a smile, but it wasn’t pleasant at all.\n\n“Of course I know Dragon Blood Evilbreaker, but…” Li Keer knew Han Sen was provoking her, but she still hesitated.\n\n“Make the exchange,” Exquisite said suddenly.\n\n“Third Sister, I’m not sure that’s a good idea,” Li Keer said to Exquisite.\n\n“It’s fine. I want to see if he can learn Dragon Blood Evilbreaker,” Exquisite said smoothly. Her eyes looked so strange.\n\nLi Keer nodded and turned back to Han Sen. “Alright. I will swap Dragon Blood Evilbreaker for the fruit. Listen closely, because I’m only going to tell you once.”\n\nHan Sen perked his ears and focused on the skill that Li Keer began to explain. He didn’t know if he could learn it, but he did know that Dragon Blood Evilbreaker was a high-quality art."
}