{
    "chapter": 2688,
    "title": "Broken Underworld Silk",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2688",
    "text": "“Have you thought about Under the Sky’s flaws?” Exquisite asked, glancing at Li Keer.\n\nLi Keer shook her head. “What about you?”\n\nExquisite shook her head as well. She frowned and said, “For us, silkworms are a way of gaining new understanding. However, they aren’t merely tools for learning. Our situation now is both good and bad. On the positive side, we’re learning a lot from Han Sen, and he’s allowed us to feel what having a truly powerful will is like. He will help us accelerate our growth. But if we keep learning and following him, we will simply be copying his progress. We will be aping him, so to speak. And no matter how closely we try to replicate what he has done, we will never achieve what the true Han Sen can accomplish. The path we tread must be one that leads to glory greater than our silkworm’s. We need to trailblaze a path of our own. But with the way things are now, that might be a very difficult prospect.”\n\nLi Keer cut in quickly. “Perhaps, but Han Sen’s will is too strong. At our level, we won’t be able to pinpoint his flaws for our own betterment.”\n\n“The fact that we can confess something like that is terrible, without a doubt. He is supposed to be our silkworm. We are not supposed to be his. If Han Sen leaves the impression that we cannot exceed his talents, then we are already limited by him,” Exquisite said with a look of seriousness.\n\n“In that case, what do you propose we do about it?” Li Keer couldn’t think of a way around this problem.\n\nIf Han Sen left an indelible impression of invincibility on their peers, then their achievements would be forever overshadowed by his own. That wasn’t the sort of silkworm they were looking for.\n\n“Han Sen needs to lose once. A loss is the only way that impression of him can be erased from our hearts,” Exquisite said.\n\n“Even Shale lost to him. I highly doubt that any other silkworm will come close to rivaling him in the near future.” Li Keer looked at Exquisite with confusion. She wasn’t entirely sure what her Third Sister was implying.\n\n“Why do you suggest it has to be a silkworm? Now that Han Sen has achieved first place, he should be able to go to Jail Demon Hall. He can start practicing there. First, it will be a great help for his own abilities. Secondly, he will probably get crushed. Once that happens, he will lose his confidence and cockiness. Thirdly, it will break the image we have of him. We’ll have a hard time viewing him as being so incredible if he gets defeated. That sounds like three birds with one stone, if you ask me,” Exquisite said coldly.\n\n“This is a brilliant idea. Now, let us go and register his application to enter Jail Demon Hall. Open Sky Elder earned a lot from Han Sen, so I doubt he will refuse his request to go there,” Li Keer replied merrily.\n\nHan Sen and Bao’er were still fishing at Underworld Lake. Li Keer gave an Underworld Silk to Bao’er, so Han Sen no longer had to share his own. But Han Sen was still feeling quite depressed. After he fished up the Xuan Yellow Sutra, the only things he had pulled from the lake were utter trash. Rusted armor and broken weapons were a frequent sight. He had even collected bits of broken statues and the like.\n\nOne time had been particularly bad. While he was fishing, he latched onto something super heavy. He had instantly assumed, based on the weight, that he had snagged something amazing. He spent half the day reeling it in. When he finally pulled it free of the lake, it was just a three-meter-tall statue with shoulders and legs missing. Han Sen’s lungs almost exploded.\n\nBao’er was sometimes able to fish up pieces of jewelry. Han Sen didn’t know what they were for.\n\nAnd also, the entire time, the 16 pigs continued to follow Bao’er around. They frequently munched on Bao’er’s snacks, but they didn’t grow at all. They each remained the size of a fist. They looked small and cute, but as far as Han Sen could tell, they were completely useless. If they were not spending their days eating and sleeping, they were sleeping and eating. It was either that or following Bao’er’s *ss and running around everywhere.\n\n“Dad, come here! There is something coming. It is so heavy…” Bao’er suddenly exclaimed.\n\nHan Sen quickly approached her, and he started tugging the string. It really did feel like something absurdly heavy. It was like the other end of the string was attached to a small mountain.\n\nHan Sen and Bao’er used all their strength as they tried to reel in the Underworld Silk from the lake. After pulling it for a while, they finally saw something coming up from below the swirling clouds. They could see its corner as it rose from the mist.\n\n“What is this thing?” Han Sen looked shocked when he saw the item.\n\nBased on what he could see, Han Sen could tell that the item was built from bronze. It had an opening that was one meter wide at the top and narrowed as it went farther down.\n\nAs the bronze item was slowly pulled up, more and more of it appeared above the fog. Han Sen could soon see that this bronze item’s opening was one meter in size. It was a statue of a sheep’s head.\n\nNo, not a single sheep’s head. Each of the object’s four corners held a sheep’s head.\n\n“This thing… It looks like a Four Sheep Cube,” Han Sen thought to himself when the bronze item finally slid into full view.\n\nPang!\n\nIt sounded as if something had broken. Although the bronze item had almost completely been removed from the lake, its ascension came to a halt. The Underworld Silk holding the statue had snapped.\n\nHan Sen watched the Four Sheep Cube sink back into the mist of the lake. He didn’t know if it was an illusion or not, but Han Sen could see the four sheep heads seemed to smile strangely at him as the object disappeared.\n\nHan Sen stared at the lake in confusion. The Underworld Silk had broken with ease, which was a first. Han Sen and Bao’er had spent a long time fishing with Underworld Silks, and never before had this happened. Now, the Underworld Silk had simply snapped without them understanding why.\n\nHe wanted to ask Li Keer and Exquisite, but they weren’t present. Han Sen had nothing else to do except continue his mellow fishing experience.\n\n“It has been a few days. Mister White should have some news for me. I should ask Li Keer to take me to the desert again,” Han Sen said to himself as he continued fishing. He had a simmering sense of excitement regarding the Xuan Yellow Sutra.\n\nHan Sen wouldn’t even have to practice the strange geno art. He only had to reverse his Blood-Pulse Sutra to make use of it. How lucky was he to stumble on such an easy new geno art?\n\n“I hope the Xuan Yellow Sutra is useful,” Han Sen thought to himself. But then he suddenly heard Bao’er shouting, “Dad, something is coming. Come and help me!”\n\nHan Sen saw Bao’er’s small hand clutching the Underworld Silk. She seemed to be struggling. The Underworld Silk had latched onto something heavy that kept the line taut, just like earlier.\n\nHan Sen raced over to her and grabbed hold of Bao’er’s Underworld Silk to pull the next item up. Whatever he was bringing up now was heavier than the Four Sheep Cube.\n\nHan Sen and Bao’er fought against that immense weight. There was a power that was pulling downward, struggling against them. They were on the verge of losing the Underworld Silk or getting pulled into the lake themselves.\n\nThe sixteen little piggies came over, too. They all stood in a line to bite the Underworld Silk. Then they leaned back, pulling it like a big game of tug o’ war.\n\n“Put your back into it, comrades… One, two, one, two…” Two people and sixteen small piglets were pulling the silk. They all shouted. After half a day, they finally saw something emerge from the lake.\n\nWhen they finally saw it, Han Sen couldn’t help but shout, “It is the Four Sheep Cube again!”"
}