{
    "chapter": 2543,
    "title": "Failure?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2543",
    "text": "When Elysian Moon’s self-cogwheel changed, the genes of her body changed more. Her swordmind became stronger and stronger, slowly climbing closer to the strength of the being that she and Gu Qingcheng created when they combined.\n\nBuzz!\n\nA blue umbrella was unleashed. It automatically opened over Elysian Moon’s head. The swordmind of the umbrella became heavier. The swordmind was surging throughout Elysian Moon’s body, spurring it on to change even more.\n\nGu Qingcheng was as shocked as she was happy. Even if she didn’t have the power of the Dongxuan Area to show her exactly what was happening, she could tell that Elysian Moon’s body was becoming stronger. It was becoming even more perfect.\n\nThat was especially true of the swordmind. It was the sword fairy picture she practiced, but different. Elysian Moon was now just like the sword fairy she had once imagined. Only instead of holding a sword, she held a paper umbrella instead.\n\nThe umbrella was like a sword. The ribs of the umbrella were like individual blades, and they all combined to make an amazing umbrella sword. As the umbrella sword changed, Elysian Moon’s body altered as well. The swordmind became almost tangible. The umbrella sword generated a sword sun and wrapped up Elysian Moon inside it.\n\nWhen the blue sword sun finally dimmed, Han Sen and Gu Qingcheng saw a cold, blue fairy. She was standing still, clutching a blue umbrella. It looked as if she no longer had to eat food, and she was like a goddess from the Moon Palace.\n\nHan Sen was shocked. He could no longer feel Elysian Moon’s swordmind now, but the fact that she could hide it from his detection made it even scarier.\n\nAs he looked over Elysian Moon now, Han Sen felt that she was no weaker than the figure she became when combined with Gu Qingcheng.\n\nAside from having just one super king body, her power should have been just as strong as it would have been if combined. But its nature was also different from the power that the combination being possessed.\n\n“The Blood-Pulse Sutra is such a powerful geno art. Why can I not use it on myself?” Han Sen felt very troubled by this. The geno art he practiced could pass genes to his children and help others in their evolution. He only received a small benefit himself, and he couldn’t use it to level up any faster.\n\nIn truth, Han Sen had simply misunderstood the concept of the geno art. Every time he practiced the Blood-Pulse Sutra, it was slowly modifying his genes. The Blood-Pulse Sutra helped his genes develop better, but it worked slowly. When Han Sen used his power on others, the results were just faster and easier to see.\n\nIt looked so weak, as it didn’t seem to directly benefit Han Sen himself. And that was why the Blood-Pulse Sutra was so scary.\n\nThe results the Blood-Pulse Sutra created reached far beyond the geno art itself.\n\nThe real purpose of the Blood-Pulse Sutra was to break the limitations of one’s blood lineage. So, the geno art wasn’t limited to a certain set of skills or techniques. Rather, the Blood-Pulse Sutra had the potential to expand one’s practice endlessly.\n\nMost ordinary people would never accomplish much in their lifetimes. They would work for the necessities of survival, and they would live within the confines of pre-determined limits. Most people were complacent, so they never put their full effort into transcending those limits or breaking the glass ceiling.\n\nBut some special people would end up doing things that others would consider unbelievable. Their success was never guaranteed, though. What people could do was unknown because the future itself was unknown.\n\nThe Blood-Pulse Sutra sought out ways for people to rise throughout their lives, and it tried to figure out the unknowns of the future. That was why it never limited the people that practiced with it. And unlike humans, who often got discouraged by failure, the Blood-Pulse Sutra never stopped trying. It was always there to help, in the background.\n\nA more modern way to explain this would be to say that Han Sen’s practice of the Blood-Pulse Sutra put him at the zenith of what technology could achieve. The people he cast the Blood-Pulse Sutra on would receive the best of what technology could provide. However, the person would only receive the best of what Han Sen had managed to discover. He couldn’t impart technologies that he himself hadn’t yet explored.\n\n“Did it work?” Han Sen looked at Elysian Moon, who had finished changing.\n\nElysian Moon shook her head. “My body has become stronger, but I can still feel a connection with her. The need to combine with her is still there, as well.”\n\nHan Sen looked at Gu Qingcheng. Gu Qingcheng shook her head and said, “That feeling is still here.”\n\nHan Sen comforted them by saying, “Maybe it is because your genes have yet to finish being repaired. That is why the feeling is still there. Perhaps you need to wait until your genes have finished, and then that feeling will be gone.”\n\nGu Qingcheng was confused, but she didn’t resist Han Sen’s power. Just like Elysian Moon, she walked in front of Han Sen and accepted the power of his Blood-Pulse Sutra.\n\nHer self-cogwheel was different from Elysian Moon’s. Gu Qingcheng’s self-cogwheel was green. She also had symbols that began to glow on the cogwheel. Even though Han Sen couldn’t directly interpret them, he had the overwhelming feeling that the symbols meant “sword.”\n\nGu Qingcheng’s evolution process was similar to Elysian Moon’s. Her body changed continually, becoming stronger and stronger. Her swordmind grew more powerful as well. When the old, bronze sword appeared, a strong swordmind wrapped her up. Inside it, she kept changing.\n\nBut the changes happening to her were different from those that Elysian Moon experienced. Gu Qingcheng was already a very holy woman, and when her body changed, her presence changed, as well.\n\nThat holy presence was still there, but it was now so much harder to feel. It was very mysterious.\n\nIf Gu Qingcheng used to be a fairy, then right now, she was becoming a goddess cloaked in fog. Her presence was half-transparent. It made others want to see her real face and pull down the facade she hid behind.\n\nShe was so pretty, and yet, she was so blurry. She was beautiful and mysterious. Even Han Sen, as he stared at her, thought to himself, “What a beautiful, dangerous woman. If this was in ancient times, she would destroy a country worse than Da Ji did.”\n\n“No, this is the era of the geno universe. If the scary elites of the universe saw her like this, it wouldn’t lead to the destruction of a country. It could spark a war. It could destroy far more than just the lives of a single system.” Han Sen was shocked. He looked at her for another couple of minutes, then turned away.\n\n“How do you feel?” Han Sen lowered his head and frowned.\n\nGu Qingcheng sighed and said, “I’m afraid you have made things worse. My body has evolved so much, and so has Elysian Moon’s. If we combine now, the damage created will be one thousand times more terrible.”\n\nHan Sen’s face changed upon hearing this. Clearly, their connection was still there.\n\nBut Han Sen wasn’t ready to give up yet. “Even if your connection is still there, if you guys stop getting old, you don’t need to combine. Therefore, all is fine.”\n\n“I don’t know. We would have to test such a system for a while and see if we get older,” Elysian Moon said.\n\n“Let’s just give it a try. If this method doesn’t work, then we’ll have to look at other options again,” Han Sen said, quietly praying that they wouldn’t continue to get older. If this failed, there was nothing else he could do."
}