{
    "chapter": 1324,
    "title": "Strong Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1324",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nMoment Queen saw the black hole and understood why Ming Xing Emperor was so keen to come forward and fight Han Sen, despite the stunning display in which the human had mercilessly slaughtered four emperors.\n\nIn the black hole, time and space were distorted. It would twist like a vortex and swallow whatever came near. If Han Sen was pulled inside, he’d be killed. The occurrences of someone surviving a black hole were rare.\n\nShe wouldn’t be sad if Han Sen died, but his death would result in her own. And of course, she couldn’t allow that.\n\nMing Xing Emperor was cocky and boisterous, and he loudly proclaimed, “You were a fool to employ time and space before, as I am the ruler of them.”\n\nBut after that, a gold blade came flying out of the black hole. It was carried by a human hand. Then, Han Sen and his ever-cool, calm, and composed face were standing before Ming Xing Emperor.\n\n“Impossible!” Ming Xing Emperor’s face changed, and he wished to quickly cast another black hole.\n\nBut it was too late for him to do so, for the gold sword had already hit him.\n\nHan Sen vanished once more and reappeared directly behind the spirit.\n\nMing Xing Emperor was frozen, acknowledging the slip he had made. His eyes were open wide in fright, as if they had been pinned in place.\n\nRoar!\n\nMing Xing Emperor’s black dragon screamed, as the mighty beast felt its entire body split in two. It collapsed to the ground. Ming Xing Emperor’s body was sliced in two as well, sending him right back to the spirit stone where he first started.\n\nBerserk Super Creature Black Dragon killed. Beast soul gained. The flesh of this creature is inedible, but you may harvest its Life Geno Essence. Consume its Life Geno Essence to gain zero to ten super geno points randomly.”\n\nAnd then there was silence. No one understood how Han Sen had managed to survive the traversal of a black hole, and many rubbed their eyes to ensure they had not been seeing things. Ming Xing Emperor really had been killed, just like that.\n\nHan Sen wasn’t just strong in body, his attacks were lethal, too. He had killed five emperors so far, with each being felled by a single strike. People started to believe they had stepped on the toes of a human who was even stronger than Godslayer Luo’s heir.\n\nNo other spirit dared approach this time, knowing they’d each likely meet the same grizzly end that had been delivered to the others.\n\nMoment Queen herself was in utter shock by the frightening power Han Sen had demonstrated.\n\nIt wasn’t just the skills of space and time that were excellent, it was who he was. Every aspect of him had been honed and refined. He was a fierce warrior unlike any she had seen before.\n\nWhen Moment Queen was at her strongest, she was nowhere near Han Sen’s level of might and strength. He was operating on a whole different field of play.\n\n“How did he manage to do that?” Moment Queen asked herself, as she looked at him with wide-eyed surprise. She was entirely still, having been stunned so severely.\n\n“He traversed the black hole. He went into it and came out of it,” Flower Empress said. Her voice was dull.\n\nThe woman did not say a single word now. Perhaps this was unexpected even for her, and she too was in shock.\n\nGu Demon Emperor frowned and said, “It is just as No God Emperor said; he is horribly strong. We will have to wait until Ruin Emperor gets here before trying again.”\n\n“Maybe not,” the three-eyed spirit said.\n\nNo God Emperor looked at him, unsure of what he meant by this.\n\nThe three-eyed spirit, acknowledging their confusion, eased their wonder by saying, “Look at that colorful ship; if East Empress was willing to help, this would be an easy task. And if we all fight together, striking at the same time, we should be able to get him.”\n\n“I don’t think she’ll fight. She herself has no grudge against Godslayer Luo. And that aside, she is almost a demi-god,” Gu Demon said.\n\n“She owes me a favor, you know. I’d be willing to call it in,” the three-eyed spirit said.\n\nGu Demon Emperor said, “Asking her would be a fine thing. And you’re right, we might not have to wait for Ruin Emperor, after all.”\n\n“I’ll go and ask her, then,” the three-eyed spirit said, before flying over to her ship.\n\n“Greetings, My Empress.” The three-eyed spirit did not set foot on the ship, thinking it would be rude.\n\n“Board, if you wish to speak,” the woman said.\n\nThe three-eyed spirit stepped onto the ship and looked around, telling her, “I have a favor I would like to ask of you.”\n\n“Spit it out before you drone,” the woman said.\n\nThe three-eyed spirit said, “That human is so arrogant. He makes a mockery of us by killing us repeatedly. He rivals the strength of Godslayer Luo, and so I would like to ask that you join us in a collaborative effort to strike, all at the same time.”\n\n“If you want something done, do it yourself!” Flower Empress butted in to say.\n\n“I would if I could,” the three-eyed spirit said with a faint and embarrassed smile, as all three of his eyes looked away.\n\nEast Empress responded by saying, “I made a vow not to kill. I cannot help you, I apologize.”\n\nThe three-eyed spirit looked disappointed, but then she said something else. “I haven’t forgotten that which I owe you. Take this; perhaps this will settle the debt.”\n\nAfter that, something just appeared in front of the three-eyed spirit.\n\nHe grabbed hold of it and said, “Thank you so much! I will kill this human for the restoration of our pride!”\n\n“This is a repayment. What you do with it, and whether you succeed in killing your enemy, is no concern of mine,” East Empress said.\n\nThe three-eyed spirit was not hurt by these words, he just gracefully said his goodbyes and left. He returned to the sides of No God Emperor and Gu Demon Emperor.\n\n“Did she say yes?” Gu Demon Emperor asked.\n\n“No, but she gave me this. With it, we can summon everyone,” the three-eyed spirit said.\n\nThe two spirits looked at it and said, “It’s a Summoning Bell? What did you do for her that warranted such a gracious gift?”"
}