{
    "chapter": 2324,
    "title": "Bai Yi’s Secret",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2324",
    "text": "Han Sen rummaged around the building. Mister White hadn’t told him exactly where the information he needed was, so he presumed it would be easy to find. If it wasn’t, Mister White should have told him—that was the logic.\n\nBut Han Sen searched the entire building from top to bottom and found nothing. The only place he hadn’t checked was Bai Yi’s computer.\n\nGaining access to the computer would require the password. Cracking the password wasn’t difficult for someone like Han Sen, though.\n\nIn that era, there were many people who could change their physical forms. Thus, using a body-identifier wasn’t considered to be a very secure method. Computers were mostly protected by passwords.\n\nHan Sen used his Purple-Eye Butterfly to rewind and get his hands on the password that had been established for the device. After typing it in, he was able to log in with ease.\n\n“Deified beast souls are so good. It would be cool if I could get a few more,” Han Sen thought to himself, as he read what was on the computer.\n\nWhoa!\n\nHan Sen thought that his nose had started bleeding for a minute. The picture on the computer kept changing. Many naked women were being cycled in front of him. They weren’t just women of the Extreme King, either; there were women of all sorts of races. And they were all laid out in sexy poses.\n\n“Sh*t! This Bai Wei is disgusting. He even has women of the Lane on here.” Han Sen changed the screen’s settings to only display to the person directly in front of it, to avoid people seeing things from the side. He didn’t want Bao’er to get an accidental look. She now couldn’t see anything from her place beside the computer. He noticed those pictures weren’t photoshopped, either. The women there really did exist.\n\n“What is wrong with this guy?” Han Sen quickly scanned through the files on the computer. He learned that the storage was pretty much filled to the brim with such content.\n\nIt wasn’t easy for Han Sen to find a simple word document in there. It had been written in an application that only allowed basic text. A well-developed race like the Extreme King would rarely make use of such archaic software.\n\nBut Han Sen found the document’s name to be quite strange. It was titled, “My Life.” Han Sen opened the document and found out that this was also password-protected.\n\nHan Sen used his Purple-Eye Butterfly to get the password again, then he proceeded to open the document. He was feeling quite cocky about this talent, and he said to himself, “Oh yeah. It looks like I can be quite a hacker.”\n\nBao’er blinked and said, “Dad, hackers use real skills. You are just cheating.”\n\n“Huh. Cheating is a skill, too. You’re just too young to understand. You will probably understand when you grow up,” Han Sen told her seriously.\n\nHan Sen looked at the notepad, which went on for a surprising number of pages. Luckily, it was written in the universal language, so Han Sen was able to read it all.\n\n“That b*tch. Don’t let me find her, or I’ll kill her…” The first line disappointed Han Sen.\n\nHan Sen thought the document would be filled with things Bai Yi had written down while he was horny. He thought it would be related to women.\n\nAfter Han Sen read for a while, he changed his mind. He had been partially right, actually. It was related to women: one woman, in specific. It was the woman Bai Yi couldn’t stop talking about. Almost every line was an angry complaint. He scribbled his frustrations down there because there was no one else for him to vent to.\n\nAside from the horny and horrible words, there were some important tidbits of information, too.\n\nHe was talking about one woman in particular. Bai Yi didn’t mention her name right away, but it wasn’t something he was hiding. It was easy to guess that the woman was the princess of the Siren.\n\nInterestingly, judging from the complaints, the woman became a princess by striking a deal.\n\nThe woman needed the identity of a princess for protection, and her people needed the shelter of the Extreme King for refuge. Bai Yi wanted something, too. He needed something from her.\n\nIn the complaints, a holy item was repeatedly mentioned. Han Sen didn’t know what it was, but he was sure that the holy item was a part of their bargain. The woman hadn’t given it up, though. It wasn’t as if the deal had been destroyed, but more like something happened and Bai Yi was unable to get it.\n\nThrough the words, Han Sen could tell Bai Yi was a very horny man. But he could also tell that the holy item he sought was more important than a woman. He spent more time talking about the item than the princess. It was obvious how badly he wanted that item.\n\nBut most of what Han Sen found was curses and accusations; there was nothing really complete. And as for what the deal was and why Bai Yi hadn’t gotten the item, Han Sen was unable to find out.\n\n“Although I know the secret between Bai Yi and the princess, it doesn’t really help me. I can’t stay here the whole time, and I can’t make friends with Bai Yi’s people. In front of his friends, I would be easily exposed.” Han Sen didn’t think this was the information Mister White wanted him to find.\n\nHan Sen looked through the files on Bai Yi’s computer for a while. There was nothing. It was all just 18+ images. There were videos of orgies between men and women. It was some scary stuff.\n\nBut Han Sen also noticed something else that was fairly weird. He forgot about the women in the videos for a second, and he focused on the men. The men looked like Bai Yi’s friends. They must have been his close friends.\n\nThey must have been higher-class if they could do things like this repeatedly with no repercussions. Han Sen tried to make mental sketches of their faces, hoping it would be useful down the line.\n\nHan Sen turned rather green when he discovered Bai Yi’s horrible fetishes. There were videos of elderly women. The sight of them made Han Sen want to throw up.\n\n“This guy is so sick. As long as it is a certified woman, he’s happy!” Han Sen complained. He didn’t want to watch the stuff anymore.\n\nDing!\n\nSuddenly, a message popped up on the computer. Han Sen quickly opened it.\n\n“Remember the details. Especially the details. But they are just my observations of Bai Yi. I do not know his secret, so you will have to be careful with how you behave. Do not expose your true identity, and be wary of King Bai, Ancient Abyss, and the princess. They are the most likely candidates to see through you. Be careful in front of them and act like Bai Yi. You are in danger. You might be exposed. If you are caught here, you are dead, and no one will be able to save you. Not even a deified person could. I do not have much time. You do not have time to practice, either. There is a geno art that can allow you to temporarily change yourself. Henceforth, you need to change your genes. Make it look like you are slowly returning to look like Bai Yi again.”\n\nThere was no name, but Han Sen knew that it was Mister White.\n\nThe paragraphs that followed were long. They talked about Bai Yi’s relationships, his likes, and his habits. There were a lot of details there, and Han Sen felt a lot more confident.\n\n“My Prince! No! Oh no!” As Han Sen was reading the information, Lilly suddenly started to scream."
}