{
    "chapter": 2623,
    "title": "Charm",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2623",
    "text": "“Woman, what are you doing?” The Liu Widow was leaning down to kiss him, so Han Sen used his hands to stop the descent of her lips.\n\n“I want you… Don’t you want the Liu family’s treasure? If you can love me like I want you to, I will give you anything you want.” Liu Widow was staring at him like a wolf in heat.\n\nNo, she was more like a horny vixen.\n\nHan Sen planted his hands on her waist and picked the Liu Widow up. He walked toward the yard and threw her down on a stone desk.\n\nHer arms and legs spread out across the desk, the Liu Widow closed her eyes. Her face was red and she panted swiftly as she said, “Don’t be gentle with me just because I’m a delicate woman.”\n\nBut after impatiently waiting for it to happen, nothing actually did. When she opened her eyes again, Han Sen had vanished from the yard.\n\nAfter Han Sen left the Liu Widow’s house, he power-walked down Black King City’s streets. But he felt as if something was wrong. The women all across Black King City cast strange glances his way. Their eyes seemed bold and hungry whenever they glanced at him.\n\nEven the eyes of shy, young girls looked like they were on fire whenever they looked at Han Sen.\n\n“This is wrong. Something is very wrong… Is this what the Charming God Jian’s power is all about?” Han Sen decided to leave Black King City. After he left, he saw Yun Sushang riding her crane.\n\nYun Sushang’s expression twisted strangely when she noticed Han Sen. It seemed as if she wanted to avoid him, but at the same time, she was wrestling with the desperate desire to stay and see him. “Sushang, can I ask you something?” Han Sen walked toward her and bowed.\n\n“What is it?” Yun Sushang’s eyes darted around as she spoke.\n\n“Has the Charming God’s Jian worked its magic on me? This is very important for me to know. Can you tell me how much I’ve changed?” Han Sen said with seriousness.\n\nYun Sushang was shocked. And then she blushed. After hesitating for a while, she nodded. She nibbled her lips as she said, “It seems very serious. You should ask someone else.”\n\nAfter that, Yun Sushang hurriedly departed. Han Sen called her back, but she ignored him.\n\nHan Sen knew this was very bad. After he went to the little jade island, he had Bubble take on his form and remain there, pretending to be him. With Bubble covering his absence, he decided to teleport to his home in the Alliance.\n\n“Yanran, is there anything off about me?” Han Sen asked. He was lying on the bed with Ji Yanran curled in his arms like a cat.\n\nJi Yanran’s body felt soft as she held Han Sen. With a look of satisfaction, she said, “I don’t see a problem. You look very good. You look a lot more charming than you did before.” “What do you mean by charming?” Han Sen asked quickly, his eyes flashing with worry.\n\nJi Yanran looked at him closely. She held his chin as she stared at Han Sen’s face. After a while, she trailed a finger down his jaw and said, “It makes me want to sleep with you\n\nmore.”\n\n“Oh no… So that’s what’s happening…” Han Sen sank back on the bed in frustration. Now he knew why Yun Sushang was avoiding him and why Exquisite no longer visited him. It wasn’t because they thought he was a playboy; it was because they couldn’t resist doing something that was utterly forbidden. It would be something that couldn’t be described. That was why people were avoiding him.\n\n“What kind of f*cking race weapon is this? It’s like a mating pill.” Han Sen wanted to cry.\n\nHe wasn’t doing as bad as Ning Yue, but this was bad in an entirely different way. It was good to be popular with women, but Han Sen didn’t want to be a tool for women to enjoy.\n\n“Honey, how about we do it again since the sun hasn’t yet risen?” Ji Yanran suggested, an obsessive glint in her eyes. She kept drawing circles on Han Sen’s chest.\n\n“I can’t do it. I need to sort out this issue with the Charming God’s Jian.” When Han Sen was finally back on his little jade island, his legs still felt a little weak.\n\nHan Sen couldn’t figure out a way to fix this situation, so he went to Sky Palace and asked Sky Palace Leader for his assistance.\n\nSky Palace Leader seemed to know about Han Sen’s problem. After Han Sen explained, Sky Palace Leader smiled at him and said, “Isn’t this a really good thing? It’s a great skill for producing offspring. Your genes are so talented; you should definitely make a few more babies.”\n\nHan Sen looked bitter and said, “I don’t need help in that department. Plus, if men start to…” Han Sen trailed off.\n\nSky Palace Leader laughed out loud and said, “Don’t worry. The Charming God’s Jian only works on the opposite sex. If you were a woman, having the Charming God’s Jian would only make you attractive to men.”\n\n“Leader, is there no way to get rid of this side effect?” Han Sen wasn’t in the mood to joke around.\n\nSky Palace Leader kept smiling as he said, “If you were an elite that could control the power of the Charming God’s Jian, this wouldn’t happen. The problem is that your power isn’t sufficient to control the Charming God’s Jian, and thus, you are powerless to resist its effects. That is why you’re so plagued by women that you came moaning to me.”\n\nAfter a moment of silence, Sky Palace Leader went on to say, “As for a solution to this problem? There is one. You need to find a true god elite to seal up the Charming God’s Jian. Do that, and it will no longer affect you. However, once that is done, you will no longer be able to use the power of the Charming God’s Jian.”\n\n“You think I can find a true god elite to help me?” Han Sen quickly asked. He didn’t need the power of the Charming God’s Jian.\n\n“It will be difficult. I can help you if you take some time to think about it. But hiring a scary elite like that would probably be expensive.” Sky Palace Leader looked troubled.\n\n“I will cough up any sum I need to for this to be fixed.” Han Sen gnashed his teeth. He didn’t want to be a walking sex toy. He would pay whatever fee was required.\n\n“How about this? You spend three days teaching out of every month. And then, I will help you find a true god deified.” Sky Palace Leader made it sound like a complicated process, judging from the way he spoke. “No problem,” Han Sen agreed instantly. He wasn’t in the mood to bargain right now. There was no other way he might be able to find a true god elite to help him. He had to rely on the leader.\n\n“You must consider this. If the Charming God’s Jian is sealed, unless you become strong enough to break that seal, you will never again be able to use its power.” Sky Palace Leader smiled warningly at Han Sen.\n\n“I don’t need it. I don’t need it to find women,” Han Sen said, clearly not caring.\n\n“It isn’t that simple. If you have the Charming God’s Jian at your disposal, women are more likely to approve of you. Even if you wanted their money and their lives, at some point, they would give whatever you asked to you without a shadow of a doubt. You can use it in Black King City. You will get a lot out of it. If you seal it, that will no longer be anoption.”\n\n“Leader, please find a true god elite to help me seal it.” Han Sen had a wry smile.\n\nHan Sen wanted those treasures, but he wasn’t willing to sell his body for them.\n\n“Fine. Give me the Charming God’s Jian,” Sky Palace Leader said.\n\n“This thing will come back to me by its own will,” Han Sen said with a depressed look. “Wait until you find a true god elite. I will give it to him.”\n\n“He is already in front of you. What are you waiting for?” Sky Palace Leader said in annoyance.\n\n“You are true god class?” Han Sen looked at the man in shock. He remembered that Sky Palace Leader had been a King when he competed in the Geno Being Scroll a hundred years ago. In such a short period of time, he had already become a true god.\n\n“You do know exceptional geniuses can hide their talents, don’t you? Sky like me are adept at doing that.” Sky Palace Leader smiled."
}