{
    "chapter": 1161,
    "title": "Changes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1161",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen spent the next few days with Ji Yanran, attempting to make babies. The following week, Han Sen decided to return to the shelter.\n\n“Now, where might I next find a super creature?” Han Sen mulled to himself.\n\nHe thought he was still a little too weak to attack a king-class shelter by himself, but finding lone super creatures in the wild was a difficult task due to their rarity.\n\n“If Xie Qing King was here, taking down a king-class shelter would be trivial.” Han Sen was dismayed.\n\nXie Qing King was still in Holy-Sword Shelter. Lin Weiwei was there, as well. Unfortunately for Han Sen, he had no idea where that was or how he could get there.\n\nAfter another couple of shelter-jumps, they came to a portion of forest that was brimming with fruit.\n\nFist-sized green fruit was everywhere, and even more delightful, they were proper geno plants. The plants looked to be primitive-class at best, but still, the number of them was incredible.\n\nIt excited Han Sen to see them all there, due to the fact he could use his black crystal to absorb all their lifeforces and generate an ocean’s worth of special waterdrops.\n\nAside from aiding the growth of geno plants, waterdrops were also able to improve the strength and sentience of beast souls and creatures. Han Sen used to have a ton of waterdrops, but now he had very few. He had to be very careful who he chose to feed.\n\nIf he was able to absorb all the trees that filled the landscape before him, he could feed whatever pets or creatures he fancied. Han Sen scanned the region ahead of him before blindly wandering in. When he confirmed the absence of creatures, he went forth.\n\nHe picked up one of the fruits first and broke it in two.\n\nWhen he opened the fruit, the waft of some bitter scent filled his nostrils.\n\nWhile the fragrance may have caught him off guard, Han Sen was also surprised at the fruit’s composition: there wasn’t much flesh, as the core took up most of its inside.\n\nHan Sen pulled away the flesh and took a look at the fruit’s core.\n\n“It’s a walnut.” Han Sen examined it closely.\n\nHe pinched the shell of the walnut to break it, and indeed, there was a walnut inside. He ate it, and it tasted lovely.\n\nThere was no benefit to eating it, though; he thought he might as well have been munching on snacks.\n\n“Even though it’s just an ordinary-class geno plant, shouldn’t the fruit still be of some service?” Han Sen pondered the peculiarity of the walnut he had just consumed.\n\nHan Sen ate a few more and felt nothing special occur with his body.\n\nThat being said, it was not like he had reserved any lofty expectations for the fruit, given its low class.\n\nHan Sen then proceeded to absorb the lifeforces of the tree. He placed his hand on the trunk of the one in front of him, and it died fairly quickly. The black crystal generated the waterdrops just as Han Sen hoped it would.\n\nFrom that single tree, Han Sen had gathered three months-worth of energy.\n\n“Wow, that’s so little. I can only suppose it must be an ordinary geno plant,” Han Sen said to himself, as he walked over to another tree.\n\nHan Sen absorbed a hundred of the trees and received quite a bit, as one might expect. After he was done absorbing the trees, Han Sen noticed something else was residing in the same portion of the forest he was. He couldn’t see anything, but he could hear something hitting a tree someplace ahead of him.\n\nHan Sen went to check it out, and he found a rhino-sized boar beating its tusks against a tree. The nutty fruits above were falling to the ground.\n\nThe boar gobbled up each fruit in its entirety. It was only a primitive creature, so Han Sen couldn’t even be bothered lifting a weapon to end its life.\n\nBut then, just as Han Sen turned to leave, he noticed something weird occur to the boar. Heaven knew how many walnuts the boar had eaten, but it began to writhe around on the ground, as if in agony.\n\n“Oh, snap! They can’t be poisonous, can they?!” A wave of shock and worry cascaded over Han Sen’s mind.\n\nHan Sen then turned to think about how strong and powerful his body was. Even if the walnuts were poisonous, he didn’t fancy the chances they’d do much damage to him.\n\nHe continued watching the boar roll around on the forest ground, and all of a sudden, he was hit with another daze of shock.\n\nThe boar suddenly looked much smaller.\n\nHan Sen rubbed his eyes to make sure his eyes weren’t playing tricks, but without a doubt, the boar had shrunk in size. It was not uncommon for creatures to be able to change their size, but it was concerning to learn a primitive creature was able to do such a thing.\n\nIt seemed to Han Sen that the boar had become smaller due to its eating of the walnuts.\n\nHan Sen watched it for another ten minutes, and by then, the boar that was once the size of a rhino was now the size of an average one.\n\nHan Sen remained there to watch it shrink even further, and after half an hour, it was the size of just a puppy.\n\n“The walnut does make things smaller!” Han Sen’s face warped into one of panic, so the first thing he did was unzip his pants to take a look.\n\n“Whew! Thank the Maker it is still the same size.” Han Sen touched his manhood to make sure, and then wiped the sweat from his brow.\n\nThe boar seemed to stop growing smaller after that, but when it stood up, it went back to ramming trees to eat even more of the walnuts that fell. After doing so, it grew even smaller.\n\nThis confirmed to Han Sen that the walnuts did indeed make the boar smaller."
}