{
    "chapter": 2703,
    "title": "Horizontal Evil",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2703",
    "text": "To make sure he was seeing this correctly, Han Sen remained where he was for a while. The craters that the giants had made were becoming smaller and smaller. That meant his eyes weren’t going funny; the mountain really was growing.\n\nBuzz!\n\nHan Sen was staring at it when he suddenly heard a high-pitch sonic sound. When that sound hit his eardrums, Han Sen’s head became all blurry. He clutched his skill and tumbled down. He fell into the sea.\n\nHan Sen quickly cast a power to deflect that frightening sonic power. He felt a bit better, but his head was still ringing. He couldn’t completely block the sound.\n\nFighting his way back out of the water wasn’t easy. His head had only just reached the surface when he could hear that sound clearly again. He realized that the sounds were actually coming from the metal pillar. The metal pillar spun like a drill bit, and the patterns across the metal pillar shone with a weird light. The lights spun with the metal pillar, carving into the scary giant’s chest. Blood poured from the wound, splashing over the giant’s armor and hair. The blood left red streaks over everything that it touched.\n\nHan Sen only now realized that the giant’s armor wasn’t actually red. It had simply been dyed red by the blood pouring out of him.\n\nBlood had clearly been soaking into the giant’s hair for a long time, as well. Only the upper-portions of the creature’s hair had avoided the blood spray and maintained their silver-white color.\n\nHan Sen had thought the giant, impaled body was simply a corpse. However, as the metal pillar spun, Han Sen could sense the body trembling. It looked as if it was suffering unimaginable pain.\n\n“That guy is alive!” Han Sen was in shock.\n\n“Who are you? Why are you here?” Han Sen was thinking to himself. But then, he heard a sound. The metal pillar was still drilling brutally into the giant’s chest, but with a thunderous noise, the frightening creature turned its head to look toward Han Sen. Its eyes peered at Han Sen through the unkempt hair. Although the giant was only looking at him, it made Han Sen feel extremely unsettled. The gaze was so intense that it almost felt like it was burning him.\n\nThe scary giant’s voice shook while it spoke. It seemed as if it was suffering.\n\nHan Sen couldn’t imagine what the giant must be feeling at that moment. It would be worried if having a drill pushed into your chest wasn’t excruciatingly painful.\n\n“Who are you? And why are you here?” Han Sen flew backward out of the water. He tried to put some distance between himself and the giant, so he retreated to a careful distance before he spoke.\n\nThe scary giant continued to stare at Han Sen. He didn’t look away. After a while, he said, “If you were able to come here, shouldn’t you know who I am?”\n\n“Why would I know who you are?” Han Sen asked, once he had fallen back a little further from the giant.\n\nThe scary giant looked shocked, and then he laughed, “If you don’t know who I am, then that is great. That means you don’t know who Sacred Leader is.”\n\n“You are Sacred Leader?” Han Sen was shocked. He looked at the giant with sheer disbelief.\n\nWhen the giant heard Han Sen ask that, he looked shocked as well. He looked at Han Sen with a strange expression, and he didn’t speak. It was like he was trying to figure something out.\n\nWhen the giant fell silent, Han Sen asked again. “Who are you? Why have you been pinned to the mountain?”\n\nThe scary giant gave Han Sen a conflicted look. He said, “I am the Breaksky alpha.”\n\nAlthough he was pinned to a mountain and enduring torture, the scary giant sounded extremely proud when he said those words. It was like the whole universe had reason to look up to him, all because of that one simple fact.\n\n“You are the alpha of the Breakskies? These giants are really Breakskies, then?” Although Han Sen had already guessed as much, hearing the scary giant admit he was one of the Breakskies still came as a bit of a shock.\n\n“Yes. The others are all Breakskies, too.” The Breaksky alpha froze and asked Han Sen, “Who are you?”\n\n“Han Sen. I am a nobody crystallizer,” Han Sen said, trying to be polite.\n\n“Since when have the crystallizers developed bodies like yours?” The Breakskies alpha looked at Han Sen, but his face was impassive, and his thoughts remained hidden.\n\n“I think you have been locked up for too long, and as a result, you don’t know what has been going on in the wider world outside. The crystallizers are different these days.” Han Sen then cocked his head to the side and asked. “Why are you locked up here? Why aren’t your people saving you?”\n\n“You are right. This is no longer the era of the Breakskies.” The Breaksky alpha sighed and said, “If they hadn’t tried to save me, they wouldn’t be locked up here forever and forced to dig through a mountain each and every day.”\n\n“Who was able to trap you here? Was it Sacred Leader?” Han Sen asked.\n\nThe Breaksky alpha had mentioned Sacred Leader earlier, so perhaps there was a connection between the two of them.\n\nBreaksky alpha shook his head. He started to say something more, but then his expression changed. He told Han Sen, “Quick! Hide in my hair or you will be dead.”\n\nHan Sen had already noticed that something wasn’t right. Even the black crystal armor was releasing a sense indicating imminent danger. The Breaksky alpha wasn’t lying.\n\nHan Sen’s body flashed away. He flew up to the alpha’s shoulder, then climbed into the giant’s hair.\n\n“No matter what happens, you cannot release a single speck of your presence,” the Breaksky alpha murmured. He stopped talking and turned to stare coldly up into the sky.\n\nHan Sen buried himself in the giant’s hair and reduced the sense of his presence. The black crystal armor released some weird sort of power that locked down his body. Han Sen’s aura vanished until he couldn’t even detect his own presence.\n\nSuddenly, Han Sen felt a ripple flow through the space above them. Han Sen looked into the sky, and he saw something emerging from the area next to the sun-clock.\n\nWhen he saw the shape of the descending body, Han Sen almost screamed. It was King Jun, the being he had seen on Planet Eclipse long ago. After he was injured, Han Sen hadn’t seen him again. He couldn’t believe he was seeing him again here, of all places.\n\n“Horizontal Evil, have you given this some thought?” King Jun was wearing gold armor and a gold helmet. He looked like a god-king in the sky. His eyes were like lightning as they looked at the scary giant.\n\n“It looks like your wounds have almost healed, and yet you have time to waste here every day. If you have so much time, why don’t you try to find out who attacked you and made you like this?” the scary giant said.\n\nRather than being angered, King Jun replied with a voice full of cool spite. “Horizontal Evil, do you really want to be trapped here for all eternity? Do you want to see your people try to save you without rest?”"
}