{
    "chapter": 1016,
    "title": "Unbelievable Kindness",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1016",
    "text": "Seeing the Blood-Wing Beast King nearing, Liu Yuxuan quickly kowtowed before it and made a few subservient sounds.\n\nHe had only wanted to summon the beast king’s son, due to the fact the two shared something of a bond. Now, he had to tarnish his own image of being strong and influential to the creatures of the domain by going down on the ground.\n\nBut Liu Yuxuan knew what to prioritize with the beast king’s unexpected approach. He’d rather discard his image than his life. If he was disrespectful towards the king, he could provoke its finicky wrath and end up as its teatime meal.\n\nHan Sen didn’t care much for the two-faced man, making a fool of himself on the ground. He was a dead man walking, as it was.\n\nChen Hu, on the other hand, saw things differently. He was touched by what Liu Yuxuan was doing, believing his act wasn’t one of self-preservation. He believed he had gone on the ground to kowtow on his behalf and the others that were with him.\n\nBoom!\n\nThe beast king landed before them all. Liu Yuxuan did not relent in his feverish kowtowing.\n\nBut the king paid no heed to him. It walked towards Han Sen, at which point, the son leapt off its parent’s back.\n\nLiu Yuxuan wished to remind the king that, if it was hungry, Lin Weiwei was not one to be eaten. But he was having cold feet about telling the king anything. Seeing how mighty and powerful it looked, he thought it best to shut up completely and not say a word.\n\nHan Sen looked at the beast that was approaching, thinking he’d use Liu Yuxuan as a meat shield if a fight started.\n\n“Eat them. Eat them all up. Just please, save me the delicious Lin Weiwei!” Liu Yuxuan thought to himself.\n\nBut what happened next went against all of his expectations.\n\nThe beast king, after coming directly in front of Han Sen, performed a friendly gesture of respect.\n\nNeither Liu Yuxuan nor anyone else could understand what was going on, and why the beast king was acting that way towards Han Sen.\n\n“How?” Liu Yuxuan’s breath had been yanked from his lungs. Even king spirits were afraid of this creature, so it was difficult for him to fathom why it’d show so much respect towards Han Sen. He thought he must have been having a nightmare.\n\nNo one else spoke the language of beasts, but there was no hostility between the two parties. And the tension that once existed, quickly vanished. Chen Hu, hurriedly asked, “Mister Liu, can you translate what it is trying to tell us?”\n\nLiu Yuxuan was so shocked, he didn’t hear a word Chen Hu said. But the shock wasn’t going to end anytime soon. What happened next made him dizzy.\n\nThe beast king’s son ran towards Han Sen and leapt into his arms. It placed a red fruit in his hand.\n\nSeeing this, Liu Yuxuan felt blood rush to his head in such volume that it felt like his head was going to explode.\n\n“I must be dreaming. I must be! This must all be a bad dream! Why would he give a blood fruit to a human?” Liu Yuxuan’s eyes almost popped out of their sockets, as he eyed the fruit in Han Sen’s hand with envy.\n\nThe king spirit once asked Liu Yuxuan to deliver gifts and treasures to the beast, in the hopes of one day receiving such a fruit in return for the kindness. But the spirit had yet to be given a single one, despite the repeated offerings that were provided. Liu Yuxuan had only glimpsed the beast king once before, too, as he was never allowed in its presence.\n\nThis had gone on for quite some time, but the king spirit never thought to stop; the fruit really was that valuable. Constant gifts with an expected return never given.\n\nThe king spirit, despite his grand efforts, did not receive a single one. But here, now, Han Sen was handed one oh-so-simply. Liu Yuxuan’s mind was suffering a meltdown.\n\nThe beast king’s son licked Han Sen’s cheek in admiration, and its tail wagged with unbridled joy.\n\nLiu Yuxuan’s mind recalled how each of his visits with the son usually went, in that it always used him as a faucet of blood. Every time they were together, he would have to allow it to sink its teeth in him so that could it drink his blood. It always acted superior, as well, vastly different to the puppydog-like behavior it was showing Han Sen.\n\nHan Sen stroked the beast king’s son’s head and asked, “Is this fruit for me?”\n\nThe beast king’s son seemed to enjoy the hand was that caressing it softly, and it made a gentle sound. Then, it nodded in confirmation.\n\nLiu Yuxuan’s shock had turned to jealousy, but now, it turned to anger. The creatures never replied to him whenever he spoke the human language. That was the whole reason he taught himself how to communicate in the language of creatures, in the first place.\n\n“D*mn it! D*mn that *sshole.” His face was still on the ground, and he did not dare get up.\n\nHe couldn’t at all wrap his mind around why the two creatures would show so much love and respect towards a human they had never seen before.\n\nBao’er, seeing the beast king’s son being so friendly, wanted to show it some love, too. She crawled up to it and rubbed her face in its lovely mane.\n\nThis did nothing to upset the disposition of the beast king’s son or the beast king itself, either. Things were as peaceful as ever, and the son decided to lick Bao’er a little, as well.\n\nHan Sen was surprised by the entire affair, also. He had gotten himself ready for a fight, so the lack of hostilities came as a delightful shock.\n\nThe blood fruit he had been given looked immensely powerful. It looked far superior to the ones birthed by Devil King’s seeds or any of the ones found in the Valley of Time.\n\nRoar!\n\nThe beast king suddenly roared, and after it did, many small creatures flocked to the valley as if they were in celebration of Han Sen’s coming.\n\nWith the beast king protecting them, the group traveled through the valley for a few hundred miles, entirely unhindered. But when they exited the valley, it was no longer the dominion of the Blood-Wing Beast King. When it was time to say goodbye, the king leapt onto a rock and gave a faint cry of sadness in farewell."
}