{
    "chapter": 924,
    "title": "Super Creature?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_924",
    "text": "The barbed bushes that encircled the tree shook, until something emerged.\n\nWhen Han Sen laid his eyes on the beast before him, he started to immediately sweat bullets. He could feel the wretched sense of the creature that was headed his way from fifty meters away.\n\nA metal dinosaur, composed of what seemed to be blue steel, is what came out from the obscuring thickets of the trees. The suffocating feelings of dread were a direct cause of its approach.\n\nThe blue dinosaur was not large, by any means. In fact, it was no larger than Han Sen himself, but he was able to sense that its power dwarfed his own by an unfathomably large margin.\n\nAs sweat descended his forehead, the dinosaur laid eyes on him and drew closer. It stepped directly into the shelter's surrounding, where other creatures always feared to go.\n\nHan Sen quickly turned around and tried his hardest to return inside the tree.\n\nHe had encountered many powerful creatures before, but this one was in another league. Never before had he seen a creature not heed the bones that offered sanctuary to such places. Bold as brass, the metallic dinosaur lurched forwards, step-by-step.\n\nAs Han Sen started running, he heard a boom. The dinosaur leapt a great distance and landed in front of him, leaving to two crater-like footprints in the soil. Its speed was incredible.\n\nCasting his Dongxuan Sutra, a vast amount of energy began to generate inside his kidney. Then, he used Aero to try and fly away from the menace.\n\nJust as Han Sen moved, the dinosaur opened its mouth. And then, a horrible power came into contact with his back; one that pulled him back down to the ground.\n\nFortunately, the dinosaur only took hold of Han Sen's armor. The creature did not injure him.\n\nHe stood up and fell back a few steps. Then, the dinosaur jumped behind Han Sen and bit the back of his armor again, keeping him close.\n\nStrangely, it did not hurt Han Sen. All it did was pull him back and keep him close.\n\n\"Is this thing playing a game with me? Will it devour me when it gets tired?\" Han Sen tried his hardest to run away and escape, but every time he did, the dinosaur stayed his flight.\n\nHan Sen knew he had to continue hiding his super spirit mode. And if he had to use it, it would only give him three seconds. If he decided to use it, he had to ensure he would not miss any strike he sought to deliver.\n\nWith the dinosaur engaged in its game, Han Sen was first going to wait and see how long this would go on before doing something. He'd bide his time and when that time was right, he'd use his super king spirit mode to ensure an escape.\n\nHan Sen was currently unsure whether or not it was a sacred-blood or a super creature he was facing, but regardless of what it was, he knew he lacked what was necessary to triumph over it.\n\nGetting pulled back over and over again, the dinosaur seemed to be getting annoyed. It grabbed Han Sen and did not let him go this time.\n\n\"Is this it? Is the fun over? Is it going to eat me this time?\" Han Sen prepared himself to cast super king spirit mode.\n\nBut the dinosaur merely reached out its talon-laden hands and presented a green fruit to Han Sen.\n\nThe dinosaur seemed as if it wanted to give it to Han Sen.\n\nHan Sen froze, unsure whether or not he was reading the situation correctly. This was not the time to be making mistakes, after all. All he did was stare, alternating his gaze between the fruit and dinosaur.\n\nSeeing Han Sen not have a reaction, the dinosaur roared. It really did seem as if the creature wanted to give it to him for free.\n\n\"Is that for me?\" Han Sen pointed at the green fruit and then himself, using gestures to illustrate his vocal question to the queer beast.\n\nThe dinosaur roared. It was obvious it desired Han Sen to have it.\n\n\"You're not going to try and fatten me up first, before dining on me, are you?\" Han Sen gave a side-eye to the dinosaur.\n\nBut the dinosaur, getting frustrated with Han Sen's mistrust, pushed him.\n\n\"Um, thank you.\" Han Sen accepted the green fruit from the dinosaur.\n\nThe dinosaur, seeing him take it, let out a happy cry. It put its head in front of Han Sen and then licked his face.\n\nHan Sen wasn't sure what to think, having been drenched in its saliva. He was at least comforted by the fact the creature looked happy. It rolled on the floor in exuberant joy.\n\n\"Did I just meet a newly-born super creature?\" Han Sen wiped away the saliva and continued to look at the excited dinosaur.\n\nHan Sen, in his time in the sanctuaries, had encountered many different creatures that did not want to hurt others. If this was a super creature, Han Sen thought things would most certainly take an interesting turn.\n\nHan Sen looked at the blue dinosaur, and observed its appearance as a small t-rex. Its body gleamed like blue metal. It wasn't big but that mattered little upon Han Sen's sensing of its power.\n\n\"It must be a super creature. Normal creatures wouldn't dare come this close.\" Han Sen then tried walking closer to the tree, but he was bitten and pulled back again.\n\nHan Sen could tell that the blue dinosaur did not want to go any closer to the tree.\n\n\"You don't want to go that way? You can come with me.\" Han Sen tried pointing at the tree, but still, the dinosaur did not dare get any closer. It seemed as if it wanted to remain there, playing with Han Sen.\n\nSeeing this, he tried many different methods to get the dinosaur to enter the tree. Nothing seemed to work, but Han Sen was at least happy that the dinosaur did not want to hurt him. Sitting down on the grass, he merely got to thinking what else he could try.\n\nQu Lanxi then suddenly exited the tree. Han Sen had been gone a long time, so she came out in search of him, wondering if they could go out and collect food together.\n\nThe blue dinosaur, upon seeing Qu Lanxi, angrily growled at her. It looked ready to jump on top of her and rip her to shreds.\n\nHan Sen grabbed the dinosaur's neck and shouted at Qu Lanxi, \"Go back!\"\n\nWithout a second wasted, Qu Lanxi immediately returned inside the tree. The dinosaur was too strong for Han Sen, though, and it jumped forward with him still hanging onto its neck. The door did not close in time, and it seemed as if it would land on Qu Lanxi."
}