{
    "chapter": 103,
    "title": "The Fight Between the King and the Imposter",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_103",
    "text": "It turned out to be a 12.0 magnitude earthquake in the press indeed.\n\nLin Feng had asked someone to meet him in the final, yet that someone was not Yi Dongmu, but Dollar, who was considered an imposter.\n\nAll major media had reported this, and Fang Mingquan from Contest Center was especially excited about it and had analyzed it from all angles. His conclusion was that \"Dollar was simply great.\"\n\nBut obviously the major media and fans didn’t share his enthusiasm. They thought Lin Feng wanted to gain popularity by participating in the grandstanding becaused he was no longer the center of attention.\n\n\"Rubbish. Lin was the runner-up last year but he had no vision. No wonder he was only the runner-up. Let him keep his ranking and be second to my Yi Dongmu this time.\"\n\n\"Keep his ranking? You think too much of him. He’d have to be lucky to make it in top 10.\"\n\n\"Lin and Dollar are just two weak guys feeling bad about themselves.\"\n\n\"Ha-ha, Yi Dongmu will get rid of Dollar in seconds before he beats Lin to show them who the real king is.\"\n\n\"What the heck? If Lin was going to see someone in the final, it should be Yi Dongmu.\"\n\n\"Even if it is not Yi, at least it should be Tang Zhenliu, right? How is Lucky D relevant?\"\n\nThe Skynet had exploded for this matter. However, Lin Feng and Han Sen, the two who had caused it did not realize this at all. One was enjoying tea with Tang Zhenliu and Fang Jingqi, and the other was playing Hand of God in the gym of the teleport station.\n\nHan Sen had spent all his time playing Hand of God when he was not practicing with Tang. But he had never been able to make another breakthrough. He always had one or two small mistakes with evolver-4.\n\nHan Sen knew that he had reached his limit in both physique and reflexes. If he had no improvement in geno points, it was impossible for him to go any further.\n\nTherefore he decided to take a break from Hand of God. Han Sen acquired two daggers and tried to practice Sleeveblade with both hands. Although he was not as good as Gambler, he could produce the daggers from his sleeves and put them back skillfully at the moment. Even someone very observant could hardly see his hands move, but it was just a start on Sleeveblade.\n\nWhen Han Sen took the daggers back, his hands would shake slightly while Gambler was able to keep his hands perfectly still and retrieve the dirks using only his arm and palm muscles. Han Sen was not even close to that.\n\nThis mislead Han Sen to think that he needed to pass all the levels of Hand of God before he could get somewhere with Sleeveblade.\n\n\"After I win tomorrow’s match, I will fight Yi Dongmu. If I beat him, I will become the Chosen and enter the ranking round, where I will meet Lin Feng, which I actually look forward to.\" Han Sen recovered his dagger, slowly closed his eyes, and thought about all the matches he had experienced.\n\nThe next day, Han Sen had an easy victory once again. His opponent still had not recovered from a bad injury and failed to show up.\n\nHan Sen walked down the stage and wanted to see Lin Feng’s match, but someone stopped him.\n\n\"I hope tomorrow you will have the guts to stand in front of me, because I will kill you.\" Yi Dongmu said coldly and walked past Han Sen without so much as throwing him a glance.\n\nAlmost everyone who saw this went crazy. Yi Dongmu’s words caused another storm on the Skynet.\n\nBasically everyone was guessing if tomorrow Dollar would dare to show up. The majority predicted that Dollar would quit.\n\nAfter all, the difference between the two was huge. Yi Dongmu’s performance had been outstanding and he had even killed several celebrity rivals, including Dragon Swordsman, who had the tenth place last year.\n\nDollar, on the other hand, had a rough journey. And he was here more for his luck than for his actual strength.\n\nExcept for Fang Mingquan who predicted Dollar would get a total victory, almost all TV personnel believed Dollar would either quit or die.\n\nOn the day of the match, the martial rings in all shelters were packed with people who were waiting to watch the match through the sacred stele.\n\nThis was absolutely the most controversial fight in the entire contest this year, and people called it the fight between the king and the imposter. Almost everyone in First God’s Sanctuary was watching and the number of viewers was even bigger than that of the final last year.\n\nThe popularity of this match was in part due to Contest Center and Fang Mingquan. Or else there wouldn’t be so many people who were paying attention to Dollar and the media would not have cooked up such a hype.\n\nThe field reporters all wished to interview Yi Dongmu and Dollar before they started. Although there was no way to record it, it was enough that everyone in the First God’s Sanctuary could see it at such a crucial moment.\n\nUnfortunately, neither Yi nor Dollar had appeared, but they saw Tang Zhenliu and Lin Feng. It was hours until their own matches so they must be here to watch the fight between Yi and Dollar.\n\nThe clever reporters quickly squeezed over and circled Tang Zhenliu and Lin Feng. They loudly asked,\n\n\"Lin Feng, I’m from Contest Front. Who do you think will win this fight?\"\n\n\"Lin Feng, I am from Contest Corner. You said you would see Dollar in the final. Do you still believe that?\"\n\n\"I’m from Contest Center. Lin Feng, do you and Dollar know each other? Why did you ask him to see you in the final?\"\n\n...\n\nLin Feng quietly smiled. \"Haven’t I already said that I will see him in the final?\"\n\nLin then walked toward his seat and sat down.\n\nThose journalists quickly circled Tang Zhenliu who was behind Lin and bombarded him with all sorts of questions.\n\nTang gracefully tossed his hair back and said with pride, \"No matter who wins, it will be the same for me, as I will get the first place.\"\n\nHe paused, and before the reporters reacted to his comment, he continued, \"If you are asking which of the two will win, then of course it’s Dollar. Isn’t that obvious?\"\n\nThe reporters were shocked. Not only Lin Feng, but also Tang Zhenliu said Dollar would win, which was the opposite what they had thought.\n\nBut when they were trying to ask again, Tang Zhenliu had gone away as well.\n\nOnly the reporter from Contest Center was overjoyed, who quickly teleported out of God’s Sanctuary and reported what Lin and Tang had said.\n\nWhen Yi Dongmu and Han Sen both showed up, First God’s Sanctuary went buzzing. The cheers for Yi overwhelmed those for Dollar.\n\nIn the martial ring of Steel Armor Shelter.\n\n\"Stationmaster, do you think Dollar will win?\" Yang Manli asked Qin Xuan sitting next to her nervously.\n\n\"He robbed my quota to go so I will not forgive him if he’s not even in top 10.\" Qin Xuan said fiercely, while knowing that it would be difficult to beat Yi Dongmu who had shown incredible skills in previous matches.\n\n\"He will lose for sure. He was simply not on the same level as Yi Dongmu.\" Son of Heaven said in a cold voice.\n\n\"I do not want to listen to these words. My Dollar is the best,\" displeased, Qing gave his mouth a downward twist and said. He and Yuan had been going to all Dollar’s matches.\n\n\"Whether you like it or not, it is the fact,\" Son of Heaven said casually.\n\n\"Didn’t you say the same thing last time? Well?\" Qing grinned and asked, leaving Son of Heaven’s face darkened."
}