{
    "chapter": 2179,
    "title": "I’ll Eat You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2179",
    "text": "Han Sen and his group traveled across a number of mountains and swamps. He was able to find a few xenogeneic corpses, but he couldn’t find a single one that was still alive.\n\nThey couldn’t find any Duke xenogeneics, and not even any low level ones, either.\n\n“Why are there so many people taking advantage of a time like this?” Han Sen felt depressed. But with the way things were going, he realized there was nothing he’d be able to do about it.\n\nHe decided to leave Planet Sodi. But suddenly, many Duke elites began to descend from space.\n\nSeeing the skies fill with spaceships and elites coming to Planet Sodi, Han Sen raised his eyebrows. Had they not been flying in a number of different directions, Han Sen might have believed they were coming for him.\n\n“Planet Sodi is under lockdown. Please do not try to leave the surface.” An announcement was aired through the skies.\n\nBattleships and airships all sat in a gridlock over Planet Sodi. Even space fortresses were kept in the orbit of the planet. Weapons were aimed at Planet Sodi from every direction, as well. If they all fired their weapons, Planet Sodi would have been reduced to space rubble ten times over.\n\nMany small aircraft flew out of the greater battleships, and they all seemed to be heading down towards Planet Sodi. Han Sen was shocked, and he wished to know what was going on. “That Destroyed traitor cannot be on Planet Sodi, can he? If he is, then he must be a very brave fellow. He might have been hiding in plain sight, but it appears someone has exposed him.” Han Sen could not think of any more potential explanations for the current scenario. But still, he was just guessing. Nothing was confirmed yet. Han Sen would know soon enough if the traitor was there, though. That much he was sure of.\n\nThe whole of Planet Sodi was locked down. It was impossible for Han Sen and the others to leave the planet now. All the battleships and space fortresses were put into combat mode. If Han Sen’s group forced their way out, they’d surely be attacked.\n\nThis was a territory belonging to the Rebate, so at least Han Sen was a part of them. There was no need for him to try to run. So, Han Sen took Han Meng’er and the others to the only city that existed on Planet Sodi. It was called Steel City.\n\nHan Sen was something of a VIP amongst the Rebate. When he entered Steel City, the workers there gave him a glowing reception. They heartily invited him in and gave him a room at the most luxurious hotel in town.\n\n“I hope the lockdown doesn’t last too long. I don’t want to be late when I am supposed to guard the door.” Han Sen didn’t think it would take too long, though. They had locked down the planet with a large host of Dukes and Marquises. It would be impossible for the Marquise they sought to escape them.\n\nBut two days went by, and those enforcing the lockdown still hadn’t found the traitor.\n\nHan Sen frowned. There were so many Dukes and Marquises there, the entirety of Planet Sodi had to have been searched from top to bottom by now. Despite their exploration of every nook and cranny, the Destroyed traitor had eluded capture.\n\nThere were only two possible explanations for this. Firstly, they might have been working on incorrect intel. Perhaps the traitor wasn’t even on Planet Sodi, and that was why they were having trouble locating him.\n\nThe second possibility was that the Destroyed traitor wasn’t actually hiding. Perhaps he really was walking around in plain sight, but he had changed his appearance. And as a result, nobody recognized him.\n\nHan Sen didn’t think the first possibility was correct. If they hadn’t been able to confirm that this was precisely where the Destroyed traitor was, there was no way they would have blanketed the sky with such a dramatic show of force. Apparently, the authorities were confident in their intel. The traitor was most likely there.\n\n“If he really has disguised his identity, that is very bad news. There are so many Marquises here on this planet. They cannot check everyone, and so if that is the case, they will be unable to find him.” Han Sen was worried that it might take too long for him to return to Cold Palace in time.\n\nHan Sen and Han Meng’er and the others were all merrily eating in the hotel lobby. Eventually, Han Sen detected a certain presence that was familiar to him. He lifted his head to take a look, and there he saw that same Extreme King woman he had encountered before.\n\nShe hadn’t left the territory of the Rebate yet. And on top of that, she had come to the Six Star xenogeneic space. She must have also been looking for the stolen treasure of the Destroyed.\n\n“What could he have stolen, I wonder? It has even prompted the people of Extreme King to come out in search of it.” Han Sen was shocked.\n\nThe Extreme King woman saw Han Sen, but she pretended that she hadn’t. She walked right past Han Sen and sat near the window.\n\nHan Sen didn’t concern himself with her too much. If she wanted to ignore him, then he figured there was little point in him approaching her. He might find himself asking for trouble.\n\nNot long after, Han Sen saw many different races coming into the restaurant. Many of the elites that were out in search of the traitor had come to Steel City.\n\nThey realized the problem now. The Destroyed traitor was no longer hiding. The traitor had changed their identity, and now no one knew who it might have been.\n\nA few Buddha came into the restaurant. One Marquise in particular came up to Han Sen and bowed before him.\n\n“Amitabha! Mister Han. Thank you for saving me.”\n\nHan Sen remembered that Buddha as one of the Marquises he saved in Metal World. He hadn’t learned the man’s name, however.\n\nYou are welcome, but I was just trying to save myself,” Han Sen responded quietly.\n\nWhen Han Sen and that Marquise Buddha spoke, many Marquises and Dukes heard them and approached. Kahn was amongst them. When he saw Han Sen, he smiled and sat dovm next to him. “Brother Han, how much of a coincidence is this? We have met once again. I have heard that you froze Barr. That is very scary. You becoming a Marquise was a little late, wasn’t it? If you were Marquise a little earlier, I bet that Dollar would have met his match against you. You should have been the first name on the Geno Being Scroll.”\n\nKahn had turned into a rather obnoxious bootlicker. All of the elites looked over to Han Sen, with a mixture of complicated expressions.\n\nHan Sen ignored Kahn’s praise. That guy was like a cockroach, and he never died. Although Kahn was just a Marquise, Han Sen had tried to kill his giant golem body twice and failed. Kahn was still alive, and everywhere Han Sen went, he kept bumping into the annoying man.\n\n“Huh,” Kahn grunted, and his face went a little pale. That was because a large man had walked into the establishment, clutching a bone knife.\n\nHan Sen turned his head. Barr stood there, holding his bone knife. The freeze effect had vanished.\n\nBarr’s appearance made the whole lobby stop. That cruel man would kill anyone, anywhere. He had no concern for law or morals.\n\nKahn saw Barr approach, and so he stood up. He forced a smile at Han Sen and said, “Talk soon.”\n\nAfter that, Kahn returned to the table he was at earlier with the rest of his Demon fellows.\n\nBarr came in front of Han Sen and said coldly, “I’ll eat you.”\n\nAfter that, he did not wait for Han Sen’s response. He walked to another table and thrust the bone knife into the ground. He sat there and looked at Han Sen without blinking.\n\nHan Sen knew Barr hadn’t found a way to defrost fully. If he had, the monster would have struck Han Sen without speaking.\n\nNo one knew what was going on, but there were many Dukes and Marquises there. Droves of them filled the lobby.\n\n“Can I sit here?” asked a voice near Han Sen."
}