{
    "chapter": 195,
    "title": "Busty",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_195",
    "text": "\"Brother Han.\" Han Sen saw an attractive woman after he stepped out of a gravity trainer.\n\n\"Huangfu Pingqing? Why are you here?\" Han Sen paused and asked.\n\nNot being a Blackhawk student, Huangfu was not supposed to show up here.\n\n\"I am studying as an exchange student at Blackhawk. In the next two years, I will stay here.\" Huangfu looked at Hansen with a smile.\n\nIn order to come to Blackhawk, she spent quite some efforts.\n\nHan Sen thought it was a bit too coincidental.\n\n\"Seems that Brother Han would not welcome me?\" Huangfu leaned forward, blinking at Han Sen.\n\nHan Sen then noticed that Huangfu was wearing a pair of jeans, Chelsea boots, and a low-cut ecru blouse that showed a little too much, making the young man feel hot.\n\n\"That is quite busty...\" thought Han Sen, unable to move his eyes from her seductive curve.\n\nThe last time he saw her, she was wearing beast soul armor, so it was hard to tell. But this time in clothing like this, her breasts would attract so much attention, not just from guys, but from girls as well.\n\nHuangfu saw Han Sen's eyes fall on her chest, and slightly leaned further. Suddenly Han Sen thought his nose would bleed if he did not leave right away.\n\n\"Ahem, Ms. Huangfu, do you need me for something?\" Han Sen subconsciously rubbed his nose, for fear that there would be blood.\n\n\"Nothing import. Just to say hi. I just arrived and there must be a lot that I don’t know. Please help me if you could.\" Huangfu smiled. Han Sen was dazed by her look and figure.\n\n\"Of course.\" Han Sen suddenly felt it would be best if he stayed away from her.\n\n\"Also, two days until the auction of beast souls in Steel Armor Shelter. Brother Han you must come.\" Huangfu blinked.\n\n\"I will. But I’m wondering about the form of payment in the auction.\" Han Sen had sold a lot of stuff recently. Plus his salary and endorsement fee, he had a total of more than 60 million.\n\nBut it was obviously not enough to get a sacred-blood beast soul with this kind of money. As long as the beast soul was not too shabby, it could easily sell at more than 100 million.\n\nNot to mention Son of Heaven who was super rich was also in the steel shelter, and Han Sen was no match to his in terms of wealth.\n\n\"Levo dollars work, and you can also barter.\" Huangfu smiled at Han Sen, \"If you saw something you like, you could let me know and I could keep it for you.\"\n\nHan Sen thought, \"I haven’t even seen the beast souls. How would I know?\"\n\nHuangfu saw through his mind and shook her hand in front of him. Her breasts were also moving and Han Sen almost passed out.\n\n\"There is the information of the beast souls in the auction. Let me know if you like something and I can keep it.\" Huangfu put the chip in his hands.\n\n\"You mean it?\" Han Sen was so happy that he wanted to insert the chip into his comlink right away.\n\n\"Don’t rush. And this is not the best place to talk about things. This information is still a commercial secret at this point and we don’t want others to see. Let’s go, I will buy you lunch.\n\nThen, Huangfu held the Han Sen's arm, and took Han Sen out.\n\nHan Sen felt the softness on his arm and went blank, \"Sister... I will buy you lunch...\"\n\nHan Sen felt that he was molested during this meal. Huangfu sat next to him. When she spoke, her lips were almost touching his ears. The warmth from her breath ticked him. However, he was not thinking about the woman, but the beast souls.\n\nHuangfu and her people were selling the beast souls that they had brought to Steel Armor Shelter and made quite some money.\n\nBut those were only the primitive beast souls and the beast souls for auction were at least mutant.\n\nHan Sen did not look carefully at mutant beast souls and directly turned to two sacred-blood ones.\n\nOne was a flying beast soul called Holy Bird, which was a pair of colorful wings.\n\nAnd the other one was a beast soul weapon that Han Sen had always wanted. It was a shiny silver harpoon only two feet long.\n\nIts blade and the tip were so shape that it made one feel scared by looking at it.\n\nHan Sen fell in love with the harpoon at first glance. A harpoon required harder techniques than a dagger, and was a very rare weapon.\n\nHan Sen was very interested in the sacred-blood harpoon and checked its name. He then asked Huangfu, \"Sister, how much is the three-blade harpoon?\""
}