{
    "chapter": 32,
    "title": "A Ritual Between Men",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_32",
    "text": "The copper-toothed beast fed by Han Sen had become purple in color and bigger in size two months after it had become a mutant creature.\n\n\"Whether I could keep rising in the world all depends on you. Please become a sacred creature soon.\" Han Sen looked at the purple color of its skin and thought it was about time.\n\nJudging from the situation, it would take about three months for a mutant creature to evolve into a sacred-blood creature. This period was neither too long nor too short. It was almost impossible for most people to hunt a sacred-blood creature in just three months. Even Qin Xuan might not have been able to hunt a sacred-blood creature for a year.\n\nNow with this black crystal, Han Sen could have an entire sacred-blood creature to his own every three months, which was simply incredible.\n\n\"Just give me enough time, and I could easily evolve with all four types of geno points maxed out. By then I will gain the title of sacred-blood aristocrat for sure.\" Han Sen was getting excited.\n\nHe did not see Qin Xuan at the teleport station on his way home. She could be either tired of this game or simply busy.\n\nOutside the station, he saw a girl standing at the roadside and stopped walking.\n\nIt was Xue Xi, the girl who grew up with Zhang Danfeng and him.\n\nXue Xi was from a single-parent family, and her mother had raised her by working at Han Sen’s father’s company. With no one to babysit her, her mother had often brought her to work, and she had always played with Zhang Danfeng and Han Sen.\n\nLater, Han Sen heard that Xue Xi’s father was still alive and found her mother and her. After his Dad’s incident, Han Sen didn’t have the energy to learn more about her family. But he did hear that she was an illegitimate daughter and her father only took her back after his wife passed away.\n\n\"Sen!\" Xue Xi also saw Han Sen and exclaimed.\n\n\"Why are you here?\" asked Han Sen, puzzled.\n\n\"Sen, I’m over 16 and can enter God’s Sanctuary now,\" Xue Xi chuckled and said.\n\n\"So fast?\" Han Sen was startled. In his mind, Xue Xi was a little girl, and now she could even enter God’s Sanctuary.\n\n\"I'm only a few months younger than you. Don’t think of me as a child,\" Xue Xi said discontentedly.\n\n\"Indeed. How time flies!\" Han Sen looked at her well-developed body and smiled. She was no longer a little girl.\n\nXue Xi blushed as Han Xin looked at her. When she was about to say something, there was a roar of an engine, and they saw a well-dressed young man coming down from a private aircraft parked on the roadside.\n\nThe young man was about 20 years old, and that private aircraft alone was worth more than ten million.\n\n\"Sister, I said earlier to use our private teleport equipment. It’s just inevitable that we should meet some annoying people at a teleport station.\" The young people did not even look at Han Sen and went straight to Xue Xi.\n\n\"Brother, he is my childhood friend,\" Xue Xi quickly explained.\n\n\"Well, we should go back.\" The young man ignored her explanation, took her hand and led her on the aircraft.\n\n\"Sen, I’ll come back,\" Xue Xi said to Han Sen softly before she went.\n\nThe young people returned to warn Han Sen: \"People like you aren’t worthy to be her friend. Leave her alone or you’ll be sorry.\"\n\n\"Are you talking to me?\" Han Sen glanced at him.\n\n\"You don’t believe what I said?\" The young man suddenly stepped forward, and quickly hit Han Sen’s lower abdomen with a knee.\n\nHe was very close to Han Sen, and he was incredibly fast. His knee suddenly came toward Han Sen.\n\nHan Sen looked calm, but secretly sneered. \"Nothing is better for wrestling than Ghosthaunt. Even Qin Xuan dares not let me get close now.\"\n\nLeaning to one side, Han Sen avoided his knee and stuck a leg behind his leg on the ground. Han Sen’s also clamped the young man’s neck and pulled hard.\n\nBang!\n\nThe young man suddenly lost his balance and fell to the floor.\n\nLying on the ground, he looked at Han Sen in shock and forgot to get up. He didn’t expect his hit would be in vain, and couldn’t believe he was pulled down by Han Sen.\n\n\"Sen, what happened?\" Seeing things going wrong, Xue Xi ran down from the aircraft and quickly helped the young man up.\n\n\"Nothing, just a ritual between men. It is late and I need to go. Let’s eat together sometime.\" Han Sen smiled, waved goodbye and went to the train station.\n\n\"Brother, you alright?\" Xue Xi asked the young man.\n\n\"Interesting... really interesting...\" The young man watched Han Sen leaving with a strange smile.\n\nSeeing the young man smiling, Xue Xi was suddenly anxious. \"Brother, don’t pick on him. He didn’t mean it.\"\n\n\"He could make me fall even when he didn’t mean it. If he meant it, then would I, Fang Jingqi, be killed?\" he said with his eyes narrowed.\n\n\"Brother... that’s not what I meant...\" Xue Xi panicked and did not know how to explain.\n\n\"No worries sister. As he said, it was a ritual between men and I shall return the favor.\" Fang Jingqi stared frantically in the direction where Han Sen went. \"In a few days, please invite him to dinner at home.\"\n\n\"What?\" Xue Xi looked at Fang Jingqi and could not believe her own ears."
}