{
    "chapter": 1210,
    "title": "Big Snake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1210",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nSnowball stood atop the cliff, watching the white ball tumble off. It smiled, thinking of the gruesome demise that would await those inside it once they reached the bottom. But just as the ball started to drop, something from the inside began to stretch it. The force inside the ball was warping its shape and composure.\n\nThe white ball was not broken, but the power was enough for the entire thing to defy gravity and shoot back up into the skies with the speed of a freshly-launched cannonball. It soared upwards, far above where it had been previously.\n\nThe snowball watched the ball rocket up, and as it looked, its eyes sank and became sullen. Its face turned morbid.\n\nThey had been on a cliff that skirted a long drop at the center of the mountain. There was a canopy above it, with a hole inside. What was above couldn’t be seen.\n\nSnowball leaped onto the skyward ball and jumped on it, hoping to change its trajectory and make it fall again. But the power of the coin was too much to defy, and the ball was still heading upwards towards the hole.\n\nWhen the snowball saw it becoming alarmingly close to the black hole, it looked shocked. And then, before the creature knew it, the ball was plugged inside the black hole.\n\nHan Sen was shocked, as well. The power of the sixteen-numbered coin had stretched and deformed the ball, but it had not been able to break it.\n\nAfter a while, Han Sen felt the ball hit something. And then, the ball began to spin.\n\nHan Sen held Bao’er to keep her steady.\n\nThe ball was like a bouncy ball, and after a while, it stopped. Then, they both heard a noise.\n\nA strange noise sounded, as if something had stepped across the ball. Unfortunately, Han Sen had been stripped of his ability to use the Dongxuan Aura for now, so he could not tell what it was.\n\nOutside the ball was a cave. There were many cream-colored eggs inside it.\n\nWhen the ball entered, it had crushed countless numbers of them. The juicy innards of the eggs had been spilled everywhere.\n\nThe cave was messed up, and snowball stood near the ball. It was frozen.\n\nThe snowball looked at the ball and the smashed eggs, then simply decided to run. But just as it reached the exit, it was stopped once more. A big, lumbering shadow drowned it in darkness. A giant black snake had appeared.\n\nThe snake was not an ordinary one. To go along with its black scales, it possessed a black horn and black wings.\n\nIt did not have any claws or talons despite looking like a dragon, but it did have massive, poisonous teeth. They were curved, and the look of them alone was enough to skewer a person to death with fright.\n\nThe snake watched the snowball shiver and shake.\n\nAs it trembled in fear, the snowball pointed towards the white ball and barked. It wanted to protest its innocence and indicate that it had nothing to do with the destroyed eggs.\n\nThe big snake was cruel and unforgiving, and all parties involved were responsible. It lunged forward and tried to snap the snowball with its wretched maw.\n\nThe snowball was shocked. It emitted a flash and trapped itself inside a white ball.\n\nThe snake bit into the white ball that had suddenly surrounded the intruder, and tried to break it with its fierce teeth. The teeth dug their way into the plush skin of the white ball fairly deeply, but they were unable to pierce through.\n\nBut with this bite, the teeth expelled a corrosive substance. It was its lethal venom, and it dyed most of the white ball black.\n\nPang!\n\nWhere the ball had been dyed black, it shriveled and melted away.\n\nThe snowball fell out of the broken ball like a marble, and it unwittingly rolled into a few more of the eggs and broke them. The little blighter looked even paler when it noticed that it was drenched in egg yolk. It tried to force a smile as the snake bore down on it.\n\nThere was only one thing left for it to do. It turned heel and fled, with the snake behind it in hot pursuit.\n\nThe snowball’s speed was incredible, but the snake was even faster. Whenever the snowball looked likely to meet the snake’s teeth, it would wrap itself up in another white ball. But each time this occurred, the snake bit into it and broke the ball with its venom.\n\nThe snake’s poison was the snowball’s most feared substance. The balls it conjured could not be broken through pure strength, but only with poison.\n\nThe snowball kept on running, smashing straight through the eggs without a care if it meant it’d have an easier time escaping the snake. The snowball relied on the ball to stay alive, but its performance eventually became sluggish. It moved slower each time a ball was summoned and subsequently broken.\n\nThe snowball kept on running, and when it saw the ball that had trapped Han Sen and Bao’er, it ran towards them. When the snowball was just one meter away from the ball, its body flashed. A bright white flashbang was emitted, and it caused the white ball to crack.\n\nHan Sen and Bao’er had heard a lot of movement taking place outside. They had heard a lot of things breaking, and what stood out to them most was a fear-stricken bark produced by the snowball itself.\n\nAn explosion then sounded, like the popping of a balloon but much, much louder.\n\n“Is this ball breaking? Is it going to open?” Han Sen guessed.\n\nIf a creature was breaking the ball, Han Sen wondered what incredible strength the creature must possess. And while Han Sen was lost in thought, he heard a katcha sound. Swifty following this, the white ball of his imprisonment opened like the unfolding of a lotus flower."
}