{
    "chapter": 1700,
    "title": "Crystal King Armor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1700",
    "text": "“Impossible!” Yake looked at her with disbelief. He was a crystallizer with self-generated geno armor. He was also the only creature that could still stay in the sanctuary after doing so.\n\nHe lost to Stay Up Late, who was a crystallizer from the Third Division Special Forces. That did not come as a surprise, but Bao’er was just a pet beast soul that belonged to Han Sen. He could not believe a pet beast soul’s power could be even remotely stronger than he was.\n\nAnd Bao’er was also wearing a geno armor.\n\nBao’er jumped up and threw a punch towards Yake’s face. She looked so angry, and she knew who was important to Han Sen. Yake had wanted to kill Luo Lan, which was something that swiftly infuriated the baby.\n\nYake was in the air, and he’d be unable to dodge her next strike. All he could do was raise his arms and try to punch back her incoming fist.\n\nBut Bao’er’s fist was like a hammer, and it tore Yake’s arm open. The fist landed on his helmet, caving it in. The force propelled his body down into the ground with the force of a cannonball, cratering the zone.\n\nThe angry Bao’er wished to give chase, but Zach and Zagu were slipping behind her and going for Ji Yanran. They were planning to take Littleflower away from her.\n\nBao’er’s little body flashed back to Ji Yanran. To stop Zach and Zagu, she gave them a punch each.\n\nDong!\n\nZach and Zagu were strong. They were stronger than Yake, definitely, and that was because they had also generated their own geno armor. Even so, their armorsets were visibly dented by the punches that Bao’er delivered.\n\nYake’s face, which was smeared with mud and blood, emerged from the crater. He came rushing towards Bao’er with manic fury.\n\nBao’er fought all three of them with absolute strength. Her fists and her arms were so hard, Bao’er was able to keep delivering strikes that repeatedly dented their armor.\n\nYake and the others were in shock. It was difficult to believe that anyone this powerful aside from the officer resided in the Alliance.\n\nThe officer frowned, seeing all this. And he was visibly afraid of the power Bao’er wielded.\n\nBut Bao’er’s golden leaf armor suddenly started to shine. The luminosity made it look rather unstable. Bao’er had put the armor on to defeat Snake Witch before she really should have, and that had made her weak for some time.\n\nThis time, however, she wasn’t able to kill them immediately. It was taking her a while, and it didn’t help that there were three of them to deal with. Things were turning dire once more.\n\nJi Yanran saw Bao’er’s situation suddenly turn grim, and she gave Littleflower to Luo Lan. Then, she put on the Crystal Shoes that were in her bag.\n\n“Crystal Shoes, please help us! We will very much appreciate your assistance,” Ji Yanran said to the Crystal Shoes.\n\nThe Crystal Shoes heard what Ji Yanran said, and then leaped down onto the ground. They slipped themselves onto her feet, and a crystal light began to shine everywhere. The shoes were like magic, and they turned into a crystal armor that decked out Ji Yanran.\n\nBefore Ji Yanran could move, the crystal armor pulled her into the air. She attacked Zach with spinning legs.\n\nZach threw a punch at the incoming legs and they collided. But Zach’s fist was broken against the solid crystal armor, resulting in a spray of blood.\n\n“Argh!” Zach fell back, as Ji Yanran was now in the thick of things. Ji Yanran joined the fight alongside Bao’er.\n\nThe attackers had a hard time withstanding Bao’er’s strikes alone, but now they could do nothing. They kept on getting hit without reprieve, and they were bleeding like mad.\n\nEveryone from God’s Organization was in shock.\n\nThey thought it would be a fun event to draw Han Jinzhi out of hiding. The Han family wasn’t even their target. Yet as soon as the fight began, they realized how scary the family was. That fear had only mounted in the time since, and they felt truly powerless and helpless before them.\n\nYake, Zach, and Zagu were having a particularly terrible time. They had claimed to be the strongest, and they had even claimed to be crystallizers. But now they were getting cruelly beaten by Ji Yanran and Bao’er. They were on a short fuse now.\n\nJi Yanran was not fighting them herself, of course. She was being controlled by the Crystal Shoes. The shoes merely borrowed her body for fighting purposes.\n\nWhen the officer saw the Crystal Shoes, his eyes opened wide. He said, “Why would Eastern King’s Crystal Shoes be here, owned by these humans?”\n\nThe officer suddenly left Stay Up Late where he was. He headed straight for Ji Yanran and Bao’er.\n\n“Officer, are you leaving?” Stay Up Late followed the officer and stopped him.\n\n“Night, I said this is none of your business.” The officer frowned, and then his body moved. He was unable to get rid of Stay Up Late that easily, however.\n\nStay Up Late’s mouth was bleeding, but he could still smile and mock his former superior. “You taught me everything, so you know me. But that also means I know you. You’re not shaking me so easily.”\n\n“Step back; I do not want to soak myself in your blood,” the officer said coldly.\n\n“I told you I have been watching over them, and I won’t let anyone bring them lasting harm.” Stay Up Late blocked the officer again.\n\n“You really think you can stop me from going over there?” The officer sighed.\n\n“I told you. We both understand each other too well,” Stay Up Late said.\n\nThe officer shook his head. “You know me, but you don’t know time. It’s been so long and things can change, like…”\n\nAfter that, the officer blasted out a scary power. A flaming pair of wings appeared, setting him ablaze, assimilating with his armor.\n\n“Southern King Wings? How is that possible? Your geno armor is compatible with it?” Stay Up Late screamed in shock.\n\n“There are many things of which you know nothing,” the officer said, then pulled out a white sword.\n\n“Western King Sword?” Stay Up Late could not contain his expression of surprise. He was truly shocked.\n\n“The geno armors of the four crystallizer kings still exist, and I have obtained two of them. And they are blending into my geno armor. No one in the sanctuary can ever hope to fight me. Before me and my power, your knowledge is useless.” The officer held the white-metal sword high as his body blazed with fire. He coldly told Stay Up Late, “Step aside. Don’t make me spill the last of your blood.”"
}