{
    "chapter": 1894,
    "title": "Black Cliff",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1894",
    "text": "Not much later, the Rebate Noble heirs were beaten. Their armors had been broken, and their faces were all swollen. They fell to the ground, crying their eyes out.\n\nSpeechless, No Flower, and Black Cliff were all in shock. It was unheard of, for a nameless Viscount to beat down so many Nobles. Xie Qing King seemed terribly overpowered.\n\nAnd he was nothing more than a guard in Han Sen’s roster. It was a scary thought.\n\n“It looks like solo, or even in group fights, you guys are all weak. None of you can fight,” Xie Qing King said simply, and then returned to the entrance.\n\nHe returned to standing at his station like a proper guardsman, and he paid them no further attention.\n\nSad Night picked himself up off the ground. His face was completely swollen, stained with blood and dirt. His eyes were bloodshot. He wanted to go and hide.\n\nHe wouldn’t mind losing to Han Sen, but he and the other Rebate had been beaten by an insignificant Viscount. This wasn’t just embarrassing to them; this was an embarrassment to their elders. Everyone would be laughing if news of these events ever spread.\n\nThe worst thing about it, though, was that Speechless and No Flower had seen it all.\n\n“Black Cliff, what do you think?” Sad Night looked at Black Cliff. Sad Night was not going to continue fighting, as that would just lead to greater embarrassment. But Black Cliff was different. He was the oldest son of Black-Moon King, and he was a Duke. If he struck, it was unlikely anyone near Mirror Lake could withstand the blow.\n\n“I am only here to see Han Sen’s Knife Blank. The rest of this is none of my business,” Black Cliff said with disinterest.\n\nSad Night’s face went red. He looked at Black Cliff, then left. He was way too embarrassed to stay now. A few more of the Nobles drifted away, and then the rest got up and said goodbye to Speechless and No Flower.\n\nSpeechless and No Flower didn’t want to leave yet. They were happy to wait outside with Black Cliff.\n\nAfter half an hour, Han Sen exited the base.\n\nHan Sen looked at Black Cliff and the Buddhas. With a frown, he said, “Why are you still here?”\n\n“I am Black Cliff, from Planet Black-Moon. I have heard you are in possession of a mystic Knife Blank. I would like to borrow it. The conditions are yours to decide,” Black Cliff said, looking at Han Sen.\n\n“Are you related to Black Steel?” Han Sen asked.\n\n“Black Steel is my fourth brother,” Black Cliff answered.\n\n“If you are a sibling of Black Steel, please come inside.” Han Sen welcomed him inside.\n\nBlack Cliff was willing to comply, and he let one of the Kate lead him forward.\n\n“What do you two need?” Han Sen looked at Speechless and No Flower.\n\n“Amitabha. I am No Flower of the Buddha. This is Speechless Buddha Lady. I have heard Knife Queen accepted a genius for a student, and so we have eagerly looked forward to meeting him.” No Flower bowed.\n\n“Well, you guys have met him. You can go now.” Han Sen turned around and walked back into the base.\n\n“Hang on…” Pang! Before No Flower could speak, Han Sen had closed the gate.\n\nSpeechless and No Flower had seen a lot in their time. They had seen many people express all sorts of different tempers, but Han Sen was unique amongst all they had seen.\n\n“The student of Knife Queen is special.” No Flower had a wry smile.\n\n“Never mind. If he doesn’t want to see us, then we’d best depart.” Speechless looked strange as she made the decision. “That is the only way, I suppose.” No Flower nodded.\n\nThey left the base and flew off in the aircraft. Speechless was thinking to herself, “Knife Queen wouldn’t just accept any student. We haven’t yet found out why she selected him, but seeing how strong his followers are, it might suggest he is hiding something. I need to force him to talk to me sometime.”\n\nAfter Han Sen went back into the base, he went to the meeting room to discuss things with Black Cliff.\n\n“Why do you want to see my Knife Blank?” Han Sen asked.\n\nThe Knife Blank was not an ordinary item. If Black Cliff hadn’t been Black Steel’s brother, Han Sen wouldn’t have let him in, regardless of his rank. He certainly wouldn’t let him see the Knife Blank.\n\nBlack Cliff said, “The Black family forges weaponry, and I am quite skilled at the process. I have been doing this for fifty years, but even now, I have yet to be able to forge a King class knife. And that’s all because I’ve never been able to get my hands on decent materials. Only fine materials can make what I seek to create. I have heard the Knife Blank you found inside Knife Grave is a good item. So, I was hoping I might borrow it. And if not, I hoped I could make an offer to purchase it outright.”\n\n“I wasn’t planning on selling it. And you do know that because it came from Knife Grave, it cannot actually be forged?” Han Sen said.\n\n“The weaponry from Knife Grave can be forged; you just have to know how. It’s okay if you do not wish to sell the material, but if it does work, I can forge it into something of your choosing, all for free. I’d even be willing to pay. You will still keep ownership of the knife, too.” Black Cliff looked excited.\n\nHan Sen thought that was a worthy bargain. The Knife Blank was only a Knife Blank. He couldn’t utilize its powers, so it would be great if it could be forged.\n\nIt’d be free, and it’d also come from the best blacksmith of the Rebate. That was a very good deal.\n\nHan Sen did not need to worry about Black Cliff destroying the weapon. This was Narrow Moon, and he wouldn’t do something like that unless he was genuinely crazy.\n\nAnd Black Cliff did not look like a crazy man, so Han Sen was not worried.\n\n“Okay, please wait here.” Han Sen asked someone to bring the Knife Blank. But just as he was about to hand it over, he felt that something was wrong.\n\nWhen Black Cliff saw the Knife Blank, he froze. It looked as if his eyes were on fire. The fire did not really exist, but Han Sen could see it. It looked very familiar.\n\n“King Jun.” Han Sen immediately recalled where he had seen this before.\n\nThe gold sunbird that Han Sen had killed, and the being called King Jun that named himself Skygod, and the fire he used… What Han Sen saw in Black Cliff’s eyes reminded him of all that.\n\nHan Sen was going to hand the Knife Blank over, but right before he did, he pulled it back.\n\n“Knife Blank. Knife Blank.” Black Cliff was acting as if he had been possessed. He mumbled over and over, as he tried to grab the Knife Blank from Han Sen.\n\n“F*ck! King Jun is behind this!” Han Sen immediately reacted. Unless Black Cliff was stupid or just plain mad, he wouldn’t have come here to try to steal the Knife Blank. Even if he stole it and killed Han Sen in the process, he couldn’t have owned it.\n\nBut that seemed to be exactly what Black Cliff was doing. The man’s mind seemed to be scrambled. And it reminded Han Sen of King Jun Skygod."
}