{
    "chapter": 1328,
    "title": "Fighting Ruin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1328",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was like a spartan; he was a killing machine. With no other weapons at his disposal or powers he could depend upon, this was the only thing he could do.\n\nRuin Emperor was no slouch, though. He understood the threat that he was now faced with, and he arduously tried to counter every attack brought towards him. Fists cracked against fists, as legs kicked against legs. If it weren’t for the remarkable talents of the fighters, this would have been nothing more than a brutal street-brawl.\n\nMoment Queen was stunned by the display. Han Sen was using his physical attacks to suppress Ruin Emperor, so much so that the all-powerful and supreme spirit of the Third God’s Sanctuary was on the defensive.\n\n“How strong is he?” Moment Queen asked herself once more. She had asked herself this many times, as of late.\n\nAnd it wasn’t just Moment Queen thinking of things this way, either. Everyone pretty much was, and that included the audience on the colorful ship and East Empress herself.\n\nRuin Emperor was indisputably the mightiest spirit of the Third God’s Sanctuary, and for a human to have achieved the strength to contest such a spirit was something that could only occur in a spirit’s deepest, darkest nightmares. It signaled the dawn of change for the sanctuary.\n\nHan Sen’s physical power was being driven by Jadeskin, and Ruin Emperor’s powers could not trap and suppress it.\n\nUnfortunately, he was not able to use Ghost Slash. While he might have posed a threat to Ruin Emperor, his chance of ultimately defeating the emperor and achieving victory was low without such a powerful, killing attack.\n\nRuin Emperor was undergoing something he hadn’t had to suffer for a very long time, though. Under this sudden onslaught, his face turned grim. He did not expect he would have to properly fight another human before going after Godslayer Luo’s heir like he had come there to do.\n\nRuin Emperor tried attacking in return whenever he could, but Han Sen was like an indestructible statue. He was immune to everything the spirit sought to do. He actually believed himself to be at a disadvantage, and on a long, slippery slope to loss, failure, and shame.\n\nThree-Eye Emperor and Gu Demon Emperor moved to attack Han Sen’s companions, while this happened.\n\nThey thought killing Han Sen’s companions would deal a blow to his morale and distract Han Sen enough for him to be thrown off-guard, leaving him open to a killing blow by Ruin Emperor.\n\nIt wouldn’t be difficult for them to take down Han Sen’s companions, either, because their powers had been robbed by Ruin Emperor. The silver fox and Xie Qing King were defenseless, and all the two emperors had to do was watch out for Zero.\n\nGu Demon Emperor had thought of a way to get Zero out of the way, too.\n\nGu Demon Emperor summoned a number of toxic bugs and sent them over towards the ravaged shelter.\n\nHe slapped his can and three Cup Demon Gu appeared, just like before. Black smoke flower out of the cups, then, composing a number of Cup Demon Emperors.\n\nZero was going to use her dagger to attack, but one of the Cup Demon Emperors suddenly became bloated. It rapidly grew in size like a swiftly inflating balloon and then exploded.\n\nZero had the powers of Asura, but her body was weak. She couldn’t withstand the attack, so she had to soar off into the sky and avoid what damage the bloated cup might deal.\n\nAnd after she dodged, she was not out of the proverbial Cup Demon woods. More of those figures were approaching her.\n\nOne Cup Demon Gu was able to produce ten Cup Demon Emperors. With three of them in play, that meant thirty of them could be produced. And thirty of them had been made, and now, they were all going after Zero.\n\nZero was preoccupied with defeating the doppelgangers on her tail, as Gu Demon Emperor had planned. And that meant he was free and clear for now.\n\nThe power of Asura was limited by its effective range. The dagger helped increase that range, but still, there was nothing Zero could do to aid those down below. She had quickly found herself surrounded.\n\nOrdinary spirits would have been destroyed by the oppression of those doppelgangers in a heartbeat, but it did go to show how secretly talented Zero was, in simply remaining alive in the face of their adversity.\n\nZero tried to kill them before they all exploded like the first had done.\n\nAll the Cup Demon Emperors were ten gene lock enemies, and Zero’s body was so weak, she would not even be able to withstand a single hit from one of those enemies.\n\nThe three-eyed spirit smiled, seeing this happen. He thought Gu Demon Emperor was a genius.\n\nThree-Eye Emperor was fairly strong himself. He had to be, if he shared space and spent a lot of time with No God Emperor and Gu Demon Emperor, after all. His third eye flashed with a green light, and then he fired a green laser beam which went straight into Xie Qing King’s eye.\n\nThe green arrow was relentless, and it went straight in with no resistance.\n\nXie Qing King tried to block the beam, but it was too late for him. It had taken him by surprise.\n\nXie Qing King’s right eye had been broken, smashed into jelly. Blood began to pour profusely from the gruesome wound.\n\nBlue Dinosaur roared and ran to engage Three-Eye Emperor in retaliation. But there was nothing the poor beast could do. Three-Eye Emperor only had to look at Blue Dinosaur to send it falling backwards with a destroyed eye.\n\nEnjoying the pain he was able to inflict, Three-Eye Emperor took a step forward and peered into Blue Dinosaur’s second eye. Then, boom! Another of its eye sockets was a soggy mess.\n\nBlue Dinosaur writhed around on the ground, squealing in agony. The pain was awful, but the blindness was horrifying. It tried getting up to flail around and attempt to hit Three-Eye Emperor, but he was able to dodge with ease.\n\nBlue Dinosaur was very slow with its broken vision now, and try as it might, it just couldn’t muster the speed necessary for hitting Three-Eye Emperor.\n\nPang!\n\nThree-Eye Emperor leaped forward and punched Blue Dinosaur with a fist fueled by a creepy green light. The poor creature was sent flying several hundred meters away by the ferocity and power of that blow.\n\nFortunately, Holy Rhino was still there with them. He had deployed heals to the wounded, and he was even able to fix Blue Dinosaur and Xie Qing King’s eyes.\n\nThree-Eye Emperor realized the annoyance the rhino could pose, so he said aloud, “Well, I certainly need to take you off the board first!”\n\nAfter that, he fired a beam of green light at one of Holy Rhino’s eyes.\n\nThe eye of the rhino cascaded blood. But suddenly, someone appeared before Three-Eye Emperor and obscured his vision to prevent a follow-up."
}