{
    "chapter": 1930,
    "title": "Moon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1930",
    "text": "The Dukes didn’t look at the blade in the same way Han Sen had. They all looked at it for less than a minute before handing it back over to Black-Moon King. The entire thing was done in a few minutes.\n\nThe young ones were not allowed to look at it by themselves. After they had all seen it, the ceremony came to a close. Black-Moon King invited a few Kings and Dukes over for tea. Some accepted and stayed, others declined and left.\n\nBlack Steel invited Rebecca and a few of the other young ones to the garden for a chat, Han Sen included.\n\nSo, Han Sen followed Black Steel to the garden. There, he sat down. Aside from Han Sen, everyone seemed to be acquainted with one another. So, there was no formal etiquette to follow.\n\nWithout Black-Moon King around, they were prone to speaking far more openly than they ordinarily would. As they began chatting, not a single person was left out. But with that being said, Han Sen did not say a word. Han Sen did not know anyone there except for Black Steel, and so he retreated into his mind to mull over what he had learned with the knife. He didn’t care for their topics of conversation.\n\nDu Lishe, noticing that Han Sen wasn’t speaking with them, hummed and said, “Genius Han, you looked at Narrow Moon Knife for so long. And you kept saying it was so good, you could obviously detect something we could not. Why don’t you tell us what you saw, so that we too can learn it.”\n\nAfter Du Lishe said that, everyone turned to look at Han Sen. They were curious whether Han Sen really had learned something, or if it was all some sort of act.\n\nHan Sen’s eyes were closed, still reviewing what he had learned. He hadn’t noticed Du Lishe was talking to him. His eyes were shut tight, and it appeared as if he was ignoring her.\n\nDu Lishe, noticing him ignoring her, looked mad and did not say anything more.\n\nDu Lishe’s silence did not mean others wouldn’t say anything, though. She was Moon Wheel King’s second daughter. She was pretty, and she was talented. She had many admirers.\n\nThe young ones that sat there with them were admirers of Rebecca and Du Lishe. Now that Han Sen had apparently ignored her, someone could not help but stand up for her.\n\n“Didn’t he tell you what he saw?” a Viscount called Kriman asked dubiously.\n\n“What did he say?” Du Lishe asked.\n\nEveryone looked at Kriman, but everyone knew he wasn’t going to say anything nice.\n\nKriman laughed. “Didn’t you grow ears? Genius Han said it was a good knife. He said it many times.”\n\nKriman spoke it in the tone Han Sen had, and Du Lishe laughed. “Ha!”\n\nKriman over-enunciated his words, laughing at Han Sen and pretending to understand, which made many people there laugh. The elegant ones smiled.\n\nHan Sen sat where he was without emotion. He was deep in thought. He was afraid that occupying his mind with something else for a while would make him forget important details. So, he still did not hear them.\n\nHan Sen continued to ignore the group. Black Steel frowned and said, “Han Sen has his reasons for viewing the knife the way he did.”\n\nBlack Steel did not know how to participate in that particular debate, so this was what he said.\n\nKriman did not respect Black Steel. He only wanted to stand up for Du Lishe in the hopes of getting closer to her, and so he said, “Black Steel, you know knives. Similar actions from you might make sense, but I can’t feel the same for other people. He looked at it for half an hour, repeating the same two sentences over and over. If he is not educated, don’t pretend he is. This is the first time I’ve ever seen someone so dumb.”\n\n“Kriman, mind your tongue.” Black Steel’s face looked grim.\n\nKriman smiled and said, “I don’t beat around the bush. If I have said something that is incorrect, then you can have him point out the mistake. If he can convince everyone, I will earnestly apologize.”\n\nSad Night and Night Giant King, who had a grudge with Han Sen, looked over angrily and said, “Yes! If he saw something, let us hear what it is that he saw. If it makes sense, then we will apologize, too. What is the point in just saying that the knife was good, over and over.”\n\nBlack Steel could see Han Sen still sitting where he was, not saying a word. He touched him and said, “If you are willing to, you can tell people.”\n\nBlack Steel understood Han Sen. He knew Han Sen had seen something the others hadn’t, and that was why he stared at it for so long. What Han Sen saw wasn’t anyone else’s business, of course. Black Steel would not push Han Sen to explain if he wasn’t willing to.\n\nBut now that the people were saying things like this, Black Steel could not stand by and watch. He was worried for Han Sen. If Han Sen did not say something, his reputation would suffer. No one ever let a person’s reputation go.\n\nOutsiders had a tough life in Narrow Moon. Han Sen had built himself a good reputation. Black Steel thought it would be a shame if it was destroyed now.\n\nAfter being touched by Black Steel, Han Sen woke up from his daze. Han Sen looked confused, hearing what he said. And so, he asked, “Tell people what?”\n\nHe hadn’t heard anything else that had been spoken. All he had heard was what Black Steel had spoken to him.\n\nBut when that went into the ears of Kriman and the others, they misunderstood. They thought Han Sen was admitting he didn’t know or see anything. Hence why he had nothing to say.\n\nKriman laughed and said, “Black Steel, you heard him. I didn’t misplace my blame. I admire Genius Han for one thing only: his shamelessness. He didn’t learn anything, despite staring at it for half an hour. I couldn’t bring myself to do such a thing.”\n\nSad Night coldly laughed and said, “Because he is a genius, isn’t that right? He isn’t like us. He is already so smart, he was able to tell us the shocking fact that it was a good knife. What more can we expect?”\n\nHan Sen heard that and quickly understood what was going on without even needing to ask Black Steel.\n\nSeeing Kriman and Sad Night speak, Han Sen coldly said, “I won’t tell you, but my teacher did teach me something. Instead of using words, I can perform, and what I perform will make you smile.”\n\n“We would like to see what shocking performance you could do for us. You are not going to perform the astounding Speech of Good again, are you?” Kriman spoke strangely.\n\nHe thought Han Sen was changing the topic, hence why he was repeating the same insults. He didn’t want Han Sen to escape this.\n\nHan Sen smiled. He casually said, “I learned a geno art called Moon.”"
}