{
    "chapter": 2506,
    "title": "Encountering the Black Hole Spider Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2506",
    "text": "“I don’t know… I have only heard about it. If this really is the Shield of the Medusa’s Gaze, then her eyes ought to be able to open. The legends say that if she opens her eyes, even a god would cry. But it has been too long… Many people have heard the legend, but anyone who might have looked on the Shield of the Medusa’s Gaze is probably dead by now. Only an immortal could confirm the validity of this thing. Even in the Thousand Treasures Alliance, I am afraid only a few elders might be able to confirm its identity,” Fang Qing Yu said.\n\nHan Sen frowned. If this was the Shield of the Medusa’s Gaze, the Extreme King must have seen him retrieve it.\n\n“Bao’er, come up and pilot the ship. Speed up and let’s get moving.” Han Sen turned the helm over to Bao’er and carried the shield to his room. He wanted to find out if the shield was useful.\n\nIt didn’t matter if it was the Shield of the Medusa’s Gaze or not. If he couldn’t use it, then it was rubbish.\n\nHan Sen gripped the shield in his hands and put his jade power into it. Or at least, he tried to. The power bounced away. He was unable to place Jadeskin’s power into the shield.\n\nHan Sen frowned. Next, he used the power of the Dongxuan Sutra, and he tried to put that into the shield. This time the power didn’t bounce away. After the power of the Dongxuan Sutra entered the shield, the carving of the beautiful woman started to glow with a purple light. Light began to glow within her flickering eyes, and it appeared as if they were going to open.\n\nBut Han Sen’s eyes widened. The shield was like a bottomless hole, and it consumed his power ravenously. In just a second, Han Sen’s face was ghostly pale. His lifeforce had been drained, but the woman inside the shield still had her eyes closed. There was still some purple light around her face, but it didn’t look as if the eyes were going to open.\n\nHan Sen quickly pushed the shield away. If this kept going, he’d be nothing but a dried-up husk.\n\nAfter Han Sen got rid of the shield, the light on the shield disappeared. It went back to looking old and slightly battered. It no longer showed any sign of activity.\n\n“Even if this isn’t the Shield of the Medusa’s Gaze, it’s still an awesome treasure. Even with my power, I cannot activate it.” Han Sen was quite pleased with his find. He believed the shield had to be the Shield of the Medusa’s Gaze.\n\nBut Han Sen was still a bit miffed about being unable to make use of it. He was too weak, and he knew he would have to try it while wearing the Peacock King soul robe.\n\nHan Sen wasn’t in the mood to try it at that moment, though. The legendary Shield of the Medusa’s Gaze was too scary, and Han Sen knew he couldn’t control its power properly. He was afraid that if he activated the shield, its power would destroy everything.\n\nHan Sen tried putting the Shield of the Medusa’s Gaze into Destiny’s Tower. The Shield of the Medusa’s Gaze was very heavy, but he managed to stick it into the tower without much difficulty. That would save him a lot of trouble.\n\nFang Qing Yu was still wondering if it was truly the Shield of the Medusa’s Gaze. Han Sen wasn’t really concerned about that. It would be a powerful item, as long as he was able to use it.\n\nThe white whale was still undergoing repairs, so it wasn’t moving very fast. The Ice Blue Knights continued to tail the whale, and the whale could do nothing to shake them.\n\nIce Blue Knight King was in the ship that was following them. He stared at the white whale non-stop, every day.\n\nThere were no words to describe how conflicted Ice Blue Knight King’s heart felt right then.\n\nHan Sen had killed a prince and captured King Bai’s favorite son, but none of that impacted Ice Blue Knight King personally. Han Sen had suddenly dug up the Shield of the Medusa’s Gaze from a place belonging to the Ice Blue Knights, though. Ice Blue Knight King was unsure how he should be reacting to all this. What he knew was that he wished he had never met the guy.\n\nHan Sen was like some demonic force hanging over his life. If God gave him another chance, Ice Blue Knight King would kill him back when he was still inside his mother’s belly. That way, Han Sen would never have been able to harm others.\n\n“The Shield of the Medusa’s Gaze… The Shield of the Medusa’s Gaze was hidden beneath my nose for years. And I…” Every time Ice Blue Knight King thought of this, his heart bled.\n\n“Captain! Something has happened inside the white whale,” a knight loudly shouted.\n\nIce Blue Knight King looked at the white whale through the video feed. He saw that the white whale looked a bit different. It was no longer a half-broken mess. Now its hull was sleek and smooth, like a living creature.\n\nRight now, the white whale was glowing with a strange white light. He could see there were some waves around the white whale.\n\nBefore Ice Blue Knight King could react, the white whale swung its tail. It was like a fish swimming in the sea very quickly. It disappeared in a blink, and only the shockwaves of its wake remained.\n\nThe stalking Ice Blue Knights stared after it in shock. By the time they could react, the white whale was gone.\n\n“Captain! What do we do? Should we give chase?” The commander looked at Ice Blue Knight King, who was still staring out into space.\n\n“Go after it!” Ice Blue Knight King said, gritting his teeth.\n\n“How do we pursue it?” The commander asked, looking uncertain.\n\n“Go forward!” Ice Blue Knight King commanded glumly.\n\nThe recovery of the white whale had finished, so it could now go at full speed. There were still some parts of it that required fixing, but Han Sen couldn’t wait any longer.\n\nHan Sen didn’t know when Meng Lie and the others might reach him. But the further away from the hounds they got, the safer they were bound to be.\n\nOnce they entered the deeper recesses of the systems of chaos, not even the Extreme King could control the situation. Even if Meng Lie was there, seeking Han Sen out wouldn’t be easy.\n\nIn the systems of chaos, large groups of xenogeneics often traveled together. And there was a wide variety of sorts. Fortunately, Han Sen’s group had the white whale. Normal space xenogeneics were unable to breach the hull of the white whale, and the ship’s speed made it easy for Han Sen to slip past them.\n\nWhen they encountered small xenogeneics, Han Sen would slow the white whale so he could kill the space xenogeneics and earn xenogeneic genes.\n\nThe pirates were able to kill many xenogeneics, too. They were all so happy about it. With the big white whale backing them up, they didn’t have to be afraid of being surrounded. They were all able to kill so merrily.\n\nHan Sen didn’t want to kill Marquises and Dukes anymore, though. If the Pirates killed those, they could keep them. All he wanted were King class xenogeneics.\n\nIf they met a large horde of space xenogeneics, Han Sen would have to retreat. There were Galactic Shrimps out there, in shoals of billions. Encountering groups of that size would be extremely dangerous.\n\n“Black Hole Spider!” The white whale moved into a system, and a giant spider attached to a planet suddenly came into view. It was like the whole system had been webbed by the giant creature.\n\nHan Sen slowed the white whale down to keep from disturbing the spider. That scary deified creature was something that not even a normal deified elite would be willing to disturb. Han Sen did not want to touch it, either. He wanted to steer clear.\n\nAs the white whale was about to leave the system occupied by the Black Hole Spider, Han Sen suddenly saw the claws of the arachnid move. The creature turned its head to look at the white whale. The black hole-like eyeballs turned to stare at them."
}