{
    "chapter": 2734,
    "title": "Leveling Up to Deified",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2734",
    "text": "Spell took on her female form and appeared in front of Han Sen. In a moment, she had rushed into Han Sen’s body and combined with him. And then, Han Sen’s body underwent some amazing changes.\n\nAfter he successfully combined with Spell, Han Sen’s body restructured dramatically. He wanted to use the changes of his body to redirect the routes of the four geno arts. He hoped that doing so would let him find a way for all four geno arts to co-exist at the same time.\n\nAfter Spell fused with his body, however, Han Sen suddenly noticed that the changes in his body’s structure went far deeper than he had imagined. All four geno arts were thrown off the routes they sought, and their powers were disrupted. In this mess, the four geno arts were leaking energy freely. They began searching for new routes to channel their power, and that sudden search created a small and temporary balance. Han Sen could barely keep up with what was happening in his own body, though. Lines of power were running everywhere.\n\nIn such a chaotic situation, Han Sen had no other choice. He needed to keep running the powers of the four geno arts. It was his only chance of progressing.\n\nTo Han Sen’s surprise, he discovered that after he combined with Spell, the compatibility of his powers seemed to have increased. The four powers were running together without conflicting.\n\nEspecially The Story of Genes. After Han Sen combined with Spell, The Story of Genes became very tame inside his body. It was like a placid lake that had always been inside him, and wherever the power flowed, chaos would slowly fade away. Any places in his body that didn’t have power were gradually filled up by it.\n\nThe Dongxuan Sutra’s power reacted in an even more unique way. It separated itself from Han Sen’s body, confining most of its energy to the Dongxuan Armor. Between the Dongxuan Armor and Han Sen, a special cycle was running.\n\nThe powers of his blood and bones became Han Sen’s primary strength. While the substance chains were generated, they kept pushing Han Sen’s body toward deified class.\n\nFinally, the four geno arts were able to generate substance chains again, all while Han Sen’s own body was trying to hit a deified level.\n\nHan Sen knew he was at a crucial point. If he failed again, he didn’t know if he could endure the searing pain another time. The four geno arts suddenly formed a substance chain. Four different powers combined, melting into Han Sen’s body.\n\nHan Sen couldn’t control himself. He arched his back and roared to the sky. The cells in his body quickly changed.\n\nAt that moment, four different geno arts created an amazing rhythm as their structures became one. Their power bloomed like a flame being struck from a match.\n\nTheir powers weren’t truly combined, but they were now like a machine composed of four parts. Although they remained individual powers, they were all working together.\n\nThe black armor was strong and beautiful. Boiling blood, ice, and jade-like flesh. Han Sen felt as if he had leveled up. That feeling was indescribable. A flaming, black substance chain rose from Han Sen’s body, making him look like a scary xenogeneic demon god. Even his presence looked like a xenogeneic’s.\n\n“God body evolution complete. Battle body leveled up to deified class…”\n\nWhen Han Sen heard the notification, informing him he had successfully leveled up, he checked out his information.\n\nHan Sen: Super god spirit body\n\nGene Battle Body: Xenogeneic (primitive)\n\nLevel: Deified\n\nPercentage: 0%\n\nLifespan: 2658\n\n“Did these four geno arts combine into one?” Han Sen saw that his gene battle body was listed as “xenogeneic,” and the four previous battle bodies were gone.\n\nHan Sen’s heart jumped. He tried to pull Spell out of his body, and when he did, he felt as if some balance within his body had broken. The geno powers cracked apart from each other, weakening Han Sen’s power.\n\nAlthough his power was weaker, he wasn’t pulled out of deified class. He still had a substance chain power.\n\nHan Sen looked at his information, and he noticed his gene battle body was broken into four familiar sections again.\n\nMutant Blood (primitive), Jadeskin (primitive), Dongxuan Sutra (primitive), Spell (primitive). The four of these battle bodies were the same. They had all reached primitive class. The reference to the “xenogeneic battle body” had vanished.\n\n“Weird.” Han Sen shook his head at the strangeness of the situation. But before he could figure out exactly what was going on, the small jade figure started to shiver and shake.\n\nLi Keer and Exquisite were on their way. Regretfully, Han Sen swam toward the surface of the Good Fortune Pool.\n\nHan Sen breached the surface, and after coming out of the water, he found Li Keer and Exquisite standing near the hall’s door. They were with Shale and Li Chun Qiu. All four people were staring at him.\n\n“You really became deified?” Exquisite and Li Keer looked at Han Sen in shock.\n\nWhen they received the news from Li Chun Qiu, they hurried over with haste. They had only just arrived there, and they saw Han Sen emerge from the Good Fortune Pool. They found powerful substance chains radiating from Han Sen’s body; he was deified.\n\nLi Chun Qiu looked upon him very strangely. He had been waiting for Han Sen to come out of the Good Fortune Pool for too long. That was why he called Exquisite and Li Keer. He wanted them to sense Han Sen’s mind and find out what was going on down there.\n\nBut who would have known that as soon as Li Keer and Exquisite arrived, Han Sen would come out of the pool? And he emerged as a deified. This was all too strange. Li Chun Qiu couldn’t even begin to guess how Han Sen had done this.\n\nA half-deified had remained inside the Good Fortune Pool for seven hours. He had triggered countless weird visions. And on top of that, he had become deified. That wasn’t what Li Chun Qiu expected.\n\n“Han Sen, you really became deified?” Shale asked Han Sen.\n\nHan Sen laughed and said to Li Chun Qiu, “Thank you for giving me a chance inside the Good Fortune Pool, sir. Had you not done this for me, who knows when I would have leveled up to deified.”\n\n“This is perfect. Now you and I can fight fairly.” Shale’s eyes were aflame with the idea of the fight.\n\n“Is it appropriate to do it here?” Han Sen was eager to flex his new deified powers, but this was the Good Fortune Pool. It wasn’t an ideal battleground.\n\n“Go to the valley,” Li Chun Qiu said coldly. Then, he teleported away.\n\nExquisite and Li Keer rounded on Han Sen. They looked at him with anger, saying, “You became deified without calling us?”\n\n“I did not expect to become deified inside the Good Fortune Pool. It was all just a happy little accident.” Han Sen spread his hands innocently. He had hoped to level up the Blood-Pulse Sutra and Jadeskin to half-deified. He had never expected that he would suddenly become deified.\n\nHis becoming deified was something of a surprise.\n\n“Let’s go! Let us see how strong you have become, now that you are deified.” Exquisite walked over to Han Sen and put a hand on his shoulder. They teleported into the valley."
}