{
    "chapter": 1125,
    "title": "Strange Valley",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1125",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Uncle Bug, where are you off to?” Han Sen asked, looking at Uncle Bug.\n\n“I am going to Redbug Lake to collect some more meat,” Uncle Bug answered.\n\n“You are strong, and you’re around the same age as my great-grandfather. Perhaps you met him at some point? It’s a shame he is dead now, though. His name is Han Jinzhi; have you heard about him?” Han Sen asked, coyly.\n\nUncle Bug gave a strange look at first, but then he smiled, saying, “That name eludes me, sorry!”\n\nHan Sen wished to say something more, but Uncle Bug quickly waved his hand and said, “I need to go to Redbug Lake now. We can talk later.”\n\nWatching Uncle Bug leave, Han Sen knew he had caught the man off-guard. Uncle Bug was a little nervous in his response. Han Sen wished to find out what had happened in the past, but no one ever wished to talk about it. Not even Sunset could tell him.\n\nIt was incredibly unlikely but fortunate for him to have met Uncle Bug, and Han Sen was fond of the area around the shelter. He knew he couldn’t push the old man too hard for information. Not yet, anyway.\n\n“How can I get Uncle Bug to reveal more?” Han Sen wrestled with a number of different methods he could try, but none seemed viable.\n\nSo, he decided to find out more about who Uncle Bug actually was. People only knew him by the queer nickname, so he fancied trying to dig a little deeper beyond the name Uncle Bug.\n\nHan Sen even asked someone to compose an image of the man. With this portrait in hand, Han Sen perused Skynet to learn more about Uncle Bug’s true identity. Unfortunately, he couldn’t find a trace of the man.\n\nUncle Bug gave Han Sen an uneasy feeling in his stomach, and his mere presence was different than what Han Sen received off others.\n\nHan Sen concluded his investigation with lame results: nothing new was learned. He hadn’t even found the man’s real name.\n\nHan Sen asked the elders in the shelter, who looked to be close with Uncle Bug, but learned nothing from them, either. They spoke a lot, but didn’t actually say much, so to speak.\n\nHan Sen now knew there was something off about the man, but he wasn’t sure how he’d get him to talk.\n\nUncle Bug continued to pretend he didn’t know anything, upon future inquiries. It was rather frustrating for Han Sen.\n\nHan Sen’s Dongxuan Sutra could not follow every train of thought or scan through the mind of a person as if it were an archive. Had he been able to do this, Han Sen wouldn’t have gone to such lengths to find out info elsewhere.\n\nBut he knew he had to be careful and not scare Uncle Bug off. If he was too pushy, things could turn ill. What’s more, if Han Sen ever left this shelter, he wouldn’t know where to find him back in the Alliance.\n\nHan Sen decided to drop the investigation for now and resume his previous plan of heading for the strange valley he had been told about. He went there with Bao’er.\n\nFinding a super creature in The Forest of a Thousand Insects was a very difficult affair, as the knotted realm was rather tame compared to other regions if one did not venture too far.\n\nHan Sen went to the deserted area and saw the three hills, which acted as a crude border-wall separating The Forest of a Thousand Insects and Thorn Forest.\n\nThe hills were not too tall, and they stood at a height of around five hundred meters. They were quite plain and barren.\n\nHan Sen flew into the sky to get an aerial view of the space. As he had been told, there was a Y-shaped valley devoid of any visible life. It was like a dead canyon, cloaked in white sand.\n\nHe wouldn’t believe it was entirely empty, however. Giving the place a scan, his suspicions were confirmed. He found something. In that valley were numerous holes. They were all the size of a fist, roughly, and looked like little tunnels that belonged to a nest.\n\nHan Sen’s dongxuan aura could not see through the thick walls, unfortunately, so he could not get a proper scan of what might lay inside. He did hear a noise, though.\n\nHe wasn’t entirely sure what the noise was, but he acknowledged it wasn’t too dissimilar to the crying of a baby.\n\nUncle Bug had told him about the noise, but Han Sen was still surprised to hear it just as he said. And he could hear it from quite a distance away, too.\n\n“Whatever creature is making that sound, it seems as if it resides beneath here. I’ll have to draw it out somehow.” Han Sen had an idea of how to do just that. So, he returned to the forest and caught two tank bugs.\n\nHan Sen cut each of them up and tossed them into the valley.\n\nThe two tank bugs had not been killed, they had just been badly injured. They squirmed around in agony, trying to escape the place, as blood squirted everywhere.\n\nWatching the bugs leave the valley, another thought cropped into Han Sen’s head, “Are those creatures not interested in the tank bugs?”\n\nAs Han Sen thought about this, the tank bugs were successfully making their escape. Or so it seemed.\n\nThe tank bugs were only ten meters away from the exit. But then, they just vanished. The trail of blood they had left in their wake stopped in the exact spot they disappeared from sight. Stranger still, it didn’t look as if something had pulled them down into the sand.\n\nThe two bugs just vanished before Han Sen’s eyes, with no warning or indication of where they had gone.\n\nHan Sen had already activated his dongxuan aura, so if something peculiar had happened, he should have noticed it.\n\nBut the two injured tank bugs suffered a fate that made no sense. Han Sen gritted his teeth and flew back into the forest again. He grabbed a few more bugs, wounded them, and tossed them into the valley.\n\nThis time, Han Sen focused on them intently. He wanted to watch where they went exactly.\n\nHe had tossed in ordinary and primitive class creatures, and they looked to be panicky and desperate. They urgently wished to escape the valley."
}