{
    "chapter": 2481,
    "title": "Daddy of Gods",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2481",
    "text": "“If he’s the master of all celestial beings, then I’m the daddy of all gods,” said a King class elite with a tremendous belly-laugh.\n\nMany other elites were saying similar things. They enjoyed mocking others, and with what was happening on the video stream, it was too easy. It was like two crazy people putting on a comedy skit.\n\nBut in the next second, their smiles froze. A red light appeared in Han Sen’s hand, and that light looked like the seed of fire itself. The red glow immediately lit up Lando’s body, and his entire form burst to life with wild red flames.\n\nAt the same time this happened, a scary presence appeared. It exploded out of Lando’s body like an erupting volcano.\n\nIn seconds, Lando’s injured body recovered. The Demon Hell Dragon Tattoo on his back, which had just now looked dim and lifeless, was now bursting with a purple light. A purple dragon’s shadow came to life on Lando’s back, and it looked even shinier than when Lando had used his powers earlier.\n\nAll of the stream’s viewers stared at their screens, motionless. No one was quite sure what had happened, but Dragon One’s eyes opened wide. He could barely believe what he was seeing.\n\nThere were two scars on Lando’s back. They were the wounds he incurred when his wings were ripped off. The legends said he was cursed when his teacher tore them off and that they would never grow back.\n\nBut at that moment, bones sprouted from his back and flesh crawled over them, creating new purple dragon wings. As the wings grew from Lando’s back, the Demon Hell Dragon Tattoo grew wings as well.\n\nPreviously, the Demon Hell Dragon Tattoo had only been half-finished. Now, however, Dragon One sensed that there were no longer any flaws to the tattoo’s composition. The presence that radiated from Lando was enough to make people tremble. Seeing a deified treasure of this power was very, very rare.\n\n“This… this is impossible! The Demon Hell Dragon Tattoo is finished…” Dragon One was shocked. He stared at Lando with wide eyes.\n\nBut he wasn’t really looking at Lando. He wasn’t looking at the Demon Hell Dragon Tattoo, either. He was looking at Han Sen, who had his hand on Lando’s forehead like some kind of ancient progenitor of gods.\n\nIn truth, everyone tuned into the broadcast was looking at Han Sen in utter shock. Even if they didn’t know enough to recognize the changes to the Demon Hell Dragon Tattoo, they could feel that Lando was changing into something grander. The geno universe was frozen as all the creatures watched the stream in shock.\n\nAt this moment, those two figures were at the center of the entire universe. One of them was releasing a scary presence, and the other one was like the father of all gods. He stood over Lando like some holy deity, giving his believer a blessing.\n\nHan Sen felt so happy about this. He wasn’t some sort of god, and he didn’t have a holy power to imbue Lando with.\n\nHe was just using the Blood-Pulse Sutra’s area.\n\nHan Sen hadn’t been sure what to do with it before. He didn’t know why the Blood-Pulse Sutra’s area couldn’t trigger the movement of any other universal cogwheels. When he touched one of the unicorns, however, he realized what the Blood-Pulse Sutra’s area was for.\n\nBlood-Pulse Sutra’s self-cogwheel couldn’t move any other universal cogwheel, no matter how small or light it might be. However, it COULD push self-cogwheels.\n\nYes. The self-cogwheels of people. The Blood-Pulse Sutra’s cogwheel connected with the self-cogwheels of others.\n\nHan Sen used his Blood-Pulse Sutra’s self-cogwheel to connect with Lando’s self-cogwheel. He pushed his self-cogwheel and used its power to affect Lando’s self-cogwheel.\n\nHe wasn’t simply pushing a self-cogwheel to release more power, though. His action activated Lando’s blood on a deeper level.\n\nThe Blood-Pulse Sutra’s cogwheel wouldn’t make creatures strong, but it could modify the flaws of a creature’s genes, and it could even activate hidden genes.\n\nHow deep the effect could go depended on the hidden genes of the creature in question.\n\nIron ore could be forged into steel, but it couldn’t be transformed into gold. In the same way, the Blood-Pulse Sutra’s power could correct a creature’s flaws and help it develop according to its nature.\n\nIron, silver, or gold, it all depended on the creature. Han Sen’s Blood-Pulse Sutra only provided refinement and aid.\n\nFrom an outside perspective, though, it looked like the Blood-Pulse Sutra was speeding up a creature’s evolution.\n\nIt was like if a land-dwelling creature was forced to live in the ocean. If their genes had a potential that would be useful for water, then after a billion years of evolution, they might grow lungs like a fish.\n\nThe Blood-Pulse Sutra, however, could speed up that entire process. A change that would normally require thousands of years and countless generations might now happen in seconds.\n\nOf course, everything was dependent on a person’s genes and hidden powers. The Blood-Pulse Sutra couldn’t turn stone into a clump of gold.\n\nBut the Blood-Pulse Sutra, when used on Lando, provided fairly amazing results. It worked a hundred times better than Han Sen had expected.\n\nHan Sen thought it might help push Lando’s self-cogwheel to the max, returning the man’s body to optimal condition.\n\nLando’s self-cogwheel was very heavy. It took all of Han Sen’s strength to push Lando’s self-cogwheel to spin a little faster.\n\nBut who would have guessed that the speed of Lando’s self-cogwheel would begin to increase on its own? Even the Demon Hell Dragon Tattoo changed, as well.\n\nThis surprised Han Sen because the Blood-Pulse Sutra’s first-tier power was limited. Han Sen had just started using the area, so pushing a King’s self-cogwheel was presumably the best he could do.\n\nThe Demon Hell Dragon Tattoo was deified. According to Han Sen’s general understanding of how the Blood-Pulse Sutra worked, he shouldn’t have been able to push it.\n\nBut when Lando’s self-cogwheel accelerated, the Demon Hell Dragon Tattoo magically changed, too. The flaws that had previously plagued the Demon Hell Dragon Tattoo had now vanished, and the tattoo had become perfect.\n\nThe scariest thing was that Lando’s genes had also been perfected. He was no on the verge of becoming deified, and the Demon Hell Dragon Tattoo was beginning to influence Lando’s body.\n\nHan Sen went rigid with shock as the Demon Hell Dragon Tattoo’s power surged through Lando. The Dragon pushed through the final wall that stopped him, and he suddenly generated a substance chain. He had become deified.\n\nCountless people and creatures across the geno universe looked at Han Sen, who was touching Lando’s forehead like some ancient deity.\n\nA moment later, Lando’s presence combined with the Demon Hell Dragon Tattoo. It rushed out into the sky as a scary substance chain came down on Lando.\n\nIn front of Han Sen, dark sinews of power waved and thrashed. The substance chains were breaking space, and Lando looked like some heavenly being of power. Everyone’s brain felt empty. They couldn’t believe this.\n\nThey were all thinking numbly, “How did Lando become deified? Is Han Sen really a father of gods?”"
}