{
    "chapter": 2401,
    "title": "Do You Believe That This World Has a God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2401",
    "text": "Han Sen had long been curious about Destiny’s Tower, and that was because this stone Destiny’s Tower was just like the metal Destiny’s Tower inside his Sea of Soul. Aside from the towers being made of different materials—one having been made of stone and other having been made of metal—there was no difference.\n\nFour deified elites used their powers to force open the gate to Destiny’s Tower. Only one person could go in while the gate was being held up. Once he received the signal, Han Sen immediately ran into the tower.\n\nDeng!\n\nHan Sen had just entered the tower when the door slammed shut behind him.\n\nBecause Han Sen knew the process, though, he wasn’t afraid.\n\nThe four deified elites had to use formation powers just to get the door open, and it could only be kept open for a single second. It simply wasn’t feasible to keep it open any longer than that.\n\nHan Sen was given one month to spend in Destiny’s Tower. When that month was up, the door would open again, and Han Sen would be allowed to leave.\n\nHan Sen looked around the tower. He had heard there was supposed to be an amazing geno art located inside the tower, and any creature that learned it would be able to increase the speed of their evolution. But everyone who left the tower seemed to practice different geno arts. That made Han Sen curious about whether the rumor was true.\n\nHan Sen was on the first floor of Destiny’s Tower. The layout was exactly like his own Destiny’s Tower, but there were some paintings hanging on the walls of this tower.\n\nThe pictures were supposedly the geno arts of legend, but when Han Sen looked closer, he realized that the pictures were not geno arts at all. They were drawings of people.\n\nThe pictures were of a man. Han Sen couldn’t tell if he was human, crystallizer, Extreme King, or one of the Sky. They all looked so similar that it was hard to tell the precise race of the man in the painting.\n\nBut this man wasn’t drawn like an average person. He was drawn like a god atop an altar. Every wall held a picture depicting the same man in a different position, but no matter how he was posed, he seemed to be looking out of the picture with disdain. It was somehow uncomfortable to meet the painted man’s gaze.\n\nAlthough Han Sen knew it was just a drawing, not a living man, the painted man gave him a chilled feeling. It was like the eyes of the man could see right through his soul or something.\n\nHan Sen frowned. He longer he looked at the painting, the more he wanted to avoid it. That wasn’t normal.\n\n“Is there something wrong with this drawing? Or is it like a jade spirit in the White Jade Jing? Is it actually alive?” Han Sen looked at the man in the painting, but try as he might, he couldn’t discern its true nature.\n\nHe looked across the whole first floor, but he found nothing except for pictures of that one man. Han Sen silently moved on to the second floor.\n\nUpon reaching the second floor, Han Sen frowned. This floor had paintings of the man on every wall as well. He was just posed in different positions than he had been on the first floor.\n\n“This entire tower isn’t just full of this one man’s paintings, is it?” Han Sen’s heart jumped, and so he proceeded to the third floor.\n\nOf course, Han Sen was unlucky. His guess had been correct. The third floor held the same paintings.\n\nEach floor in the tower had eight walls. Each wall had a painting of its own. Han Sen walked all the way from the first floor to the sixth floor, and he saw forty-eight of the man’s paintings in total.\n\nIt was the same person in every painting. He was just in a different position in each one. He would be sitting in one, while in another, he could be standing or lying down. All the pictures had the man in a different position. But no matter what his position was, the man’s eyes were always the same. Han Sen hated those eyes.\n\nThe man wasn’t ugly. In fact, Han Sen thought he was quite handsome. The man had a smile that should have been loveable, but instead, Han Sen loathed it. He couldn’t put his finger on why.\n\nHan Sen was a little surprised by that realization, because he didn’t like judging people by their appearance. It didn’t matter if a person looked nice or horrible; he would not form a real opinion on them until he learned more about who they really were.\n\nBut now, looking at these paintings, Han Sen already hated this man. That was not normal at all.\n\nTrying to suppress his hatred, Han Sen climbed to the highest floor. This was the seventh floor.\n\nIf the stone Destiny’s Tower was related to his metal Destiny’s Tower, the seventh floor should have a space Bai Sema. That was where Han Sen imprisoned people in his own tower.\n\nAs soon as Han Sen stepped onto the seventh floor of Destiny’s Tower, he stopped dead in his tracks.\n\nThere were no more of those paintings on the seventh floor. There was just a stone platform in the middle of the room. Someone was sitting atop the stone platform, and Han Sen realized instantly that it was the same man showcased in the forty-eight paintings across the lower floors.\n\nHe sat atop the stone platform, his legs crossed like a buddha. His hands were down, and his eyes were shut. It was like he was sleeping.\n\nHan Sen couldn’t detect a lifeforce coming from the man, though. The man was like a statue. With Han Sen’s eyesight, though, he could tell the man actually was alive. He could see the man’s pores and the pink of his skin.\n\nHan Sen could see most of his vessels, too. Aside from the fact that he wasn’t breathing, he really did look like someone who was alive.\n\nHan Sen used the Dongxuan Aura to inspect the man. It was odd that the man looked so alive while giving off utterly no indication of lifeforce. Even after scanning the man, Han Sen couldn’t tell if he was living or dead. That was extremely weird.\n\nWhile Han Sen was examining the man, some sort of odd wave began to pass through the air around the man’s body. The air moved in a circle, like a nearly invisible whirlpool.\n\nHan Sen took a step back. He soon realized that the swirl was just a lifeforce, not anything harmful.\n\nWhat astonished Han Sen the most, though, was that the black crystal armor in his Sea of Soul reacted to the whirlpool. The armor began to tremble. A mysterious power flowed out of the armor and sank into Han Sen’s body.\n\nHan Sen felt himself become really heavy. It was like the cells inside his body had been frozen in place by that mysterious power. The Dongxuan Sutra and Han Sen’s other primary geno arts had been locked down by the strange power as well.\n\nOnly the Original Water King Body and a few other powers Han Sen had absorbed were still active inside his body.\n\n“What is this?” Han Sen asked in sudden trepidation. Then the man slowly opened his eyes. It looked like he was smiling at Han Sen, but he wasn’t.\n\nHan Sen’s heart flared with that feeling of hatred again, but this time, it was one thousand times stronger than it had been when he saw those pictures. Han Sen managed to suppress the feelings and keep them from showing on his face.\n\nHan Sen finally figured out where the feelings were coming from, though. The passionate hatred inside him was flowing out of the black crystal armor. It wasn’t his own emotion.\n\nThe man stared at Han Sen the same way he’d gazed out of the paintings. He smiled and coldly asked, “Do you believe that this world has a God?”"
}