{
    "chapter": 2787,
    "title": "God Spirit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2787",
    "text": "The things around him were not so lucky. Everything else had been destroyed by that explosion. There was not even dust left.\n\nOnly that jade-like bone remained. It was unharmed by that manic explosion. It was the bone Han Sen assumed to be Sky Vine Radish’s weakness and the god spirit gene that was announced in his head.\n\n“If I knew Sky Vine Radish’s self-destruction would have evaporated all of his blood, I would have drunk my fill,” Han Sen said with a greedy tone of voice. “It was not easy to kill a god spirit, and now I am only walking away with a bone.”\n\nOh, no! Did Brother King die in the explosion? Han Sen thought of Xie Qing King, and nothing pleasant came to mind.\n\nBefore Han Sen went looking for him, he saw Xie Qing King emerge from a cave with a face covered in dust. He flew toward Han Sen and said, “That thing was so strong. It almost killed me.”\n\nHan Sen felt some relief. “Fortunately, you were quick to escape the radius of the detonation. Otherwise, not even a deified elite would have been able to withstand that self-destructive explosive.”\n\nSeeing that Xie Qing King was fine, Han Sen now had the time to check out his Sea of Soul. There was a giant spirit body that looked like jade. It was similar to Sky Vine Radish’s god body, but Sky Vine Radish had a solid body. This was just a spirit body.\n\n“When ordinary xenogeneics die, they leave behind beast souls,” Han Sen said while he examined the spirit body’s information. “Sky Vine Radish left behind a god spirit. I wonder what the difference is.”\n\n[Sky Radish God: destroyed class god spirit]\n\nWhat does it mean for it to be a destroyed class? Han Sen’s head was filled with questions. The levels of a god spirit seemed to be different from beast souls. There was no defined type, but there was a class. This was a destroyed class.\n\nHan Sen tried to summon his Sky Radish God and see what it could do.\n\nSky Radish God’s giant god spirit body suddenly appeared in front of Han Sen. Its presence was like that of a flooding beast. It was immeasurably scary. It was like it could blow up the world with one punch.\n\nIs this thing like a pet beast soul? Han Sen’s heart jumped. He commanded Sky Radish God to punch a wall in front of him.\n\nSky Radish God adhered to Han Sen’s thoughts and did what he was told. The green god spirit light on his body shone as he threw a punch into the wall. With its power, it was going to blow up the entire Space Garden.\n\nHan Sen was worried about Spaced Garden being destroyed, but he was immediately frozen. Sky Radish God’s power went through the wall, but it did not do anything to it. Even Sky Radish God’s body went through the wall as if it was a phantom.\n\nAre these god spirits like gods? Can they not touch the substances of the universe? Han Sen tried to repeat the action a few times. No matter how strong Sky Radish God was or how much power it unleashed, it could not harm the smallest leaf. Han Sen was left fairly disappointed.\n\nI thought this was some good stuff, but it can’t touch anything. This is rubbish. Han Sen suddenly thought, but that can’t be right. If the god spirit was just like the other gods and could not touch or harm the substances of the universe, it proves they were the same kind. Does that mean the god spirit can hurt the gods?\n\nHan Sen was thinking that might be possible, but there weren’t any gods willing to stand up to him. He wanted to try his hand at guessing.\n\nBut why was Sky Vine Radish’s actual body able to be harmed by ordinary creatures like me? Was it really because he was injured? Or, is there another reason? Han Sen continued to guess. He thought this entire thing was not that simple.\n\nXie Qing King flew over to Han Sen and looked at him with confusion. “What are you doing? You keep moving your legs and hands. Did the explosion break your brain?”\n\n“Don’t you see it?” Han Sen was confused too.\n\nXie Qing King looked at Han Sen and asked, “See what? Do you mean the green vine that looks like a spear? The one you are holding?”\n\n“Don’t you see him?” Han Sen pointed to where Sky Radish God was.\n\n“What? Who? Is there someone here?” Xie Qing King reached his hand out to touch whatever it was, but there was no solid surface. His hand went right through the Sky Radish God’s god spirit body.\n\n“There is a weird beast soul that you cannot see or touch. It came from the guy who called himself a god.” Han Sen explained the Sky Radish God’s situation to him.\n\nWhen he heard that, Xie Qing King was momentarily silent before saying, “So, do the god spirits look similar to the gods? Maybe it is just as you thought. Perhaps you can use them to go against the gods.”\n\n“I sure hope so.” Han Sen nodded. He had been feeling terrible about his inability to fight the gods and how he always had to be passive before them. If the god spirit was able to fight the gods, it would be a beast soul he would cherish more than any other.\n\n“Let’s not talk about that.” Xie Qing King looked around and said, “We made too much noise down here. I am afraid it is only a matter of time before people come. Let’s just leave.”\n\nHan Sen nodded. He put the god spirit gene bone inside his Destiny’s Tower and committed to an escape alongside Xie Qing King.\n\nAfter they left, they saw the geno hall had been revealed. Han Sen heard a voice coming from the geno hall. He quickly realized that the god personality the geno hall was referring to could have been the god spirit gene bone.\n\nHan Sen was not going to take the god spirit gene to the geno hall. He wanted to know more about the bone first.\n\nHe thought the Space Garden would have been destroyed because of Sky Vine Radish self-destructing. When he looked closer, Han Sen noticed the Space Garden had not been destroyed. It had actually become bigger. He did not know how much bigger it was, but the plant xenogeneics in the flower fields had mutated. They had become quite big and weird.\n\nNot far ahead, Han Sen saw a big tree that looked like a strange snake. It was releasing a scary presence. He was able to tell that it was a deified class.\n\n“It seems that after Sky Vine Radish’s power exploded and spread, it benefitted the xenogeneic plants all around here. It has made them swiftly evolve. Now, the Space Garden is worth more than the old Space Garden. It will be perfect for us to build a base here. It is a shame Violet was blown to bits. That means we have missed out on the key to access the Space Garden.” Xie Qing King looked sad as he spoke.\n\n“There must be a way.” In Han Sen’s mind, he started to think, The Space Garden itself is a giant ganoderma lucidum xenogeneic. If it is alive, that means we can talk, and I can convince it. But I am afraid this ganoderma lucidum’s intelligence might be low. If it doesn’t understand words, it might be difficult to convince.\n\nWhile Han Sen was thinking, he heard the sounds of people coming from the left. They were headed for the battlefield."
}