{
    "chapter": 1255,
    "title": "Three Statues",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1255",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBlood River King stood at the tallest rampart of the castle, overlooking the river.\n\nThe Blood River ran fast, and the banks sometimes burst, but flooding had never been this bad before. Much of the shelter had been submerged.\n\n“My King, does the river always behave this way?” Yaksha asked, as he approached and also looked out over the river.\n\nThere had been no rain, so it was a most peculiar phenomenon, witnessing the river flow at an increased pace and volume to such a degree.\n\nBlood River King shook his head and confirmed, “I have been here for fifty thousand years. Never once have I seen the river behave this way. But…”\n\n“But what?” Yaksha asked.\n\nBlood River King explained, “Before I first arrived here, a berserk super creature roamed beneath the waters of the Blood River. He was the leader of this place, and it was said that whenever he desired to eat, the river would flood and allow it to swim above land to eat its fill. When its hunger was satiated, the waters of the river would quell.”\n\n“And where is this beast now?” Yaksha asked.\n\n“It went to the Fourth God’s Sanctuary. That… was a long time ago. Truth be told, I wouldn’t be here, had it not been for its ascension. I was fortunate enough to enter these lands after it had moved on,” Blood River King admitted.\n\n“Weird. If it rises randomly like this, something ill must be afoot. Do you know if the creature had any kids?” Yaksha wondered.\n\n“Not to my knowledge, but it is not out of the question. Perhaps we can search for it,” Blood River King summoned the tentacle monster, bidding it to go out and look for another possible creature in the waters.\n\nAfter some time had elapsed, there had been no reports of such a creature existing. Nothing had been found, and the mystery of the rising river saw no elucidation.\n\nThe river now submerged Han Sen’s cave entirely, but strangely, no water entered the stone pocket.\n\nHan Sen looked all around him before recentering his vision on the jue. After drinking the wine, Han Sen’s body was dotted with peculiar symbols that were on fire.\n\nThe fires eventually departed his body, floating through the air towards the jue. Then, Han Sen’s body returned to normal.\n\nThe jue for the wine was now like a lit oil lantern.\n\nBut the flames within did not illuminate the cavern, and a greater darkness intruded. Beyond three feet in front of him, he could not see a thing.\n\nHan Sen held Bao’er and checked himself for any further changes. Aside from his own lifeforce appearing a little weaker, there did not seem to be any alarming changes.\n\nThe jue suddenly moved in another direction.\n\nHan Sen swiftly followed after it. Away from the jue, there was only darkness, so he kept close to it. And out in the darkness, Han Sen could not escape the nagging feeling that someone was watching him.\n\nHan Sen did not fancy remaining in that darkness, so he made sure to keep close and follow the floating jue.\n\nBao’er’s hands clutched Han Sen’s neck tightly, for she was deeply afraid of the dark.\n\nThe jue continued its airborne flight, and although he felt compelled to follow, Han Sen found it a touch suspicious. He remained alert and ready for anything hostile that came his way.\n\nHan Sen recalled the directions he was going should have led him to a dead end by now, for there was nothing special in that cave. But weirdly, they were able to keep on walking.\n\nAnd after miles of walking, they went on and on. There weren’t any walls around them either, or so it felt.\n\nThe sense that someone was watching him heightened, but he could still tell that it was just him being paranoid. There was nothing actually there.\n\nEventually, after much walking, an exit could be seen far ahead in the dark distance. It was like a sole beacon, a sole puncture of light.\n\nAs Han Sen got closer, he was indeed able to confirm that it was an exit.\n\nThe exit was dead ahead, but Han Sen could not make out what lay beyond the blinding light. The moment he stepped out, though, all became clear.\n\nBao’er looked around in amazement.\n\nThey were underwater, and as Han Sen reached his arms out to touch the water, his hands felt soothing coolness.\n\nThe water had formed a dome, leaving the area inside completely dry,\n\nIt was like an invisible wall was separating them from the water. In that place, there was a circular altar made of stone.\n\nThere were three different statues on the altar, too. They represented the same thing, but all had differences to differentiate them from each other.\n\nThe left statue looked like a mermaid. The statue on the right was a reverse mermaid. The middle statue was the creepiest, depicting a human covered in patches of scales.\n\nThe jue went to the left statue and lit it up.\n\nWithin that flame, the statue opened its eyes with a frighteningly powerful aura.\n\nHan Sen frowned. The mermaid statue was alive. It slid down the altar with its scaled lower body.\n\nThe red-haired mermaid formed her lips into an “O,” forming a number of bubbles that drifted over to Han Sen.\n\nHan Sen summoned Disloyal Knight and Little Angel, and then, Disloyal Knight covered everything in the vicinity with blue lightning.\n\nBoom!\n\nDisloyal Knight leapt forward and punched the red bubble that was nearest to Han Sen."
}