{
    "chapter": 2677,
    "title": "Eight Hole Emperor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2677",
    "text": "Shale glanced toward Mo Fang, and Mo Fang lifted his lips while looking back at Shale. Neither said a word, but they each knew what the other was thinking.\n\n“Butterfly, are you with us, or are you with Shale?” Mo Fang asked, looking at the Fox woman.\n\n“I’m just a weak woman. I can’t help anyone,” Butterfly said while falling back. She didn’t want to help either side.\n\nMo Fang knew the woman was more than she seemed. She had deliberately leaked the news that Shale was no longer deified. She obviously wanted to sit back and receive whatever benefits stumbled into her lap.\n\nBut Mo Fang didn’t mind. No matter how tricky she might have been, she simply wasn’t strong enough to affect his chances of securing first place, he believed. For right now, only Shale was standing in his way.\n\n“Shale, are you really going to protect Han Sen?” Shale nodded at the others who had come with him. The three of them spread out, surrounding Shale.\n\n“Whether I agreed to protect him or not, I would have been forced to face you eventually,” Shale said while standing up. His body was three meters tall. He radiated power, and he was intimidating even when he wasn’t trying to be. He looked like a golden-maned lion.\n\nMo Fang smiled and said, “If you quit now, we don’t have to waste time fighting.”\n\n“Just fight.” Shale looked so calm. He had all the peaceful solidity of a mountain.\n\n“Then you will have to be careful,” Mo Fang said. He pointed a finger, and the Evilbreaker powers of the Dragon spread over his fist.\n\nThe Dragon were widely-considered the bravest race, and Evilbreaker powers were powers that could concentrate might. They could make the smallest attacks into the strongest attacks. It was similar to Han Sen’s Heart Connection.\n\nBut Heart Connection released all of someone’s power at once. Evilbreaker powers only concentrated the power you wanted to use at the moment.\n\nHan Sen once spent time investigating the Evilbreaker powers of the Dragon, and he came to the conclusion that it was a very scary geno art.\n\nRight now, Mo Fang was using the ability to summon strength. The power he gathered was stronger than that of a Dragon deified. It was like his finger could form a black hole in space.\n\nShale didn’t dodge or run. His giant body stepped forward as he swung his fist. He moved so quickly that his blonde hair waved in the wind, his body surging forward like that of an enraged lion.\n\nBoom!\n\nThe finger and the fist collided with each other, and the ensuing explosion tore apart the nearby terrain. Shale didn’t move at all, whereas Mo Fang fell back ten meters.\n\nMo Fang smiled. Then, he laughed and said, “You truly are a born-deified. Even if you are weaker now, your fitness is still incredibly rare.”\n\n“That was just physical power. It was nothing compared to the secret geno arts of the Very High,” Shale said humbly.\n\n“In regards to personal power, I’m not your equal. But I want to reach first place. Therefore, I must apologize,” Mo Fang said. The Extreme King fighters and the Aichi then made their move.\n\nNow, Shale was in the same type of trouble that Han Sen had previously been in. But Shale’s situation was even direr.\n\nThe primary difference was the swapping of Mo Fang for the mantis-man. There was a big difference between the capabilities of those two. Mo Fang’s strength was far greater than the mantis-man’s had been.\n\nIt might have been an illusion, but with Mo Fang’s participation, the cooperation of the others seemed to be far better than it had been the last time. It appeared unbreakable.\n\n“Mo Fang is skilled with heart techniques. With his ability to command, he can control the other silkworms as if he was twiddling his fingers. He can allow four people to conduct group combat at their max potential. Shale doesn’t have the power to suppress them, so it is clear that he is in danger,” Exquisite said while looking at Shale down on the battlefield.\n\nWhile Exquisite spoke, Shale endured a few hits.\n\nShale was born to a small race that didn’t have any good geno arts. Aside from his talent and level, his heritage was worse than Han Sen’s. The few good geno arts he had were the ones he had learned during his stay in Outer Sky.\n\nIt was impossible for Shale to defeat the four people surrounding him with his skillset.\n\nShale might not have been less skilled than Han Sen, but he lacked Han Sen’s range and diversity.\n\nHe had been trapped by the areas unleashed by the Aichi warrior and the two Extreme King fighters, and his power couldn’t reach Mo Fang. He was like a beast trapped inside a cage. No matter how much he struggled, he couldn’t get out of the cage. And the people outside the cage were hurting him.\n\nMo Fang moved his fingers as if they were ten separate blades. Scary godlights were shining everywhere, and countless marks were being drawn across Shale’s body.\n\nMo Fang had a title. He was known as the Eight Hole Emperor.\n\nSomeone who was known to be particularly empathic or sensitive was often called an “Eight Face Exquisite” or a “Seven Hole Exquisite Heart.” Mo Fang’s title was created as a combination of those two terms because he could use his empathy to affect others. He became known as the Eight Hole Emperor.\n\nHe could do far more than just control three half-deifieds; he could easily exert influence over armies comprised of tens of thousands of troops. Such a feat would be easy for Mo Fang.\n\n“What a powerful body. You seem stronger than the average Very High. Ten armor talents are very rare. No wonder you are so famous.” Mo Fang had used his initial attack against Shale several times, but he could only shred the man’s skin to leave behind minor wounds. He felt compelled to compliment his foe.\n\nLiyu Zhen and Li Xue Cheng’s hearts almost hopped out of their chests. Right now, they weren’t even worried about Han Sen beating Shale; it looked like Shale might not even last long enough to fight him.\n\n“D*mn it!” Li Xue Cheng’s face darkened in rage. He thought about what might happen if Shale lost the silkworm bout. He felt dizzy, and his body kept shivering. The Very High that were banking on Han Sen winning were very happy, by comparison.\n\n“That kid Mo Fang isn’t bad. Although his power is weak, I can’t think of a single Very High of the young generation that is a better commander.”\n\n“Good job. Get rid of Shale quickly.”\n\n“Haha! Mo Fang will kill him. And then, he will kill Han Sen. I like this story.”\n\n…\n\nShale was incurring more and more wounds. If a half-deified was any weaker than Shale, they would have already lost this fight. But looking into his eyes, it was obvious that Shale wasn’t scared. He wasn’t going to retreat.\n\nHis eyes looked like the eyes of a lion. He was excited, as excited as a bloodthirsty beast. It was like some sort of stimulant was pumping through his veins instead of blood.\n\nMo Fang frowned. He realized how difficult it was to harm Shale. He could use an attack against Shale once, and after that, the same attack would no longer damage him. Mo Fang had to keep changing his fighting stance as he used one technique after another.\n\nTo an outsider, it might look like Shale was being suppressed. Someone would have needed to look very close to realize how much Mo Fang was struggling.\n\nEven though the Very High had thousands of geno arts, with most coming from other races, Mo Fang hadn’t practiced them all. If this continued for too long, he would have to start repeating his skills.\n\n“Is that it?” Disappointment welled up within Shale’s eyes."
}