{
    "chapter": 2429,
    "title": "Requiem Tree Egg",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2429",
    "text": "“Trees make babies? Is this requiem tree a xenogeneic?” Han Sen asked in confusion.\n\nMiss Mirror shook her head. “I don’t know if the requiem tree is a xenogeneic, but it doesn’t produce babies. The tree egg is essentially a collection of the tree’s resin. The more energy a requiem tree takes in, the more resin it can produce. That resin gathers inside the tree hole to become an orb. It looks something like an ant egg. They are called tree eggs.”\n\n“I was told a story of a man who managed to get a requiem tree egg that was around the size of a fingernail. He was only a low-tier King, but he used the requiem tree egg’s power to advance all the way to deified. Ever since then, requiem tree eggs have become the most sought after treasure in the entire universe. But the ability of requiem tree eggs to help a King class being rise to deified is only of secondary importance. People are more interested in them because they can be used to help deified individuals ascend.” Miss Mirror paused and went on to say, “But considering the battle that happened here, I’m afraid the requiem tree egg inside the tree hole has already been taken away.”\n\n“Maybe it’s still here. Let me see,” Night Wind said. Then he launched himself into the air and flew up to the tree hole. He hovered right in front of it, putting his eyes right near the tree hole to peer inside.\n\n“This tree hole is strange. I’m looking right into it, but I cannot see anything inside,” Night Wind said to Miss Mirror.\n\n“Requiem trees are resting trees for the Ancient God. They have unusual powers, so not even deified elites can see what is inside the tree hole. Luckily, requiem tree holes aren’t dangerous. Just put your hand inside,” Miss Mirror said.\n\nNight Wind hesitated, but he did as he was instructed. Just in case, he shrouded his hand in night power that would defend against anything evil that might have taken up residence inside the tree hole. Then he placed his hand into the hole.\n\nShe said the tree hole wasn’t dangerous, but who knew if some toxic bug had decided to make its home there or something. This entire city felt cursed, and so by Night Wind’s reasoning, bizarre toxic bugs weren’t out of the question.\n\nSeeing Night Wind place his hand in the hole, Han Sen felt nervous on his behalf. If there was something weird inside the tree hole, and it pulled Night Wind inside, that would actually be kind of scary.\n\nBut after Night Wind plunged his hand into the hole, a grin crossed his face. He shouted, “There is something in here! It is circular, and it feels like a stone. I don’t know if it is a requiem tree egg, however.”\n\n“Touch it with your hand. If it is a requiem tree egg, your hand will smell like resin,” Miss Mirror said.\n\nNight Wind touched the item and then pulled his hand out of the hole to sniff it.\n\nHe didn’t actually need to bring it up to his nose. Even at the bottom of the tree, Han Sen and Miss Mirror could smell that pleasant, grassy fragrance. Just the smell alone was enough to make Han Sen feel like his body was waking up after a long winter. He felt so relaxed, it was like his cells were coming alive.\n\n“Not bad! That is the smell of a requiem tree egg. I can barely believe that the requiem tree egg is still there. Pull it out!” Miss Mirror said.\n\nNight Wind immediately reached into the hole again to pull the tree egg out. But when he tried to draw his arms back out, they stopped abruptly. He couldn’t seem to get the egg out.\n\n“The egg is too big! I can’t get it to fit through the hole,” Night Wind said. He pulled out his sword of darkness to slash the tree hole in an attempt to widen it.\n\nBut when the sword of darkness hit the bark of the tree, it only left a small white scratch mark behind. There wasn’t the faintest semblance of a firm dent.\n\n“Trying to cut it is useless! The requiem tree is the resting place of many members of the Ancient God. Even a tiny requiem tree is impervious to most powers and gear, and this tree is enormous,” Miss Mirror said.\n\n“Can he not crack the egg into pieces and bring them out like that?” Han Sen said.\n\n“The egg will be harder than the requiem tree itself. How is he supposed to break it?” Miss Mirror rolled her eyes at Han Sen. Then she turned to Night Wind again. “How big is the tree egg?”\n\n“Very big…” Night Wind said, his voice strangely distracted.\n\n“How big is very big? Big like a brain?” Han Sen asked with a laugh.\n\nA fingernail-sized requiem tree egg turned a King into a deified. If there was a brain-sized requiem tree egg, it would probably start a war that would consume the entire universe.\n\n“If your brain is one meter across, then yes, it is sized like your brain,” Night Wind said quietly. Han Sen noticed that the man’s eyes were very wide.\n\n“What? That large?” Han Sen asked hoarsely. His eyes almost popped out of his skull. He could scarcely believe how big that was.\n\n“Are you sure that is a requiem tree egg and not something else?” Miss Mirror asked with shock. Not even she could believe it.\n\nNo one had ever heard of such a giant requiem tree egg before. Even small eggs were considered priceless relics among deified elites, but this…\n\nThe thought of a one-meter long requiem tree egg was enough to make people’s blood boil and their hearts leap in their chests. The power of something like that was beyond imagining.\n\n“I don’t know. You should confirm it yourself, Miss Mirror.” Night Wind came down from the tree hole. He still looked somewhat shell-shocked as he spoke to Miss Mirror.\n\nIt was weird to see such an expression on Night Wind’s face. But when seeing a requiem egg such as that, even a deified was bound to have difficulty managing their excitement.\n\nA requiem tree egg could strengthen deifieds. A requiem tree egg the size of a plum could increase a deified’s level by quite a bit. If a deified refined a tree egg of this magnitude, they could easily become a god spirit.\n\nMiss Mirror flew up to the tree hole. She put her hand in and began feeling around the tree hole. Seconds later, her jaw hung slack in wonder.\n\n“It really is a requiem tree egg. I cannot believe that such a large egg exists.” Miss Mirror finally said after ten minutes of fiddling. Her expression said that she wasn’t entirely sure how she should feel.\n\n“It really is a requiem tree egg,” Han Sen and Night Wind said together.\n\n“Yes, and it is also circular. It is somewhere between a meter and two meters across.” Miss Mirror couldn’t help but sigh. “It is a shame that the tree hole is only the size of a fist. If it was a small requiem tree egg, we could take it out. Now we know that there is a tree egg inside and that it is something that would change the universe as we know it. However, we don’t have a way to remove it.”\n\n“Wait! Maybe there’s a way to get it out.” Night Wind suddenly sounded exhilarated.\n\n“What? You have a way to expand the tree hole?” Han Sen looked at Night Wind. Miss Mirror looked at him as well, a single eyebrow raised.\n\nInstead of answering, Night Wind used his finger to point at the tree excitedly, and spoke, “Look over there.”\n\nHan Sen and Miss Mirror followed his finger. A deep scar ran across one side of the tree. It was a three-foot-long gash, and it was three fingers deep, at least.\n\n“That is a sword mark.” Han Sen’s eyes brightened.\n\nThe sword mark was old, and even though the tree had healed, there was a scar. But based on the angle of the scar, it looked as if it had been delivered by the big sword they had found earlier."
}