{
    "chapter": 990,
    "title": "Obtaining the Dragon Orb",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_990",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Bao’er, get back here!” She didn’t heed Han Sen’s call, but she did turn around and wave at him. This prompted him to follow, despite the sirens in his head. When he caught up with her, she had crawled even further forward.\n\n“Don’t go in there!” Moment Queen shouted. If Han Sen died, she did, too. There was nothing for her to gain in her master’s untimely death.\n\nHan Sen returned Moment Queen to the Sea of Soul and continued chasing after Bao’er.\n\nHe would have put his foot down and stopped her if Bao’er was an ordinary baby. But her appearance obviously hid her true maturity and knowledge. She wouldn’t have crawled into the castle like she was, if there was nothing of value to be found there.\n\nWhen they got inside, there were a variety of different passages. The variety of passages didn’t slow Bao’er down, though. As if she knew the way to go, she kept on crawling without a single pause to collect her bearings.\n\nShe crawled incredibly quickly, and whenever Han Sen fell behind, she’d stop and turn around. Then, she’d call out, “Daddy, come!”\n\nHan Sen continued to follow her, and was surprised by the distinct lack of action. They walked through the labyrinthine complex of the vine-castle without anything attempting to get in their way.\n\nThe castle was massive, and Han Sen had been walking for at least ten miles within its walls. He projected there’d be many more directions to travel since paths branched off in every-which-way, as awkwardly and obtusely as the very vines that twirled around each other to form the castle’s structure.\n\nSuddenly, Bao’er stopped. She pointed forward, and at which point, Han Sen decided to pick her up. In front of them, the corpse of a dead creature barred their way.\n\nIt was a golden tiger of sorts, and its body was wedged into the passage, with its backside facing them. There were no visible wounds, but blood coated the area around it.\n\n“Hm, did the roar come from this thing?” Han Sen summoned his Disloyal Knight.\n\nWhen Disloyal Knight saw the body, it emotionlessly approached the corpse and began chomping on the flesh and slurping its blood.\n\nIf Disloyal Knight was so interested in eating the creature, then there was a high chance the fallen monster was a super creature.\n\nDisloyal Knight ate as quickly as Little Angel had, and it wasn’t long before Han Sen could see the front of the tiger.\n\nThe tiger did not have a head, and he was unsure why it was missing or who had severed it.\n\nAfter a brief look around, he couldn’t find the head and neither could he find a Life Geno Essence to consume.\n\nDisloyal Knight was almost done with the creature. With most of the flesh gone, it began gnawing at the bones, before snapping them and sucking the marrow inside with a revolting, feverish excitement. Han Sen had no clue how it could eat so much.\n\nWhen it was done, Han Sen put Disloyal Knight away. Then, Bao’er crawled forward and said, “Let’s go, Daddy.”\n\nHan Sen was unsure whether or not he should keep going, as the way that monster had been killed concerned him a great deal.\n\nBut with Bao’er hurrying him, not dismayed by what they had just seen, he was okay with following her forward.\n\nWhenever the way branched—which was often—Bao’er led him without pause. There was no fear of getting lost, with her leading the way.\n\nShortly after, they came to a big room. In its center, there was an alter that had also been formed by the vines of the castle. Upon it lay a man.\n\nDragon-like horns protruded from the man’s head, and his body was clad in black-plated armor. He had long, blue hair. As surreal as the scene was, it was so quiet, you would assume the man was just peacefully in slumber.\n\nUpon closer inspection, Han Sen noticed a glowing orb atop the man’s magnificently still forehead. It was beautiful.\n\nLooking inside it, the image of a dragon appeared. It seemed to swim around inside the orb, as if the glowing lights were the sea it resided in.\n\n“So, this is the spirit orb?” Han Sen was overjoyed at the discovery, but he wasn’t willing to be so reckless as to attempt to steal it without learning more about the situation he had found himself in.\n\nThe man did not look dead, and his sleep may have been true. If Han Sen snatched the orb, and the man woke up, he’d be the one who was dead.\n\nDeciding it was time to bring Moment Queen back, he did just that.\n\nShe looked angry and ready to complain at first, but when her eyes glanced across the man, she screamed and said, “Spirit orb! It’s Dragon King’s spirit orb!”\n\n“Can we take it?” Han Sen asked.\n\nMoment Queen inspected it carefully, but came to a disappointing conclusion. “No. The emperor has not been revived, but the body is active. It looks as if it’s missing a key ingredient that is necessary to complete the resurrection ritual.”\n\nMoment Queen paused, and then went on to say, “Dragon King’s body is connected to the orb. The lifeforce inside the orb, if stolen, might compel the body to attack and kill us. And that would be no hassle for an emperor, believe me.”\n\n“So, does that mean we should leave it be? We can’t take it?” Han Sen frowned.\n\nMoment Queen had a wry smile, but then said, “His resurrection is only half complete. I still fail to understand how it wasn’t a success. See the dragon inside the orb? That is the spirit’s soul. He should have been revived, so it is very strange to learn that he has not.”\n\n“The spirit orbs you can take and consume are those that have yet to achieve any such activity. This is far too tricky for us to attempt.” Moment Queen seemed to be out of ideas.\n\nHan Sen wished to say something, but Bao’er suddenly held up her gourd. Then she aimed it at the dragon orb.\n\nOver the course of a single second, the orb was sucked into the gourd.\n\nMoment Queen froze, looking at Bao’er as if she had just seen a ghost.\n\nHan Sen, seeing Bao’er take the orb, then turned his attention to the body, in case it moved. But then, the strangest thing occurred: the lifeless body withered away, drying up like a long-deceased carcass.\n\nDong!\n\nSomething fell from the emperor’s body, after it dried up."
}