{
    "chapter": 975,
    "title": "The Man in a Bronze Ding",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_975",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThere was red soil inside the bronze ding. It smelled like blood, and someone had been buried beneath it.\n\nThe head and the hair of a man was all that was left uncovered by the soil. As Han Sen looked, the man’s pale face seemed to be looking at him.\n\nThe man’s eyes were white, and they had no pupils. It was a chilling sight, and he could have easily been mistaken for a demon.\n\nHan Sen could not tell whether it was a human or a spirit. He couldn’t detect a lifeforce, but it was so curious and unnerving to think a person had been buried there, so far underground, inside a ding.\n\nHan Sen gulped, as he was getting rather creeped out.\n\nWhen he regathered his composure, he sought to check the man out and see if he could learn more. His preliminary examination told him that the man had a pretty face, and he was wearing jade earrings. That was all he could see.\n\n“Who is this man? And why has he been buried here?” Han Sen flew away from the ding and saw a folding screen. Moving past it, his eyes were greeted with the sight of a stone hall.\n\nIn there, Han Sen noted the presence of several stone statues. They were all demonic-looking in their imagery. But he didn’t know which demons they depicted, as they didn’t at all look familiar to Han Sen.\n\nTowards the end was a stone table, and atop it, a grey box. Han Sen approached it, and noticed it was open. The lid was slightly ajar.\n\nThrough that gap, he saw that a bone was inside it.\n\nHan Sen magnetized the box towards him and fully opened the lid to get a look at the bone that was within. Much to his surprise, he realized that it was actually a rubik’s cube that had been crafted from bone.\n\nThis wasn’t an average rubik’s cube, though. It was six-sided, and none of its surfaces were color-coded. In place of colors, there were many symbols that were foreign to Han Sen.\n\nAfter a thorough count, he learned there were one hundred faces for the rubik’s cube.\n\nCreating a rubik’s cube that was so small, yet so dense and complex, was not something of average craft. It would require the precision of high technological advancements and machinery.\n\nIf you could complete and solve a simpler rubik’s cube, you could do this one. The only difference being, with this level of complexity, it’d take far more time.\n\nAnd with only foreign symbols for an indication of which face aligned with what, minus any easier-to-discern colors, it was sure to be far harder.\n\nWith ten-thousand faces to unmuddle, it was to be a real headscratcher. And it was most certainly not a puzzle that could be solved by any average human.\n\nThinking it quite interesting, Han Sen wanted to keep it. After another examination, to espy whether or not there was any danger associated with the item, he deemed it okay to take. Swiftly, he pocketed the puzzle.\n\nWhen he got back, he fancied completing it through the use of a computer. He figured there was no point in exhausting actual brainpower to solve it.\n\nAll Han Sen worried about was whether or not the bone that had been used to craft the rubik’s cube had come from a creature. If it had been, he couldn’t return to the Alliance with it.\n\nHan Sen decided to leave the stone hall, and just as he was to pass the screen, he was delivered a fright. Standing atop that screen was the man he had previously seen buried inside the ding. He was staring at Han Sen.\n\n“Are you a man or are you a spirit?” Han Sen eyed the man suspiciously, as he drew his blood dagger.\n\nThe clothes the man was wearing did not seem like any uniform belonging to the Alliance. There were many plates of black metal across his attire, but they looked soft. His garb was strange.\n\nThe man did not answer. He reached out his hand towards Han Sen’s neck with a sudden burst of speed.\n\nHan Sen’s face changed in acknowledgement of this, and a blaze of phoenix fire enveloped the dagger in his hands. He struck forth with it and slashed the man’s outstretched hand.\n\nDong!\n\nWhen his blade collided with the man’s skin, it sounded as if Han Sen had just struck metal. The dagger bounced off the man’s hand, and with a sudden reversal of power, Han Sen was sent flying backwards into the stone walls of the hall.\n\nThe white-eyed man sought to attack Han Sen again before he could recover, so Han Sen summoned his Dragon-Blood Snake to defend him.\n\nPang!\n\nThe white-eyed man created a hole directly through the Dragon-Blood Snake. The creature squealed in pain.\n\nFortunately, it was a strong and powerful beast soul. It was able to withstand the hit, and it’d take more than that to bring it down.\n\nBut the white-eyed man had no interest in fighting the Dragon-Blood Snake. After his initial attack on the creature, the man moved past the reeling beast soul and went after Han Sen again.\n\nUsing his dongxuan movements, Han Sen repeatedly slashed the man with a storm of black fire strikes.\n\nBut no matter where it landed, each hit was useless. He even attacked the man’s face, but it was all to no avail.\n\nThe man closed the distance between them with an attack of his own, and Han Sen was too late to dodge it. The flesh of his shoulder was torn, and the gash instantly wept blood.\n\n“Who are you!?” Han Sen asked again.\n\nAgainst this enemy, Dragon-Blood Snake was all but useless. And even if he employed his super king spirit mode, Han Sen wagered he’d still be weaker than the man.\n\nRealizing he could not beat this foe, all Han Sen wanted to do now was escape. The landscape, and its winding tunnels, were maze-like this far below the earth. If he was quick enough, there was a chance he could lose the man.\n\nBut that was a big if. The man was incredibly fast, and Han Sen was unsure whether or not he could compete with him. Already, that speed was being employed to prevent Han Sen’s departure.\n\nAfter a few more evasions, Han Sen’s chest was slashed. When the man’s middle finger came back into view, it dripped with Han Sen’s blood."
}