{
    "chapter": 2323,
    "title": "Princess",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2323",
    "text": "When they neared the center of the city, Han Sen and Bao’er’s eyes opened wide. The beautiful ocean plaza was full of garbage, but the eeriest thing was the presence of skulls. There was an abundance of them from a variety of different races. They lay in piles around the plaza, making marring the scene with their darkened, stained surfaces.\n\nBut the plaza only held the skulls. There weren’t any skeletal corpses around.\n\n“Surely Lilly can’t be the only person living here.” Han Sen was shocked.\n\nThey soon passed the plaza and came to a pretty palace. That place was clean, and there were guards standing before it.\n\n“It would have been great if it was just Lilly here.” Han Sen sighed.\n\nLilly was leading with Han Sen in tow. When they came before the palace, the two guards raised their spear-like weapons to stop Lilly and Han Sen.\n\n“Kind sirs, please inform the princess that her little prince is back.”\n\n“Prince? Where is the prince?” a guard asked stiffly.\n\n“Something is wrong here,” Han Sen thought. Even if the guards didn’t recognize Bai Yi because he looked like someone else, they shouldn’t have been talking that way. When they made mention of the prince, it didn’t seem to respect him.\n\nAs Han Sen mulled this over, Lilly explained that Han Sen had used Return to Origin.\n\n“You guys wait here.” After a guard heard the tale, he looked at Han Sen keenly and then walked into the palace.\n\nHan Sen felt strange. The guards now knew that he was Bai Yi, and they still treated him rudely. It was beginning to concern him.\n\nThe two guards were also Sirens. Bai Yi was the son of a once-virgin Siren. Even if he wasn’t a prince, he shouldn’t have been treated that way.\n\nHan Sen didn’t know what was going on, so he stopped talking and watched to see what would happen.\n\n“My prince, please do not be enraged. The princess has been in a foul mood of late. You should just hold on… Hold on a bit…” Lilly worriedly tried to comfort Han Sen.\n\nHan Sen took a breath and slapped one of the guards in the face. The Original Water King Body’s power sent the guard flying. He crashed into a pillar of the palace and spilled blood. It was a great struggle for him to get up.\n\nHan Sen walked forward silently, his face looking grim.\n\nLilly’s face had gone white. She ran up and said quickly, “My Prince, this is bad… You will make the princess angry!”\n\nHan Sen patted his blood kirin and coldly said to her, “Things are different now. So what if she is angry? You should stop babbling and go clean something up.”\n\nLilly nodded to comply, but before she could say anything, a cold voice echoed through the palace. “A half-deified xenogeneic gives you that much courage?”\n\nHan Sen squinted his eyes and watched the person emerge from deeper within the palace.\n\nIt was a woman clad in palace clothing. She looked similar to Lilly, with blue hair, blue eyes, and ears that were blue gills.\n\nBut her lower body wasn’t the tail of a fish. She had nice long legs. Her legs were so long that they made her look very tall. And with that imperious expression on her face, she looked like someone of very high status.\n\n“I’m not that brave. I just don’t want to come home and have to report to people,” Han Sen responded flatly.\n\nThe pretty woman’s eyebrows rose, but her face was scarily cold. She looked at Han Sen with derision. “You are from the bloodline of a virgin, and you had to use Return to Origin to combat a Duke. Is that not embarrassing for you to talk about?”\n\n“That’s my business, not yours.” Han Sen made sure he sounded a little angry.\n\n“I’ll overlook what you’ve decided is ‘your business,’ but this is the last time. If you touch my people again, you know full-well what will happen.” After that, the woman ignored Han Sen. She sent others out to aid the Siren guard that Han Sen had struck. Then she walked back into her quarter of the palace.\n\nThe Sirens that went to pick up the guard glared disrespectfully at Han Sen. They didn’t have the respect for a master or prince that they should have.\n\n“This Bai Yi’s life was pretty bad. And who is this princess? She’s… unique,” Han Sen thought to himself.\n\nWhen the princess had finally returned to her palace, Lilly looked visibly relieved. She told Han Sen, “My Prince, let’s go. Stop making the princess unhappy.”\n\nHan Sen snorted and followed Lilly.\n\nThis was turning out very differently than what Han Sen had imagined. He had believed that Bai Yi was a prince and that this was his territory. He should have been in the comfort of a nice palace.\n\nBut Lilly only took Han Sen down a side-passage. They followed a winding path around a garden to get to the far end. She brought Han Sen to a small shack.\n\nHan Sen frowned. If he hadn’t used his Dongxuan Aura to examine Lilly, he would have thought that she was putting on some sort of bizarre act. He even wondered if this was all just a trap to test him. What kind of prince would live in a place like this, in territory that supposedly belonged to him?\n\nLilly pushed the door open and started tidying up things inside the little hut. She said, “My Prince, you should rest. I will clean-up right now.”\n\nHan Sen saw that the building was well-kept. It was already sparklingly clean. He waved at Lilly. “There is no need for cleaning. You should go and rest. I’m going to spend some time overtaking this body. Do not disturb me. I will call you when I need you.”\n\n“Yes, my Prince,” Lilly said. She exited the building, closed the door, and left.\n\n…\n\nThe princess was standing atop the palace, looking down at that building by the garden.\n\n“My Holy Virgin, did Bai Yi really use Return to Origin?” asked a very old Siren standing behind the princess. He spoke with a rough voice.\n\n“I can only suppose he did. His body has the presence of Return to Origin within it, and his Original Water King Body and water area-of-effect seem to be alright. But…” the princess stopped talking.\n\n“But what?” the old Siren asked.\n\n“He dared to argue against me. I don’t know why he tried to do that,” the princess said with a frown.\n\nThe old Siren coughed and said, “That xenogeneic seems powerful. It most certainly isn’t an ordinary creature. Now that he has it, it should be a great help to him. It looks as if he earned a lot on his trip, not just that one creature. But even with that reward, it was good that he was willing to use Return to Origin to obtain that body. His chance of being approved by our relic is even lower now. It is good for you.”"
}