{
    "chapter": 1027,
    "title": "Killing Nine-Tail Ghost Fox",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1027",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe ghost fox squealed as if it was trying to say, “I am indestructible, you are nothing!”\n\nBut in the next second, Han Sen’s mighty fist was burying itself deep into the ghost fox’s face. It annihilated the composure of its shadowy form and sent the beast flying.\n\nThe ghost fox wore an expression of complete incomprehension. It couldn’t believe the human had actually managed to punch it.\n\nHan Sen did not hesitate for one second, though. His anger was like the sudden eruption of a volcano, and he moved over to deliver follow-up blows. Approaching the fox, his arms swung wildly.\n\nPang! Pang!\n\nHan Sen punched the nine-tail fox repeatedly. Blood squirted out with each brutish impact like flowers in the air.\n\nThe ghost fox was in shock at how the tables had turned on it. Han Sen was an oppressive tyrant, standing in front of it, beating it senseless. The crazy man’s barrage of punches ruined its body into a sickly, disfigured mess. All it could do in response was scream, shriek, and squeal in agony and fright.\n\n“Die! Die! Die!” Han Sen’s fists were faster than any eye could track.\n\nKatcha!\n\nA fist opened up and grabbed one of the fox’s tails. It ripped the tail off and cast it away like some joke.\n\nThe nine-tail fox could not hold back its pained cries. It tried to raise its claws in a hopeless defense, thinking it might be able to get away.\n\nBut Han Sen’s fists of fury were too powerful. The nails and paws were shattered with no additional effort, and then, he teleported in front of the fox’s face.\n\nKatcha!\n\nHan Sen grabbed the fox by the neck and reached around for another one of its tails. Effortlessly, another tail was torn from its flesh.\n\nThe ghost fox was in shock. It had resided on the mountain for countless years, but it had never been this scared before.\n\nHan Sen was like a demon. Its ghost body was useless against the raging madman. The fox couldn’t fathom trying to fight back anymore, and all it wanted to do was run off and retreat to some cave where it could lick its wounds.\n\nEvery step it tried to take, Han Sen was there with it. Another tail was ripped off.\n\nEvery time a tail was ripped off, it lost its shadowy, phantom-like illusion. When it hit the ground, it was an average, fluffy fox tail.\n\nHan Sen chased the fox for three hundred miles. Over the course of this distance, the ghost fox was beaten until it continuously spilled blood from its mouth, and countless wounds checkered its body. Every now and again, a tail was ripped off and cast away, too.\n\nWhen Han Sen reached the last tail, the ghost fox no longer looked like it had before. It had lost its translucent look and simply became a frail, beaten, black fox.\n\nWith Taia, Han Sen did not show any remorse or mercy. He cut the head of the fox clean off, from a strike that started low. The upward momentum sent it barreling through the air. / update by\n\nThe ghost fox Han Sen had been savagely beating on was killed then and there. It wasn’t in any particularly flashy fashion, just a clean, simple severing of its head.\n\n“Super Creature Nine-Tail Ghost Fox killed. No beast soul gained. Consume its flesh to gain zero to ten super geno points randomly. You may also collect the Life Geno Essence.”\n\nAfter killing the nine-tail fox, Han Sen exited his super king spirit mode. It was incredibly draining on him, and he had been sapped of all strength. Now, he could barely lift a finger.\n\nHis bones felt like glass, as if they were fragile and ready to shatter. His flesh felt stressed, as if the entire composition of his body had been stretched. He was like butter, scraped over too much bread. His lifeforce was weak now.\n\nIt took him a whole hour of super king spirit mode to kill the fox. If he hadn’t figured out how to kill it by tearing off its tails, he wouldn’t have been able to finish it off.\n\nThe reason Han Sen was able to make a comeback and kill it, though, was all down to the ghost fox’s underestimation of his power. If the fox had not tried to possess and toy with him for a while, he could have been outright killed before being given the opportunity to fight back.\n\nIf the fox had tried to kill him properly, it all would have been over for him.\n\nHan Sen had more than a few tricks up his sleeve, and the ghost fox had no idea he was capable of unleashing such vast amounts of power.\n\nThe fox had been in charge of that mountain for countless ages. By killing the master of that massive region, it finally made him realize just how powerful and fortuitous he was to possess a super king spirit body.\n\n“This hurts way too much.” Whichever way Han Sen chose to move, it felt as if he was pressing his body against a thousand knives.\n\nThe silver fox had done nothing for a while. He had only followed Han Sen, staring at him with his mouth agape.\n\nThe ghost fox had been wickedly powerful for many years, and heaven knew how many good things it had eaten over the course of its time as supreme commander of Ghost Mountain. A super creature that had reached its ninth tier would most certainly not have been able to kill it. The fact that it was so far ahead of every other creature there was why it had been in charge. Even the silver fox had been forced to become its slave.\n\nNo one could have expected it to have been so simply killed by a human like that.\n\nHan Sen summoned Thorn Baron, asking her to bring the fox’s corpse with her.\n\nBack in the shelter, he rested the following day and night. His body had moderately improved, but he was still very weak, and there’d be a while to go before he could make a full recovery.\n\nNot even the silver fox’s powers of healing were enough to fix him.\n\nHan Sen had tried to use his own holy light to heal himself, but it was futile. It seemed as if only time possessed what it took to recover, this time.\n\nThe silver fox brought out the Dragon’s Saliva Han Sen had been gifted. After eating a bit, Han Sen felt much better.\n\nStill, with not much going on, Han Sen thought it’d be a waste to eat it now. Its recovery benefits could prove very useful in the future.\n\nHan Sen dug up the Life Geno Essence. The silver fox circled him as he did so. With the saliva drooling from his mouth, it was obvious Little Silver wanted some.\n\nWith a wry smile, Han Sen gave the Life Geno Essence to the silver fox. He barked after accepting it, then ran off to enjoy it.\n\nAfter trying to eat some of the ghost fox’s tail, Han Sen found it to be inedible. So, he summoned the Disloyal Knight and got him to eat it.\n\nThe Disloyal Knight gobbled up all the meat it could, and was then sent back to the Sea of Soul. This time, it began to shine with a green light—it was evolving!"
}