{
    "chapter": 1898,
    "title": "Exchange Even",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1898",
    "text": "“Gone? How can they be gone?” Du Lishe asked curiously.\n\nQing Li explained it, and then let her take a look at the broken wood chips.\n\nAfter Du Lishe heard what she was told, she had a look of disbelief. “Really? How long has Han Sen been practicing Teeth Knife? You say he has a Teeth Knife knifemind and can use it to such a high level? I can’t help but find that hard to believe.”\n\n“I wouldn’t have believed it, either, if I hadn’t seen it with my own two eyes. But I really did watch him write it down upon the boards. And then, I saw the wooden board get broken apart by the words he had scrawled. You have to believe me. Han Sen really is so strong! It’s no wonder the queen picked him as a student. I am far inferior,” Qing Li said.\n\n“Don’t think too much about it all just yet. The event is going to start soon, so let’s head over to the meeting.” Du Lishe hadn’t seen the text herself, so she didn’t think it was that incredible. She put it out of her mind and dragged Qing Li with her to the event.\n\nThe exchange event was hosted by one of the two races, and they alternated each time. This time it was the Rebate’s turn to host. The Buddha Clear Sea King brought around twenty of his Buddhas here. Before the event started, they met with the Nobles of the Rebate. That way, the two groups would be familiar with each other during the event.\n\nAmongst all those Buddhas, there was one called Sun. He had the highest rank out of them all. He was a Marquise class fellow.\n\nIf this was down to raw talent, Speechless and No Flower were the absolute strongest. Buddhas had a special ability; when Buddhas became old, they could transfer their knowledge and experience to the younger ones.\n\nThey called that ability, Open the Mind. The Buddhas that used it would die a short time after, and the Buddhas that were on the receiving end would only be able to absorb as much knowledge as their prowess allowed them to.\n\nNo Flower and Speechless had their minds opened. They had been very talented when they received their knowledge, so they were able to absorb a lot. They learned far more than the average Buddha did.\n\nSpeechless was the best, though. The elder that opened their mind for her was a half-deified Buddha. Speechless was extremely talented, and people expected her to be the first fully-fledged deified Buddha in the last thirty thousand years.\n\nBut Open the Mind was classified, and most people did not know anything about this process. Even those who knew about the ability couldn’t tell who had received a predecessor’s knowledge.\n\nQing Li and Du Lishe went to the meeting and met up with friends there.\n\nSomeone introduced a Buddha to Qing Li. The Buddhas and the Rebate were allies, so there was a good atmosphere and relationship between them. But there was a competitive side to their cordialities, and they were fond of finding out who was stronger in various categories.\n\nThis was an exchange event, but right now, it was more like a competitive display of skills than a swap-meet.\n\nHan Sen was not at all interested in events such as this, but Yisha had repeatedly asked Han Sen to attend. So, he had no real choice but to come.\n\nWang Yuhang and Xie Qing King were fond party-goers, and Gu Qingcheng was interested in learning about the Buddhas. So, they all decided to follow Han Sen.\n\nThe four of them found a corner to sit down in, and there, they could watch the show and enjoy the food of the Rebate. Because Han Sen was not a member of the Moon Garden, he could only sit outside to spectate. He could not enter or interact with the Buddhas.\n\nWhile this meant nothing to Han Sen, Speechless kept looking for him. When the meeting began, she had yet to see Han Sen around. She felt confused about his absence.\n\nSpeechless thought Han Sen was the student of Knife Queen, and because of that, he would have been allowed to participate in the event. But Speechless looked around for him for a long time, with no hide nor hair of him to be found. She didn’t ask about him, though. She’d feel weird to ask.\n\n“Isn’t Han Sen Queen’s student? Why are you watching the event from the outside, like us?” As Han Sen and his companions were munching away, he heard someone speak with a rather mocking tone of voice.\n\nHan Sen looked over and saw a few xenogeneics. They were not old, and neither were they Rebate. The person who spoke was someone with the head of a cow.\n\nWhile they were some sort of bovine race, but they looked different from the Kao. Han Sen did not know which race they belonged to, but he had seen this cow-headed person before.\n\nIn the Moon God Festival, the cow-headed man was with Gold Jade King’s son Gao Ji. He was one of the very few Earls there.\n\nHan Sen looked at them but did not say a word. They were outsiders, and they were simply leaning on the Rebate.\n\n“I thought Queen would give her student special treatment. But he’s just like us, an outsider, not allowed to be a member of the Moon Garden. He can’t participate in the event, and he can only sit out here and watch.”\n\n“So what? Even if he could join, what could he hope to exchange?”\n\n“Maybe he can exchange a little luck, you know?”\n\nThe young man with the head of the cow and his fellows were talking so loud, it was obvious they wanted Han Sen to hear them.\n\nHan Sen frowned, though. He wasn’t sure what they meant. They were outsiders there, as well. They should have felt the same way about things as Han Sen himself did. He did not know why they’d bother picking on him, wanting to start trouble.\n\nSo, Han Sen ignored them and pretended he did not hear them. He continued talking with Gu Qingcheng and the others.\n\nThe cow-headed man thought it was pointless to continue talking, after noticing that Han Sen wasn’t paying them any mind.\n\nAfter a while, Clear Sea King and Moon Wheel King arrived. They announced the start of the event.\n\n“The guests have come from far and wide, so let them take the stage first.” Moon Wheel King smiled.\n\n“Amitabha! Let us hope we don’t embarrass ourselves.” Clear Sea King looked at No Flower, and then he went on to say, “No Flower, you go first. Share your experience with your friends.”\n\n“Yes, my king.” No Flower stood up and bowed before Clear Sea King and Moon Wheel King. He walked on stage and spoke to the worker, saying, “Please help me prepare a testing gold rock.”\n\nA testing gold rock was a rock for testing one’s power. While the rock could be dented, it was very durable, almost unbreakable. It was usually used for the testing of geno arts.\n\nThey have No Flower coming on stage. It looks like they are ready to show off,” Du Lishe said with a smile."
}