{
    "chapter": 2398,
    "title": "Xenogeneic Chase",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2398",
    "text": "Han Sen and the others fell back. They immediately expanded their King areas as they stared at the goose egg stone.\n\nKatcha… Katcha…\n\nMore cracks opened across the surface of the goose egg stone. The cracks were very well-aligned, so they obviously weren’t like ordinary cracks one might find in a well-weathered stone. Instead, the perfectly-spaced cracks opened straight up and down.\n\nBoom!\n\nCountless dark green claws emerged from the top and bottom of the stone.\n\n“Holy sh*t! That is a big bug!” Dragon Eight screamed with wide eyes.\n\nThe stone might have looked rather like an egg, but the thing inside it was definitely not a baby goose. It was actually a xenogeneic bug, one that looked like a centipede. Its body was curled around itself, so all its claws were hidden. It had simply made itself look like a goose egg. Now, the disturbing creature was stretching out its body, making itself look very scary in the process. It revealed its teeth as it stared down on the Destroyed and Dragon around it.\n\nBlood and gore were smeared across the bug’s belly. It was probably the remains of the missing Destroyed Kings.\n\nEveryone still alive knew that somehow, this xenogeneic had eaten more than fifty of the Destroyed Kings in a single second. The realization was chilling. No one issued a command. Everyone, including Han Sen and Dragon One, immediately turned and flew away. They were going to leave Planet Dark Zone.\n\nBut just as they were about to fly up into the clouds, the whole sky of the planet turned dark green. It was like a giant green crystal had formed to cloak the entire planet. Even the small amounts of light that made it through the clouds were dyed that same greenish shade.\n\nPang!\n\nBoth the Destroyed group and the Dragon group fell from the sky like meteors. They hit the planet so hard that their bodies punched deep holes into the surface.\n\n“Air-restriction area. With this kind of radius… it must be a deified xenogeneic!” Dragon Eight pronounced as he climbed out of his hole. His face looked grave.\n\n“That isn’t an air-restriction area.” Han Sen looked glum, too. He looked at the ground around them.\n\nThe area looked as if it had managed to cover the entire planet. None of them could fly away now. Even more frightening was the fact that this wasn’t just an air-restriction. It had another power, too.\n\nBefore Han Sen could analyze it further, though, the giant insect leaped forward. Its mountainous body moved with uncanny speed, and dark green substance chains seethed in the air around it. The chains wrapped around its entire body, their outer edges as sharp as razors.\n\nHan Sen used his Dongxuan Aura as he turned to run. He didn’t dare use his Move Mountain Area; it would be totally useless against a monster like this.\n\nA xenogeneic like this had enough raw power to crush his Move Mountain Area without breaking a sweat. His Dongxuan Armor wouldn’t be able to withstand strength of that magnitude. He would die in moments.\n\nBoom!\n\nThe weird bug attacked. Two of the Kings were too close to the creature to run, so they had no choice but to attack. They tried to use their own powers to fight back against the insect, but the weird bug was able to swallow them whole. The weird bug then dove into the ground, vanishing under the surface and leaving a large hole behind.\n\nThe ground shook beneath Han Sen like a violent earthquake. He wanted to run, but after a few frantic steps, he came to a black hole in the ground. A King running next to Han Sen was swallowed by the insect as it launched itself up from that hole in the ground. The weird bug hung in the air for a moment, then turned and dove back under the earth.\n\n“F*ck you!” Dragon Eight screamed when he saw the insect eat one of the Dragons. It made him so angry that he used his giant gold dragon. He sent a punch toward the pit in the ground.\n\nBoom!\n\nThe hole collapsed on itself, and the weird bug didn’t come out again. It didn’t scream, either.\n\n“Careful!” Dragon One sprinted toward Dragon Eight and knocked the man backward, then dodged away himself.\n\nThere was another boom as dirt and dust fountained up where Dragon Eight had been standing only a moment before. There was now another large hole, and the strange bug had reemerged. Half of its body was above ground, and it looked like some strange tower as it swung its claws.\n\nNo one moved to attack the creature; running was the only thought on their minds. They all knew that fighting the beast would be a useless move. There was nothing they could do against such a scary deified xenogeneic.\n\nHan Sen was running. And he was running very fast. He was very good at fleeing impossible fights, and he was confident that he could break the weird bug’s King area and leave Planet Dark Zone.\n\nOf course, he needed the bug to stop chasing him first. Even if he could break the air-restriction area, he wouldn’t make it very far if the bug was still pursuing him.\n\nSo, Han Sen put conscious effort into keeping a low profile. As soon as he had the chance to, he would use his super god spirit to leave Planet Dark Zone.\n\nAnd in regards to the others, Han Sen could only pity them. At a time like this, it was every man for himself. Han Sen was not their daddy. There was no need to make a sacrifice on their behalf.\n\nHan Sen’s face suddenly grew pale. The hair on the back of his neck stood up, and his heart leaped into his throat.\n\nWithout hesitation, Han Sen used all his strength to leap forward. The bug erupted up through the ground he had just been standing on.\n\nHan Sen’s body had almost touched its mouth, and the dark green substance chains around the creature were like blades. One of them brushed Han Sen’s leg, which was clad in the Dongxuan Armor. The chain sliced cleanly through his Dongxuan Armor, leaving a deep gash in Han Sen’s leg.Han Sen ignored the pain burning in his leg and continued to run. If he stopped now, he would die.\n\nThe weird bug was back underground, though. It seemed to swim under the ground like some sort of strange fish. Every time it came out again, it left a ten-meter hole in its wake.\n\nPerhaps it was because Han Sen’s leg was leaving a trail of blood behind, but Han Sen noticed that the weird bug seemed to be focusing all its attention on chasing him specifically.\n\n“I cannot be this unlucky,” Han Sen thought, feeling sick. He hoped he was wrong, but when that bug burst out of the ground right next to him again, he knew that his hunch had been correct. The insect was after him, and him alone.\n\n“F*ck you!” Han Sen was slower than the weird bug, so he wouldn’t be able to dodge the bug again. He flew into the sky, his body releasing a white light. He was in super god spirit mode now, and he avoided the weird bug’s gnashing teeth as he flew higher and higher.\n\nThe bug didn’t seem to have any ranged attacks aside from its King area, so Han Sen focused on flying as far away as he could. But just as he thought he was about to leave the area, he heard a buzzing sound.\n\nTransparent wings had sprouted from the weird bug’s back. It flew toward Han Sen at incredible speed, and within a single second, it was right below Han Sen.\n\nAll of its dark green substance chains were knotted together, spinning over each other like some enormous blender. The weird bug’s open mouth was coming right for Han Sen. It was like a big whale, ready to munch on a little fish."
}