{
    "chapter": 2184,
    "title": "The Real Traitor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2184",
    "text": "Everyone’s attention was drawn to the shout; even Han Sen’s. The voice had come from Toxic Dragon Old Six. He was flecked with blood, and a black shape had been seared into his chest that looked like a woman’s hand.\n\nThe handprint had burned through Toxic Dragon Old Six’s dragon scales, branding his chest with its black mark.\n\n“Destroyed power!” someone shouted. Then everyone was jumping toward the Feather woman. Even Dia Robber abandoned his attack on Han Sen to deal with her.\n\nAside from the Destroyed, the only person that could use Destroyed power to damage Dragon Six in such a way had to be the Destroyed traitor.\n\nToxic Dragon Old Six had kept pursuing that Feather woman, and she had finally hurt him.\n\nEveryone was running for the Feather woman now. Only Barr, who was completely obsessed with Han Sen, remained to finish what he had started.\n\nHan Sen felt glum about this, of course. But when Dia Robber left, he took his disruptive powers with him. Han Sen could suddenly use Break Space Flash again, thankfully.\n\nHan Sen moved fast, activating Break Space Flash as he went. Before Barr caught up with him, Han Sen rushed into a building. When Barr ripped the building apart to locate Han Sen, he couldn’t find him anywhere.\n\n“Han Sen! Get out here!” Barr struck out furiously with his bone knife, reducing the building to smaller and smaller pieces, but he still couldn’t find Han Sen.\n\nHan Sen wasn’t in the mood to deal with the immortal madman. After Little Invisible cast a power on him, he became completely transparent. And furthermore, he used his Dongxuan Aura to mask his presence. Then he slipped out from under Barr’s nose.\n\nEveryone was intent on hunting down the Destroyed traitor now. Many scary powers were being hurled towards the Feather woman, but the Feather woman slipped by them with unbelievable grace.\n\nDespite being only a Marquise, she was teleporting straight through the Dukes and Marquises hunting her. Even Dia Robber was unable to stop her.\n\nDia Robber’s bird head flashed. That same field of chaos was opened, and the woman fell into it.\n\nBut shockingly, the woman’s movement abilities weren’t affected by the power. She could still teleport, and no one was able to do her any harm.\n\n“You stupid people! Do you really think I am the Destroyed traitor? Dragon Six used that palm strike himself. He hit himself! It has nothing to do with me!” the woman exclaimed after another successful evasion.\n\n“Liar! Do you honestly expect us to believe that?” a Destroyed Duke roared back. His desire to kill her was greater than ever.\n\n“If I was the traitor, why would I make it so obvious?” The woman smiled and spread her arms cockily. She did not dodge. Instead, she brought a light to the tip of her finger, and she aimed it at the Destroyed Duke.\n\nThe Destroyed Duke moved his six arms and fired three separate powers. He used a tri-colored godlight to counter her attack.\n\nBut her godlight broke through the tri-colored godlight. It branded the Destroyed Duke with a weird mark. The Destroyed Duke was suddenly turned into a miniature version of himself. His flesh and bones were all compressed and condensed together. The three-meter-tall body was turned into little more than a sugar cube.\n\n“A mark of the Very High! You are of the Very High!” Everyone’s faces went white. Those who had been going for the woman now stopped. They quickly began to scramble backward.\n\nDia Robber seemed to realize something. He looked towards where Toxic Dragon Old Six had been, but the Dragon was nowhere to be seen.\n\n“Where is Toxic Dragon Old Six?” Dia Robber asked one of the other Dragons.\n\n“I don’t know… He was here, though…” The Dragons felt that something was very amiss.\n\nNow, all the races started to realize that the woman was associated with the Very High. They knew of her marking ability. It was a Very High skill. The Very High certainly couldn’t have been the traitor.\n\nBut Toxic Dragon Old Six had definitely been hit by a Destroyed power. If the power hadn’t come from the woman, then he really must have used it on himself.\n\nToxic Dragon Old Six was a Dragon, though. He couldn’t have used a Destroyed power on his own, which meant he had to have been the traitor. He had stolen the Destroyed Bible.\n\nBut now, he was gone. He had vanished amidst the chaos, and no one knew where he had gone. Perhaps he had even fled Steel City.\n\nDia Robber looked at the Feather woman and bowed. “Excuse our most impolite rudeness. We will issue a proper and formal apology at a later date. Can you please tell us which direction the traitor went?”\n\nThe fake Toxic Dragon Old Six had framed her. She must have seen where he went.\n\n“When you guys attacked me, he escaped that way.” The woman coldly pointed towards the Steel City gate.\n\nWithout a moment of hesitation, everyone ran in that direction. He had left a trail as he ran, and they tracked him into some mountains.\n\nThe woman watched impassively as everyone left. They wanted to find the traitor, but they also wanted to escape her wrath with all haste. The thought that they had all attacked one of the Very High had given them massive chills. They sincerely hoped she’d be forgiving.\n\nThe woman did not seek revenge, though. Instead, she flew up into the skies.\n\nWhat happened in Steel City was watched by the ships. They saw when the woman revealed herself as one of the Very High, and so no one stopped her from leaving Planet Sodi.\n\nThe universe’s number one race: the mysterious Very High. They were the strongest and most mysterious race. Even the Extreme King and Ancient God races were afraid of them.\n\nWhen the Very High mark appeared, bad things tended to follow. This had happened many times through the ages, and many races had been destroyed by the Very High, wiped from the annals of history.\n\nDia Robber and his followers searched the mountains up and down, and eventually, they found the fake Dragon Six and engaged him.\n\n“Are you guys blind? Why would I be the traitor? Don’t you know that the fox race is only comprised of women? They become weaker if they turn into males. Do I look like a f*cking woman?” Toxic Dragon Old Six shouted as he fought back.\n\nDia Robber saw that the man’s Toxic Dragon Evilbreaker powers were real. As he fought, he asked, “What are you doing, then? Why are you running if you aren’t the traitor?”\n\n“I’m not running! I’m f*cking injured, and I’m looking for a place to heal!” Toxic Dragon Old Six shouted angrily.\n\n“You say you are Toxic Dragon Old Six, yes? How can you prove your identity?” Kahn asked. Something seemed wrong about this whole situation.\n\nToxic Dragon Old Six’s body then seemed to turn inside out. His body was covered with toxic scales, and he looked like a humanoid-but-toxic dragon. He breathed out toxic gas and said, “No matter how strong a fox lady might be, she wouldn’t be able to imitate a xenogeneic toxic dragon body.”\n\n“Oh no!” Dia Robber looked horrified. When he returned to Steel City, the Very High woman was gone."
}