{
    "chapter": 1316,
    "title": "One Versus the Whole Sanctuary",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1316",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nIt took Han Sen four days to return to Moving Star Shelter.\n\nBy the time he got back, the fight was already over and the crisis had been averted, or at the very least met head-on during his absence and resolved in a massive battle he had missed out on.\n\nWhen Han Sen returned, though, he wasn’t exactly delighted at the results. Before him lay the ruins and remnants of what was once a glorious and immaculately conceived and constructed shelter. And in the midst of the ruins was Xie Qing King, who seemed to be enjoying a nice, cold beer. Still, he was glad the place had been saved and his companions had pulled through.\n\n“Good job.” Han Sen gave him a high-five.\n\nHan Sen had heard what had transpired through Thorn Queen, especially what Xie Qing King had managed pull off in order to kill Gold General.\n\n“I am Xie Qing King, not Xie Qing Emperor,” Xie Qing King said.\n\n“I thought you were a super emperor now!” Han Sen said, in hysterics.\n\nFortunately, no one had died during the siege. An incredible thing, too, given how hairy things became. Having the silver fox and the Holy Rhino around to heal was a brilliant thing, and they had both proven themselves to be invaluable assets to the composition of Han Sen’s primary force, despite Xie Qing King’s personal feelings towards Little Silver’s shock therapy treatment.\n\nThe talent of healing was quite rare, overall. Individually, such creatures had a hard time surviving due to their weakness in attacking.\n\nAnd because of that, it was difficult for them to level up.\n\nNine gene lock creatures like the Holy Rhino were an extremely rare find, and it was no wonder its original owner had gone to such lengths to procure it.\n\nSaint Fan himself made sure to use the Holy Rhino a lot, too, and it had proven a great asset for him, before his death.\n\nHan Sen, Thorn Queen, and Xie Qing King were having a merry chat when Moment Queen exited the spirit hall, heading in their direction. Moment Queen didn’t seem like her usual self, though. In fact, she was looking quite grim. It prompted the interest and concern of those talking.\n\n“Can someone tell me who Godslayer Luo is?” Moment Queen asked.\n\nMoment Queen was in the Second God’s Sanctuary when Godslayer Luo was in the third, so it wasn’t too surprising to learn she did not know much about him.\n\n“A human elite; why? What’s wrong?” Han Sen thought her asking such a question was strange. Something was amiss.\n\nMoment Queen pointed at Zero and said, “I just returned from the spirit base. All the spirits there are saying she is the heir of this Godslayer Luo guy, and that they’re all planning to kill her as revenge or something.”\n\n“Define the all that is planning to kill her.”\n\nHan Sen knew this was going to happen, one way or another. Spirits were quite vengeful creatures, but none had yet learned he was the true heir to Godslayer Luo.\n\nHe didn’t expect this to become an issue this far down the line, though, prompted by a misunderstanding.\n\nStill, he wasn’t too afraid. Han Sen was an incredibly mighty person now, and he’d do whatever it took to protect Zero, provided she even needed protection—the wild and wonderful thing she was.\n\nMoment Queen went ahead to say, “All the spirits want to kill Zero. They know we are in her company. We’re on our own out here. This is bad!”\n\n“Well, what can we do about it? We’re not feeding Zero to the dogs, if that’s what your poisonous heart is contemplating,” Han Sen mused.\n\nMoment Queen suggested, “We go into hiding. We go underground, like, literally. We give this dump up for now. Go to the underground shelter, have a nice cold pint, and wait for all this to blow over.”\n\n“And what about the humans we’ve ensured the security of?” Han Sen asked.\n\nHan Sen had asserted control and assured the safety of many shelters by this point. There were many humans, far more than the underground shelter could offer refuge to.\n\n“Maybe they can go hide in that Alliance place Xie Qing King likes to drone on about?” Moment Queen offered.\n\nHan Sen rejected the idea, saying, “No. If we lose the shelters, we might as well off them ourselves.”\n\nMoment Queen said, “I fear you are having difficulty grasping the gravitas of the situation here. There are at least a dozen emperors coming, all looking to plant Zero’s head on a pike. She’s a remarkable fighter, I’ll give her that, but this is a threat that is too much for any one person to even dream of defeating.”\n\n“I’ll help her fight, and fine: tell the humans to return to the Alliance while we sort this out,” Han Sen conceded.\n\n“And how do you hope to stop this enemy force? It’ll only take one punch off one of them to end our lives,” Moment Queen thought Han Sen was overestimating his own talent. He was jeopardizing everything by being so cocky and boisterous, she believed.\n\nMoment Queen composed herself and then said, “The second, fourth, fifth, and seventh Son of Gods are on their way. We hide or we die, it’s that simple!”\n\n“Let them come. I will kill them all,” Han Sen said, casually.\n\n“Yeah, what are you fussing about? Back in the day, when I had to face a siege, I didn’t have any fancy-schmancy super creatures to heal. We had sticks! Two sticks, and a rock for the whole shelter—and we had to share the rock! Buck up, girl, you are one very lucky spirit!” Xie Qing King said, chucking the remainder of his beer away. It was difficult to tell if he was being serious or not.\n\n“This is madness!” Moment Queen had no clue what was going through their minds anymore.\n\n“Madness? This is the Third God’s Sanctuary! Have some godd*mn faith, Moment Queen. I have a plan! So, for now, go and tell humans to return to the Alliance. Things are going to heat up, of course, but we’ve weathered worse storms than this. They will not crush us,” Han Sen said.\n\nMoment Queen was unable to convince them to change their course of action, so she ended up having no choice but to abide by their decision. She notified the other shelters as she was told to.\n\nHan Sen then got deep into planning out how he was going to defeat what was coming and turn the tides in his favor. He wanted to take over the entire sanctuary, anyway.\n\nHan Sen had opened ten gene locks with Jadeskin, and with Little Angel by his side, slaying emperors should prove no problem, he thought.\n\nWith Zero and the silver fox’s help, he wagered he’d be able to take on thirty emperors without even breaking a sweat.\n\nThorn Queen came to Han Sen in a bit of a rush, and then she presented the snake egg. There were cracks running along the shell, suggesting it was about to hatch.\n\nNot long after, it all came apart as a red-scaled dragon emerged, saying, “Oh yeah! I’m back.”\n\nHan Sen smiled and said, “Well, you just remember to keep your end of this bargain. We made a deal, remember?”\n\n“Of course! A hundred years is nothing. You are too kind!” Dragon King was starting to talk more like a human now."
}