{
    "chapter": 2659,
    "title": "Luck Is Broken",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2659",
    "text": "Although creatures that came from the star fruits always started at first tier, the lowest King rank, they were still adults. Han Sen could help them develop by providing them with resources, but there was a limit to how much they could evolve. Bringing most of these Kings up to deified would be an impossible task. Half-deified was likely as far as they could go.\n\nHe had yet to find a deified xenogeneic, and that alone disappointed Han Sen.\n\nExquisite comforted him by saying, “Few of the fruit hold deified xenogeneics, so it isn’t strange that you haven’t found one yet. You still have another 40 chances, too. There is no need to rush this process. If your luck is decent, then one or two of your 50 fruit should hold deified xenogeneics.”\n\nWhat she said was correct, but it still made Han Sen depressed.\n\n“Dad, Bao’er wants to pick some fruit, too,” Bao’er said, looking up at Han Sen and tugging at his clothes.\n\nSince Exquisite could feel what Han Sen was thinking, Han Sen was careful to keep his mind blank. He told Bao’er, “Okay. You can help Daddy choose some star fruit, then.”\n\nBao’er was enthused, and she began to look around with wide eyes. Not long after, she pointed at a star fruit in particular and said, “I want that one.”\n\nHan Sen picked up Bao’er and went there. He flew to the top of the star fruit, and Bao’er’s hand touched the point where the fruit and branch connected. Then, the star fruit fell.\n\nHan Sen watched the star fruit’s shell melt away. He knew Bao’er always had good luck with things like this, so he was hoping to take advantage of Bao’er’s good luck to amass an army of deified fighters.\n\nThe shell began to peel away, revealing the xenogeneic on the inside. Han Sen looked carefully at the strange xenogeneic.\n\nIts body was very small, barely larger than Han Sen’s clenched fist. It had really big ears and a tiny, Q-shaped tail. The body was stout and circular. It looked like a fat, little, pink pig.\n\n“What is this xenogeneic?” Han Sen asked, looking at Exquisite. He could sense that the lifeforce of the creature he had just discovered wasn’t strong. It was just like the other xenogeneics he had selected. It didn’t have the presence that a deified creature would have, either. And presence aside, it certainly didn’t look like a powerful warrior.\n\n“I don’t know. I can’t recognize every xenogeneic in existence,” Exquisite said with a shake of her head.\n\n“It looks like Bao’er’s luck doesn’t always pan out in my favor. I thought she could get me a bunch of deified xenogeneics.” Han Sen couldn’t help but sigh.\n\nExquisite rolled her eyes. This man was actually using his daughter for his own gain. She had never seen someone this obscene before. There seemed to be no limits to his shamelessness.\n\nBut Bao’er seemed to really love the fat little creature, and she bent over and picked the pig up. She rubbed its fat body because it felt really good to touch.\n\n“Dad! Can I have this little pig as my pet?” Bao’er asked Han Sen while looking at him.\n\n“Of course you can.” Upon seeing that the little pig wasn’t a deified xenogeneic, Han Sen was fine with giving it to her as a pet. He had enough King class xenogeneics as it was.\n\nBao’er was so happy to receive the creature, but she didn’t sign a contract with it before waking it up.\n\nExquisite twitched in shock. Bao’er had woken the creature up without signing a contract. Xenogeneics without a contract were as dangerous as any wild xenogeneic.\n\nBut after the little pig woke up, it showed no signs of aggression. It lifted its round body and started running around Bao’er joyously. It looked very happy.\n\nBao’er picked it up, and the little pig didn’t resist. It rubbed its face against Bao’er’s hand.\n\n“Thank God it isn’t an aggressive xenogeneic.” Exquisite felt relieved.\n\n“Bao’er, continue,” Han Sen said to Bao’er.\n\nBao’er nodded. She let the little pig go and then flew to another star fruit. The little pig took off after Bao’er, its bum wiggling.\n\nBao’er swiftly decided on another fruit. The flesh of the falling fruit sloughed away, and when the slumbering xenogeneic inside was revealed, Han Sen and Exquisite were given a fright.\n\nIt was another little pig. It looked exactly the same as the first one that Bao’er had chosen, and it was the size of a man’s fist. It was chubby, too. The two little pigs now looked like twins.\n\n“Weird. Two different star fruits shouldn’t yield the same xenogeneic twice in a row. Yet these two appear to be of the same race. Why has she found two little pigs that are identical?” Exquisite looked at the pigs in confusion.\n\nHan Sen looked at the two pigs, and he realized there was a difference between them.\n\nWhen he looked closely, he realized there was a white symbol on the forehead of each pig. Since the symbols were almost the same color as the pigs, the symbols were difficult to see unless you were very close to the pigs.\n\nThe forehead spell that was on each pig was different, however. Han Sen had no clue what they meant.\n\nHan Sen looked at Exquisite. Exquisite shook her head. “I don’t know what this means, either. There are too many different kinds of xenogeneics. Perhaps this is one of the rare breeds. But judging from their presence, they should only be King class. And they aren’t aggressive.”\n\n“Why is Bao’er’s luck broken today?” Han Sen thought glumly. She had just discovered a pair of little pigs, and they wouldn’t even attack. They seemed useless. They wouldn’t even be useful as slaves.\n\nBao’er took the two little pigs with her to open up more fruit, and what happened next made Han Sen and Exquisite freeze in place. She found another little pig.\n\nBefore Han Sen could say anything, Bao’er started jumping around the star tree. She kicked down many star fruits. More than a dozen of them were falling through the air before Han Sen could open his mouth to protest.\n\nExquisite quickly teleported over to Bao’er to pick her up.\n\nThe star fruits fell, burning like dying suns. They quickly dissolved and revealed the xenogeneics inside.\n\nHan Sen and Exquisite’s eyeballs almost popped out of their skulls. Inside those star fruits were more of the little pigs.\n\nThe small pigs woke up fast. They opened their eyes as soon as their shells melted away. In moments, they were all merrily running around the first two pigs. They trotted next to Bao’er, and they looked very happy.\n\n“What is this?” Even Exquisite’s face was wrought with confusion.\n\nIt was a single breed of xenogeneic, yet there were so many of them. The star tree had never done anything like this before.\n\nHan Sen and Exquisite looked over the pigs, and aside from the spells on their foreheads, everything about them was the same.\n\n“Bao’er, you have collected so many pigs. You should let me open the rest,” Han Sen said with a strained smile. He’d been hoping Bao’er would get him a few deified xenogeneics, but it didn’t look like that was happening anytime soon. And at this point, Bao’er could start her own pig farm.\n\nThere were sixteen little pink pigs running around. They all lined up around Bao’er.\n\nBao’er didn’t comment on what had happened, but she seemed very pleased with her choice of fruits. She didn’t show any desire to pick more of them."
}