{
    "chapter": 1260,
    "title": "Fish King’s Reappearance",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1260",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAbove the water of the river, a million flying fish had appeared. They were all following its winding course upstream.\n\n“It looks like the fish king is on its way to tangle with the vine again.” Han Sen was surprised, and as he looked over, he saw the big, familiar fish. Its scales gleamed like a trove of gold in the sunlight; fitting for the king it was.\n\nHan Sen wanted to send Qin Xuan someplace safer, but there was currently no time. He put her on Golden Growler, and together they chased after the fish.\n\n“What’s going on?!” She had been in the Third God’s Sanctuary for less than two minutes, and she had no clue what was going on. She was unnerved and almost scared about what might soon happen.\n\nMany monsters were escaping the river and its proximity to make way for the abundance of flying fish. It was a spectacle, for sure, but the power of everything around dwarfed her own. She was terrified.\n\n“The fish king is on its way to fight something particularly powerful. I’m here to see if I can claim a few goodies,” Han Sen explained the long and short of it.\n\n“Will my presence prove a burden? Perhaps I should go back for now?” Qin Xuan knew Han Sen was the strongest human there, and the last thing she wanted to do was drag him down. She had only just arrived, so there’d be no chance she’d be able to fend for herself, after all.\n\n“We’re only here to watch from afar; for now, anyway. It’ll be fine if you come along,” Han Sen said.\n\nLeaving Qin Xuan there would be just as good as sending her on a death march. She could return to the Alliance, but Han Sen did not know when he’d be able to fetch her.\n\nHan Sen was also worried that the creatures would destroy the teleporter in their panic. If that happened, she’d have to end up respawning elsewhere.\n\nHan Sen was going to remain in hiding, anyway. When Yaksha and Blood River King came, all he’d have to do was make sure she was extra hidden.\n\nBao’er wanted to play with the flying fish once more, but he stopped her this time.\n\nHan Sen did not know where Yaksha was, currently, but it’d be difficult for them to avoid being spotted if they followed the fish too closely. They had to be as sneaky as possible.\n\nThe fish king was going at a slow pace, and there must have been quite a distance to go for it to reach the showdown it was headed for.\n\nThe amount of fish that was following the king was nigh unbelievable to see. Their numbers were countless, and the only word a mind could muster to describe the spectacle was “insane.”\n\nGolden Growler followed the river on the rough ground past its banks. Still, it managed to move so smoothly, that there was nary a shake or bump.\n\nBut then, Han Sen suddenly saw a crocodile-like creature that was around ten meters long. When it saw the Golden Growler, it tried to eat it, Han Sen, and Qin Xuan.\n\nHan Sen thought it was an ugly beast, as its body had thick, hardy scales and a mouthful of razorblade-sharp teeth. The monster was a super creature—that much was certain.\n\nWith its mouth that was comparable to a black hole, it sought to swallow the trio.\n\nGolden Growler did not shy away, though. It expanded the size of its body, making itself become a giant, goliath-sized beast. The crocodile now looked like a scrawny lizard, and so Golden Growler stepped on it.\n\nGolden Growler, by this point, had seven of its gene locks opened. Han Sen had fed it much super flesh and many waterdrops to nurture its growth over time. But the speed at which it had developed was surprising, even to Han Sen. And the size it could grow to, if it so chose, was rather shocking to witness.\n\nGolden Growler had as many gene locks open as Han Sen did with his Dongxuan Sutra. Its primary talent was its ability to grow bigger, just as it had been back in the First God’s Sanctuary.\n\nBut now, size wasn’t everything. The bigger it grew, the stronger it became. And this scaled with how many gene locks it had opened, too. When Golden Growler opened its seventh gene lock, its vitality exceeded Han Sen’s.\n\nThis didn’t surprise Han Sen, though. Golden Growler was special, as most creatures of the First God’s Sanctuary did not possess an ability. But Golden Growler could grow bigger or smaller on a whim, so Han Sen had to wonder if it actually was a super creature from the First God’s Sanctuary.\n\nWhen Little Angel ate the other Golden Growler’s flesh, she was able to evolve. It was a plausible theory.\n\nRegardless of its origins, however, Han Sen thought it to be a remarkable thing that Golden Growler could evolve and become better. Golden Growler had seven of its gene locks open, but it was now fighting a super creature with nine gene locks open.\n\nThe mouth of the creature Golden Growler had stomped on was frightening, but all the teeth in the world couldn’t harm Golden Growler now, due to its size. When it was bitten, it was like a small nip, and no pain was felt.\n\nBut for a creature with seven gene locks open, engaging with a creature with nine gene locks open was difficult. Golden Growler could not dish out a grand amount of damage, at all.\n\nBut what it could do was still shocking enough to see, anyway. Golden Growler was a mount beast soul, so fighting was never expected to be its forte.\n\nYet still, it was able to hold its ground against a super creature. It was shocking. But Qin Xuan was more shocked than all, right now. The impacts and shockwaves were difficult for her to withstand, as they fought.\n\n“Are creatures in the Third God’s Sanctuary always this strong?” Qin Xuan was amazed, despite being a little worried. The first creature she had encountered just so happened to be a super creature.\n\nHan Sen placed Golden Growler back in his Sea of Soul. It had grown too big, and he didn’t want anyone to see it. Not wanting to waste any time, though, he summoned Little Angel and Disloyal Knight.\n\nDisloyal Knight used a halo to debuff the creature and buff Little Angel to become stronger. Little Angel swung her sword and left a deep, few-meter-wide cleft across the monster.\n\nThe monster screamed, prompting Disloyal Knight to dash forward and strike the beast’s jaw and send it flying.\n\nLittle Angel flew towards it and chopped it to bits within the blink of an eye.\n\n“Super Creature Abyssal Beast killed. Beast soul gained. The flesh of this creature is inedible, but you may harvest its Life Geno Essence. Consume its Life Geno Essence to gain zero to ten super geno points randomly.”\n\nHan Sen was delighted, not expecting to achieve another super beast soul so soon."
}