{
    "chapter": 2410,
    "title": "Stream of Swords",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2410",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe huge furnace’s appearance caught Han Sen completely off guard. He quickly shoved as much power as possible into his Dongxuan Area. It was impossible for him to completely stop the Swords from the Furnace and the fire area. This giant copper furnace was a genuine half-deified beast. It was probably only one small step away from being deified. It was almost stronger than Dragon One.\n\nBut, thankfully, it didn’t have substance chains, so it couldn’t be a real deified.\n\nThe Dongxuan Area couldn’t completely seal power, but it still affected the universal cogwheels. It made the universal cogwheels spin slower, which led to a reduction in power.\n\nPlus, with the Move Mountain Area, Han Sen wasn’t really afraid of that stream of swords, though they did look very scary.\n\nDong!\n\nHan Sen waved the Sword from the Furnace that was in his hand and knocked away a bunch of the raining swords that were coming dangerously close. But ultimately, the sword rain was too much to defend against, and each one of those swords wielded a frightening power. Each attack came with the strength of a half-deified creature.\n\nA blade hit Han Sen, cutting open the Dongxuan Armor. Fortunately, Move Mountain Area was able to absorb a lot of power from the attacks it had sustained. It was able to shrug off the attack of a half-deified being. The sword rain could leave deep scratches in the Dongxuan Armor, but it couldn’t pierce all the way through.\n\nBlade after blade slammed into the armor. It was like a flash flood. Each one kept left a scrape across the armor’s surface. The strikes got dangerously close to Han Sen’s flesh, and he almost yelled out in alarm.\n\nThe waterfall of swords kept pounding Han Sen’s body. Under such violent attacks, this King seemed just as threatening as a deified xenogeneic.\n\nWhile the deified bug Han Sen had fought was incredibly powerful, it didn’t have any ranged attacks, so the Kings with Han Sen still had a chance to run away.\n\nBut beneath this sword rain that blanketed the sky, there was nowhere to run. No matter how strong a person’s defenses were, getting continuously struck by that sword waterfall would eventually lead to him getting perforated. It was the same principle Han Sen had been counting on when he attacked the copper furnace.\n\nBut this stream of attacks wasn’t made up of water; it was composed of swords wielding half-deified power.\n\nIf it was anyone else, with any different type of area power, they would have died within the first messy barrage of that stream of swords. Even their bones would have been crushed.\n\nLuckily, Han Sen had his Move Mountain Area for protection. As all those sword streams came down on the Dongxuan Armor, they provided an incredible buff to the armor’s defensive properties.\n\nAs long as the first few attacks didn’t break the Move Mountain Area, using the Dongxuan Armor as the carrier made him invincible.\n\nThe small copper furnace flew over to the big copper furnace. The mouth of the furnace kept spitting out fire as it made a pitiful whining noise. It seemed to be telling the big copper furnace of its woes.\n\nAfter the big copper furnace heard what it was told, it became enraged. It released a wave of green fire that looked like it could incinerate a planet. The fire area came down and covered the Swords from the Furnaces.\n\nThe swords received the fire area’s buff, and their powers rose to a terrifying level.\n\n…\n\nDragon One was flying through space. After Dia Robber left, he went around, following in the direction Han Sen had gone. He kept on the move, but he didn’t see Han Sen.\n\nHan Sen had been traveling fast, clearly intending to kill as many xenogeneics as possible. Dragon One and Dia Robber had talked for a while before going their separate ways. It made sense that Dragon One had yet to catch up with Han Sen.\n\n“Moving forward more leads to the core furnace zone. The strongest core furnace is half-way to being deified. It doesn’t have its own substance chain yet, but it is stronger than most half-deified beings. And there are scary swords inside that furnace. Many Kings and half-deifieds have confronted it, but none of them have been able to kill it. I wonder why Dollar is headed there. Is he going to fight the core furnace alone?” Dragon One looked forward and frowned.\n\nHe was still traveling forward, but he suddenly glanced over his shoulder. He saw a shadow coming toward him.\n\nDragon One watched it suspiciously, and when he saw the person clearly, he raised an eyebrow in surprise. “Dia Robber?”\n\n“What a coincidence. We meet again so soon!” Dia Robber smiled and flew towards Dragon One, stopping right before him.\n\nDragon One and Dia Robber looked at each other. They were both smart, so they both knew what the other wanted.\n\n“Dia Robber, if you quit now, we will leave Exquisite Mountain. It will belong to you and the other Destroyed,” Dragon One offered quietly.\n\nDia Robber laughed. “Dragon One, give me Dollar. We do not want Exquisite Mountain. The Dragon can keep it.”\n\n“It looks like we will have to employ our own tricks,” Dragon One said with a feral grin.\n\n“No matter what, Dollar will belong to the Destroyed,” Dia Robber responded coldly.\n\n“Even if that is what you want, he might not go with you,” Dragon One countered.\n\nDia Robber started to say something, but then he noticed some green flames far in the distance. The light reflected off of clouds of dust that had risen from the turmoil, and countless swords could be seen flying against the dusty backdrop.\n\n“Dollar went to the core furnaces?” Dia Robber’s face changed.\n\nDragon One frowned. “It seems that way.”\n\nDia Robber’s face changed, but in the end, he laughed and looked at Dragon One. He said, “He really dares to go in there? Does he want to kill the core furnace? Not bad. Now we can gauge how strong he is. You will want to know as well, right?”\n\nDragon One had a wry smile. He and Dia Robber were thinking the same thing. They both wanted to use Dollar’s powers to fight the core area’s deified xenogeneics.\n\nThe core area’s deified xenogeneics were a very large prize. Because no deified could enter this place, claiming that prize was a very difficult process.\n\nMany different elites of varying races had attempted to bring down core deifieds, but they all had failed. Even the Extreme King had to rally many half-deified people to pull off such a hunt.\n\nThe Dragon and the Destroyed had achieved some modicum of success in the past, but they had to rally many half-deifieds in their attempts. That also meant they lost a lot of people in the battles, and when the benefits were split among those who remained, there was never much for each person. Nothing to compensate for the danger and losses incurred.\n\nTherefore, over the past few years, there hadn’t been many chances to hunt deified xenogeneics.\n\nThe strength of deified xenogeneics varied widely, and the weaker variety were generally targeted by hunters. Once those deified xenogeneics were killed, only the strong deified xenogeneics remained, and over time, those monsters became even stronger. Killing them was now a much harder endeavor than it had once been.\n\nLike the weird bug they recently encountered; it was a powerful deified xenogeneic. Even if they gathered many half-deified elites, there’d be a very low chance of actually taking out that horrifying creature."
}