{
    "chapter": 2885,
    "title": "Crystallizers Light Up a Lantern",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2885",
    "text": "“To make your race extinct,” Han Sen coldly said.\n\nBurning Lamp’s expression changed. He seemed to restrain his simmering anger as he frowned and asked, “Mister Han, are you here because of what happened? We Buddha can be reasonable.”\n\nAfter that, Burning Lamp laid out some items. Among the items was a Teeth Knife. The beast from which the teeth came was unknown. He said, “I know you are angry about what happened, but the knife blank was destroyed while refining it. This knife is a Tiger Teeth Knife. It came from a deified xenogeneic from the west called Space Tiger. Its teeth were used to make the knife. It is not a bad deified weapon. It matches with the Teeth Knife you use. This is a gift from the Buddha to you. I hope this can let bygones be bygones.”\n\n“Burning Lamp, the causal karma knife you used comes from my knife blank.” Han Sen looked like he was smiling at Burning Lamp, but he was not smiling.\n\nBurning Lamp’s face did not change. He coldly said, “You think too much. Mister Han, it was just a knife blank. How else could we make a true god weapon? That was a holy item the Buddha spent a lot of effort making. It is our race weapon.”\n\n“Burning Lamp, do not say I haven’t given you a chance,” Han Sen said. “In addition to the true god material, give me the causal karma knife and true god weapon you received from the geno god list. Only then can we let bygones be bygones.”\n\n“Do not be ridiculous!”\n\n“Who do you think you are? Very High Leader or Golden Growler?”\n\n“Mister Alpha, there is no need to talk to a prick like this, who does not know his place. He destroyed our protective Buddha light. We should kill him.”\n\nAll the Buddha Kingdoms Kings were incredibly mad. They thought Han Sen’s demands were too much.\n\nBurning Lamp’s expression turned cold. He looked at Han Sen and said, “In respect to Knife Queen and Sky Palace, if you go now, I will pretend you were never here. If you are really going to be this ridiculous, then do not take it out on us for being cruel.”\n\nHan Sen knew this was going to happen, so he icily said, “Burning Lamp, I have just given you and the Buddha a chance, but you are too greedy and have not cherished it.”\n\nBurning Lamp wished to say something, but he suddenly saw Han Sen wielding light. It was like a volcano erupting into the sky. It was quickly dyeing the whole of space a weird color. All the stars went dark.\n\n“I… By the name of Han Sen, who is a crystallizer, am going to light up the race lantern.” Han Sen’s voice boomed across the universe. It was like the whole universe was sending his voice out to echo across the dark corners of the cosmos.\n\nAmid the echoing, the geno hall slowly appeared.\n\n“Holy sh*t! The geno hall has appeared again. What is going on? It used to be once every century. Now, it has happened a few times. What is going on in the world?”\n\n“Han Sen is lighting up a lantern for the crystallizers, but every lantern in the geno hall has been lit up. Which race is he going to challenge?”\n\n“Interesting. The crystallizers failed to light up a lantern and were almost entirely wiped out. Now, Han Sen that might offer them a chance of lighting up a lantern. Which race is he going to challenge?”\n\n“Is it still going to be like what the crystallizers originally did? Is he going to challenge one of the bigger races?”\n\n“Godfather Han is lighting up a lantern. This is interesting. With Space Garden’s power, taking down a low-rank high race should not be difficult.”\n\nIn Sky Palace, Yisha was playing chess with Sky Palace Leader. They suddenly heard the echo. They were both shocked.\n\n“This kid is coming out to stir up issues again,” Sky Palace Leader said with a smile. “Which race is he going to challenge?”\n\nYisha looked worried. “It does not matter which race. The problem is that the Very High have been looking for him. If he shows himself now, the Very High might find him. I am afraid that with his anger, he will probably challenge the Buddha. You know what Burning Lamp is like now.”\n\n“That kid is not dumb,” Sky Palace Leader said with a laugh. “If he dared to show up, he must have a plan. There is no need to worry.”\n\nInside a building on the other side of Sky Palace, Yun Suyi’s pretty eyes looked strange. “Han Sen is lighting up a lantern for the crystallizers. Which race is he going to challenge?”\n\nIn the Extreme King, Queen Bai Wei saw Han Sen in space. She looked conflicted.\n\nIn an abyss, the leader looked at Han Sen in space and said, “Crystallizers. They are making a comeback.”\n\n“Lighting a lantern for the crystallizers…” Blood Legion Leader said with a smile. “Han Sen is interesting.\n\nAcross the universe, many creatures were tuning in to watch the fight. At the same time, in the Very High, Exquisite looked worried and said, “When did he come out? He is also showing himself in public and wants to light up a lantern. He is just asking for my people to catch him.”\n\n“Do not worry, Big Sister. He must have a plan if he is going to do this.” Li Keer tried to offer her comfort.\n\nExquisite practiced Very High Sense, but she could not help but worry. “I am not worried about whether or not he can light up the lantern. Even if he does, with the involvement of our people, he won’t succeed. He really shouldn’t have shown himself now.”\n\nEvery race looked into the sky. They saw Han Sen standing in front of the geno hall. They were curious to learn which race he was going to challenge.\n\nThe faces of Burning Lamp and the Buddha turned pale. They knew which race Han Sen was going to challenge, but they did not dare believe it.\n\nNo matter how famous Han Sen was, this was just because of his blessing skill. With his real power, he was nothing compared to Burning Lamp, who was ranked 80th on the geno god list. It was hard to believe Han Sen would dare challenge the Buddha.\n\nThe geno hall was completely visible. Han Sen pointed his finger. His finger had a drop of blood on it. The blood was going to the geno hall’s gate.\n\nWhen the blood got close to the geno hall’s gate, the gate doors opened up. The doors were wide open. All the lanterns of all the races were shining in the geno hall. They shone across the whole universe like it was daytime.\n\nEveryone in the universe stared at Han Sen and the opened geno hall doors. The lanterns were shining inside. This proved the geno hall had approved Han Sen’s challenge. Now, it all depended on which race he sought to challenge.\n\nHan Sen looked at all the lanterns, which were burning brightly. They were like beasts staring at him with hungry eyes.\n\nHan Sen’s face did not change. He moved his lips and said one word, “Buddha!”\n\nWhen Han Sen spoke that sole word, the other lanterns seemed to dim. Only one lantern blazed fiercely, and its light became brighter. It flew out of the hall with a murderous aura."
}