{
    "chapter": 1829,
    "title": "The Knife That Destroys the Sky and Earth",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1829",
    "text": "After the eleventh knife rain, there were so many knives on the ground. They were all over the place, and there was hardly a place to step.\n\nHan Sen’s feet walked across the handles, and Black Steel was standing in front of a knife. Han Sen thought the knife looked fairly normal.\n\nBut Black Steel looked surprised. He pulled it out carefully and held it with both hands. He happily said, “This is a Duke weapon!”\n\n“It doesn’t look like one.” Han Sen saw the dim-looking light of the blade, and felt impartial towards it.\n\n“We are in the Knife Grave. It is still sleeping, mind you: the power is suppressed. Once you leave this place, you’ll be able to see how great this is.” After that, Black Steel gave the knife to Han Sen. “The knife you have wanted me to find you is this. Now, we no longer owe each other anything.”\n\n“You don’t want it?” Han Sen waved it around a bit. It felt great, but Han Sen was not wholly satisfied.\n\n“There is still a lot of time to go, so there is the chance I’ll be able to find another.” Black Steel continued walking. He didn’t look back once.\n\nHan Sen followed Black Steel for a long time, and marveled at the amount he knew about the place. After the eleventh knife rain, there were many more higher-tier weapons on the ground. But finding something of Duke class was still not a simple task. Aside from having the ability to spot one, you’d need more than a modicum of luck.\n\nOn that giant planet, which was covered in millions of knives, finding a Duke weapon would be harder than finding a needle in a haystack.\n\nThere were more higher-tier knives, but the ordinary ones still rained in countless numbers. The ratio of good knives and bad knives didn’t change, though. There were just more of both.\n\nBlack Steel had randomly given Han Sen the Duke knife, which had surprised Han Sen.\n\nThe land was wide. Han Sen and Black Steel were like two ants, afloat in a sharp sea. Knives were everywhere, and the sight of them made Han Sen’s eyes go funny.\n\nHan Sen swore he had never seen so many knives in his life before.\n\nTime passed, and Black Steel was unable to find another Duke knife. He hadn’t been able to find a Marquise one, even.\n\nIt looked like the Duke knife had exhausted both of their luck.\n\nBoom!\n\nThe ground began to rumble as the volcano of knives began to rattle and shake again. The pillar fired up into the sky and illuminated the clouds. It made the sky look like an ocean of lava.\n\n“Again!” Han Sen shouted at Black Steel. He pulled out the Duke scimitar and looked up at the crimson clouds.\n\nBlack Steel raised his head and stood up straight. He was holding two knives now. One of them was the horse knife, and the other was a short knife. The latter was an Earl weapon.\n\nBoom!\n\nThe lava in the sky rumbled and roared like thunder. The knives came soaring down, dripping with the steel juice of their origin.\n\nThe sky was filled by what looked like an endless display of meteors.\n\nHan Sen looked grim. They were all Viscount weapons, and they were accelerating as they descended to the ground with full power.\n\nHan Sen was holding a Duke weapon, but its power was asleep. Han Sen needed his power to activate it. But being the Baron he was, there was a limit to what he was able to do. So, all he had to rely on was the sharpness of the blade itself.\n\nIn the eleventh rain, Han Sen had seen how powerful a Viscount’s sword could be. He and Black Steel had barely managed to hold on and make it through. This knife rain was much scarier than the eleventh, though; that much was for certain.\n\nPang! Pang! Pang! Pang!\n\nAll the knives came racing down like a barrage of infinite missiles. They annihilated the earth, as countless knives shattered into pieces.\n\nThe scariest thing about all of this was how the knife rain was falling. It wasn’t a shower; it was a fuH-on heavy rain that did not seem to relent.\n\nHan Sen was waving his Duke knife. He clutched it tight, swinging at every knife that looked set to land on him. His finesse insured none touched him.\n\nBut Han Sen only had one knife, and he did not have a shield. He cut the knives that were raining down from directly above, but he wasn’t able to cut the ones that were in his proximity.\n\nThe falling knives exploded when struck, shattering. Many were broken, scattershotting Han Sen. They gave him a number of cuts, proving his Baron armor could not stop them.\n\nBlack Steel was faring much worse, though. Han Sen had mutant blood power, so his wounds would not bleed. If he hurt his skin, he could still keep going. But Black Steel could bleed, and he was soaked with the many lacerations that covered his body.\n\nThe knives rained down like a bombing run. It was scarier than the blitz. At least bombings sometimes provided a gap or berth to breathe: these knives wouldn’t stop for a moment\n\nHan Sen’s Duke knife was sharp, but hitting those knives made his arm numb. His hands slowly began to crack.\n\nThe knife rain, after lasting ten minutes, showed no sign of stopping.\n\nHan Sen and Black Steel were fighting the knives back-to-back. They both held a side, and slowly, things began to get better.\n\n“This knife rain is lasting too long! We can’t hold on. We have to leave!” Han Sen shouted, as he continued slashing and slashing.\n\n“You go first! I haven’t found the knife I am looking for,” Black Steel said, while swinging his knife like a madman.\n\n“I’ll give you mine, and I’ll take any,” Han Sen said.\n\n“It’s yours, not mine,” Black Steel said calmly.\n\n“Are you crazy?” Han Sen kept swinging his knife.\n\n“You leave first,” Black Steel insisted, continuing to wave his knife.\n\n“F*ck no!” Han Sen slashed, cutting through a number of knives that were about to skewer his head.\n\nBoom!\n\nThe sky trumpeted with thunderous sounds again. The lava in the sky seemed to explode. The rain poured from the sky. Knives! Countless knives!\n\nThe knives came down like a torrential flood. They streamed down from above with the strength of a raging river. It’d be enough to destroy the sky and earth."
}