{
    "chapter": 144,
    "title": "Do You Want to Know",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_144",
    "text": "\"Now you can disappear, right?\" said Han Sen while drinking water.\n\n\"Boy, don’t be too arrogant...\" exclaimed the thin man.\n\n\"Go,\" Li Yufeng stood up and said.\n\nWatching the group going away, Han Sen was then able to focus on his food.\n\n\"How did you do that?\" Ji Yanran looked and Han Sen curiously and asked. She trusted her own judgment, and the spitball should be under the middle cup originally.\n\nWhat she did not understand was when Han Sen retrieved the spitball from the middle cup and placed it in another cup. She did not see how he did it.\n\nHan Sen just smiled at Ji Yanran and said faintly, \"It’s a secret.\"\n\n\"Big deal. You must have used some cheating method as well,\" Ji Yanran said, pouting.\n\n\"You show me how I cheated then,\" Han Sen blinked and said.\n\n\"I don’t know how to cheat,\" Ji Yanran said, with her gaze on the three cups, wanting to know how Han Sen did it.\n\n\"If you really want to know, I can tell you on one condition,\" he said.\n\n\"What do you want me to do?\" Ji Yanran looked at Han Sen vigilantly.\n\n\"Since you are my girlfriend, shall we go to dinner and movie sometime?\" Han Sen suggested with a smile.\n\nJi Yanran stared at Han Sen and said, \"Who is your girlfriend? If you say that again, I won’t be polite anymore.\"\n\n\"So, you do not want to know?\" Han Sen was not the least scared by the ferocious look on her sweet face.\n\nJi Yanran paused. She really wanted to know how Han Sen did it. The members of Hand of God Society were always playing this game, the key factors of which were speed and eyesight. If she could learn the method Han Sen had used, she would be invincible in this game.\n\n\"Just a meal and movie?\" Ji Yanran blinked and asked.\n\n\"Yes.\" Han Sen laughed.\n\n\"Well, that’s fine. Now tell me how you did it?\" Ji Yanran hesitated and said.\n\n\"In fact, it is very simple. As long as your hand is fast enough, you can do it with some special gestures.\" Han Sen did not lie. He was simply using Sleeveblade.\n\nBut his hand was too fast and his movements too subtle, so Ji Yanran could not have seen how he had managed to do it.\n\n\"If you won’t tell me the truth then forget it.\" Ji Yanran refused to take Han Sen’s word for it, as she did not believe that he was that fast.\n\n\"If you do not believe me then there is nothing I could do. I’ve said all I could. Don’t forget about the dinner and movie tomorrow,\" Han Sen shrugged and said.\n\n\"I promised you dinner and movie, but did not say when. In a hundred years, liar!\" Ji Yanran spit out her tongue at him, chuckled and left.\n\nHan Sen had intended to practice operating warframes before Starry Cup began. However, Lin Beifeng told him excitedly that he had discovered a nest full of mutant creatures, which Lin could not take care of alone and asked Han Sen to hunt with him.\n\n\"Sen, hurry. Teleport now and we could split the mutant creatures fifty fifty.\" Lin Beifeng did not dare to go alone and was reluctant to cooperate with any of the gangs. If he did that, he might not even be able to get 30 percent.\n\nAfter all, he only provided a location, and in accordance with the rules, if he did not contribute anything else, all he could have was 30 percent.\n\n\"How long does it take?\" Han Sen hesitated. The Starry Cup will begin in a few days. He had promised Fatty that he would go. It was also his idea to apply for all the items, so it would not make sense if he missed it.\n\n\"It’s not far. Just in the southern mountains. With mounts, it would take us less than a day.\" Lin Beifeng quickly said.\n\n\"Fine, wait for me at the gate of Steel Armor Shelter. I will be there.\" Han Sen was very interested as he only had 52 mutant geno points and wished to gain more.\n\nHan Sen used the school's teleport station to enter the shelter, and saw Lin Beifeng walking around the gate in circles, looking very anxious.\n\n\"My brother, you finally come. Let’s go now.\" Lin Beifeng grabbed Han Sen the moment he saw Han.\n\nThe two summoned their mounts and marched into the southern mountains. Han Sen saw that Lin Beifeng was still riding a primitive mount and laughed, \"Lin, why are you still riding a primitive mount?\"\n\n\"Mutant mounts are very rare. I have been looking but no one was selling.\" Lin looked at the mutant three-eyed beast Han Sen was riding admiringly.\n\n\"I have one. Are you interested?\" Han Sen was ready to sell the mutant horned sand fox mount since he had no use of it.\n\n\"You should have said so earlier. What kind of mount is it? Show me!\" Lin quickly said.\n\nHan Sen summoned the mutant horned sand fox. Lin fell in love with the strong white fox and said, \"Sen. I will take it. Name your price.\"\n\n\"Do you have S-Class license of Saint Hall?\" Han Sen asked.\n\n\"Those are hard to come by. My family had some, but we have used them up,\" Lin said helplessly.\n\n\"Alright, then I will take a larger share of the mutant creatures this time,\" Han Sen pondered and said.\n\n\"No problem, but they all seemed to be the same type of creatures and it does not do anything if you eat too many.\" Lin looked at Han puzzled, not understanding why he would want so much of the same kind of meat.\n\n\"I'm not eating them myself, but feeding a pet.\" Han Sen summoned his golden rock worm king.\n\n\"Feeding a pet with mutant meat… How extravagant!\" Lin saw the golden little worm in Han’s palm and asked, \"It must be a mutant pet?\"\n\n\"Guess again,\" Han Sen said with a smile.\n\nLin Beifeng suddenly widened his eyes. \"This is a sacred-blood pet?\"\n\n\"Why not?\" Han Sen said.\n\n\"Wow, Sen, you are so awesome that even your pet is sacred-blood.\" Lin Benfeng thought about it and said, \"So I will take this mutant beast soul mount. No matter how many mutant creatures we hunt, I will only take five and the rest are all yours.\"\n\n\"Cool,\" Han Sen agreed right away.\n\nWhat Lin Beifeng found was a large nest of mutant creatures and it would not be a bad deal."
}