{
    "chapter": 1267,
    "title": "Dragon Fish",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1267",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe fish king’s gold body was unable to prevent the advance of the skeletons. The now-bony fiends were transparent, and the fish was unable to strike or even touch them. But when they tried biting into the fish king, they were able to sink their teeth into its flesh and rip out small chunks.\n\nThey were like a swarm of little maggots, all converging on the fish king to nibble it to death. As they all bit into it, they dyed the surroundings red with blood.\n\nThe fish king wanted to rid itself of the skeletons that sought to eat it alive, but there was nothing it could do.\n\nIts scales could do nothing against the skeletal fairies, as they straddled a line between the physical and supernatural. They could not be touched by others, but they could touch anything they desired.\n\n“The fish is almost done for. Is now the time we should strike?” Yaksha asked aloud.\n\nThe empress seemed unconcerned, and replied, “Do not underestimate a creature with ten gene locks open. They are stronger than you might imagine.”\n\nYaksha knew the fish king could not be killed so easily, and he was actually trying to usher the empress into attacking. If he did that, he could find his best chance to Judas her.\n\nWith the empress not yet willing to budge, Yaksha could do nothing. He returned to silence and waited.\n\nThe fish king then suddenly roared. Its body began to shine like a beacon of gold light as it grew in size. Large talons decked the feet that then sprouted out of the fish, as its entire body took the form of a dragon.\n\n“It is no wonder Yaksha called it a flying dragon fish!” Han Sen was shocked, witnessing the fish’s transformation.\n\nThe dragon’s head turned, shooting hot air at the skeletons that swarmed its new form. The skeletons were turned to dust by the power of that gust. Then, the fish king turned around, ready to swallow the fruit it had long lusted for.\n\nThe fairies all around the fruit were dead, and now there was nothing prohibiting the dragon fish king from consuming that which it had come for.\n\nThe bell-looking fruit then shone green.\n\nThe dragon fish king suddenly roared and fell backwards, all the way down into the lake below.\n\nAs it fell, its body returned to that of a fish.\n\nPang!\n\nThe fish king’s impact with the water created manic waves, as its blood turned the lashing waters of the lake red.\n\n“What are you waiting for?” The speech of the empress was directed towards the man.\n\nThe man then stood up and approached the dried-up waterfall.\n\nThe man was going to climb the whole way up.\n\nHan Sen was shocked, and he thought to himself, “He doesn’t know how to fly? How is that possible?”\n\nThe man climbed the treacherous cliffside slowly.\n\n“Who is that guy?” Yaksha asked.\n\n“He is the one who will collect the fruit. You should go and help him,” the empress directed. She remained seated on the throne as it began to move towards the lake. She was going for the fish king.\n\nYaksha was delighted, thinking he now had a chance of grabbing the fruit.\n\nHe had been worried earlier. If he had to steal the fruit alongside the empress, he’d have difficulty nabbing one. If the only thing that stood in his way was a human—one who couldn’t fly, at that—there was nothing really stopping him.\n\nYaksha was fairly confident he could collect the fruit the fish king had just approached. The fish king had triggered the Aqua Gas, so it was no longer a threat.\n\nSeeing the empress head for the lake, Yaksha summoned his wings and followed after the man.\n\nYaksha flew around the man, saying, “The empress instructed me to help you. How do you plan on reaching the fruit?”\n\nYaksha was not keen on the man, but there had to be a reason for him being there. The man must have had something the empress wanted, so Yaksha wanted to find out exactly what that was.\n\nThe man continued to climb, simply stating, “I will climb up here, and then I will climb up there. I will reach for the fruit with my hands, and with my hands, I will pick up the fruit. I will then climb down from there, and climb down from here.”\n\nYaksha thought he was talking crap, but he just smiled and said, “The fruit is a dangerous item. How exactly do you plan on grabbing it?”\n\n“She told me I can pick it just as easily as I would an apple,” the man said.\n\nYaksha was getting annoyed with the man, but he didn’t let it show. He went ahead to say, “Well, you have to hurry. If the fruit manages to build up another cloud of gas to emit, nabbing it won’t be so easy.”\n\n“Don’t you see that I am climbing as fast as I can?” The man gave a smile.\n\n“Don’t you know how to fly?” Yaksha was getting annoyed at the snail-like pace of the man.\n\n“No,” the man said.\n\n“Really?” Yaksha was legitimately surprised.\n\n“Do you see any wings on my back? I don’t,” the man said.\n\n“Well, you take your time climbing this rockface like a sloth. I am going to go on ahead and grab the fruit for our empress.” Yaksha then departed, going upwards.\n\nThis was his best chance. It was a now-or-never moment. Once he had one of the fruits in his hand, he could pocket it and run. Yaksha did not think the empress could catch up with him, with the headstart he’d get.\n\nWhen the fish king fell, Han Sen had snuck into the water to get a peek at its injuries.\n\nHan Sen dived in deep, and when he approached the fish and got a good look, he was quite surprised at what he saw."
}