{
    "chapter": 2334,
    "title": "Blood Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2334",
    "text": "King class was divided into nine different tiers. Becoming half-deified required a person to break through all nine tiers. A further barrier had to be surpassed before someone could become fully deified.\n\nInstead of being recognized separately, these nine tiers were typically just grouped under King class, however. The power of a King’s area-of-effect grew with each tier that was surpassed.\n\nThe blood kirin had completed all nine tiers; it was half-deified, after all. Prince Swordstar’s guard was a half-deified elite, too.\n\n“How dare you behave so poorly in front of a prince!” That half-deified guard made a cow’s mooing sound. He then released a yellow king area, which overlapped with the blood kirin’s blood area. The guard lifted the axe in his hand and ran forward to strike the blood kirin.\n\nThe blood area combined with the yellow area, and both guards were affected by each other. A sudden weight fell across the blood kirin’s body, as if it had suddenly shouldered the weight of a mountain.\n\nThe yellow area was associated with the element of earth, and it created earth elemental pressure within its zone. Kings with poor bodies could very well find themselves crushed by that pressure.\n\nAs the blood kirin was pressed down by the earth power, the guard’s axe came towards the creature like a mountain. It was aimed to come down on the blood kirin’s head. The power exerted would have been enough to cut an entire planet in half.\n\nRoar!\n\nThe blood kirin roared. Instead of trying to avoid the strike, it used its own horn to block the falling axe.\n\nBoom!\n\nThe blood and yellow powers surged against each other. The blood kirin’s horn was able to block the big axe, keeping the axe aloft.\n\nThe half-deified guard roared. He struggled to push his big axe down further, as the two powers kept crashing against each other in the area.\n\nHan Sen and Prince Swordstar watched the two from afar. Suddenly, a massive red and yellow explosion rocked the area. The blood kirin was able to get past the half-deified guard.\n\nWhen the light of the explosion faded and the onlookers could see again, they immediately noticed that the blood kirin’s neck scales were torn. There was a huge cleft across them, and the blood kirin’s blood began to drip slowly down its chest.\n\nThe chestplate of the half-deified guard’s armor had also been broken. He had been cut, and he was bleeding, as well.\n\n“Very strong body! You did not die after taking a blow from my Open Sky Axe, but still, you will die today,” the half-deified guard shouted fiercely. His Open Sky Axe produced a scary light, and it came swinging at the blood kirin again.\n\nThe blood kirin lowered its head. Its eyes looked red. Then the eyes grew darker and darker, until they ended up looking black.\n\nHan Sen understood the blood kirin well, and he knew now that it was really angry. Its blood air was about to go mad. It was like a nuclear bomb that was on the verge of detonating.\n\nAs the half-deified guard sprang toward it, the blood kirin did not dodge. It raised its head and peered at the guard. The blood air in its eyes was about to erupt like a volcano.\n\nBlergh!\n\nThe power from the blood kirin’s eyes didn’t explode out as Han Sen had expected. The other guard’s chest suddenly started to rupture with blood.\n\nHis Open Sky Axe didn’t come down as planned. Blood spurted from his wound like a spring, and everyone watching the fight looked on in shock. The half-deified guard quickly tried to cast a power to stop his loss of blood.\n\nBut it was a futile effort. Blood still streamed out of his chest, then turned into a mist and drifted straight over to the blood kirin, where the blood kirin promptly absorbed it.\n\nThe wound on the blood kirin’s neck soon closed up as if it had never existed.\n\nThe blood kirin roared like a lion. It became a blood shadow, then flew over to the half-deified guard.\n\nThe half-deified guard was bleeding, and his face looked shocked at the turn of events. He roared in response and swung his Open Sky Axe at the blood kirin once more, desperately trying to slash the incoming blood kirin.\n\nThe blood kirin made no attempt to evade the big axe, and neither did it try to use its claws to block the blow. The beast allowed the axe to slam into it and cut a deep crevice across its scales. At the same time, though, the blood kirin’s talons touched down on its opponent.\n\nAs the guard screamed, his blood sprayed like a geyser.\n\nThe murderous blood kirin ignored the frantic blows of the axe, using its scales to absorb the strikes as its claws continued shredding the guard’s armor and tearing up his flesh.\n\nThe blood kirin’s claws left marks all across the knight, and blood spilled ceaselessly from his body. His blood was like a volcano, and nothing could stop that eruption.\n\nHan Sen grinned as he watched. The blood kirin’s blood area was a very scary ability. Han Sen was fortunate that the blood kirin was not his enemy.\n\nInstead, when the guard hit the blood kirin with the big axe, it was now able to heal so quickly.\n\nAfter a moment, the half-deified guard was broken. He screamed continuously as he tried to scramble away, but under the grip of the blood kirin’s blood area, he had lost too much blood. His powers were now weak, and he no longer had the strength to run.\n\nThe blood kirin was like a wolf. It was like a tiger. It leaped over towards the man, then ripped off his arms and swallowed them. Crunching noises came from the creature as it savored its snack.\n\n“Prince! Save… save me!” the half-deified screamed to Prince Swordstar.\n\nPrince Swordstar felt a bitter chill strike him after watching all this. The cruelty of the blood kirin shocked him and all the other guards.\n\nBefore Prince Swordstar could say anything, the blood kirin picked up the guard in its mouth and ate him whole.\n\nA half-deified elite had been completely swallowed by the blood kirin. The man’s last scream still echoed in the ears of the horrified audience.\n\n“Bai Yi… You killed my guard…” Prince Swordstar looked very ill. His eyes stared blankly ahead.\n\n“It was just a guard, and he died. What’s the big deal? If you are not happy about it, the blood kirin is willing to hear your complaints. Go and kill it, if you dare,” Han Sen replied flatly.\n\n“You…” Prince Swordstar’s face had darkened. He wasn’t half-deified. He only had two half-deified guards in his employ, and now one of them had been eaten by the blood kirin. Sending another one into the fray would not help.\n\nOther princes and princesses watched the fight from afar, looking jealously at the blood kirin.\n\n“I didn’t expect that Han Sen’s xenogeneic would be so strong; it is like it is deified already! I cannot believe that *sshole Bai Yi was able to claim it.” When Bai Ling Shuang saw the blood kirin’s performance, the sight made her grumble angrily.\n\n“If you have nothing else to say, Brother Forty-Seven, then I best be on my way.” Han Sen mounted the blood kirin again and looked at Prince Swordstar with disdain. Then he headed towards the king tree.\n\nPrince Swordstar’s face kept cycling through a number of emotions, but he let Han Sen go and did not press for another fight.\n\nPrince Swordstar wasn’t willing to continue the contest, but Bai Ling Shuang and the other royal children still followed Han Sen. They could see he was getting close to the king tree.\n\n“Is he going to practice in front of the king tree?” Bai Ling Shang frowned, her expression turning strange.\n\nHan Sen thought he would find more primary root king dragons closer to the tree, but that wasn’t the case. The ground closest to the king tree was different, and normal royal children wouldn’t dare to approach it. That was why Bai Ling Shuang looked so disturbed."
}