{
    "chapter": 2479,
    "title": "Tianxia’s Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2479",
    "text": "Han Sen was getting chased by the unicorn Kings. The herd of unicorns was fleeing as fast as they could, so he couldn’t use his eye ability to escape. He frowned.\n\nThe gold unicorn King pursued Han Sen relentlessly. The beast clearly wanted to end him.\n\n“You won’t treat me with any respect unless I show my teeth, huh?” Han Sen thought angrily. He gathered up all the power he had, then he lifted the Thunder God Spike and thrust it toward the gold unicorn’s fusiform area.\n\nDong!\n\nThe area and the Thunder God Spike clashed against each other, unleashing a scary fountain of sparks. The impact ripped the fabric of space. Han Sen felt as if his arms were about to be shaken loose, and his entire body was pushed back by the force of that fearsome power.\n\nHan Sen held tightly to the Thunder God Spike. His Jadeskin power was running at max capacity, but it still wasn’t enough to repel the gold unicorn’s power.\n\nHan Sen used all the might he could muster, and it felt like he was pulling power all the way from his toenails! The Blood-Pulse Sutra was boiling inside Han Sen’s body, and his blood roared through his veins like a runaway train.\n\nBoom!\n\nSuddenly, a force shook Han Sen from the inside out. He could sense an invisible cogwheel in front of him. His body was the center of the cogwheel—the big red cogwheel.\n\n“The Blood-Pulse Sutra is going to become King class!” Han Sen was shocked. He hadn’t expected the Blood-Pulse Sutra to level up without an enormous amount of conscious effort on Han Sen’s part.\n\nThe Blood-Pulse Sutra’s self-cogwheel started to spin. It did so in unison with other cogwheels of the universe. Because Han Sen’s body was in motion, he couldn’t open the universal core hall’s door.\n\nBut after the Blood-Pulse Sutra’s self-cogwheel moved, Han Sen noticed something strange.\n\nThe other self-cogwheels that Han Sen had spun could push the universal cogwheels around them. Jadeskin’s cogwheel could push seven, and the Dongxuan Sutra’s cogwheel could push many.\n\nThe Blood-Pulse Sutra, though, couldn’t push any of the nearby universal cogwheels. Somehow, though, Han Sen still sensed that many universal cogwheels were connected to it.\n\nHan Sen didn’t understand what was going on, and he had no idea what the area power of the Blood-Pulse Sutra might be. When he activated his Mutant Blood Area, no actual area powers were emitted.\n\nAnd yet, his fitness increased a lot. Fighting the unicorn Kings wasn’t all that difficult for him now. And he was now moving quickly enough to evade their attacks.\n\nPang!\n\nHan Sen spun the Thunder God Spike in his hand and jabbed it into the gold unicorn’s area. Then Han Sen leaped up, dodging another unicorn’s laser light.\n\nLando’s Demon Hell Dragon Tattoo was getting brighter. The scary purple dragon air rising from the tattoo was condensing into substance chains. It became a giant purple dragon upon Lando’s body.\n\nThe Tianxia Unicorn’s face looked grim. The rainbow colors in its eyes flashed repeatedly, as if the universe was dying and being reborn inside them.\n\nLando roared, and a giant purple dragon shook everything around them. It looked as if he was going to swallow the entire world.\n\nThe light in the Tianxia Unicorn’s eyes deepened, combining until all the colors had mixed into a uniform grey. The grey light shot out, heading for the raging purple dragon.\n\nWhen the grey light and giant purple dragon collided, the whole world seemed to go quiet. The powers collided in near silence, and for a moment, nothing seemed to happen. A small vortex appeared between them, then began to expand, growing until it was exerting a powerful drag on everything in sight. It was like space itself was falling into an abyss.\n\nHan Sen and the unicorn Kings were still engaged in battle when Han Sen felt the vortex pulling him toward Lando and the Tianxia Unicorn.\n\nAnd Han Sen wasn’t the only one affected. The unicorn Kings, the fleeing unicorn herd, and even the clouds around them were all being sucked into the vortex. Once they fell inside, they vanished.\n\nHan Sen cast his own powers, but he couldn’t fight off that force of suction that was dragging him in. Not even a half-deified King unicorn could escape it, so the chances of Han Sen escaping it were nil.\n\nSeeing that he was about to be sucked into the dark swirl, Han Sen prepared to return to the sanctuary. Just before he activated his power, though, he felt someone grab his arm and pull him back from the abyss.\n\nHan Sen raised his head and saw that it was Lando who had grabbed him.\n\nPang!\n\nHan Sen heard the sound of something breaking. Under the tremendous power of the vortex, the invisible walls composed of substance chains started to crumble. The walls shattered like glass and began to fall into the abyss.\n\n“Go!” Lando shouted. The arm that was holding Han Sen swung as Lando hurled Han Sen away from the vortex. In the next second, Han Sen found himself thousands of miles away, and he was still flying.\n\nAs he flew back, Han Sen heard a distant shout. The grey light inside the Tianxia Unicorn looked like a laser that could destroy the whole universe. It was being fired at Lando again.\n\nA dragon roar shook space itself, and Lando’s whole body became a giant purple dragon that struck the grey light.\n\nHan Sen watched as the grey light pierced straight through the giant dragon body. The huge form suddenly dissolved into purple smoke.\n\nLando’s body was sent flying, still trailing streamers of that smoke. His body was twitching spasmodically. He was dying.\n\nHan Sen was shocked. He thought Lando had thrown him away because the man believed he could defeat the Tianxia Unicorn. But now, it seemed as if that wasn’t the case.\n\n“Why is he doing this? He doesn’t seem like the sort of guy who would care about the lives of others. Why would he save me moments before losing?” Han Sen kept thinking about it, but he was unable to understand.\n\n“Why should I care? He has nothing to do with me, anyway.” Han Sen summoned his power and added to the force of Lando’s throw, boosting himself away from there.\n\nLando’s body was floating amidst the clouds. The light of the Demon Hell Dragon Tattoo grew faint. It required a lifeforce to remain active.\n\nLando’s lifeforce was fading. He couldn’t support the Demon Hell Dragon Tattoo any longer, and the tattoo fell from his body.\n\n“In the end, I still couldn’t attain that last step.” Lando could see the Tianxia Unicorn coming for him. He could see the unicorn’s eyes glowing grey. A powerful grey beam came from its eyes. Lando looked so calm, though, and it was as if he didn’t care whether he lived or died. It was as if he wouldn’t feel any pain… and he wouldn’t.\n\nHe quietly closed his eyes, peacefully waiting for that final moment to come. To him, death would be a sweet relief.\n\nPang!\n\nThe grey beam broke the sky, but it didn’t break Lando’s body. Something tightened around Lando’s arms. Someone had suddenly pulled him away. The grey beam went right by his body and into the sky, missing him entirely. The power roared past him, an incredible display of strength."
}