{
    "chapter": 2795,
    "title": "Stalemate",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2795",
    "text": "“You know nothing. This is the sky silk picture that was drawn by the Extreme King’s Shadow King. This picture is of the love of Shadow King’s life, but it is a shame that he could not get her. Shadow King saw his lover fly to the sky and break the door. She entered the geno hall, which meant he knew he would never see her again. In his profound sadness, he decided to draw this sky silk picture.”\n\nAfter pausing, Holy Pirate said, “This picture shows how much Shadow King misses her. This is not like an ordinary picture. You can never find a picture that evokes as much emotion as this… What a good picture…”\n\nHoly Pirate did not look at Han Sen as he spoke. He kept inspecting the silk picture and admiring it.\n\n“Did the people of the Extreme King use this picture to exchange with my life?” Han Sen stabbed at a guess.\n\n“You just sit tight here, and I will leave you alone. If you do not be honest with me, I will lock you up.” Holy Pirate did not look at Han Sen. He thought he was so good that Han Sen could never escape him.\n\n“Who are you?” Han Sen asked.\n\n“Have you ever heard of Holy Pirate of the Pirates?” Holy Pirate had a look of pride as he spoke.\n\n“I have heard of the Pirates, but I have never heard of Holy Pirate before.” Han Sen was not trying to make him mad. He had truly never heard of the man. After all, Han Sen did not know much about the universe. For someone like Holy Pirate, if someone had not mentioned him, he would not have known.\n\n“It does not matter if you don’t know. Just sit and wait here.” Holy Pirate said that and then ignored Han Sen. He kept admiring the sky silk picture.\n\nHan Sen tried asking the man a few questions, but Holy Pirate totally ignored him. He was captivated by the silk picture.\n\nHan Sen leaned his head over to get a closer look. He noticed that above cloud nine, there was a temple that looked like a palace. It looked like the geno hall he used to see.\n\nHan Sen sought to ask who the woman in the picture was. After all, she had the power to go to the geno hall. She had to have been a supremely powerful elite.\n\nBut Holy Pirate was completely ignoring him. He was obsessed with the picture. Saliva was almost drooling out of his mouth.\n\nHe had two bites of the fruit. It was very sweet. A warm sensation began to spread inside his body. He thought it might have been something truly special. To Han Sen’s current body, fruit like that did absolutely nothing for him.\n\nThis creepy old man calls himself Holy Pirate. He was able to enter the Space Garden freely. I am afraid his level must be quite high, but I can’t use any power. I do not think I can escape this predicament. Han Sen rolled his eyes. He turned to the Holy Pirate and said, “Can I walk around the valley?”\n\nSeeing the creepy old man ignoring him, Han Sen just walked out. He wanted to figure out where he was.\n\nThe valley was not a big place. Aside from a few wooden houses, there were weird flowers and strange grasses. There were animals everywhere. It was a good place to live a nice, private life.\n\nNot long later, Han Sen reached the valley’s entrance. He looked out and saw something completely different. Yellow sand was everywhere. Beyond the valley was one vast desert wasteland. It was a completely different world to the bosom of that valley.\n\nHan Sen did not fancy leaving the valley, so he returned and walked deeper into the valley.\n\nWhen Han Sen walked to the end of the wooden houses, he saw a mountain wall. It displayed a picture. The picture looked to be one of a chess game that had been left unfinished due to a stalemate.\n\nThis looks like Go, but a Go chessboard only has 19×19 squares. There are many more squares here on this one. Judging from the black and white chess pieces and formation, it really does look like Go. When Han Sen used to practice Heavenly Go, he did some research on Go. He was not a professional, but he could play chess pretty well.\n\nAfter staring at it for some time, he confirmed that its rules were just like Go. The picture displayed an unfinished match that was currently in a stalemate.\n\nIs this Holy Pirate obsessed with chess? Is that why he carved a stalemate on the wall? Is it so he can look at it every day? Han Sen examined it for a while. He deciphered that in this stalemate, the white chess pieces were actually at a greater advantage that could lead to a win. The black chess pieces, on the other hand, looked weak and destroyed. It seemed as if they were going to lose.\n\nHan Sen loved playing chess, but he did not have the mood to play it now. He kept walking further into the valley. It was not long before Han Sen discovered that every now and again, the cliffs and walls displayed a picture of a similar stalemate. When Han Sen walked into the deeper recesses of the valley, he had managed to count 17 of those stalemates.\n\nEvery picture of a stalemate was different. Some of the games were at the very end, whereas others displayed games that had only just begun.\n\nHan Sen thought these games of chess were research samples of what Holy Pirate studied. By inspecting them, they did look like simple games of chess. They did not seem like worthwhile candidates for being scrawled onto the walls.\n\nDoes this mean Holy Pirate actually sucks at playing chess? Is that why he puts such simple chess games on the wall? Han Sen did not think that would be possible.\n\nThe will of the deified elites should have been enough to make them good at Go. Even if they were not particularly talented, there was no way such a simple chess game could not be understood. There was no need to carve an example on the wall and observe them every day.\n\nAside from those stalemates, Han Sen did not see anything else in the valley. He did not dare enter the wooden houses. The whole valley was mostly natural. There weren’t many man-made trails.\n\nWhen Han Sen returned to the wooden house he had emerged from, Holy Pirate had already put away his silk picture. He was lying down on a chair sunbathing. He looked very happy.\n\n“Why… Holy Pirate… Did you put those chess board images on the mountains?” Han Sen tried to frame the question indirectly, hoping to find a way to convince Holy Pirate to start talking about them in a roundabout way.\n\nThe Extreme King hated him a lot. If he was in the Extreme King’s hands, Han Sen did not think he would be safe.\n\nHoly Pirate coldly grunted and said, “If I knew what those chess games meant, I would not be in this place that not even birds will come to sh*t on.”\n\n“What does that mean? Didn’t you carve those chess matches into the wall?” Han Sen looked at Holy Pirate in shock.\n\n“I would not have the time to do that,” Holy Pirate casually said. “They were carved by some old fart. He said if I was able to solve the secrets of the chess games, I could find the treasure he left. I have been studying them for a few decades and still have discovered nothing.”\n\nHan Sen’s heart jumped. He looked at Holy Pirate and asked, “If I can help you solve the secret of the chess matches, will you let me go?”\n\n“Do not waste your time. I have a title in this universe, and it is Chess King. After inspecting it for a few decades and not finding anything, it must have all been a lie concocted by that old far.” He realized he said something he shouldn’t have, so Holy Pirate stopped talking.\n\nHan Sen thought they were just ordinary games of chess. Therefore, he did not examine them closely. After hearing him say that, he thought now might be a good opportunity. Thus, he went back to look at the chess matches.\n\nAlthough he might not have been able to solve the secrets of the chess matches, this was all Han Sen could do for the time being. If he discovered the secrets of the chess games, perhaps he could negotiate with the man.\n\nHan Sen checked out each image once. It was just like the first time he observed them. There was nothing special. There were just 17 different stalemates."
}