{
    "chapter": 2542,
    "title": "Elysian Moon Changing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2542",
    "text": "The two beautiful women looked like flowers made of jade, and Han Sen couldn’t turn his back on either of them. He wasn’t their enemy, so he couldn’t simply choose which one should die.\n\nBut when he thought about the arrogant, perfectionist, blood-thirsty being they combined to become, he knew that he had to do something. It wasn’t just the other races of the universe that would fall under their wrath—eventually, they would go after humans as well.\n\n“What should we do?” Han Sen looked at Gu Qingcheng and then at Elysian Moon. They looked extremely similar to each other. Their presences, however, were different.\n\nGu Qingcheng was mysterious, but she didn’t distance herself from everyone. Elysian Moon was as cold as ice, and looking at her gave people the feeling that they were being shut out. Han Sen could tell the two apart, though, and he would never mistake one for another.\n\nWhen they both combined and became one, their presence was completely different. The woman they made felt like a fairy. She was a being that didn’t care about anything in the world. That coldness was chilling to see.\n\n“Which of us do you choose to kill?” Elysian Moon asked when Han Sen remained silent.\n\n“I’m not killing anyone. To be honest, even if I agreed to kill you, I don’t think that’s something I could make myself do.” Han Sen shook his head.\n\n“Then would you prefer to watch us fight each other to death or die of old age?” Elysian Moon asked emotionlessly.\n\n“That doesn’t matter. I think there might be a road out of this mess. It is worth a try, at least,” Han Sen said hesitantly.\n\n“What road do you mean?” Elysian Moon and Gu Qingcheng looked up with interest.\n\nAfter a moment of thought, Han Sen said, “The aging problem is being caused by the flaws in your genes. If you can fix these flaws, then there is no reason for you to fight to your doom.”\n\nGu Qingcheng shook her head. “If things were that simple, we wouldn’t have been fighting in the first place. My genes are included in Elysian Moon’s spirit stone. And Elysian Moon’s genes contain the sword fairy I created. We both have a part of each other, and because of that, parts of ourselves are missing. We can’t use the genes of other creatures to fix problems that are inherent in our own.”\n\n“I know.” Han Sen nodded, sighed, and said, “My method isn’t for you to combine with the genes of another creature. My method can fix your genes as they are.”\n\n“What do you mean? If we could fix our genes, we wouldn’t be stuck in this situation,” Elysian Moon said, tilting her head to the side.\n\n“You’re both missing a part of yourselves, and the parts you’re missing are the parts you gave to each other. That means you aren’t complete. But, you both still contain the missing components of each other. All you need to do is fill in the gaps. I can try to activate both of your gene potentials, which might allow your incomplete genes to repair themselves. I’m not sure if it will work, but it is something we should at least try.” The method Han Sen was proposing would require the power of the Blood-Pulse Sutra’s area. He would push their self-cogwheels in an attempt to force their genes to evolve.\n\nThe Blood-Pulse Sutra’s area power was little more than a nudge. Whether or not it worked would be determined by the possibilities harbored by the genes that required fixing. Therefore, Han Sen couldn’t promise that he would succeed. It was a chance for them, though. It was something they had to try before they resorted to the more sordid solutions.\n\nIf it worked, they could both live.\n\n“You can fix the flaws of our genes?” Gu Qingcheng and Elysian Moon’s beautiful eyes were staring at Han Sen.\n\n“I can’t promise you it will work, but there is no harm in trying,” Han Sen said.\n\n“Try it, then,” Elysian Moon said immediately.\n\n“We’ll test it on you first. Come over here,” Han Sen said, looking at Elysian Moon.\n\n“Is there a risk to this process?” Gu Qingcheng asked.\n\n“There is no risk. While there is a chance that it won’t succeed, failure shouldn’t result in any harm to your bodies,” Han Sen said.\n\nElysian Moon walked over to Han Sen. Her voice was completely level as she said, “A long time ago, you were rather unfond of me, weren’t you? It is good that I’m in danger, is it not? If I am dead, then you can be free.”\n\nElysian Moon was saying this to Gu Qingcheng, not Han Sen.\n\nGu Qingcheng moved her lips, but no words were spoken.\n\n“Don’t worry, only good things can happen to you. Otherwise, I wouldn’t want to try this.” Han Sen understood what the two women wanted. He smiled at Elysian Moon.\n\n“Stop talking crap. Let’s get on with it. Even when I was a spirit, I was never afraid of death,” Elysian Moon said, meeting Han Sen’s eyes.\n\nHan Sen smiled, lifted his right hand, and pressed his fingers to Elysian Moon’s forehead. Then, he started to cast the Blood-Pulse Sutra. He made his self-cogwheel connect with Elysian Moon’s self-cogwheel. Then, he started to spin them.\n\n“Don’t try to resist my power. Try to accept it and move with it.” A blood godlight formed on Han Sen’s hands, and the light seeped into and melded with Elysian Moon’s body.\n\nWhen the blood light entered her, Elysian Moon’s self-gene power was activated. The dusty self-cogwheel started to spin a little.\n\nElysian Moon’s self-cogwheel was blue. It had old-fashioned symbols inscribed upon it. Han Sen didn’t know what they meant, but he knew that it was the source of Elysian Moon’s power.\n\nWhen Elysian Moon’s self-cogwheel began to accelerate, the old-fashioned symbols shone brightly. They were like a sun. The light blurred as the self-cogwheels spun.\n\nBlue lights rose from the cogwheel, dyeing Elysian Moon’s flesh and cells a weird shade of blue. The woman looked like a blue crystal statue.\n\nThe color was rather ghostly, and Elysian Moon no longer looked like a person. She was like some sort of phantom, or the crystal statue of a witch. And before long, the crystal started to melt.\n\nNo, rather than melting, it was like dirt was being washed off of the crystal statue, layer by layer. It was like a flower shedding its wilted petals.\n\nGu Qingcheng watched Elysian Moon and Han Sen. Her face was always impassive, but right now, she looked nervous.\n\nThe crystalline Elysian Moon’s blue light began to fade. The blue light dissolved into dust, and Elysian Moon’s body changed as the light peeled away. She was starting to become someone different from who she was before.\n\nHan Sen was so happy. Elysian Moon’s genes were starting to change. That meant his Blood-Pulse Sutra was working. Even if he was unable to fix them entirely, this process was still going to benefit Elysian Moon’s body.\n\nBut Elysian Moon wasn’t like Lando, who was a top half-deified. Rather than leveling her up, Han Sen’s power simply improved her genes. Her talent and powers were increasing.\n\nBuzz!\n\nA strange sound came from Elysian Moon’s body, like a sword was being unsheathed. A scary swordmind blossomed from her, and the ghostly air shifted around her. The weird blue light faded further.\n\nDescribing Elysian Moon was difficult, because she now looked like a ghost woman from hell. Right now, Elysian Moon looked like a cold fairy in the moonlight. She seemed distant, but not in a way that would frighten people."
}