{
    "chapter": 2404,
    "title": "Han Sen Makes His Wish",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2404",
    "text": "Han Sen thought of many different things he could wish for. He thought of wishing for God to be dead or for Han Sen himself to become God. Both of those seemed like wishes that God would be unable to fulfill, and thus would be forced to renege on his bargain.\n\nBut when Han Sen thought about it some more, he realized that those wishes wouldn’t work. If Han Sen wished for God to die, he needed a way to make sure that God really was dead.\n\nOrdinarily, death meant losing all signs of life. But different types of life also had different types of life signs.\n\nWhen Han Sen first entered the seventh floor and saw the man, he thought the man was dead. If that was the “death” Han Sen was referring to, then God would fulfill his wish without difficulty. He could make himself lose all signs of life without being negatively impacted.\n\nIf Han Sen was going to make that sort of wish, he should wish that God had never existed. If God never existed, then he wouldn’t be around to fulfill Han Sen’s wishes. If he fulfilled Han Sen’s wishes, then he wouldn’t be around to call in the debt. If he was still around to exact payment, then he could not have fulfilled the wish.\n\nIt was a simple theory, and the wish should have been impossible to fulfill.\n\nThe wish made certain assumptions, though. If Han Sen really wished for God to never exist, then the assumption would be that the man really was God. If the man told Han Sen he was not God, it would be as if he was erasing God’s existence. And then he could make Han Sen pay the price.\n\nThere were many other similar methods that God could use to avoid getting the bad end of a bargain. God was very good when it came to toying with rules. Because of that, Han Sen didn’t think that any of these ideas would work.\n\nHan Sen’s gaze came down on the paintings of God hanging on the walls, and suddenly, Han Sen saw them very differently than he had before. The position of the paintings hadn’t changed, but looking at them now gave Han Sen a very different sensation.\n\nHan Sen felt a water mind coming from one picture. The water mind was like a sea. It washed back and forth over Han Sen, making him feel as if he was drowning in the image. His sensitivity to water powers increased.\n\nHan Sen was shocked. He looked at all of the pictures one by one, and he found that each of them had a different meaning. Some of them were very soft and gentle, whereas others were very hard and destructive.\n\nSome of them were small, and others were endless. Others were like galaxies hanging in the sky.\n\nThe forty-eight pictures somehow captured all the different aspects of water powers. Han Sen looked at the forty-eight paintings, and his knowledge of water powers increased by several levels.\n\n“It looks like God’s power really is quite impressive. It can read my body composition and place a water mind in the paintings for me. When the Extreme King elites came here, they must have each seen a mind that matched their own powers. That is why they became so much stronger.\n\nFrowning, Han Sen muttered to himself, “This God is like King Qun. They both have very strong powers, but for some reason, there are restrictions that keep them from utilizing all of their strength. This is the only chance I have against them, as the ordinary creature that I am. Otherwise, this God could surely destroy the universe itself.”\n\n“But fighting a god by God’s rules? The chances of winning are still pretty low.” Han Sen then suddenly thought of Asura.\n\nAsura left behind the Asura Sutra, or the Falsified-Sky Sutra, which had Causal powers. And Asura had actually consumed a God. Was that God the same type as King Qun?\n\nBut Han Sen had eventually learned that the God Asura consumed was something like a Buddha. Although the Buddha were strong, they didn’t reach God-status.\n\n“Maybe that was just a coincidence,” Han Sen thought to himself.\n\nHan Sen kept looking at the forty-eight paintings, all the while thinking about what he might wish for. Gaining more water power was great for Han Sen.\n\nAncient Water God’s Ancient God Origin had caused the Original Water King Body to develop, so the King area’s utility had definitely increased. Learning more through these paintings would also be helpful.\n\nBut because of his black crystal armor, Han Sen’s body was locked down. That God could probably only feel the Original Water King Body, which was why the paintings only held a water mind.\n\nIf Han Sen had access to all his geno arts, he could have learned a great deal more from the paintings.\n\nBut the black crystal armor wasn’t giving Han Sen the opportunity to do that, and Han Sen couldn’t understand why. It was similar to how the black crystal armor had hidden from the geno hall.\n\nA month was a long time, though. Han Sen was able to think about all this slowly, as he had plenty of time to learn the water minds that were available.\n\nWith his own water mind knowledge deepening, Han Sen’s water element Shocking Sky Punch became stronger. As he understood more and more, Han Sen continued to modify the technique.\n\nHan Sen hadn’t yet made a wish. This was the last day he would be allowed to remain inside the tower, and he was still learning the water minds in the paintings.\n\nThe painting in front of Han Sen started to talk. “You made a deal with me. You must make a wish. If you don’t, you cannot be allowed to leave Destiny’s Tower. And you know this.”\n\nHan Sen laughed and said, “I am going to make the wish now.”\n\nGod was threatening Han Sen. If Han Sen didn’t keep his promise, he wouldn’t be allowed out even if the Extreme King opened Destiny’s Tower.\n\nBut Han Sen thought this threat was very interesting.\n\nIt seemed that, for some reason, God didn’t want to offend the Extreme King. Otherwise, he would have just let Han Sen reach the time limit without reminding him.\n\nThat proved that God was planning to let Han Sen go instead of forcing him to stay.\n\n“Then come to me and tell me your wish,” the man said in a cool voice. His face remained impassive.\n\nHan Sen returned to the seventh floor of Destiny’s Tower and walked in front of the man.\n\n“You do not have much time. Tell me your wish,” the man said.\n\n“Can you fulfill any wish I want?” Han Sen asked, looking at the man.\n\n“Yes. Anything you want,” the man surely said.\n\n“Can I look for someone?” Han Sen asked.\n\n“Of course.” The man was answering without hesitation.\n\nHe must have heard many strange wishes in his time. Looking for someone might have been a very common wish.\n\n“Good. Then, can you please tell me where my great-granddad is?” Han Sen didn’t make a tricky wish or try to trap God. His wish was simple.\n\nWhen the man heard it, he thought the wish was very simple, as well. He wouldn’t have to bend the rules to fulfill this request.\n\n“What is your great-grandfather’s name?” the man asked.\n\n“Aren’t you God? You must know.” Han Sen said with a chuckle.\n\n“Fine,” the man said casually. He looked at Han Sen, but the reflection in his eyes kept changing."
}