{
    "chapter": 2208,
    "title": "The Conditions for Joining",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2208",
    "text": "Han Sen was indulging himself with quality drinks and food hot off the grill, but he suddenly looked up and let his face go blank. Something powerful was coming his way, and it extinguished the fire in a single moment. Not even smoke was left to rise from the ashes.\n\n“Han Sen, how dare you cheat on my tests!” Ice Blue Knight King barked. He stood with his arms crossed over his chest, a man clad in green clothing beside him.\n\nHan Sen instantly became worried, but his expression remained unchanged. “Knight King, why would you say something like that? How could I have cheated?”\n\nWhen Ice Blue Knight King saw Han Sen remain so calm despite the powerful presences approaching him, he knew for sure that he had drastically misjudged Han Sen. The man really had played him. Ordinary Dukes would be groveling on the floor in front of such a dangerous aura. Only someone extraordinary could have kept his cool in this situation.\n\n“If I say you were cheating, you were cheating! Even if you didn’t intend to deceive the tests, I still consider you a cheater.” Ice Blue Knight King approached Han Sen with a scary amount of power.\n\nIce Blue Knight King had led knights throughout the systems of chaos for over a century, and he had killed countless creatures in that time. He was a very scary man. And in addition to all that, he had the will of a half-deified being. Even a King would be intimidated in his presence.\n\nHan Sen sighed and said, “Well, what are you going to do to me?”\n\nAlthough that sounded very hopeless, Ice Blue Knight King knew that Han Sen wasn’t actually cowed. The Knight King was actually quite curious about this resilience, though.\n\n“Kill you.” Ice Blue Knight King pulled out his sword so fast, the others at the barbeque didn’t even see when it cleared the sheath. Before they could blink, a blue light was coming down on Han Sen’s head.\n\nThe ice blue greatsword stopped one inch above Han Sen’s hair. Han Sen didn’t flinch or show the slightest change in his expression, though. All he did was looked at Ice Blue Knight King and Mister White and say, “If you do not mind joining me, I can have wine and meat brought for you. Would you please accept some as an apology?”\n\nIce Blue Knight King was quite surprised, but he kept his gaze flat as he stared at Han Sen. “You didn’t think I would kill you?”\n\n“No,” Han Sen responded.\n\nThere was something else Han Sen could’ve said, but didn’t. Even if Ice Blue Knight King wished to kill him, he wouldn’t have been able to. His sword would have greeted the Demon Bug Bai Sema, not Han Sen’s flesh.\n\nIce Blue Knight King glanced at Mister White and sheathed his greatsword. He then moved to sit beside the fire. Looking interested, he asked Han Sen, “Why didn’t you choose to join us Ice Blue Knights? Give me a decent reason, and I might just let you go.”\n\nHan Sen sat down and began to explain the situation without hiding any details. He told the Knight King about the grudge he held with Night River King, then finished with, “If I go, Night River King will do harm to my friends and family here.”\n\nIce Blue Knight King laughed and said, “That is trivial. I will make a recruitment order to forcefully conscript Night River King into the Ice Blue Knights.”\n\n“Wouldn’t it be easier to leave me? Why go to all this trouble?” Han Sen murmured, depressed. Recruiting a King to join the Ice Blue Knights was a big decision, and so Han Sen didn’t understand why the man was going through all that trouble to secure one Marquise.\n\nIce Blue Knight King took Han Sen’s bottle of beer and had a swig. He said coldly, “The Ice Blue Knights are in charge of cleaning up a planet in the systems of chaos, but this planet has many deified xenogeneics. They appeared unexpectedly, and we were short-handed on troops. If Knife hadn’t sacrificed herself to buy us more time, the Ice Blue Knights would all be gone. We owe her a great deal, and so, our debt falls to depend on you.”\n\n“If you really want to pay her sacrifice back, then let me stay here.” Han Sen really didn’t want to be a part of the Ice Blue Knights. He hated the concept of being confined. The Ice Blue Knights were like a proper army with way too many rules.\n\nIce Blue Knight King didn’t answer. He cheered and tapped his drink with Mister White. Then, he looked at his empty cup and told Han Sen, “This drink is nice. You can bring more with you when we leave.”\n\nSeeing Han Sen looking rather glum, Ice Blue Knight King grinned. Mister White smiled and said, “Do not worry. If Ice Blue Knight King wishes to take you, he will prepare everything. Night River King will go, too, and we will certainly be keeping an eye on Narrow Moon.”\n\nHan Sen seriously said, “If things are like that, then I won’t complain too much. But I do have one important condition. If you agree to this, then I will have no problem with coming along. If you don’t agree, then I’m afraid you’ll be taking me there in a body bag.”\n\n“What condition is that?” Ice Blue Knight King asked curiously.\n\n“I want them to come with me as part of the team. You cannot split us up, no matter what.” Han Sen pointed at Han Meng’er and the others.\n\nIce Blue Knight King shook his head. “The Ice Blue Knights have rules. If they cannot pass the test, they cannot join. And if they cannot pass the test, then your conditions cannot be met.”\n\n“I haven’t completed the test, so I’m not qualified to join. Please let me go,” Han Sen said.\n\nIce Blue Knight King looked at Han Sen. “Do you know what a chance you’re trying to give up? I’m aware of your difficulty. Your body and geno arts require many resources to level up. Knife is gone, and Narrow Moon won’t be giving you anything but scraps. The only chance you have is to come with me to the systems of chaos.”\n\nHan Sen just stared at Ice Blue Knight King without speaking. He stood by the decision he had made.\n\nIce Blue Knight King didn’t want to concede. He had his rules, and Han Sen’s request had been too much.\n\nThe scene froze with two men unwilling to take a step back. Mister White smiled. “The Ice Blue Knights do have rules. Han Sen’s demands are too much to ask.”\n\nBefore Han Sen could speak, Mister White continued. “You don’t have to join the Ice Blue Knights directly, but I could use a few more guards. And my guards don’t belong to the Ice Blue Knights. There aren’t too many rules with me, so if you would like to, you can come along as part of my team.”\n\n“Mister White, how could you do that? Your guards are required to be King class!” Ice Blue Knight King exclaimed.\n\n“They’re my guards, and I’m free to choose who I want, am I not?” Mister White smiled.\n\nHan Sen looked at Ice Blue Knight King, and then he looked at Mister White. He was confused."
}