{
    "chapter": 1915,
    "title": "Entering Red Mist Valley Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1915",
    "text": "Sword Know and the other Viscounts were angry. They followed Han Sen and Wang Yuhang for half the day, and wherever they went, they encountered a great many xenogeneics. And after every fight, the Viscounts were a little more injured. While many xenogeneics were slain, there was no sign of the red mist spring anywhere.\n\nIn addition, Han Sen took all the materials from the xenogeneics they slew. It upset them quite a bit.\n\nWhen they were almost ready to unleash their rage, they saw something flashing red up ahead of them. It was obvious what that place was.\n\nThe Viscounts then ignored Han Sen and took off racing towards that place.\n\n“Han Sen, are they going to be okay?” Wang Yuhang asked Han Sen.\n\n“They’ll be fine. Go and fetch some more people to collect all these xenogeneic genes. When you’ve returned to base, stay there and do not come out,” Han Sen said.\n\nWang Yuhang and Xie Qing King went to fetch others to collect the xenogeneic materials and take them back to base. Then, Han Sen approached the Red Mist Valley.\n\nWhen he drew close, he saw the Viscounts establishing camp just outside it. They hadn’t run into the mist yet. They knew they would not be able to see the spring before it erupted, so there was no point getting lost in the fog yet.\n\nSeeing Han Sen draw near the valley, no one paid attention to him.\n\nAs this happened, a shadow appeared. It came through one of the magnetic storms and landed atop a mountain. It peered down at Red Mist Valley.\n\n“Night River King, you are so early! Were you worried about your subordinates not being able to collect any of the spring?” Right after that, another shadow appeared. That was Black-Moon King.\n\nNight River King looked at Black-Moon King and said, “You didn’t send anyone here, so why have you come?”\n\n“Can’t I have the pleasure of watching?” Black-Moon King smiled.\n\n“Hmph.” Night River King hummed and did not say anything.\n\nFrom every direction across Planet Eclipse, many shadows descended. They were landing in various spots, but they all had their attention fixed on Red Mist Valley.\n\nPlanet Eclipse’s magnetic storms were strong, so it would be impossible to observe the valley from off-planet. So, the Kings had to come in person if they wanted to watch.\n\nMost springs would release a dozen drops of spring water. Springs had been known to release over a hundred, but such an occurrence was very rare. They’d be quite lucky if the spring spawned a few dozen drops.\n\nHan Sen was resting just outside Red Mist Valley, waiting for it to erupt. He felt the little Red Mist Minks moving around quite a bit in his pack. He took one out and put it in the palm of his hand.\n\nPerhaps it was because Han Sen had been carrying them for a while, but they seemed to have realized that Han Sen was not planning on eating them. The mink did not look afraid. It used its claws to point into the Red Mist Valley.\n\n“You want to go in there?” Han Sen asked the mink with surprise.\n\nThe little mink nodded. It sat down like a squirrel, continuing to point into the valley with a look of gleeful energy.\n\nThen, Han Sen looked at the mink and asked, “Why do you want to go in? Do you know where the spring is?”\n\nThe little mink looked at Han Sen with confusion, unsure of what he was asking.\n\n“It’s quite smart, but it has just been born. It doesn’t understand what I’m saying.” Han Sen frowned.\n\nThe little mink, seeing Han Sen not move into the valley, continued pointing into the mist with its claws. It was trying to hurry Han Sen into going in there. Han Sen brought out the other six little minks. They were all behaving the same way, and they really wanted to go in.\n\nHan Sen put them inside his pocket and did as he was instructed. He walked into the valley.\n\nThe Viscounts were watching Han Sen as he went.\n\n“Sword Know, Han Sen went into the valley. Do you think we should follow him?” One of the Viscounts informed Sword Know, bowing gracefully.\n\nAfter Sword Know arrived on Planet Eclipse, he used the spirit orb to make himself an Earl. He hadn’t broken the law, though. He was a Viscount when he arrived on the planet, so he was merely being tricky.\n\nSword Know laughed darkly and said, “No. The red mist is still here, so the spring won’t yet erupt. It is pointless for him to go inside. There are many xenogeneics around, too. I think he is going inside for something else.”\n\nIn another tent, Du Lishe said, “Sister, Han Sen went into the valley. Do you think we should follow him?”\n\n“The red mist is still there, so there’s no point. Keep waiting.” Rebecca saw the xenogeneics approach Han Sen, and continued by saying, “He is just a Baron. Even with Ghost Teeth Knife, it’ll be difficult for him.”\n\nThe other people felt like this, too. They were all in their tents, and no one was willing to stop Han Sen or follow him.\n\nNight River King, however, frowned and thought to himself, “What is he doing?”\n\nHan Sen’s performances had never failed to surprise him, and Night River King was no longer willing to take Han Sen’s behavior for granted.\n\nThe few Kings watching the valley had all seen Han Sen enter it, too. None of them had a clue what he might be hoping to accomplish. They thought the mist would disperse in about three hours, anyway. By going in now, you wouldn’t be able to see the spring.\n\nQuickly, Han Sen approached the group of xenogeneics surrounding the mist. He moved his body swiftly and nimbly, needling his way past them all. He was too fast for the xenogeneics to respond properly.\n\nHan Sen even stepped atop a xenogeneic. Within a few seconds, he was inside the valley. All before the xenogeneics could make a move.\n\n“I forgot he had those shoes.” Rebecca frowned.\n\n“What are those shoes, anyway? How can they give him such a grand speed boost? I worry that they might be Marquise class or something,” Du Lishe asked, with much shock.\n\nIt wasn’t just Du Lishe feeling this way, either. The Viscounts outside the valley were all mulling over the origin of those shoes.\n\nBut the Viscounts did not freak out just yet. They were still going to wait for the mist to disappear.\n\nAfter Han Sen went into the valley, he pulled out one little mink. The little mink rapidly ran through the valley.\n\n“No way this little guy knows where to find the spring,” Han Sen thought, as he followed the mink through the valley.\n\nBecause the red mist was strange, the Kings who were watching could only detect vague movement within the mist. They could not see what Han Sen was doing, though, and so they frowned.\n\nHan Sen followed the mink deep into the valley. The deeper they went, the more excited the minks became. They went back to the cave where they were born.\n\n“Is the spring inside this cave?” Han Sen was confused, as he didn’t think this was quite right. The place wasn’t as Yisha had described."
}