{
    "chapter": 1903,
    "title": "It Is Not Bad",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1903",
    "text": "When Han Sen returned to his seat, everyone looked at him differently. Now, people were looking at him as if he was a monster.\n\nHan Sen was not in a good mood. He had only wanted to show off Ancient Devil’s mind a little bit, but that display had obviously gone off the rails. He wondered what the Kings of Narrow Moon might be thinking of him now; Yisha in particular.\n\n“Ancient Devil, why did you do that?” Han Sen asked coldly, placing his will back inside Destiny’s Tower.\n\n“I was just giving you what you wanted,” Ancient Devil responded.\n\nHe sat where he was, unmoving. He smiled like a Buddha touching flowers.\n\nHan Sen didn’t say anything in response. He merely looked at Ancient Devil for a bit, then left the tower.\n\n“Ancient Devil is way too dangerous. I can’t risk letting him out,” Han Sen thought to himself.\n\nWhat happened next, in the gathering, was suddenly much more boring. After No Flower and Han Sen’s performances, even though there were many talented Buddhas and Rebates, the event was a slog.\n\nPeople weren’t thinking much about the event anymore. People’s minds were too preoccupied with Han Sen.\n\n“An amazing mind, Qing Li. You were right. Han Sen’s mind is strong. I wonder how he managed to practice that.” Du Lishe looked strange.\n\nQing Li did not know what to say. This was not the mind she had previously seen. What she had seen was Teeth Knife knifemind. But now, they were not going to believe that, so all she did was smile.\n\n“It is a shame he has hair. Otherwise, I would believe him to be one of the Buddhas. He could most certainly be a King class Buddha, or even a deified one.” Rebecca kept looking over to where Han Sen was sitting.\n\nThat Buddha sentence shocked the people of Moon Garden. It was hard to imagine that it had all come out of a Baron.\n\nThe event kept on chugging along, and when Speechless took the stage, she looked over to where Han Sen was sitting. She bowed and said, “I hope I can compete so skillfully against Han Sen. Please teach me something.”\n\nBeing challenged by Speechless like that, made everyone look at Han Sen again. They were all hoping that he’d accept. People in Narrow Moon knew Han Sen could use Teeth powers.\n\nHan Sen shook his head. “You are too polite. I have not practiced sword skills much. I am afraid I’d perform too poorly for you to see.”\n\nHan Sen was too obvious earlier, and he wasn’t keen on the prospect of performing again in front of everyone.\n\n“That is okay. Skills are all connected. Knife Queen’s Teeth Knife is so famous, and if you can use knife skills, I would be glad,” Speechless said.\n\nNow that Speechless had said that, it would reflect poorly if Han Sen continued to decline. So Han Sen thought for a moment and then said, “I am not very good at sword skills, and I don’t like hitting women. How about this person next to me? Her sword skills are great. If you really want someone worth competing against, ask her to practice with you.”\n\nHearing that, Speechless frowned and looked upset.\n\n“Han Sen, Speechless is a guest here. You cannot be so rude as to deny this,” Moon Wheel King said.\n\n“Okay,” Han Sen answered, standing up.\n\nSpeechless suddenly smiled and said, “In that case, I will fight against her. And if she loses, you will compete with me. Is that correct?”\n\n“If you really are that desperate for this, then okay.” Han Sen nodded. They were both Viscount class opponents, so Han Sen did not believe Gu Qingcheng could lose.\n\n“I am sorry to bother you, my lady.” Speechless bowed to Gu Qingcheng.\n\nGu Qingcheng rolled her eyes at Han Sen, got up, and walked to the stage.\n\nNarrow Moon and the Buddhas were curious. They did not know why Han Sen would let his subordinate practice against Speechless.\n\nMany people thought Han Sen was just a Baron. He had a powerful will, but not powerful strength. Perhaps he did not want to embarrass himself, so he pushed a subordinate out to take the fall for him.\n\nBut that did not make sense, either. If she lost, he would have to go fight Speechless, anyway.\n\nAs people guessed what Han Sen was trying to accomplish, the practice started.\n\nSpeechless let a worker bring out the same Viscount sword. Then she said to Gu Qingcheng, “If you think this sword is poor, you may feel free to use your own.”\n\n“It’s the same.” Gu Qingching picked up the offered sword.\n\nSpeechless smiled and picked up the other. She said, “Please.”\n\nGu Qingcheng pulled the sword back and swung it at Speechless.\n\nIt was an ordinary technique to draw back the sword. But in her hands, it wasn’t so simple.\n\nGu Qingcheng’s sword skills were overbearing. The moment she held the sword, they were at one with each other.\n\nIn Speechless’ eyes, it suddenly felt as if her entire world had been taken by that sword. She could not dodge the quick strike, and all she could do was use her hand to fight against it.\n\n“What a powerful swordmind!” Speechless was shocked. She did not expect a subordinate of Han Sen could be such an effective swordsman.\n\nShe never anticipated that the sword would come at her with such speed. Speechless gathered up her sword power and composed her swordmind to fight back.\n\nBut Speechless was not very good at fighting in this manner. She wasn’t called Speechless because she was mute, but because the Buddha that opened her eyes was called Speechless. She was grateful for that, and so she called herself Speechless.\n\nSpeechless Buddha King was good at Speechless Sword. But Speechless Sword was silent. It was a sonic-power skill that no one could hear. It was scary.\n\nThe swords made no sound, and no one spoke.\n\nMany of Speechless Buddha’s past enemies never knew what happened to them, or why they were killed. Their deaths had come faster than they could utter a word.\n\nSpeechless Sword was scary, but you could not fight it head-to-head.\n\nThe two swords clashed against each other. But then, Gu Qingcheng returned her sword and walked off the stage. Katcha!\n\nEveryone saw Gu Qingcheng leave the stage, and as they did, the Nobles wondered what had just occurred. And then, they heard a sound. Speechless1 sword had been broken in half. Her eyebrow was now home to a small cut. Blood dripped out from the laceration, and it looked like another red mole.\n\nEveryone was shocked. Speechless had been quickly defeated by Han Sen’s subordinate. The whole event had been silent, as if the spectators had watched a battle of ghosts.\n\n“Sword skills like that.. Where do my sword skills stack up against that?11 Everyone recalled what Han Sen had said, and their stomachs felt hollow."
}