{
    "chapter": 2893,
    "title": "Getting a Deified Beast Soul Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2893",
    "text": "Han Sen knew what was wrong with it. He wanted to break Time Ghost’s Absolute Time. To do that, he had to break the time power area or unleash a speed that could blister through the delaying of time.\n\nAfter all, Time Ghost’s Absolute Time did not stop time. Time still went by, but it was at a much slower pace. If the speed was faster than the delay, Han Sen could hurt it.\n\nHan Sen’s speed was not at that level yet. He could try it once he reached true god class. For now, he had to find another way to break through the Absolute Time.\n\n“How is Golden Growler in the geno hall?” Han Sen directly asked.\n\nSince God already knew about the connection between him and Golden Growler, there was no need to hide things. If God wanted to deal with Little Gold Gold, Han Sen was prepared for it.\n\n“Not bad,” God coldly said. “After all, he has the blood of the growlers in him. Destroyed class spirits are unable to harm it, but it is hard to tell if it has a higher-level god spirit. Let’s see what it can do.”\n\nThis answer surprised Han Sen. He thought God would use Little Gold Gold to lure him to the geno hall, but it seemed as if that wasn’t the case.\n\nAfter pausing, God smiled at Han Sen and said, “Did you watch the fight involving the crystallizers lighting their lantern?”\n\n“Yeah,” Han Sen replied. “What’s the problem?”\n\n“Han Sen’s fitness level is not as good as yours, but his geno arts are very weird,” God said. “It can reverse the bloodline of something. It can force creatures into devolving. That power is different from something like time and space. If it had an element tied to it, it would be a life element.”\n\n“Are you interested in him?” Han Sen asked.\n\n“I am quite interested,” God honestly admitted.\n\n“You should go look for him,” Han Sen said with a laugh.\n\nGod shrugged his shoulders and asked, “Did I not tell you God Spirits can only travel with the body of a creature in the universe? Besides, a universe’s god body restricts God Spirit power. That is why I am using this body to travel around the universe despite the danger. I cannot go anywhere. Plus, a place like Space Garden… Without the master’s approval, not even I can go in.”\n\nAfter pausing, God said, “Plus, I have no time.”\n\n“Can’t gods live forever?” Han Sen asked with shock.\n\n“God has a duty. We gods have work.” God laughed. He looked at Han Sen and said, “This time, I came back to tell you that something has happened. I will not be coming back to the universe. After six months, I will give you Wan’er back. Of course, that is unless you want to go to the geno hall sooner.”\n\n“Before becoming true god class, I will not go to the geno hall,” Han Sen said.\n\n“There is nothing absolute in this world. If you miss me, perhaps you will enter the geno hall sooner. You will not just die immediately.” God waved his hands and stepped away.\n\nThe sky suddenly presented a set of stone stairs. After God stepped on them, he quickly disappeared with the stone stairs.\n\nAfter God left, Han Sen felt relieved. He was worried God might notice Han Sen and Dollar were the same person, but he believed God hadn’t noticed anything.\n\nThat was expected. The ordinary Han Sen and Han Sen in xenogeneic mode were two completely different species. Unless the person knew there was a connection between the two, they would have to inspect their genes to come to a conclusion. Otherwise, there was no way to tell it was the same creature.\n\n“What happened in the geno hall that made God return?” Han Sen wanted to use Sky God Crown to enter the geno hall and have a peep, but he resisted. He held back his curiosity.\n\nIf Little Gold Gold was not yet in danger, Han Sen planned to become true god before going to see Little Gold Gold.\n\nHan Sen looked at Time Ghost. Normally, he could not kill Time Ghost. Now, Time Ghost was locked down there. There was likely a way.\n\nHan Sen opened his Dongxuan Sutra. He used one hand to go to the Time Ghost.\n\nJust like before, when Han Sen’s hand was about to touch the Time Ghost, it felt like his hand was slowed. It felt like he would never be able to touch Time Ghost.\n\nHan Sen’s eyes flashed. His hand started to swirl. Since time was going to stop, Han Sen ripped a crack in it.\n\nBoom!\n\nSuper Spank. Han Sen’s hand broke the Absolute Time Area’s substance chains. It broke layers in the Absolute Time.\n\nEven though it was being restrained, the power of the Time Ghost was still extremely strong. Super Spank was only able to break a few layers of the Absolute Time. He could not break it entirely.\n\n“If it did not work this time, let’s give it another go.” Han Sen put his hand forward and made a move. It made the area have some swirls.\n\nHan Sen attacked and attacked. He broke the Absolute Time. His power proceeded to punch the Time Ghost. It made the Time Ghost’s body shake. It was unable to break its armor.\n\n“True god xenogeneics really are something else.” Han Sen was holding the Sky Vine Radish God Lance. The moment he ripped Absolute Time, he waved his lance at the Time Ghost.\n\nIf Time Ghost had not already been trapped, its spirit hadn’t been taken, and the newborn spirit was not yet grown, Han Sen did not think he could deal with it.\n\nBut Han Sen put in a lot of effort. In the end, he was able to kill the Time Ghost.\n\n“Xenogeneic deified hunted. Time Ghost: Deified xenogeneic gene found. Obtained Time Ghost deified beast soul.”\n\nHan Sen was happy. There was a time when he did not get deified beast souls, but the Time Ghost power was special. Perhaps the beast soul contained its special time element.\n\nHan Sen could not wait to check it out in his Sea of Soul. He saw the Time Ghost beast soul in front of him.\n\n“Deified beast soul Time Ghost: Area type (perfect)”\n\nHan Sen was excited. A Beast Area soul was very rare, but Han Sen was also glad to see the perfect status. It was the same as the Cold Light Sword. It meant the Time Ghost beast soul was very strong. It could be used to battle a true god deified opponent."
}