{
    "chapter": 1957,
    "title": "Taken Hostage",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1957",
    "text": "“What way? Tell me.” Han Sen looked at Speechless with interest for the first time.\n\n“Galaxy Sand needs to be showered with starlight to be kept alive. Otherwise, it turns to simple stone in only a few days. I know when Clear Sea King will bring the sand out, and where he takes it to be replenished with starlight.” Before Speechless finished, Han Sen summoned a green tower and sucked her inside.\n\nEntering a King class house and stealing their items was something Han Sen would do only if he was crazy. Speechless was only stalling for time.\n\nHan Sen hid all the evidence he might have left at the scene, but Speechless was supposed to meet with Clear Sea King. If she didn’t show up, Clear Sea King would notice something was amiss.\n\nHe didn’t want to waste any more time than he had to, so he scrawled a few words on the ground where he was and then left.\n\nHan Sen walked around the mall, and eventually, Battle King’s subordinates saw him. On his way back to Mach’s shop, all the subordinates that belonged to Battle King began to move.\n\nNews of Speechless’s kidnapping had already spread. When Clear Sea King saw the words Han Sen had left on the ground, his face looked extremely sour.\n\n“Clear Sea King, do not worry. I will take responsibility for this. I will return the Buddha Lady to you alive, but I want to find out who is messing around in my territory.” Battle King looked horribly angry, too.\n\nThe enemy had kidnapped a Buddha in his own territory, and had asked for Galaxy Sand in exchange for her return. It was humiliating Battle King.\n\nIf Battle King hadn’t taken responsibility, Clear Sea King might have believed he was the one who started all this—to steal the Galaxy Sand.\n\n“Amitabha! I will let you handle this,” Clear Sea King spoke the Buddha catchphrase. His face did not change, but he looked worried.\n\nBattle King might have said he was going to help, but Clear Sea King was still suspicious of his possible involvement in the kidnapping.\n\nOn Battle King’s planet, someone had kidnapped Speechless in secret. And furthermore, she was there under Clear Sea King and Battle King’s protection. Clear Sea King believed that Battle King must have been the kidnapper.\n\n“Give me one day.” Battle King knew Clear Sea King was suspicious of him, and so he looked fairly gloomy.\n\nThe entire planet started to search for Speechless, all following a command issued by Battle King himself. But after a whole lot of time, Speechless went undiscovered. The kidnapper’s identity was still unknown.\n\nWhen the investigation concluded, the most suspicious person they found was Han Sen, who happened to disappear from the watch of the spies. But Han Sen was just a Viscount, and it seemed impossible for someone such as that to kidnap someone like Speechless without making a ruckus.\n\nAt a time like this, though, Battle King wasn’t willing to let the slightest possibility by.\n\nWhen Han Sen took Little Seven to participate in the next contest, Battle King’s best subordinate, Blood Kill Duke, took control of Mach’s store with further subordinates.\n\nMach was just a businessman with no money. He wouldn’t risk co-operating with Han Sen, but he informed them of how he and Han Sen met and did not hide a single thing.\n\nAfter Han Sen returned from the contest, Mach invited him in. But when he entered, Blood Kill Duke and his people quickly surrounded Han Sen.\n\n“What are you doing?” Han Sen frowned.\n\nBlood Kill Duke brought out a red chain and tied up Han Sen. He said, “Take him back for interrogation.”\n\nQuickly, Han Sen was brought into Battle King’s house. Little Seven was taken away.\n\nIn a lonely room, Blood Kill Duke looked at Han Sen and coldly said, “Dollar, if you hand her over now, all will be fine. Don’t make me do this.”\n\n“You should tell me what you want me to hand over first,” Han Sen replied.\n\n“Where is Speechless Buddha?” Blood Kill Duke asked Han Sen.\n\n“In a safe place!” Han Sen laughed.\n\nBlood Kill Duke was shocked. He did not expect Han Sen to admit he was responsible, so that was quite unexpected.\n\nAfter pausing, Blood Kill Duke looked murderous once more. He shouted, “Hand Speechless over and I will let you live!”\n\nHan Sen laughed and said, “If you dare touch me, I can assure you that you’ll never see Speechless again. Why don’t you give your method a try, and see what Clear Sea King and the Buddha will have to say about it?”\n\n“This is Meka!” Blood Kill Duke growled.\n\nHe shone with a red light, which then flew swdftly down on Han Sen.\n\nHan Sen didn’t even blink. He just looked at Blood Kill Duke. He made no effort to dodge, and he just sat there quietly.\n\nBlood Kill Duke was annoyed, but he knew he couldn’t do anything. This was something that involved the Buddha.\n\nThings would go badly for him if he messed this up.\n\n“What do you want?” Blood Kill Duke asked after he regained his calm.\n\n“Galaxy Sand. You are too low level to talk to me, though. Give Clear Sea King a ring and tell him to come over,” Han Sen said.\n\n“Don’t forget that your life is still in my hands here. I can make you suffer.” Blood Kill Duke hummed.\n\n“Kill me or give Clear Sea King a shout. It’s your decision,” Han Sen said, as calm as ever.\n\nIn the control room, Clear Sea King and Battle King witnessed everything. They were surprised to hear he was the one who kidnapped Speechless Lady.\n\n“Amitabha! Let me talk to him,” Clear Sea King said.\n\nBattle King nodded. Dollar had put him in a pretty bad situation. He couldn’t kill him, either. It would be best if Clear Sea King went and talked with him.\n\nBlood Kill Duke was given an order by Battle King, which prompted him to leave. Then, Clear Sea King came in. Clear Sea King sat next to Han Sen. He did not say anything to Han Sen, and merely looked at him.\n\nHan Sen’s energy was not outstanding. It didn’t seem too powerful, but Han Sen didn’t appear to be trying to hide anything, either. It was like he didn’t care about his own presence, even when a King was sitting right in front of him.\n\nHan Sen wore armor so Clear Sea King couldn’t recognize his face. After a while, Clear Sea King said, “How much did they give you? I can give you ten times more.”\n\nHan Sen laughed and said, “Don’t even think about it. No one else is behind this. You either kill me and Speechless dies with me, or you give me Galaxy Sand. Those are your two choices.”"
}