{
    "chapter": 1301,
    "title": "Precious Gift",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1301",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nIt was too late for them to run now. Night Empress was wrathful, and she gestured with her hands to blanket the helpless spirits and creatures with a scornful darkness.\n\nThey mustered every ounce of strength they had left in a bid to repel the malevolent dark, but it was a futile resistance. Their powers were consumed by the looming black, as if it fed on their offerings.\n\nAnd it wasn’t long before the dark ravaged their bodies like a hungry beast before an open feast, in dire need of a feeding.\n\n“Pah, I see through your tricks!” No God Emperor bellowed, thrusting forward towards Night Empress with his No God Sword.\n\nHis arrogance was blinding, and he did not believe demi-gods could return from the Fourth God’s Sanctuary and enter the Third God’s Sanctuary. He thought this was all a ruse, an illusion conjured by the trickster Lotus, or a doppelganger formed by some force through past memories and history.\n\nSeeing No God approach her, Night Empress was unconcerned. She was as real as the night, and as real as the darkness with which she swarmed the imperious emperor.\n\nThis had all transpired over the course of a few measly seconds, and then, as quick as it had begun, it ended. The darkness was removed from the area.\n\nHan Sen looked around, noticing all the creatures and spirits had disappeared with the violent black.\n\n“Where are they? Where did they go?” Han Sen asked.\n\n“They are dead,” Night Empress said.\n\nHan Sen asked, “Can they respawn?”\n\n“No; such a killing is absolute,” Night Empress answered, with perfect certainty.\n\nNight Empress then frowned, “Hmm, but that spirit stone can allow him a respawn. Not bad.”\n\n“Mother, are you referring to No God Emperor?” Lotus Empress asked.\n\nNight Empress nodded, then told her, “My time here is limited. Why don’t you come with me to the Fourth God’s Sanctuary? I can guarantee your safety there.”\n\n“I can come with you? As easily as that?” Lotus Empress asked in wonder.\n\nNight Empress assured her, “Of course, you should know that. Why else would you summon a demi-god? Why else would you summon me?”\n\n“I didn’t summon you.” After Lotus Empress said this, she eyed Han Sen.\n\nNight Empress said, “Then I’ll bring him, too.”\n\nHan Sen was quick to reject her offer. He told her, “Thanks, but no thanks. You should just take Miss Lotus with you.”\n\nAs pleasant as his words were, beneath the surface, Han Sen was hissing a fire directed at Dragon King. His information had been incorrect once more.\n\nSummoning a demi-god was a shortcut into the Fourth God’s Sanctuary, and a method in which a being wishing to ascend could bypass The Ten Steps of the Holy Door and its cleansing flames.\n\nAs much as Han Sen appreciated the offer, he would prefer to walk the purifying steps. And that aside, he had yet to open his tenth gene locks.\n\nAnd furthermore, Han Sen knew he could just step into the Evolution Pool for a shortcut of his own.\n\n“Mother, I will take the steps as you did,” Lotus Empress said.\n\nNight Empress ran her fingers through the hair of her daughter and smiled. She told her, “It is good that you wish to pass through the holy fire. Not only does it speak to your strength of heart and resolve, the benefits are tremendous.”\n\nNight Empress then proceeded to summon something dark. She handed it to Lotus, telling her, “I don’t have much time. Take this. If No God Emperor returns for you, use it. Use it to destroy that monster.”\n\nNight Empress then walked back to the altar and became a statue of stone.\n\n“Hey, don’t go yet! I was the one who summoned you, after all. Where’s my gift?!” Han Sen pleaded as she went, but she gave no heed. She was a statue before he finished, and he knew he wasn’t going to receive a response.\n\nThe altar then disappeared in a final flash of darkness, and the next time Han Sen and Lotus Empress looked around, they were back nearby the Luminous Stone. The Luminous Stone was webbed with cracks, unlike before. And after an uneasy tremble, it shattered completely, collapsing into a mound on the ground.\n\nThe jue Han Sen possessed finally stopped vibrating incessantly.\n\nHan Sen was gutted, though. Despite his efforts to summon Night Empress, he hadn’t received a single goodie.\n\n“Haha!” Lotus Empress was laughing, in a cheery mood Han Sen had not known she could display. She went ahead to comfort him, offering, “How about I give you a gift instead?”\n\n“What gift would that be?” Han Sen thought getting something off Lotus Empress wouldn’t be half bad.\n\nBut then Han Sen’s eyes drifted to the black jewel she had been gifted by her mother, Night Empress. A streak of envy crossed his mind, and he thought it’d be great if he could have it.\n\nHan Sen knew she wouldn’t be giving that to him, though.\n\nLotus Empress swung the jewelry in front of Han Sen and told him, “It’s this Night Gem.”\n\n“Wait, you’re giving that to me?” Han Sen was made exuberantly happy, but he was jumping to conclusions.\n\nLotus Empress pulled back her hands that caressed the lovely thing, saying, “Of course not.”\n\n“Then why swing it in front of me? Are you taunting me?” Han Sen asked, with a dried attitude.\n\nLotus Empress was emitting a vibrant radiance, and she seemed to be genuinely happy after all that had happened. She said, “Yes, haha. But don’t worry, I have something better for you.”\n\n“You can offer me something better?” Han Sen didn’t think anything could beat a gift that was given by a demi-god.\n\n“Yeah, do you want it? Yes or no?” Lotus Empress asked.\n\n“I’ll take anything you are willing to give me,” Han Sen answered.\n\nSince Han Sen had already taken a bunch of Holy Baby fruit, he was down for something else off her. Besides, he was the one who summoned Night Empress. Han Sen thought he was due a reward for that deed, for sure.\n\nLotus Empress then walked around Han Sen in circles. He admired the delicate grace of her steps through an intense observation of her body. She was gorgeous.\n\nBefore Han Sen could figure out what she was doing, though, Lotus Empress told him, “How about me as your gift?”\n\n“You mean…” Han Sen couldn’t believe the stunning offer he had just received.\n\n“Yes. I am your gift. Isn’t that better than a measly Night Gem?” Lotus Empress spoke with a seductive drawl to her words, in an attractive lure.\n\n“Oh, you’re right about that! You’re much better than a silly jewel. Do you need to pack a bag, or are you already prepared to come with me?” Han Sen looked at her with avaricious eyes."
}