{
    "chapter": 1044,
    "title": "Nirvana Lake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1044",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nDevilhorn King: Polluted Beast Soul Weapon Type\n\nHan Sen was taken aback. This was a unique beast soul, and its description was unlike anything he had ever seen before.\n\nHan Sen summoned it, and it was a scimitar. It seemed like a weapon, forged of black crystals not unlike the original creature’s horns.\n\nWhen Han Sen examined the corpse of the dead king, it started to crumble away and disintegrate into soot. It was soon indistinguishable from the ground of that black land.\n\nThe black crystal horn remained behind though, like a chip of charcoal.\n\nBut when Han Sen touched it, that too crumbled away and scattered like dust.\n\nSuddenly, Han Sen’s body felt extremely weak.\n\nHe hadn’t used the whole hour of super king spirit to defeat the beast, so it wasn’t as bad as last time. But just as Han Sen decided to go looking for Brother Seven, his blurred vision saw someone coming towards him. It was Xie Qing King.\n\n“Why is he here?” Han Sen wondered to himself in disappointment.\n\nXie Qing King was headed right for him, and when he arrived before Han Sen, the spirit asked the very same question, but aloud. “Why are you here?”\n\n“I grabbed the person that accompanied Holy-Sword Emperor. He brought me here, but we got split up when encountering a lot of very nasty sheep. I don’t know where he is now.” Han Sen paused for a moment, and then went on to ask, “Did you catch up with Holy-Sword Emperor?”\n\n“No. He ran off, but not without losing his treasure to me.” Xie Qing King held out an item for Han Sen to take a look at.\n\nIt was a leather scroll, with a gold phoenix painted on it. It looked very alive; like a bird that was truly above and beyond the strength and comprehension of any other bird that existed.\n\nWhen Han Sen saw the picture, he felt as if he had been struck. It reminded him of all the birds he had seen, back in the palace.\n\nThe phoenix on the painting was stood there, delicate and proud. But at the same time, it appeared as if it was flying.\n\n“This painting is Phoenix Emperor’s treasure; he must have drawn it after seeing all the birds laid out before him in the hall,” Han Sen theorized.\n\nHan Sen thought about the palace, and now, looking at the picture presented, he realized it was the complete set.\n\n“Do you understand?” Xie Qing King asked.\n\n“No, but that human seems to. If you see him, maybe you can ask him?” Han Sen was worried Xie Qing King might mercilessly strike down Brother Seven if he encountered him.\n\nXie Qing King put the picture away. He then picked up Han Sen and started flying.\n\nHan Sen knew he meant no harm, so he didn’t try to resist the free lift.\n\nXie Qing King flew at an obscene speed, and it seemed as if they traveled thousands of miles in no time at all. They came to a stop near a lake.\n\n“My Emperor, where is this?” Han Sen asked, as he observed the lake.\n\n“Is this where the treasure resides?” Han Sen wondered.\n\nXie Qing King did not answer, and instead, chucked Han Sen directly into the water. Then, he himself jumped in. It was as if they were going to have a bath together.\n\nHan Sen believed there to be something strange about the lake, but when Xie Qing King jumped in, he felt safer.\n\nHan Sen felt as if all his dirt was being cleansed and rinsed away. His Dongxuan Aura seemed to be recovering, too.\n\nBao’er was also there, and she merrily swam and splashed about in the waters of the lake.\n\n“Emperor, this lake is fairly fancy!” Han Sen feigned surprise.\n\nXie Qing King replied, “Of course it is. This lake is composed of the tears of the fiery phoenix. The water is restorative to one’s body.”\n\n“Tears of a phoenix, you say?” Han Sen looked at Xie Qing King in awe.\n\nXie Qing King, without beating around the bush, said, “Do you know why that turkey called himself Phoenix Emperor? It was because he grew a holy tree. That tree gave birth to a pair of fruit. In each fruit was a phoenix with ten gene locks open. When they went to the Fourth God’s Sanctuary, however, the male died. That’s why this place was ruined. The tears of the other phoenix, in the loss of its partner, is what formed this lake. By bathing here, we can rinse ourselves of any debilitations we may have incurred.” After a brief moment of silence, Xie Qing King went on to say, “I went to the treasury but there was nothing there. I think the turkey must have hidden his treasure somewhere in this place. We should resume our search later.”\n\nHan Sen thought of the giant tree he had stepped into before entering the shelter, and asked himself, “Was that the holy tree he talked about?” He then went on to think, “Hmm, remember that etching near the entrance? Didn’t it say, ‘The phoenix descended on God Mountain and the emperor died’? By descent, does it mean the phoenix died and fell to the ground? And the emperor died with it? Is the emperor dead someplace here?”\n\n“We’ll be here for another seven hours. It looks like you were injured pretty badly, following your wrestling match with the sheep. Stay here and you’ll be right as rain before you know it,” Xie Qing King said.\n\nHe hadn’t known when it occurred, but Bao’er had climbed on top of Xie Qing King’s head. Needless to say, he was surprised and a little fearful.\n\nBut it was unjustified, because Xie Qing King did not mind at all. He was fine with the baby there, and he was not angry or annoyed. He simply allowed Bao’er to pull his hair and squeeze his cheeks.\n\nHan Sen wanted to call her back, in case she made him mad. But all of a sudden, he felt something touch his waist. It gave him quite the shock."
}