{
    "chapter": 155,
    "title": "Changing the Rules",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_155",
    "text": "Different from other warframe games, single warframe combat and group warframe combat were both realized via the virtual simulation to avoid casualties and warframe damages.\n\nAfter all, it was not a real war, and the players were only military school students, so they would not be asked to fight like real soldiers.\n\nIn a virtual combat, the data of their warframes would be scanned and virtual warframes would be generated. The operation was also the same as that in reality.\n\nAs the sponsor of the game, Starry Group suddenly changed the game rules.\n\nLuo Xiangyang put both hands on the table in anger, stared at Zhao Nengtian, Director of Starry Cup, and asked, \"Why did you change the rules of single warframe combat? This is not fair for most of the players.\"\n\nZhao Nengtian looked calm and sipped from a cup of hot tea before he put on a fake smile. \"The change itself is to maintain fairness. Coach Luo, you think it is fair for other players to compete with a warframe of such performance?\"\n\n\"There is nothing unfair here. The weak will get be beaten. It is the same everywhere. Since it is a single warframe combat, it is supposed to be one on one. How can you change the rules so wantonly?\" Luo Xiangyang said angrily.\n\n\"Coach Luo, this is not a random change, but a responsible one. No need to speak further. As the sponsor, we have the right to make the most reasonable changes to the rules of the game. In addition, such a change would actually benefit your society,\" Zhao Nengtian said impatiently.\n\n\"The Warframe Society does not need such an unfair advantage. We want to win using our own strength,\" Luo Xiangyang gritted his teeth and said.\n\n\"Does not matter. The rules are set, and if you are not satisfied with the rules, you can quit,\" Zhao said coldly.\n\nLuo Xiangyang was mad, but helpless at the same time. He could not ask his society to step down just because of his anger. And technically speaking, Starry Group’s change would benefit the Warframe Society indeed.\n\nThe single warframe combat was changed to a melee. All players would be sent to the same scene, and whoever survived in the end would become the champion.\n\nLuo Xiangyang knew well that all the players had a problem with the Silver Killer driven by Han Sen. This rule was basically allowing all the players to gang up on Han Sen and the Heavy Warframe Society members. Even if Han Sen was outstanding, he would not be able to withstand the attack from hundreds of warframes. He was doomed.\n\nStarry Group did not do that to help the Warframe Society, but because of Han Sen and Silver Killer’s excellence in Starry Cup. After all, Silver Killer was not one of their products.\n\nBefore knowing which company made Silver Killer, Starry Group would not tolerate a warframe that was not one of their own products to appear and stand out in the finals.\n\nThat was why Starry Group had changed the rules—to eliminate Han Sen and Silver Killer.\n\nLuo Xiangyang was extremely angry about this. He wanted his students to beat Han Sen, but not in such a way. This would bring his society shame instead of glory. People would probably even speculate that they were behind this change and consider them sore losers.\n\nWhen the changed rules were announced, there was suddenly an uproar. Not only the Blackhawk students, but also viewers on the Skynet were debating.\n\n\"This rule is clear targeting Silver Killer’s driver.\"\n\n\"Can they change the rules just like this?\"\n\n\"Ha-ha, it should have been done a long time ago. He is a bully with a good warframe. Now it’s time for others to revenge.\"\n\n\"Starry Group is really shameless. They even changed the rules.\"\n\n\"So shameless and petty.\"\n\n\"My condolences to the driver of Silver Killer. I’m waiting to see him being torn into pieces.\"\n\n\"Heavy Warframe Society members will be miserable.\"\n\n\"This will be a good show.\"\n\n\"Silver Killer is doomed. A great warframe wasted. I wanted to see how far it could go.\"\n\nFang Mingquan was also upset at this time. He did not imagine that Starry Group would be so shameless that they changed a one-on-one combat to a melee.\n\nBut Fang Mingquan also knew that a corporation like Starry Group was not something he could confront. He had to say in the live show, \"Because of the change of the rules, Han Sen and his Silver Killer will be stuck in reverse. I do not know what the sponsor of the Starry Cup was thinking, but this is undoubtedly an unfair fight. I can only hope that Han Sen could fulfill his potential and thrive. The result does not matter at this point.\"\n\n\"Agreed. Starry Group is disgusting.\"\n\n\"More than disgusting, it's rubbish.\"\n\n\"Starry Group has always been rubbish.\"\n\n...\n\nBut no matter how the audience protested, the game still started in accordance with the new rules.\n\n\"This change is very unfair to that archery student!\" Qu Lili could not help but said.\n\nAlthough Ji Yanran was unhappy to see the championships Han Sen had won, she felt that this temporary change of rules was too much.\n\n\"Not just him, the whole Heavy Warframe Society will suffer. They will be regarded as the first target to attack,\" Ji Yanran frowned and said.\n\nThe students and viewers originally displeased by Han Sen’s dependence on a high-performance warframe suddenly adopted a sympathetic attitude. Only a few were gloating.\n\nAfter all, most people were kind and sympathized with the weak, and Starry Group had really gone too far.\n\nIn any case, the game began. All the participants used a holographic simulator to scan their own warframes and generated their own virtual warframes, ready to fight in the virtual world.\n\nBut when everyone saw the game map, they could not help but call the sponsor shameless. The map turned out to be a large fighting ring--a huge circular space without any shelters.\n\nIn other words, Han Sen and Silver Killer would be exposed to attacks from the very beginning and did not even have any room to dodge or hide.\n\n\"Damn, Starry Group are a bunch of motherf*#kers. They are not leaving these guys any chances to survive.\" Curses of the unfair treatment filled the comments of the live show, as most people were very sympathetic to Han Sen."
}