{
    "chapter": 2424,
    "title": "Du God City",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2424",
    "text": "The stone path was exactly the same as the video depicted. It was unremarkable in the beginning, and Han Sen and the others reached the statue with a thousand hands and a thousand eyes.\n\nBut Han Sen could clearly feel that the closer he got to the statue, the stronger the strange impulses became.\n\nWhen Han Sen laid his own eyes on the disturbing statue, the feeling was strong enough to make even him shake.\n\nAs the countless eyes seemed to examine him, Han Sen felt as if a ghost was actually staring at him. The feeling was a hundred times greater than what he felt when he had watched the video. It felt like an endless stream of ghosts was going to come right out of the hands to devour him.\n\nHan Sen activated his Purple-Eye Butterfly, hoping to view the secrets behind the statue.\n\nThe purple pupil claimed Han Sen’s eye, becoming four spinning petals. Han Sen took a deep breath and turned his gaze on the statue.\n\nAt that moment, Han Sen felt like he was seeing a demon from hell itself. Before he got a good look at it, pain lanced through his right eye. A wet feeling slicked over his palms, as if his hands were covered in blood.\n\nHan Sen’s face changed. He forced himself to continue looking at the statue, but then he realized that the sight was about to blind him. He jerked his gaze away, not daring to turn back toward the statue with his Purple-Eye Butterfly still activated.\n\n“Are you okay?” Miss Mirror and Night Wind looked at Han Sen.\n\n“I used a trick of the eyes to look at the statue, but it almost blinded me.” Han Sen lowered his hands, which he had used to cover his face. His eyes were red and dripping with bloody tears.\n\nLuckily, Han Sen’s blood was crystallized. Otherwise, he would have lost so much blood that he would have died.\n\n“Stop looking. And don’t use your eye skill to examine it again. If my guess is correct, this statue is related to some sort of eye god. Its powers are directly linked to vision. If you use an eye skill to look at it, that’s like asking for death,” Night Wind said.\n\nHan Sen nodded and remained silent. He followed Miss Mirror down the path.\n\nAfter moving around the statue, they came to the stone cave that had been smeared with blood. It looked just as it had in the video, with more blood and gore appearing the farther they walked. Eventually, they found the door at the end of the cavern.\n\nThe Duke that was bound by substance chains screamed again. He tried his hardest to rush to the stone door. If Night Wind hadn’t held the Duke back, he would have smashed into the door hard enough to burst open his own skull.\n\nThe stone door was shut tight, and they had no idea what lay beyond it. Han Sen didn’t dare to use his Purple-Eye Butterfly again, though, so he had to inspect it with his own eyesight.\n\nThe urge to go to the stone door had grown stronger, but luckily, the three of them had strong wills. They wouldn’t lose control of themselves like the Duke.\n\nBut the urges grew stronger as time went by, and it was only a matter of time until their wills snapped. It would take a god to hold back these impulses forever.\n\nThe stone door had no lock or handle. It was shut tightly, almost seamlessly, and that was that. Countless Dukes had tried to dig into it to no avail. The door had been impervious to their physical attacks.\n\nNight Wind and Miss Mirror swapped glances, and then Night Wind started to gather up power. They wanted to follow their original plan of forcing the stone door open.\n\nHan Sen stood next to Miss Mirror. His right eye was still red and swollen, and occasional sharp jabs of pain still radiated from it.\n\nNight Wind moved his substance chain, which hovered over the ground like a black sheet. Answering his call, it slipped into his hand and manifested as a black sword.\n\nWhen Han Sen saw the sword that Night Wind was holding, he noted that it gave him the same feeling as looking at an empty night sky. The powers it contained were unpredictable.\n\nNight Wind’s eyes froze. The black sword in his hand struck the middle of the stone door, and the swirling darkness slammed against the door’s surface like a dark horizon touching the ground. He struck the door repeatedly with the full force of his substance chain, but every time the darkness came in contact with the door, the darkness shattered like a crashing wave. All the while, the stone door refused to budge. Night Wind’s power could incinerate an entire planet, but the door seemed unaffected.\n\nThe rocks around were all broken by the dark blade, revealing the edges of the doorframe, but the door did not open. They could, however, now glimpse what surrounded the door beyond the doorframe. The door was set into a city tower.\n\nThe city tower was built with black bricks. The bricks looked a lot like the black stone that was everywhere in the tunnel, but they were much harder. Even Night Wind’s chain power could only leave scrapes across them. The scrapes he left behind looked like cat scratches.\n\nAs the power of Night Wind’s sword tore away more of the black rock surrounding the door, Han Sen saw three words engraved above the door. Han Sen recognized those three words. They were written in the common language of the universe.\n\n“Du God City,”\n\n“Du God City! This is Du God City?!” Night Wind screamed. Even Miss Mirror looked dumbfounded.\n\n“What is Du God City?” Han Sen asked Night Wind. He had never heard of this place before.\n\nNight Wind’s emotions had risen until he was almost hysterical. He lost all the composure a deified individual should have carried, but he didn’t seem to notice. His eyes blazed as he stared at the three words above the door. “The legends say that the Ancient God had a powerful city in ancient times. That place was called Du God City. Because the people of the Ancient God were born deified, they couldn’t level up further. Those who went to Du God City, however, often had the opportunity to rise above the deified level.”\n\n“All this time, everyone thought it was just a legend. No one could confirm that Du God City actually existed. If this is the real Du God City of the Ancient God, then that explains why so many weird things have happened to us. And perhaps there is a chance for us to become stronger here.”\n\nNight Wind looked at the door very excitedly. He seemed to have forgotten the danger that they were in. Han Sen couldn’t blame Night Wind for his elation, though. Even when Sacred had been in power, not many elites had been able to reach the last step.\n\nEven the horrendously powerful Ancient Water God hadn’t been able to rise above his deified status. Instead, he ended up as blood rain that moisturized the world.\n\nFor the vast majority of deified elites, going through the geno hall to become a god spirit had a practically microscopic chance of success.\n\nIf Du God City was a method in which one could become a god spirit, that would be tempting for any deified.\n\nDeified elites were still just people, and they could get sick and die. They were not immortal; even Sacred Leader had been searching for the key to immortality. It was natural for deified elites to want this.\n\n“If Du God City can turn people into god spirits, then Ancient God wouldn’t be one of the three most powerful races,” Han Sen said with a frown.\n\nMiss Mirror looked at the three words and said, “Du God City is just a legend. This city has the words Du God City written on it, but there’s no proof that it’s actually the city of our legends. If it was the real Du God City, why would it be buried here? We need to think about this. We need to be careful.”"
}