{
    "chapter": 1321,
    "title": "Biggest Problem",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1321",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Giant God Emperor has come; child of Godslayer Luo, come forth and challenge me!” The spirit’s voice was unbearably loud and frighteningly deep. When he spoke, his voice boomed, and the reverberations rattled one’s chest and shook the land around.\n\n“That’s one big boi!” Han Sen muttered, in half-jest.\n\n“Hey, BFG, how about you tone it down a little? We aren’t deaf!” Xie Qing King said, in immediate response.\n\nGiant God Emperor brought his head down low to meet them. It was so big, it was like a toppling skyscraper swooping down.\n\n“Can it, squirt! I’m already breathing gently and speaking quietly. If you can’t handle it, shove a baton in both your ears,” Giant God Emperor spoke again. Although the words were meant to intimidate, they were really just funny.\n\nHe was facing Xie Qing King while he spoke, and with each stressed word, spit was fired at Xie Qing King like heavy rainfall.\n\n“F*ck you! That’s disgusting. Stop spitting!” Xie Qing King was infuriated by the spittle downpour and sought to throw a punch towards Giant God Emperor.\n\nBut Xie Qing King was little more than a bothersome fly when standing next to Giant God Emperor. Still, Xie Qing King was unfazed by this difference in size, and so he made his fist blaze, right as he leaped forward to clobber the larger spirit’s forehead.\n\nA big thumping sound followed the hit, and the massive body went flying backwards to ruin what little was left of the charred shelter behind him. It was a weird thing to see.\n\nHan Sen said, “Hey, you shouldn’t fight here! Look at that thing. The shelter can’t take much more of a beating.”\n\nGiant God Emperor stood up with a displeased grimace. He did not speak, and just immediately threw a punch back towards Xie Qing King.\n\nXie Qing King dodged and flew up into the skies.\n\nThe two then fought, eye to eye, level to level with Xie Qing King’s airborne assist. There was no beating around the push or clever tactics being employed by the alu-alu-puncher, and he was going as direct as one could be.\n\nThe silver fists repeatedly went up against the giant ones with surprising—and amusing—competency. The shockwaves that erupted non-stop were rather dizzying, though.\n\nHan Sen was shocked, seeing how powerful Xie Qing King had become after opening his tenth gene lock. It had made an impressive change.\n\nAnd as the two battled, Moment Queen approached. She turned and looked to the skies and then watched.\n\nMoment Queen commented, “Whoa! He’s the sixth Son of God. You should run while you still can!”\n\nHan Sen merely smiled and continued to enjoy the spectacle, as if he were watching a friendly bout.\n\nOn the peak of Moving Star Shelter, three other spirits were watching the fight as well. One of them was robed in a black cloak. In his hand was a can. This was Gu Demon Emperor. Beside him was the all-too-familiar No God Emperor, who had become a bit of a pest for Han Sen, in recent times. The third spirit was unknown to them, but he was a little spooky to see. He had a large third eye lodged in his forehead.\n\n“Xie Qing King is quite impressive! It is no wonder he was so famous back in the day,” this three-eyed spirit said.\n\n“Age has done little to rust the grumpy old coot. If Xie Qing King starts firing on all cylinders, I don’t believe Giant God Emperor can defeat him. Unfortunately, his special powers can only be used twice,” Gu Demon Emperor said.\n\nHe had watched Xie Qing King defeat Gold General. The felling of that creature was a goliath task even for them, so he was well aware how strong Xie Qing King could actually be.\n\nThe three-eyed spirit replied to his observations, saying, “Killing the big lug shouldn’t mean too much. We have many more emperors on the way, all eager to rip this lot to shreds.”\n\nThe three-eyed spirit then looked around and asked, “And that aside, where is Godslayer Luo’s child? That’s what we came all this way for, wasn’t it?”\n\n“Inside the shelter someplace, or what’s left of it. Either that or she’s retreated to the Alliance, like all the weakling humans would when put to the test.” Gu Demon spoke with clear contempt for the human race.\n\n“We tried going after Godslayer Luo himself once before, did we not? Even he was too much of a chicken and clucked off. We can’t make mistakes this time, and our vengeance has been a long time coming.” The three-eyed spirit echoed the hatred Gu Demon Emperor was speaking with, and he looked bitter and spiteful.\n\nGu Demon Emperor responded, saying, “I sent word to many emperors. I can only presume they’re on their way, and I suspect once they’re here, we can finally let the slaughter commence.”\n\nNo God Emperor chimed in to say, “You’re all so blinded by the need for revenge against Godslayer Luo, you’re failing to acknowledge the real problem we face. And that problem is the man down there. Do you see him?”\n\nThe other two now turned to look at where No God Emperor was aiming his eyes. They all saw Han Sen, who almost looked relaxed as he spectated the battle that was on-going.\n\nThe three-eyed spirit asked, “Hey, there’s a thought! Do you think he might be another heir of Godslayer Luo, as well?”\n\n“Probably not. But believe me when I tell you he’ll be an even harder foe to deal with. Don’t underestimate him,” No God Emperor said.\n\nThe three-eyed spirit said, “It almost sounds like you’re complimenting the boy; sheesh, where did your spine run off to? If he’s not an heir, as you say, then he doesn’t have that one-hit kill power the girl does. If he doesn’t have that, then we have nothing to be afraid of.”\n\nGu Demon Emperor was surprised by what No God Emperor had said, but he viewed things differently than the three-eyed spirit. Understanding No God Emperor wouldn’t say what he had lightly, he asked, “Can you elaborate on the powers he possesses?”\n\nNo God Emperor said, “His body hardens to become the strongest material I have ever had to deal with. I fought him, and not even my No God Sword was able to bring him harm with a clean hit.”\n\n“What? You jest, surely!” Gu Demon Emperor and the three-eyed spirit were both taken aback by what they had just heard.\n\nThey knew how powerful No God Emperor was, and the power wielded by his blade of choice. They thought a resistance to its killing power was impossible.\n\nIf even he could not slay that man, then he might actually be a foe to be wary of.\n\nThe three-eyed spirit’s attitude to his warning became more serious, and with a grim look, he offered the suggestion, “I can try to break his body through the use of my own power.”\n\nGu Demon Emperor explained on his behalf, saying, “His powers are very effective against physical defenses.”\n\nNo God Emperor then went on to say, “His swords wield the powers of time and space, too. I was unable to block his attacks.”\n\nHearing this, they were in shock. Such a fierce combination was unheard of, and they viewed the man in a different light. They almost couldn’t believe what they were hearing, but they knew No God Emperor all too well. They knew he wouldn’t joke or make up a falsehood.\n\n“The human is that strong?” the other two asked in tandem."
}