{
    "chapter": 2712,
    "title": "Ice Geno Core",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2712",
    "text": "“Third Sister, you’re telling me that when you woke up again, the God Spirit Storm was gone?” Li Keer asked, looking at Exquisite with sheer disbelief.\n\nExquisite’s expression was strange. “That is what Han Sen told me.”\n\n“Weird. With your will, Third Sister, you shouldn’t have fallen into a coma even if your body collapsed. That simply shouldn’t be possible. How did you slip into a coma from mere exhaustion? And how did the God Spirit Storm suddenly disappear? This is so weird…” Li Keer looked as if she couldn’t believe it. After pausing, she said, “We’re fortunate that these unlikely events did occur, however. If they hadn’t, you and Han Sen would have been in real danger.”\n\nLi Keer wasn’t suspicious of Han Sen. She thought she could feel Han Sen’s mind, and she didn’t sense anything weird going on in his head. If he’d been plotting something devious, she should have been able to sense it.\n\nBut Exquisite had grown suspicious. She distinctly remembered Han Sen knocking her unconscious. And even more importantly, when Han Sen knocked her out, she had no longer been able to sense what Han Sen was thinking. That made Exquisite suspicious about Han Sen’s mind. She now worried that she didn’t have full access to what was really going on in his head. Otherwise, even if she had passed out, she would have known what Han Sen was doing. And she could have prevented him from knocking her out in the first place.\n\nAnd the God Spirit Storm should have continued to follow Han Sen. Why had it waited until she was unconscious to retreat? The timing seemed terribly inconvenient.\n\n“Han Sen… What did he do?” Exquisite’s mood was very conflicted, but she didn’t mention her suspicions to Li Keer.\n\nWhen Han Sen found some alone time, he took out the six deified geno cores and began studying them.\n\nOf the six deified geno cores, three of them had a lightning element. Two of them were fire, and one of them was ice.\n\nWhen most creatures refined geno cores, they tended to select ones that matched their specific element. Otherwise, they would end up damaging their bodies by absorbing the power of an element that clashed with their innate power.\n\nBut the elements of Han Sen’s body were very balanced. None of his elements stood out more than any others, and he had some of everything. Therefore, he didn’t have to be too picky with which elements he absorbed. He could refine any geno core he found with few complications.\n\n“I think I will save these three lightning element geno cores for Little Silver. I’m afraid his talents are a little lacking. If he refines these three, his evolution should be expedited, and he’ll be given the boost he needs to excel.” Han Sen set the three lightning element geno cores aside.\n\nThere were two fire geno cores and one that was ice. As he stared at the three geno cores, Han Sen hesitated. He selected the ice geno core. After all, Jadeskin had connections to the ice element. It had grown more attuned to that power as he developed.\n\nHe picked up the ice geno core. It was only the size of an adult’s fist, but it looked like a big diamond with countless facets. It sparkled beautifully.\n\nInside the geno core, falling snowflakes were visible. And somehow, those snowflakes seemed to outline a white, nearly transparent body. It was like a snow lady from a legend.\n\n“I have heard that only deified elites can refine geno cores. I wonder if I can do it right now?” Still holding his ice geno core, Han Sen activated Jadeskin and tried to absorb the power of the geno core.\n\nThe results were disappointing. Jadeskin was unable to refine the power of the geno core. The object sat in his palm, silent and unmoving.\n\n“The easy way failed, so I guess we’ll have to do this the hard way.” Han Sen picked up the ice geno core, popped it into his mouth, and swallowed it. Then he cast Consume. He was trying to force the ice geno core to break down.\n\nConsume had only just started running when Han Sen felt ice-cold power explode inside his stomach. It froze his stomach, then began to surge through the rest of his body.\n\nIn the blink of an eye, Han Sen’s entire body turned to ice. His whole form was enveloped in a sheet of ice. It was like he had been wrapped up in diamonds.\n\nHan Sen was shocked. He felt as if his lifeforce itself was starting to solidify in the intense cold. He quickly cast Jadeskin to fight against the terrifyingly cold power.\n\nJadeskin had high resistance against the cold. Even so, Han Sen’s cells slowed so much that he thought they had stopped working. It made Han Sen feel as if he wanted to sleep. His eyelids were as heavy, as if he had gone several days without sleeping, and it was everything he could do to keep them from closing. He could have gone to sleep right where he was standing.\n\nIn that drowsy state, Han Sen could faintly hear a woman’s voice whispering near his ear, saying, “Go to sleep… Go to sleep…”\n\nHer soothing voice almost pushed Han Sen into unconsciousness. Even though Jadeskin was running fitfully, he couldn’t concentrate enough to keep it going.\n\n“Oh, no! This cold power has a relaxing effect…” Han Sen thought, realizing what had happened. If he fell asleep now, there was a chance he might never wake up.\n\n“I cannot go to sleep… I can’t sleep no matter what… Right now, Jadeskin is barely keeping my lifeforce chugging along. If I fall asleep, the cells of my body will freeze and put me into a deep sleep. It will be hard for me to wake up again,” Han Sen warned himself. He told himself repeatedly to keep Jadeskin running.\n\nAlthough he knew he couldn’t sleep, he was becoming more and more exhausted. He was going to fall asleep any second.\n\nHis body was becoming weaker and weaker, and he needed to use his will to support himself. He couldn’t let himself fall asleep, no matter what.\n\nSome indeterminate amount of time later, Han Sen felt the tiredness begin to fade. His mind became increasingly awake and aware. The cold finally receded, and his body started to feel warm again.\n\nHan Sen knew he had passed the hardest part of the trial, but that didn’t mean he could let his vigilance falter. He kept casting Jadeskin, and he continued to absorb the foreign power.\n\nAs Jadeskin absorbed that power, Han Sen noticed that it wasn’t exhibiting any changes. The power was being absorbed, but it wasn’t melting into Jadeskin as he had expected. Rather, it seemed to be remaining an independent power within Han Sen’s body.\n\nHan Sen opened his eyes, and his heart stuttered. There were snowflake symbols on his skin, etched all across his body, like tattoos.\n\nHan Sen could feel the power inside him, and he knew he could control it. But he couldn’t use it quite like a normal geno art, or even incorporate its power into one of his own geno arts.\n\n“Deified geno cores are pretty mystical. No wonder people sometimes call them Talent Skill Stones. Right now, it’s like I have an ice element deified skill. I don’t know what this ice element skill can do, but I suppose it must have something to do with cold and sleep powers.” Han Sen knew that if he used the geno art’s power, it would require time to charge up again. It wasn’t like a geno art that he could fuel continually with his own energy.\n\n“Who should I use it on?” Han Sen considered that question, but he couldn’t find a suitable target. So, he put it out of his mind for the moment. He realized that he hadn’t visited Horizontal Evil, which he had planned to do some time ago. Since Exquisite and Li Keer were not around, he decided to go back to that mysterious place to meet with Horizontal Evil again."
}