{
    "chapter": 2473,
    "title": "A Sword That Requires a Life in Trade",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2473",
    "text": "Under the black tiger’s area power, a three-meter-tall, egg-like object formed and trapped Han Sen.\n\nHan Sen tried to deploy his Jadeskin and break the black area, but he noticed that the darkness encasing him was as solid as it was terrifying. He couldn’t move at all.\n\n“What is this area?” Han Sen felt strange, but he wasn’t worried. The area seemed to consume the areas of others to empower its own, but it didn’t actually deal any damage. All it seemed to do was trap him in the dark.\n\nIf Han Sen really wanted to leave, he could use his super god spirit body to flee from the darkness. No matter how solid that darkness was, it couldn’t bind him permanently.\n\n“What’s wrong, Han Sen? Not so cocky now?” The Kings all laughed loudly in unison.\n\nThe dark area might have been solid, but it wasn’t insulated against sound. Han Sen could hear what they were saying clearly.\n\n“This area isn’t bad. What is its name?” Han Sen asked.\n\nThe Kings heard his question, and the half-deified that Han Sen conversed with earlier said, “This is Big Sky King’s Black Big Sky King Area. It has consumed twenty of our King area powers to trap you inside. And it doesn’t just work on you, either. Even if Lando was here, we’d have shut him in there with you.”\n\n“If that was true, why didn’t you try to capture me when Lando was around?” Han Sen asked with amusement.\n\n“We didn’t want to offend the ruler of the Destroyed,” the King answered.\n\n“We don’t need to talk to him! Let’s take him to the Extreme King so we can collect the bounty,” another half-deified said, cutting off the conversation.\n\nHan Sen felt the darkness start to move. He knew that the Kings were moving through the Tianxia System, pulling the dark area along with them.\n\nHan Sen tried to use the Dongxuan Area to get a better view of the dark area. He noticed that the substances composing the dark area were tightly woven, almost like a substance chain.\n\n“This is a very powerful area. It is showing the signs of creating a substance chain. Maybe this black tiger is on the verge of becoming deified,” Han Sen thought to himself.\n\nThe black area absorbed the areas of others to become very hard. Han Sen used Super Spank, but he still couldn’t break it. He decided to take a bit of a break. He was going to recover his energy before giving it another try.\n\nThe Kings were very excited. They pulled the egg-like area toward the edge of the Tianxia System. But not long after, Han Sen heard a scream from outside his prison.\n\nThat scream was the half-deified who had conversed with Han Sen earlier.\n\nAfter that scream, Han Sen heard something that sounded like space ripping. And then, everything grew quiet. Han Sen kept listening, but he couldn’t hear any other sounds.\n\nAside from that initial scream, there was no other sound to be heard. It was as if all the Kings and half-deified people had suddenly run for the hills.\n\n“Weird. Even if they saw an enemy, they should have said something. Why was there only one scream and then silence? Were they all killed before they could make a sound?” Han Sen thought to himself.\n\nKatcha!\n\nAs Han Sen was considering what might have happened, he suddenly heard a sound like rocks breaking. Then, a beam of light broke through the darkness that surrounded him.\n\nThe giant egg cracked, and a webwork of light spread across its surface. It eventually shattered completely, freeing Han Sen.\n\nWhat Han Sen saw next shocked him, though. Lando was hovering there, looking at him calmly.\n\nHan Sen coughed awkwardly into his hand. “I was afraid you would be unable to beat the Butterfly Fairy Six Kings, so I may have run farther than I should have. I was caught by these people and brought to where you are now.”\n\nHan Sen had wanted to be taken by those people because he hoped they would take him farther away from Lando. But it seemed as if that plan hadn’t worked out the way he’d hoped.\n\n“Let’s go.” Lando said nothing more. He turned around and started to fly away.\n\nHan Sen fell into place behind Lando again, but as they flew, he thought to himself, “How was he able to find me so quickly? Even if he was able to defeat the Butterfly Fairy Six Kings with ease, I intentionally took a route that would have been difficult to follow. And this Tianxia System is pretty much a maze. How was he able to tell where I was in such a short amount of time?”\n\nHan Sen knew that he was missing something important. He immediately used the Dongxuan Aura to check his body. It wasn’t long before he felt something out of place in one of his fingers.\n\nThe skin on his fingers was fine, but on a bone in one of the fingers in his left hand, there was a tadpole-shaped mark. That mark was tiny, and it didn’t even release any power. Han Sen hadn’t even noticed its presence until that moment.\n\nIf he hadn’t grown suspicious and used the Dongxuan Aura to scan his body, he wouldn’t have found that weird, grey symbol on one of his bones.\n\nHan Sen remembered that Lando had struck and cracked a few of his fingers. The mark must have been placed during that strike.\n\n“That’s why he feels so safe without physically binding me. It’s because he already has a tracker on me.” Something about the idea of being tracked everywhere he went made Han Sen deeply uncomfortable.\n\nBut that grey mark wouldn’t stop Han Sen. It was easy to remove, too. All he had to do was use his super god spirit body.\n\nBut Han Sen didn’t do anything about it just yet. He kept cool and pretended as if the mark had gone undiscovered. He continued to follow Lando.\n\n“Lando, did you kill those Butterfly Fairy Six Kings?” Han Sen asked, flying up next to Lando.\n\nLando said quietly, “I’m not a butcher. I don’t kill when it isn’t necessary.”\n\n“What about your master, then? You must have had a reason to kill him,” Han Sen inquired.\n\nEmotion flashed over Lando’s face, but it soon returned to normal. With that same cold tone of voice, he said, “That is none of your business.”\n\n“Say something that is my business, then. Why are you taking me to the Extreme King? I didn’t think someone like you would care about a reward,” Han Sen said.\n\n“There’s a sword.” Lando seemed like a nice person to chat with. He didn’t sound like the teacher-slaying murderer the legends spoke of. Han Sen had imagined the man would be difficult to talk to, but that wasn’t the case.\n\n“What sword could be worth that much? If you want a weapon, I can give you a deified weapon. You’ll find me easier to trade with than the Extreme King.” Han Sen wanted to learn more.\n\n“I only want that sword,” Lando said as he moved forward. He didn’t turn to look at Han Sen.\n\n“A sword that you have to trade a life for must be very special. Why don’t you tell me what is so special about this sword?” Han Sen said with curiosity.\n\nLando didn’t respond. It was obvious he had no intention of telling Han Sen anything else about this sword that he wanted so badly.\n\nHan Sen started to say something else, but he suddenly heard the sound of something stampeding toward them through the clouds. It sounded like a thousand horses running all at once. He raised his head and saw a group of unicorns burst through the clouds. They looked like an endless sea of white.\n\nAll emotion left Lando’s face. He spoke to Han Sen, saying, “Protect yourself.”"
}