{
    "chapter": 2415,
    "title": "Stone Field",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2415",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe xenogeneic space was a very rocky landscape. The ships landed amidst an enormous field of stones, and the passengers of the ships made camp nearby.\n\nOn Miss Mirror’s orders, the Spring Rain members began digging into the stone field, unearthing even more rocks.\n\nMiss Mirror didn’t instruct Han Sen to do anything, other than telling him to stay in camp. While he didn’t have to do any digging, his ability to wander around as he wished was limited.\n\nHan Sen asked Miss Mirror what sort of place they had come to and what their mission was there, but she didn’t answer him. She just told him that he would be safe as long as he stayed close, and he would be called for when the time came for him to work.\n\n“This is the xenogeneic space Ning Yue described. Ning Yue’s little green sword came from one of the rocks that was found here. It looks like Miss Mirror’s task here is the same as it was for the Hell. They want to excavate something out of all this stone,” Han Sen thought to himself. He really wanted to join the others in the stone field, so he could examine the rocks.\n\nBut Miss Mirror was very firm that he shouldn’t leave camp, so joining the others was out of the question.\n\nInstead, Han Sen spent his time studying his geno arts and absorbing King class xenogeneic genes.\n\nOn their second day in the xenogeneic space, something occurred in the stone fields. A few Spring Rain members had to be carried back to camp. When Han Sen heard the commotion and came over to see, he found that the unfortunate individuals were turning into stone. Not long after, their entire bodies were fully petrified. They were just a bunch of statues.\n\nMiss Mirror and the two deified elites tried to stop the petrification process, but they could do nothing. None of their attempts even seemed to slow the transformation.\n\nAfter this, the work in the stone fields was brought to a halt. Although they were no longer digging, Miss Mirror showed no sign of wanting to leave.\n\nMore ships arrived a few days later, bringing many different creatures to the camp. They were from a variety of different races, and all of them were Marquises or Dukes. They must have been brought there to become workers in the stone field.\n\n“Ning Yue.” As Han Sen watched the workers line up to register, he saw a pretty woman with pink armor. He recognized her as Ning Yue, and he felt his eyes widen.\n\nHan Sen was shocked. Not because Ning Yue was now a woman; Han Sen knew that little factoid already.\n\nIt wasn’t strange that Ning Yue was actually there, either. Ning Yue would have been looking for a chance to come back, so he could find out what happened to his body. The Extreme King had recruited workers, so it was reasonable that Ning Yue had joined their ranks.\n\nHan Sen was simply surprised by what he wore. He had a little pink dress on, and he also had some pink earrings, rings, necklaces, and red flowers in his hair. He was like a pink lady, and he was genuinely pretty. If Han Sen hadn’t seen Ning Yue before, he definitely wouldn’t have been able to recognize him.\n\n“Oh no! What is wrong with Ning Yue? Even if his body turned into the body of a woman, it doesn’t mean he has to dress up as one,” Han Sen thought to himself. The longer he watched Ning Yue, the more convinced he became that something was deeply wrong.\n\n“How to talk to Ning Yue alone?” Han Sen wanted to ask him what had happened, but he wasn’t permitted to talk to the workers. Even if he could, everyone would be watching. There was nowhere they could discuss matters privately.\n\nHan Sen thought about it overnight. And the next day, he barged into Miss Mirror’s office.\n\n“Miss Mirror! Miss Mirror! You brought me here, and yet you aren’t letting me do anything. You won’t let me out, and you won’t even let me go on the internet. What is this?” Han Sen demanded.\n\n“My Lady, we couldn’t stop the prince! He just barged in,” the guards said tensely, trying to explain his sudden intrusion.\n\n“You guys can leave,” Miss Mirror said in a cool voice. Her pretty eyes didn’t even glance their way. Instead, she kept her focus fixed on the documents she was reading.\n\nAfter the guards closed the door, Han Sen said, “Even if you don’t want to let me out, at least allow me to do something. If I’m stuck at home all day again, I am going to go crazy. And Bao’er is just a kid. She can’t remain cooped up all day, either.”\n\n“You are the one who asked to bring her here. She is entirely your responsibility.” Miss Mirror closed the file and looked at Han Sen. “You will be given your task when the time comes. But for now, your job is just to wait patiently in camp.”\n\n“Fine. I can do that, but can you at least make nicer food? Plus, I want Bao’er to have a maid to look after her. That isn’t too much to ask, is it?” Han Sen said.\n\n“We are here to work. We aren’t here on vacation.” After a brief pause, Miss Mirror said, “I will find you a maid. Now go home.”\n\n“That’s better. Find a pretty one, though. It annoys me if the maid is ugly,” Han Sen said.\n\n“Are you looking for a maid, or are you looking for a woman?” Miss Mirror asked sternly.\n\n“I am Prince Sixteen. Is there something wrong with having a woman to please me?” Han Sen smiled.\n\n“Prince Sixteen?” Miss Mirror shot Han Sen a flat look.\n\nHan Sen coughed. “I wasn’t going to do anything. I just want someone to look after my kid. But you won’t let me go out, and I must make myself look like more of a prince.”\n\n“Any other concerns you would like to share?” Miss Mirror asked, fixing Han Sen with another unnerving stare.\n\n“No,” Han Sen answered.\n\n“If there is nothing more you require, then go home. I have work to attend to,” Miss Mirror said in clear dismissal.\n\n“Then I’ll go now. Please be considerate when picking a maid for me,” Han Sen said. Miss Mirror stared at him until he left the office.\n\n“I wonder if Miss Mirror will just pick a worker? If she picks a worker, I think Ning Yue will have a high chance of being selected,” Han Sen thought as he walked. It was all he could do, after all.\n\nIf Miss Mirror didn’t pick a worker, then Han Sen would have to find another way to get some alone time with his target.\n\nThe next day, after Han Sen opened the door to take Bao’er to the canteen to eat, he saw a pretty Extreme King woman standing directly before him.\n\n“My Prince, Miss Mirror asked me to serve you.” The woman bowed to Han Sen, but her face was expressionless.\n\n“Not bad! What’s your name?” Han Sen smiled at the woman.\n\nHe had been prepared for this possibility, so he wasn’t disappointed. If Miss Mirror had picked any random person, Han Sen would have grown suspicious.\n\n“Falling Leaf,” the woman answered.\n\n“Falling Leaf, huh? Not bad. Not bad. Miss Mirror didn’t disappoint me. Come. Let’s go find something to eat.” Han Sen squinted slightly, lifting a smiling Bao’er up to sit on his shoulder. Then the trio made their way to the canteen.\n\nWhile they ate, Han Sen turned to Bao’er’s new maid. “Falling Leaf, your mission is to take care of Bao’er. Satisfy all her desires. You cannot make her cry. Do you understand?”\n\n“Sure,” Falling Leaf answered, her voice smooth and emotionless."
}