{
    "chapter": 1939,
    "title": "Heaven",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1939",
    "text": "“Why are you following me?” Han Sen asked, looking at Hai’er.\n\nHai’er sauntered casually behind him. “I gave you my end of the bargain, so of course I’m going to follow you. Heaven is going to open in a few days, and until then, I am attaching myself to you.”\n\n“I am going to listen to Burning Lamp Alpha’s speech. We can meet there,” Han Sen said.\n\n“There’s nowhere else for me to go, anyway. I might as well follow you. It might be nice to meet up with Knife Queen, too.” Hai’er really wanted to follow him.\n\nHan Sen, seeing that Hai’er wasn’t leaving, allowed her to tag along.\n\nThere were a few days to go until the speech was to commence, and it felt like forever for Han Sen. On the day of the speech, Yisha still hadn’t revealed herself.\n\n“Weird. Where is Yisha? Did she go to the speech area straight away?” Han Sen frowned.\n\n“Are you really Knife Queen’s student? Where is she?” When the speech was about to begin, Hai’er cast a suspicious glance at Han Sen. She was starting to think she didn’t know who he really was.\n\n“If you don’t believe me, then take your tablet back. Then we can go our separate ways.” Han Sen held it out to her.\n\nOver the past few days, he had researched the text on the tablet. It looked like something very profound, but there was no beginning or end to the text it included. It was just a section of a greater geno art. You couldn’t learn anything from that.\n\nHan Sen found out the tablet was rather well-known, though. The section that Hai’er had was likely very real.\n\nThe Virtual Tablet had quite a lot of storage, and the geno art filled all of it. If he only had one piece, then he only had one part of the geno art. It was no wonder why Hai’er was willing to give it to him.\n\n“No! You’ve already read the contents. What’s the point of giving it back to me now?” Hai’er shook her head.\n\nHan Sen ignored her, and he continued to frown.\n\nThe speech started, and Yisha had yet to return. Without Yisha, Han Sen wouldn’t have the Buddha’s invitation to enter their Heaven. He could not listen to the speech in the palace, so he’d have to stay in the plaza and listen alongside the commoners.\n\nBurning Lamp Alpha couldn’t be seen from the plaza. The audience could only listen to his voice ringing out of yellow speakers.\n\nMany creatures listened to the speech through the Buddha sound system. When Han Sen heard what was being spoken, he thought it was very meaningful. He felt as if his heart had leveled up.\n\nBut after thinking about it a little more, he thought it was indeed a little too vague. If you could do what the speech told you to do, you would have to be a saint. You wouldn’t have to learn anything.\n\n“It’s your fault! I am from the Pirate! I am supposed to listen from the palace. Now I’m stuck in the plaza with these lowlifes and you!” Hai’er sounded upset.\n\nHan Sen laughed and said, “You probably weren’t going to listen all that well, anyway. It doesn’t matter where you were standing when you heard him speak.”\n\n“It’s different. Hearing it from the palace is a recognition of your identity. It’s different when you’re there,” Hai’er said. Han Sen didn’t think too much on the speech, though. He was concerned for Yisha, who was still a no-show.\n\nFar away, in a stone pavilion in the southwest corner of Buddha Kingdom, an old man was sitting in front of a table. It looked as if he was dozing off.\n\nThere was a game of chess sitting on the table, and it was in the midst of a stalemate.\n\nYisha was sitting opposite the man, examining the stalemate in play atop the table. She was holding a piece, trying to decide on her next move.\n\nThe pavilion was fairly ordinary, but it gave others a feeling of separation from the world outside. It was like a realm that did not exist in full.\n\nTime passed, and Yisha sat as still as if she had been turned to stone.\n\nHan Sen couldn’t see Burning Lamp Alpha, and the speech lasted the entire day. After that, the creatures all showed their thanks to the Alpha, kowtowing before the palace.\n\nThe speech ended, and the heavens opened. Countless creatures poured in towards the opening.\n\nHan Sen and Hai’er were stuck in the crowd, looking at the way to Heaven.\n\nThere were eight doors in the Buddha city, and three of them were open. Five of them were always shut. One of the doors led to Heaven, and that was the only way to Heaven. It was situated in the west.\n\nThe western door was now open, and when they looked out at it, they could see a Buddha light. It obviously did not lead to the land outside the city, as one might expect.\n\nHan Sen still hadn’t seen Yisha, so he decided to move with the crowd towards the western door. When he went through the western door, he was not taken outside the city. He found himself in a desert.\n\nNothing was visible on those desert wastes; not even cacti. It was just yellow sand, sizzling beneath a bright, hot sky.\n\nAfter entering the desert, Han Sen heard something, like someone whispering near him. It almost sounded like someone speaking the Buddha catchphrase, but from an indiscernible source.\n\nThe noise flowed all around him in a constant susurrus. The sound wasn’t loud, but he could hear it clearly. It was like it was coming straight from his brain.\n\nAs he listened to that sound, Han Sen’s body wanted to move along with it. It made him frown.\n\n“Do you hear a noise?” Han Sen asked Hai’er.\n\n“Of course. Did you not know that Heaven has the heavenly sounds?” Hai’er rolled her eyes. If she hadn’t asked around, she wouldn’t have believed Han Sen was the student of Knife Queen. He didn’t know anything.\n\n“What’s up with these heavenly sounds?” Han Sen was trying to pinpoint its source, but he couldn’t figure it out.\n\nHai’er kept walking and explained, “The music is everywhere, all across this Heaven. At first, it will feel like it’s nothing. But the longer you hear it for, the deeper it will touch you. If you can’t stay composed and walk through this Heaven in time, your body will begin to dance along with it. It won’t stop until you’re dead.”\n\nHan Sen frowned and said, “If it’s that dangerous, and only ten people can make it through, why are so many people coming here? Aren’t they afraid of dying?”\n\n“Well, you can turn back before you lose control. You’ll be safe if you do that.” Hai’er looked around, but she could not catch sight of Speechless. Then, she asked, “When will you and Speechless meet up?”\n\n“I told you! We are not in a relationship.” Han Sen looked around and asked, “How do I know when to keep going or when I should return?”\n\n“It depends on who you are. Everyone has fear in their hearts. You turn back when you’ve lost all hope. The more confident and stubborn people are, the more danger they are in.” Hai’er rolled her eyes, and continued on to say, “But you will be fine. Speechless will protect you, and you will make it to the end.”"
}