{
    "chapter": 3039,
    "title": "Not Praying to a God Spirit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3039",
    "text": "The chance for humans to gain a God Spirit’s blessing of Blood-Pulse was not as low as Han Sen thought. There seemed to be a one in five success rate.\n\nMost humans only received a single purple lotus. Two purple lotuses were far rare to receive, but one special young man was able to obtain four purple lotuses at once.\n\nIt was almost Han Sen’s turn. Mister Yang couldn’t help but ask, “Mister, are you really going for the test?”\n\nHan Sen looked at him and asked, “Is there a problem?”\n\nMister Yang looked to his left and right. He got closer to Han Sen and whispered at a volume only the two of them could hear, “Mister, the God Spirits only give humans a God Spirit Blood-Pulse.”\n\nHan Sen understood what Mister Yang was trying to say. Mister Yang thought Han Sen was a gene race. That was why he was worried.\n\n“If a gene race puts their blood onto a stove, what would happen?” Han Sen asked with a smile.\n\n“I don’t suppose anything special would happen,” Mister Yang said after thinking for a moment.\n\n“In that case, it should be fine,” Han Sen said to comfort him. “Nothing will happen. At the very most, if there are no adverse effects, there is no need for you to worry.”\n\nMister Yang thought that made sense. Although he still felt a little nervous, especially given how weird of a history Han Sen had, if something happened, it would not play out well for him.\n\nThey queued for a while longer. It was finally Han Sen’s turn. Han Sen waltzed right into the god temple while Mister Yang’s heart pumped like mad. Peaceful was watching from afar. She paid close attention. She was eager to see the results of Han Sen’s test.\n\nAfter Han Sen entered the god temple, he walked straight up to the stove. He wanted to prick some blood and drop it onto the stove for a go. The two soldiers hurried over to him and stopped him. “Are you not going to kneel before the God Spirit?”\n\nWhen Han Sen heard them, he frowned. He had killed Evil Lotus God before. Now, they were asking him to kneel before Evil Lotus God’s statue. There was no chance of him doing that.\n\n“Hurry up and kneel,” the soldier impatiently said.\n\nHan Sen thought about it, but he ultimately decided to turn around. It was only for fun. Doing the test or not did not matter to him. Having him kneel in front of Evil Lotus God was something he preferred not to do.\n\nSeeing Han Sen turn around, the soldiers that guarded Evil Lotus God Temple were surprised. They did not know what to do.\n\nWhen Han Sen was almost out of the god temple, a man showed up in front of him and stopped him on his way. “Are you leaving so simply?”\n\n“I remember I have something more important to do,” Han Sen said. “I won’t test today, so please excuse me.”\n\n“It is OK if you do not want to do the test, but you entered the god temple. You must at least kneel. Otherwise, it will be considered as you being blasphemous toward a God Spirit.” The man did not fall back. His words directed at Han Sen were cold.\n\nNow, the soldiers guarding the god temple reacted. They all came up to surround Han Sen.\n\nMister Yang quickly ran forward and said, “Mister Shibo, this is a misunderstanding. My friend came from the mountain. He does not know the rules. If he has offended you, please, for my sake, let him go.”\n\nHe was not afraid of Han Sen getting hurt. He was afraid of Shibo making Han Sen angry. It would be bad if Han Sen slapped Shibo into pieces. That would have caused him major trouble.\n\nShibo was Ancient God City’s leader’s son. If Shibo was killed, the leader would not sit back and do nothing. Han Sen would also make the leader become a smear. If he did that, he would shock the entirety of the Qin Kingdom’s people.\n\nFrom what Shibo saw, no matter how high of a level Han Sen was, he was just a gene race. There was no way he could fight against Qin Kingdom’s high-class people. He would have to suffer.\n\n“If he is from the mountains, it makes sense,” Shibo said with a look that suggested he fully understood. He suddenly looked cold and said, “I do not care if he is from the mountains. The sentence for committing blasphemy before a God Spirit is death. If he kneels now, I can spare his life. But he will still have to suffer.”\n\nBefore Shibo finished, Han Sen interrupted by saying, “I am not kneeling today, no matter what you try.”\n\n“It is OK if you don’t.” Shibo coldly laughed. He pointed his finger at the sky. In the next second, there was a big booming noise. A giant, black-shelled creature landed in front of Shibo. It shook the plaza three times.\n\nHan Sen looked at the shell creature. It looked like a beetle. The black shell was glowing. The wings were upside down. It looked as if it was ready to munch on someone. “If you are willing to become my overbearing bug’s food, then you do not have to die for your blasphemous behavior,” Shibo said with a laugh. His face looked very cocky.\n\n“That is Mister Shibo’s overbearing bug. I have heard it is a King class gene race. It has incredible powers and defense.”\n\n“If I had such a powerful gene race, I would be happy and content for the rest of my life.”\n\nThe people in the plaza looked at the overbearing bug with envy. They did not feel sorry for Han Sen.\n\nFrom what they had seen, Han Sen came from the mountains. Someone from the mountains was being blasphemous to a God Spirit and had even offended a noble like Shibo. That was practically asking for a death wish.\n\nMister Yang was frantic, but there was nothing he could do. He could only just feel hurried and worried.\n\nShibo looked at Han Sen very cockily. “Are you going to kneel now and let me break your legs? Or do you want to be food for my overbearing bug?” “I just want to leave,” Han Sen casually replied. He walked past the overbearing bug, ready to leave the temple.\n\n“How dare you!” Shibo was angered.\n\nThis was his first time being in charge of the ceremony. He did not want to kill anyone, but Han Sen was being insufferable. He did not care too much, so he commanded his overbearing bug.\n\nThe overbearing bug squealed. Its mouth was full of sharp teeth. It went straight for Han Sen.\n\nShibo crossed his arms. He looked at Han Sen coldly and prepared to watch him get torn apart by the overbearing bug.\n\nPeaceful frowned as she watched. She did not understand what Han Sen was trying to achieve. It seemed as if he was asking for trouble.\n\nIn any kingdom, admiring a God Spirit was the most basic ceremonial gesture one could perform. Han Sen went to a god temple and did not kneel before the God Spirit. He was just asking for trouble, which was why Shibo was mad.\n\n“That is fine. I will see what his power is like,” Peaceful thought.\n\nSeeing the overbearing bug about to eat him, Han Sen did not summon a gene race. He raised his fist and threw a punch at the overbearing bug’s head.\n\nPeaceful was frozen. Shibo looked as if he was watching a fool.\n\nHe did not use a gene race or God Spirit blood. He used pure power to fight a gene race like the overbearing bug. Everyone thought Han Sen was either stupid or crazy.\n\nWhen Han Sen’s fist landed on the overbearing bug’s head, everyone’s mouths dropped to the ground."
}