{
    "chapter": 246,
    "title": "Doppelgänger Beast Soul",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_246",
    "text": "Type of beast soul of sacred-blood beetle knight: doppelgänger.\n\nHan Sen was puzzled, as he had never heard of this kind of beast soul before. He tried to summon the beetle Knight, but it simply did not work.\n\n\"How can I use this doppelgänger beast soul?\" Han Sen studied for a long time and did not find out how it was supposed to be used.\n\nHe did not have too much time for research anyway. It was about time that he should go back eat the creature he had been feeding.\n\nHan Sen eventually understood what it was like to have too much to eat. There was so much meat of the magic horn. Even with his sacred-blood wings, he could not fly fast with a few hundred pounds of meat on his back.\n\nHan Sen had fed the bones and inner organs to the golden rock worm king, otherwise it would be even heavier.\n\nOn his way back, Han Sen had been feeding himself with the magic horn meat all the time, and now he would vomit when he saw more.\n\nHe had to eat though. It was sacred-blood meat, and he could not afford to waste anything.\n\nEventually Han Sen reached his limit and thought of the holy angel. He summoned the holy angel and fed her a piece of barbecued meat of the magic horn.\n\nThis time the holy angel took the meat and started to eat. She looked very cute and had a nice manner. However, she did not ever stop and finished the piece of meat of 2 pounds in just a little while.\n\nThe little girl regarded the remaining meat with desire. Han Sen decided to let her eat as much as she wanted.\n\nHe was really tired of eating this kind of meat at this point and decided not to torture himself anymore. He could feed sacred-blood creatures at home anyways, and could spare this one.\n\nThe holy angel looked like a little girl but had an appetite of a monster. In just one hour, Han Sen could only ram a pound of meat down his throat, whereas the holy angel had already consumed more than two dozen pound.\n\n\"So, is this the appetite of a typical sacred-blood pet?\" Han Sen gazed at the holy angel enviously. If he had the same appetite, he would not have to worry about the size of sacred-blood creatures anymore.\n\nIf people learned that Han Sen was picky about eating sacred-blood meet, they would probably want to kill him.\n\nThe next few days, Han Sen ate some meat himself and fed the majority to the holy angel. When they were out of the Dark Swamp, the meat was almost finished.\n\nHan Sen thought the holy angel did not really grow anywhere after eating the better half of the meat, but her breasts seemed to be a little plumper.\n\n\"Am I seeing this right?\" Han Sen thought to himself, \"If this kind of meat could lead to a boost in bra size, numerous women would kill each other to have some.\"\n\nHan Sen gained two sacred geno points from the part of the magic horn meat he ate, and now had 52 sacred geno points.\n\nHe eventually went back to his own room at Steel Armor Shelter. The cloud beast he was feeding had evolved into a sacred-blood creature. Han Sen killed it to make a meat stew.\n\nAfter two bites, Han Sen heard the voice indicating the increase of sacred geno points. He thought with content, \"This is how it should be. It is such a torture trying to eat the entire magic horn.\"\n\nThe sacred-blood cloud beast added five more sacred geno points and made the count 57.\n\nHan Sen was slightly disappointed that he did not gain a beast soul from this cloud beast and chose to feed another cloud beast.\n\nOn the campus of Blackhawk Military Academy, Situ Xiang was going crazy. After Han Sen entered God's Sanctuary, she hadn't heard from him in three months.\n\nIt was almost time for the archery tournament, and Situ Xiang was afraid that Han Sen might have run into some accident in God's Sanctuary.\n\nOn one hand, she was worried that he would miss the tournament; on the other hand, Situ Xiang did not want anything bad happening to such a talent.\n\nSitu Xiang almost went to ask the security department of the Academy every day, trying to see if Han Sen had been back.\n\nSince every student needed to swipe a student ID when entering and returning from God's Sanctuary on campus, Situ Xiang would know if he was back.\n\nAfter her morning exercise, Situ Xiang heard from the security department that Han Sen was back.\n\nWithout hesitation, Situ Xiang immediately went to find Han Sen and let out a sigh of relief. \"Eventually he's back. I need to give him another training in the next few days. This guy is so much trouble.\"\n\nHan Sen wanted to find his girlfriend, but was stopped by Situ Xiang.\n\n\"Coach Situ Xiang!\" Han Sen saw Situ Xiang who came in a hurry and did not know what happened.\n\n\"Follow me.\" Situ Xiang took his arm and led him away. Han Sen was crucial to the school team and she had to make sure he was his best self.\n\nSitu Xiang took Han Sen to the facility of his last training. Instead of calling her dad, she decided to train him herself this time.\n\nSitu Xiang knew very well that at Han Sen's level, he no longer needed to learn more techniques. She was only worried that after staying in the God's Sanctuary for so long, he would be less familiar with archery. She wanted him to do a recovery training to make sure his archery skills were perfect.\n\n\"Coach, I don't think I need to do a full-on training. Some exercise will do,\" Han Sen licked his lips and said.\n\nHe had always been using his archery skills, which were in his bones.\n\n\"10 moving targets. If you could beat me, you can skip the training,\" said Situ Xiang decisively, handing the training bow and arrows to Han Sen.\n\n\"Coach, this is not fair. You are an evolver, and much better in strength speed and reflex than I. If I beat you as an unevolved person, you would feel so bad,\" said Han Sen casually.\n\nSitu Xiang paused. She had anticipated complaints from him, but did not expect Han Sen to have such a response."
}