{
    "chapter": 2316,
    "title": "Metal Doll",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2316",
    "text": "Fox Queen’s beautiful face darkened. “Are you mocking me by suggesting that I lost to the hands of your teacher?”\n\n“You are looking into my words too deeply, sister.” Han Sen laughed.\n\nFox Queen’s expression was like ice, and she said, “If I hadn’t been suppressed for so long that my talents stagnated, your teacher wouldn’t have been able to defeat me. When I regain my strength, I am going to break her.”\n\nClearly, Fox Queen still harbored much contempt for Yisha due to her defeat. She seemed to care about her loss quite a lot.\n\n“If you’re still recovering, why have you come here to the Extreme King?” Han Sen asked with a grin. He wanted to get whatever information he could from her.\n\nFox Queen gave him a beatific smile. “Don’t worry, I’m not here to cause you trouble. I am actually hoping to work with you.”\n\n“You want to cooperate? Why?” Han Sen looked at Fox Queen with confusion.\n\n“So we can steal treasure, of course. If there wasn’t treasure up for grabs, why would I be here with the Extreme King?” Fox Queen said, stepping closer to Han Sen. She reached out to touch Han Sen on the cheek, but he leapt fifty meters away like a rabbit. He looked very alert.\n\n“Huh, that’s not very courageous of you. Do not worry, I need your help. I don’t intend to do anything bad to you,” Fox Queen assured him with a chuckle.\n\nHan Sen coldly said, “I am just a small-time Duke. I don’t think I will be able to help you.”\n\nFox Queen had been bold to sneak into the Extreme King. Whatever she wanted to steal had to be important. If someone made the Extreme King angry, the elite race would probably destroy that person’s friends and family.\n\nEven if Han Sen wasn’t afraid, he had to think about his family and friends on Planet Eclipse.\n\nPlus, evil women like Fox Queen were completely untrustworthy. She would happily betray anyone she wanted to.\n\n“You will help me. I am merely here to say hello so that you will be prepared,” Fox Queen said. Her body returned to her guise of Red Sleeve. She waved at Han Sen and went on to say, “I’m leaving now. It would be bad if someone saw you with me. I will see you later, my good brother.”\n\nAfter that, Fox Queen put her fingers to her sexy red lips. She blew Han Sen a kiss and then flew away.\n\nHan Sen frowned. Fox Queen had come there to see him and reveal her true self. She was clearly there to warn him about exposing her true identity.\n\n“How dare she threaten me. It’s not like she can blackmail me or anything, but she seems too confident. She must have her reasons. She couldn’t be bluffing me, could she?” Han Sen couldn’t figure out her current game. He wondered what had really compelled her to expose her true self to him there.\n\nHan Sen put away thoughts of Fox Queen and got back to hunting down xenogeneics.\n\nHis pursuit of xenogeneics eventually brought him to an orange mountain. When he landed, a wall began to shake next to him.\n\nA creature made of black metal emerged. It looked like a doll, and it walked right out of the wall. Its body moved with machine-like clumsiness as it approached Han Sen.\n\n“A Duke class metal doll?” Han Sen grinned.\n\nMetal dolls were Planet King Kong’s special type of xenogeneic. They were very rare, and it was uncommon to see one away from the metal mines.\n\nThe metal doll’s xenogeneic gene was an extremely rare ingredient of xenogeneic treasure. It was a Duke class item, but it was a valued component for the creation of King class xenogeneic treasures.\n\nThe body of a metal doll was a good xenogeneic treasure ingredient, as well. Its entire body was valuable.\n\nHan Sen needed xenogeneic genes, and a metal doll was worth a dozen ordinary Duke xenogeneic genes.\n\nThe creature’s body looked clumsy, and it suddenly started moving. Its fist flashed toward Han Sen like lightning.\n\nThe thing might have looked awkward, but it moved with incredible speed. An ordinary person couldn’t have reacted to its attack in time.\n\nBut Han Sen’s reaction times were the best of the best. He jumped up and dodged the metal doll’s swift punch, then he struck back with his Ghost Teeth Knife and cut the metal doll’s brain in half.\n\n“Xenogeneic Duke hunted. Metal Doll: xenogeneic gene found. Obtained Metal Doll beast soul.”\n\n“It gave me a beast soul? I wonder what type of beast soul it is.” Han Sen was delighted. He checked out the beast soul inside his Sea of Soul.\n\nDuke Beast Soul Metal Doll: Halo-type\n\nBefore Han Sen could try out the beast soul, a loud noise came from overhead. Someone landed right next to Han Sen.\n\nHan Sen turned to take a look at the man next to him. His presence was intimidating, and he was definitely King class.\n\n“Leave the item there, and I will permit you to go,” the King class guard said coldly. Then he moved to pick up the remains of the metal doll.\n\n“That is my kill!” Han Sen stepped onto the metal doll, knocking it from the other guard’s grip. The metal doll shook beneath Han Sen’s legs. It didn’t go to the King class guard.\n\nThe King class guard chuckled icily. “You are allowed to kill and rob whoever you want in Knight’s Paradise. I’m only taking the prey and not your life in respect for Queen Bai Wei. If you meant nothing to her, I would have already killed you for what you just said.”\n\n“I’m not superstitious. You said I would have been killed? I would like to see if that is true,” Han Sen stated flatly, still standing on the body of the metal doll.\n\nKing Bai allowed his children and grandchildren to fight, but he made sure there were rules in place to keep them from killing each other. They didn’t have to worry about dying.\n\nAs long as King Bai lived, no royal child would kill their peers.\n\nBut the lives of the children’s Royal Guards were nowhere near as important. Royal Guards were often killed in the squabbles between royal children.\n\nKnight’s Paradise was something of a dangerous area. The guards killed xenogeneics there, and also competed against other guards. It wasn’t like the King’s Garden, where killing was forbidden. This would be an easy place to get away with murder.\n\nThe King class guard was totally correct. He would offend Bai Wei if he killed Han Sen there, but no one would hold him personally responsible. He’d still be free.\n\nHan Sen didn’t want to back off, though. He had come to the Extreme King to claim resources, and he would not give up easily.\n\n“If you want to die, then don’t take it out on me for obliging you,” the King class guard growled. Then he cast a green area-of-effect which covered a distance of a few thousand meters.\n\nInside the attack’s perimeter, Han Sen now felt as if he was in water. The stifling power was so strong that he couldn’t move freely.\n\nClearly, the AoE had a water element that lowered Han Sen’s mobility."
}