{
    "chapter": 1182,
    "title": "Vice-Leader",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1182",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWater Fairy smiled and said, “This is my gear, and it is called a Waterdrop Orb. With this orb, you can prevent watery chaos. Can I swap this for all four of your lifewater drops?”\n\n“Define what watery chaos means first,” Han Sen said, not quite catching her drift.\n\nWater Fairy gave the orb to Han Sen and then fired a water arrow at him.\n\nPang!\n\nThe water arrow broke into a liquidy splash, despite only being one foot away from Han Sen.\n\nWater Fairy smiled and said, “The orb can block my attacks. It can only block water damage, mind you. And after some use, it’ll take a while before it can be used again.”\n\n“But I used up one of my lifewater vials.” Han Sen wanted others to believe this.\n\n“Deal.” Water Fairy was happy to swap the Waterdrop Orb for Han Sen’s remaining vials of lifewater.\n\nHan Sen played with the Waterdrop Orb. Although it only blocked water damage, and it wasn’t the most useful item in the sanctuary, it was better than nothing. The lifewater was outright harmful, after all, so it was little more than a waste of space.\n\nThe other super creatures soon learned about their trade, too, and they all wanted to do the same. Unfortunately, Han Sen had no more lifewater left. After a while, Han Sen was able to obtain another two. Ghost Eye came to him shortly after, wanting to make an exchange.\n\nGhost Eye threw him an eyeball that was black and white. It was reminiscent of Tai Chi in some ways. Han Sen was not sure what it could do, but the eyeball was obviously gear that the creature had created. Much like the fairy, it wanted to swap the gear for Han Sen’s lifewater.\n\n“I only have two lifewater drops. Do you still want to make the trade?” Han Sen asked, while pulling his two vials out.\n\nGhost Eye was actually an ape. One of its eyes was a murky shade of white, and it was an unsettling creature to look upon. But it was also the most active super creature amongst them. It swallowed the lifewater and left immediately.\n\nHan Sen looked at the eyeball-like item he had been given. He noticed it was able to do something with Yin and Yang.\n\nIf Han Sen practiced Yang, he could use the item to make it Yin. If he practiced Yin, then he could make it Yang.\n\nHan Sen had Yin Yang Blast, which meant the item wasn’t very useful for him. For people who only practiced one, it would be a precious item to have, though.\n\n“If I work here for a long time, I should be able to amass quite the array of gear.” Han Sen thought the terms of these exchanges were more than fair, considering he had no need for the lifewater he’d be giving up.\n\nAs a result, Han Sen made plans to collect more lifewater for gear. But, a few days later, he stumbled across another message. It seemed as if the person who had been leaving the messages wanted to meet Han Sen, at last. On the paper was an address and a time.\n\nHan Sen made a mental note of it and then incinerated the parchment. The next day, Han Sen left the tree. They were going to meet in a certain grove inside the walnut forest.\n\nHan Sen arrived early, curious to meet the message-leaving enigma.\n\nAfter a while of waiting, Han Sen heard someone approach. The person wasn’t quite there yet, and the forest was wreathed with vines that obscured the view quite a bit. Han Sen would be unable to see who it was until they came closer.\n\nWhen the person’s identity was finally revealed, Han Sen was shocked.\n\nDespite all the possibilities he had mulled over in his mind, Han Sen was utterly flabbergasted it was that person who had been leaving him the slips of paper.\n\n“Didn’t I tell you to leave? What are you still doing here?” the man said coldly.\n\n“You’re the one leaving me slips of paper then, I assume.” Han Sen looked at the man with a strange expression. He had a big head and the body of a frail baby. It was Baby Ghost.\n\n“Who else?” Baby Ghost said.\n\n“Then you know what this is?” Han Sen brought out a paper with the Nine-Life Cat symbol on it.\n\nHan Sen believed he had been the one leaving the messages, but he did not believe Baby Ghost knew anything about the Nine-Life Cat or Blood Legion.\n\n“I am a member of Blood Legion. You think I don’t know what that is?” Baby Ghost looked at Han Sen with disdain.\n\nHan Sen was shocked. Baby Ghost was a king spirit; how could he be a member of a human organization?\n\nAlthough Han Sen had readied himself for this possibility, he was still taken aback to hear it out loud.\n\n“You are a member?” Han Sen was almost unable to believe it.\n\nFor a king spirit of the Third God’s Sanctuary to be a member of Blood Legion was a nigh insane thing to comprehend. Han Sen knew Blood Legion was strong, but he did not expect the organization would be strong enough to employ king spirits of the Third God’s Sanctuary. Han Sen felt as if his world had been turned upside-down, and all he knew about Blood Legion had been incorrect. What exactly was Blood Legion?\n\nBaby Ghost pulled out something and tossed it over to Han Sen.\n\nIt was a card of the Alliance. Han Sen had seen such things many times, as it was a card that usually had the Nine-Life Cat symbol on its underside.\n\nHan Sen flipped it over, and as expected, there it was. It was a Nine-Life Cat card.\n\n“I am the Vice-Leader of Blood Legion. My title is Ghost Baby,” Baby Ghost King said."
}