{
    "chapter": 2595,
    "title": "Chase Star Whip",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2595",
    "text": "“Let’s go.” Han Sen returned to the white whale and allowed Bao’er to fly the white whale away.\n\nHe felt terrible. The energy in his body was all gone, and his flesh was about to collapse. Even his peacock king soul robe had been drained. If he hadn’t used the super god spirit body to separate himself from the Shield of the Medusa’s Gaze, he and the peacock king’s soul robe would have been reduced to ash.\n\n“Too scary,” Han Sen thought, still reeling from what had happened. The price of using the Shield of the Medusa’s Gaze was far greater than he could willingly accept.\n\nFurthermore, the eyes of the woman on the Shield of the Medusa’s Gaze had only opened a little. Who could fathom how much power would be required to open both of her eyes completely?\n\nUntil he became deified, Han Sen was no longer going to use it. It would kill him.\n\nFortunately, after what happened, no one bothered to hunt him down. Aside from a few space xenogeneics, nothing living bothered him.\n\nIt wasn’t like the Extreme King or other races couldn’t find Han Sen; they simply didn’t dare to.\n\nMeng Lie hung in space like a purple ice sculpture. The people who wanted to chase Han Sen down witnessed everything, and they decided that going after Han Sen was no longer worth it. The Extreme King paid a high price to remove Meng Lie from space.\n\nHan Sen could use the Shield of the Medusa’s Gaze. Every race thought this was unbelievable. It was a true god weapon, and ordinary deifieds couldn’t touch it. Han Sen was only a King, yet he had somehow accessed the weapon’s horrifying power. It made every race fear him.\n\nUntil Han Sen figured out how far he could go with the Shield of the Medusa’s Gaze, no one dared to trouble him.\n\nIf Han Sen was able to activate the entire power contained within the Shield of the Medusa’s Gaze, no one would be able to defeat him aside from a true god deified.\n\nNow that no one was interfering with his travel, Han Sen and his people traveled through the remainder of the systems of chaos in safety. They reached Sky Palace without further danger.\n\nBut Han Sen’s situation wasn’t good. The Shield of the Medusa’s Gaze had sucked his body dry. After a month, Han Sen had yet to recover.\n\nThe strength of his body had been drastically reduced. His legs were soft when he walked. It would take him another two or three years to fully recover.\n\nFortunately, no one from the outside was aware of what had happened to him. They were in Sky Palace now, as well, so there was no need to worry about security. Sky Palace sent a few elders to welcome Han Sen and Yisha. They weren’t showing such respect because of Yisha and the Rebate, though; they had come because Han Sen was a very important individual.\n\nHan Sen was able to bless deifieds. And he owned the Charming God’s Jian and the Shield of the Medusa’s Gaze. Those things made Han Sen more valuable to them than the entire race of the Rebate. It made Sky Palace treat him seriously.\n\nIf they knew Han Sen also had the Nine Spin Destiny Mirror and the Ghana’s race weapon Purgatory Heaven, who knew what they would think.\n\nHan Sen rested in Sky Palace. Sky Palace sent many powerful deified elites skilled in healing to treat him, but they didn’t achieve very good results.\n\nHan Sen wasn’t just injured. He had exhausted his genes, and recovery wouldn’t come easy.\n\nThey were there for a few days when Yisha told Han Sen that Han Meng’er was there. It made Han Sen very happy.\n\nHan Sen thought that Narrow Moon might have been affected because of what he had done. It was good that Han Meng’er and the others were allowed into Sky Palace.\n\nBut Han Sen hadn’t seen Han Meng’er and the others just yet. Yisha smiled and didn’t explain. She invited Han Sen to come with her.\n\nThey left the xenogeneic space of Sky Palace and headed to a nearby system that was also owned by Sky Palace. Sky Palace owned many systems, and this was an important one within their domain.\n\nAs Han Sen flew alongside Yisha, he noticed that his surroundings weren’t as he remembered. There used to be many stars in this area of space, but now, it was empty. There wasn’t even an asteroid.\n\n“Did a big fight take place here? Did the people of the Extreme King come?” Han Sen asked Yisha with confusion.\n\nYisha laughed and didn’t say a word. She looked out across space.\n\nHan Sen followed her gaze. There, he saw many stars. It was nothing special.\n\nBut soon after, Han Sen heard the sound of thunder echo through space. Even the vacuum couldn’t stop that sound from being transmitted.\n\nHan Sen looked in the direction that the sound had come from, and then, his mouth dropped open in shock. He couldn’t believe his eyes. He was looking at Narrow Moon.\n\nAll the planets of Narrow Moon moving toward him, heading for the empty section of space that he and Yisha hovered in. The scene was extremely shocking.\n\nA scary elite of Sky Palace was behind the star. He had a whip. Every time he swung the whip, the crack of thunder sounded.\n\nThe cluster of stars were like many fat sheep. They were slowly being pushed forward. The very large Narrow Moon was being whipped forward into this place.“This… this can actually happen…” Han Sen had no idea how to process what he was seeing. He never dreamed of something like this being possible. Yisha smiled and said, “If I wasn’t prepared, I would never have allowed the people of the Rebate to be put at risk. This is a deified weapon of Sky Palace. It is the Chase Star Whip, and it can make stars listen to its commands. I invited Sky Palace’s leader to help me move Narrow Moon to this area. That is why we have allied with Sky Palace.”\n\nHan Sen watched the whole of Narrow Moon be moved into an empty region of space. He assumed that the old system must have been moved elsewhere, to keep that region open for Narrow Moon.\n\nAfter Narrow Moon came to rest in its new home, Yisha took Han Sen over to thank the Sky Palace elder. The elder smiled and said, “This is only me doing what I should. There is no need to thank me.”\n\nThe elder took the Chase Star Whip with him when he left. Han Sen couldn’t wait to enter Narrow Moon. He flew straight to Planet Eclipse and saw Han Meng’er. He was so happy.\n\nThe Rebate were talking about the deal that allowed them to join up with Sky Palace, but the part that included Han Sen was still something that had to be discussed.\n\nBecause Han Sen was worth more than the whole of the Rebate, Yisha only negotiated terms for the Rebate themselves. She didn’t include Han Sen in the discussions.\n\nSky Palace had come up with many plans, but Han Sen decided to join Sky Palace as a member of the Rebate. He didn’t join Sky Palace as just himself.\n\nBy doing that, he lost many of the benefits he could have earned. But Yisha had risked so much in the systems of chaos to save him. She moved the whole of the Rebate because of it, and she had made enemies of the Extreme King in the process. That was a big favor. Han Sen couldn’t abandon the Rebate and join Sky Palace alone."
}