{
    "chapter": 2214,
    "title": "Galactic Lobster Beast Soul",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2214",
    "text": "“These are the systems of chaos, and anything can happen here. Ready yourselves for death,” Mister White said when Han Sen returned to the ship.\n\nNo one had expected to encounter the Galactic Shrimp just as they were leaving that system, and the Ice Blue Knights had taken a lot of casualties. The majority of them had made it through, though. All in all, the battle had gone well.\n\nThe knights were also just happy that they had not woken up the Black Hole Spider. If they had, their entire army would have surely perished, not just the few they had lost to the shrimp.\n\nThe bodies of the dead knights couldn’t be retrieved, since no one could return to the territory of the Galactic Shrimp and recover the deceased. Even if they could have gone back, the perished would have been eaten by the creatures by now.\n\nThey had lost much in that fight. They couldn’t bring back the xenogeneic genes or the bodies of those they had slain; there hadn’t been time to collect anything. And after leaving, they couldn’t quite think about returning.\n\nThe ships had been extensively damaged. Fortunately, the ships were designed to repel the assault of xenogeneics. The armor of the hull was like the crust of the earth. Although the ships were badly battered, their cores weren’t harmed. As a result, they could still fly.\n\nAs he rested, Han Sen looked over the Galactic Shrimp and Galactic Lobster beast souls he had retrieved.\n\nHan Sen had earned many Galactic Shrimp beast souls, including sixteen of Marquise rank and one that was Duke. That was far more than he had expected. He had forgotten how many shrimp he had actually killed over the course of the battle.\n\nGalactic Shrimp beast soul: sword\n\nHan Sen summoned the Galactic Shrimp sword beast soul. Then, a two-meter-long greatsword appeared in Han Sen’s hands. It wasn’t as heavy as a normal greatsword, though.\n\nThe Galactic Shrimp greatsword was like the spike at the end of a Galactic Shrimp. It was a transparent blue color, and it looked like a saw, but with a sharp and pointy tip. It glowed blue. When Han Sen swung the blade, it unleashed an explosion of blue light.\n\nHan Sen gave one of the Galactic Shrimp beast souls to each of his companions. A Marquise class weapon wasn’t too shabby, after all. As for the Duke one, he gave that to Ji Qing.\n\nJi Qing’s super god body was called Sword Soul. She was reasonably skilled with a sword, and so Han Sen gave it to her for Ji Yanran’s sake.\n\nThe most important thing he had managed to get, though, was the Galactic Lobster beast soul. Han Sen turned his focus to that.\n\nKing class Galactic Lobster beast soul: armor\n\n“King class armor?” Han Sen gave a little whoop. He needed an armor of such strength.\n\nThe Demon Bug King Bai Sema had a high level of defense, but Han Sen couldn’t attack while the shield was up. A beast soul armor was different. It was a basic item that everyone needed.\n\n“It is a shame I only have one. If I had managed to kill a few more, everyone would have this lobster armor. We’d be much safer in the systems of chaos, that’s for sure,” Han Sen thought to himself.\n\nHan Sen summoned the Galactic Lobster armor, and a translucent blue crystal wrapped around him. Inside that blue crystal glowed a shiny green light. Han Sen moved, and when he did, it looked like the stars of an entire galaxy were moving with him.\n\n“What a beautiful armor. Is that the Galactic Lobster’s beast soul?” Ji Qing looked at Han Sen’s armor enviously.\n\nThat armor really was beautiful. It shone like a blue diamond, and so it would definitely attract the gaze of any woman who walked by.\n\nHan Sen wasn’t a fan of wearing something so flamboyant, however. If he could choose its look, he would have preferred something dull and grey. He did like to keep a low-profile, after all.\n\nWearing armor like that made Han Sen look like a firefly in the dark. It was so very shiny, and all kinds of enemies would be attracted to him.\n\nEven so, it was better than nothing. Han Sen then gave Han Yan his gold Demon Bug King beast soul. Han Yan could now explore alone, without needing to keep Little Angel next to her.\n\nHan Sen had a set of lobster armor now, so the Demon Bug Bai Sema wasn’t as important to him anymore. If he did require it, he could just find Little Angel and the others.\n\nAfter seeing the Galactic Shrimp in action, Han Sen had a much better understanding of the breadth and danger of the systems of chaos a whole lot more. Even with his three Demon Bug King Bai Semas, his safety wasn’t certain.\n\n“Now I understand how a woman like Yisha died out here.” Thinking of Yisha, Han Sen had to end his thought with an audible sigh.\n\nIce Blue Knight King had someone deliver some Galactic Shrimp xenogeneic genes and meat as a reward for Han Sen’s participation and performance.\n\nThe person who delivered the items was that same fiery Ice Blue Knight from before.\n\n“Brother, my name is Exploding Bear. I am known for my appearance as a raging bear. I will look after you from now on. If you need anything from the Ice Blue Knights, all you must do is call my name.” Exploding Bear pounded his chest before Han Sen.\n\n“Yes, I will be sure to do that, and I will make hearty use of your name,” Han Sen said with a smile. It was relieving to have an ally in the Ice Blue Knights.\n\n“Cool. If you have time, come and visit me on the sixth team.” Exploding Bear laughed, and then patted Han Sen on the shoulder. He left with the other knights that had carried in Han Sen’s reward.\n\nHan Sen used the Galactic Shrimp’s meat for a shrimp hotpot. He sliced up the translucent shrimp meat and dipped it in some sauce. When he put one in his mouth, the sweetness of the juices was exquisite. He felt as if he was going to melt with the shrimp itself.\n\nThe journey that followed wasn’t as dangerous or as eventful as Han Sen thought it might be. They traveled for a whole week, and they didn’t have to fight off a single xenogeneic in that time.\n\nThere were groups of xenogeneics that saw the ships, but they all fled without causing trouble.\n\nThere was nothing to do, and at one point, Han Sen joined Exploding Bear for a drink. Exploding Bear was captain of the sixth team. His subordinate knights were nice to Han Sen, even though he was just a Marquise.\n\nThe kindness was largely earned by Han Sen’s performance on the day before. Powerful elites would receive a lot of respect regardless of their rank or race.\n\n“Don’t worry, Brother. The systems of chaos are not as scary as you might fear. We have traveled this route many times, and it has always remained clear. The Black Hole Spider and the Galactic Shrimp were wild flukes. Big Bro Bear knows this way well, and I can tell you, nothing will happen. Relax and enjoy the drink.” Exploding Bear then proceeded to drain three entire kegs. He gripped Han Sen’s shoulder and nudged another keg toward him.\n\n“Brother Bear, it is not that I don’t want to drink, it’s that I cannot drink. My belly is too small.” Han Sen looked at his bloated belly.\n\nExploding Bear loved to eat, and while Han Sen cast Consume to try to keep up, he still couldn’t eat much. He couldn’t fathom how big the bear’s belly must have been.\n\nExploding Bear laughed and started to say something when an alarm sounded and cut him off. Everyone froze.\n\n“Battle alarm!” Exploding Bear shouted, with his eyes wide open.\n\n“It looks like Exploding Bear’s words are unreliable.” Han Sen got up and went to the control room. He knew Mister White would bring his companions there."
}