{
    "chapter": 126,
    "title": "Devil Desert",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_126",
    "text": "\"Yanran, we have been roommates and sisters for three years. It’s okay you did not tell others, but why didn’t you tell me?\" Qu Lili asked Ji Yanran, grinning.\n\n\"Tell you what?\" Ji Yanran was confused.\n\n\"Who is your boyfriend? How is it confidential to me as well?\" said Qu Lili, pouting.\n\nJi Yanran was suddenly upset and said, \"Who told you I have a boyfriend?\"\n\n\"Everyone on campus knows now. Your boyfriend beat Liu Ke and Li Ze in Hand of God by 20 points.\" Qu Lili loved gossip. Leaning toward Ji Yanran, she said, \"Tell me, is your boyfriend Ouyang Xiaosan or Li Yufeng?\"\n\nJi Yanran was even more confused, \"What are you talking about? I don’t understand any of this nonsense.\"\n\n\"You really do not know?\" Qu Lili stared Ji Yanran in the eyes.\n\n\"What happened?\" asked Ji Yanran grimly.\n\nQu Lili told her what happened, and it was the edited version by Wang Long, who did not talk about his own loss, but only about Liu Ke and Li Ze.\n\n\"Yanran, he was not your boyfriend?\" Qu Lili asked with some disbelief.\n\n\"I swear, I really do not have a boyfriend and do not know who that person is. He is so daring to joke like that,\" Ji Yanran bristled.\n\nIt had been a long time since the incident in the spaceship, and Ji Yanran had already forgotten about it. In her memory, Han Sen was merely a guy who cheated and probably never entered Blackhawk. Or he should have come to her already.\n\nSo, Ji Yanran simply did think of that and thought some master player was playing a prank.\n\nBut more and more people started to ask her who her boyfriend was. She had to explain that she wanted to know who that loser was as well.\n\nJi Yanran intended to scold him for being so insolent, but she could not think of anyone who could have done this.\n\nBlackhawk’s Hand of God Society barely made it into the top 10 in the entire Alliance, and it was only because they had Li Yufeng.\n\nAnother master player, Ouyang Xiaosan, was not interested in joining the society. and Ji Yanran was still considering whether she should personally invite him.\n\nOnly these two could have been able to do that to Li Ze. Ji Yanran knew Li Yufeng would never do that, but she was not sure whether it was Ouyang Xiaosan.\n\n\"Who is it?\" wondered Ji.\n\nAlthough the school already knew that ID had nothing to do with Ji Yanran herself, they had already gotten used to referring to him as Ji Yanran’s boyfriend, which made her quite upset.\n\nAfter this, there was a trend on Battlenet and even Skynet to name one’s ID as \"My-boyfriend-is-XX,\" \"My-husband-is-XX,\" \"My-girlfriend-is-XX,\" etc.\n\nHan Sen and Shi who had caused this were unaware. Shi was sleeping while Han Sen was reading materials on warframes.\n\nLu Meng and Zhang Yang pushed the door open and came to Han Sen.\n\n\"Sen, you are killing it! How did you beat Liu Ke and Li Ze? We know you are good but did not expect you to be this good,\" Lu Meng stared at Han Sen and said.\n\n\"You certainly deserve to be my destined enemy.\" Zhang Yang was full of zest.\n\n\"What are you talking about?\" Han Sen looked at them puzzled.\n\n\"Stop pretending. If I yell that Ji Yanran’s boyfriend is in Room 304, people will skin you alive,\" Lu Meng said with a crooked smile.\n\n\"What’s up?\" asked Shi, who was awakened.\n\nLu Meng told them the gossip they had heard and grinned at Han Sen, \"Sen, if you don’t do anything for us, we would turn against you. Ji Yanran must be so mad at you. Many people out there want you dead now.\"\n\nShi could not close his mouth. He did not realize Han Sen’s opponents were so famous. He thought they were weak.\n\n\"I do not care.\" Han Sen was not afraid. If Ji Yanran came to find him, he would welcome it.\n\nBut Shi was terrified and quickly said, \"Lu, don’t mess around. Here’s how it happened.\"\n\nShi told the true story, and Lu Meng and Zhang Yang came to realize what had happened. Zhang Yang patted Han Sen on the shoulder and said, \"So you were sticking up for a brother. Relax, Sen. I guarantee that no one will know it is you. There is no traitor in our room.\"\n\nSince Lu Meng failed to blackmail Han Sen, he turned to Shi and said, \"Shi, Sen made such an effort and offended so many people for your sake. Shouldn’t you do something?\"\n\n\"That goes without saying. Let’s go to the cafeteria and eat all the white rice you can,\" Shi promised.\n\n\"Get lost.\" The other three gave him the finger.\n\nIn those days, Han Sen had been busy studying warframes. When he entered God’s Sanctuary, he was usually with Qin Xuan’s gang, hunting sacred-blood creatures. They had been successful three times, but in none of those occasions did he make the final attack, so he gained no beast soul and just had some meat in the end.\n\nThumb had now become the leader of Fist Gang and had invited Han Sen to hunt twice. Both times they were successful and Han Sen had also gained some sacred-blood creature meat.\n\nAll the meat combined gave him one sacred geno point and he had 40 sacred geno points at the moment.\n\nHan Sen was not satisfied with such progress and started to investigate where he could hunt sacred-blood creature alone. He at least needed some mutant creatures. Meowth had also eaten up the black stingers and needed food supply.\n\nAccording to Han Sen’s progress in study. He could totally cope with the semi-annual assessment and had enough time for a safari.\n\nAfter continuous research of various information about Stele Armor Shelter and what was written by others, he finally had his eye on one location, Devil Desert."
}