{
    "chapter": 2935,
    "title": "Holy Garden Fight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2935",
    "text": "“What weird thing?” Han Sen looked at him with interest.\n\nYang Yun Sheng had a wry smile as he said, “In the dark, I heard a woman crying.”\n\n“A woman crying?” Han Sen was shocked. He himself had heard a woman crying once before, but then Moon Shadow God appeared. Han Sen believed it to be Moon Shadow God’s voice.\n\nNow, with Yang Yun Sheng having heard the crying sound too, it was weird.\n\nYang Yun Sheng said, “You will probably laugh when I tell you this, but at the time I was trapped there and feeling hopeless, hearing the crying sound actually made me incredibly angry. I thought I was going to die anyway, but if I was going to be trapped and die, I preferred dying quickly. So, I ran toward the crying sound. I was going to fight that thing in the dark without caring about whether I lived or died.”\n\n“It was so strange. I thought I was going to be killed in the dark. I chased the crying noises with the dark power still around me, but it was not as strong as before. My power was able to withstand the oppression of the dark. As I went, I stumbled across here and one long, bright lantern. When I arrived here, the sound of the woman crying was gone.” Yang Yun Sheng tried to explain what had happened to him.\n\n“Was Yang Yun Sheng following Moon Shadow God to get here? No way. Moon Shadow God was above the crack. If Yang Yun Sheng had chased Moon Shadow God, he would be above the crack as well. He also would have reached here a long time ago. He wouldn’t have just arrived now.” Han Sen looked at Yang Yun Sheng and asked, “When was the last time you heard the woman cry?”\n\n“Not long ago,” Yang Yun Sheng replied.\n\nHan Sen thought, “That cannot be right. It seems like the woman crying wasn’t Moon Shadow God.”\n\nWhile they were talking, the sound of a woman crying was suddenly heard again outside the holy garden. It sounded as if it was there, but it wasn’t there. It sounded very depressed. The sobbing almost made one’s head itch.\n\n“Here it comes again,” Yang Yun Sheng said. “It’s that sound!”\n\nHan Sen looked outside the holy garden. The two long, bright lanterns outside the door were not very illuminated. Outside the garden was pretty much just darkness. One was not able to see anything.\n\nEveryone held their breaths for a while. Eventually, the crying sound disappeared. It was like the crying person had walked away.\n\nYang Yun Sheng pointed at the meat in the stone pot and said. “Did you guys make this meat? Can I have some? I do not want to starve to death.” That place was quite scary, so he felt as if he could die any second. Therefore, he did not mind eating something.\n\n“The meat is mine!” Bao’er jumped in front of the stone table and used her hands to protect the stone pot.\n\nHan Sen wished to say something, but he heard someone else coming from outside the holy garden. Someone else had arrived.\n\nThey saw an old man wearing a gold robe walk into the holy garden. It was Nine Thousand King.\n\n“This is the holy garden. You outsiders cannot just enter here!” Nine Thousand King looked at Han Sen and the others. He looked angry. He was checking out Han Sen and the others as if to discover something.\n\nYang Yun Sheng looked fairly worried. They had just come to a place that was a bit safer and not life-threatening, yet it was where they again met Nine Thousand King.\n\nYang Yun Sheng knew Nine Thousand King was not as nice as Han Sen.\n\nNine Thousand King quickly looked at the stone pot and Wan’er’s statue inside the pavilion. He looked excited, but it was just for one moment. It could not escape Han Sen’s eye though.\n\n“Are you not going to walk away? Do you want to die?” Nine Thousand King stared at Han Sen and walked closer to the pavilion. His body had dark gold markings on it. He looked strange. It was as if many weird centipedes were surrounding him.\n\nHan Sen did not speak. He stood in front of the pavilion and did not do anything.\n\nYang Yun Sheng was scared. Although he was a butterfly deified elite, Nine Thousand King was an old monster who hailed from Sacred’s era. One was not able to tell how much he had evolved in all that time. He could have been one of the top true gods in existence. No matter, he was not able to beat him.\n\nSeeing Nine Thousand King approaching, Yang Yun Sheng appeared as if he was facing off a big enemy. Nine Thousand King did not even look at him. He looked at Han Sen, showing no care for him.\n\nNine Thousand King’s body was becoming stronger. From what Yang Yun Sheng saw, it was like a giant monster that could break the sky and could not be beaten. He thought Nine Thousand King was going to perform a strong attack on Han Sen.\n\nInstead, Nine Thousand King walked right before the pavilion without making an attack. He used his power to suppress Han Sen and the others. He said, “I am afraid to damage the leader’s legacy. Do not make me break anything.”\n\nBao’er laughed out loud and said, “You are just afraid of my father hurting you. You make it sound so nice.”\n\nNine Thousand King’s face did not move. He coldly laughed and said, “I have traveled across the universe following Sacred Leader and slaughtering countless true gods. Your ancestors, at the time, were probably drinking milk from nowhere. Killing you guys will be easy. I just want to earn some karma by letting you go. Do not misunderstand.”\n\nHan Sen smiled at Nine Thousand King, but he did not speak.\n\nBao’er ignored Nine Thousand King too. She used her spoon to pick up more meat from the stone pot.\n\n“Stop!” Nine Thousand King’s expression changed. He madly shouted and rushed toward the stone pavilion. He reached his hands out at Bao’er. The air on his body turned into the aura of a dark gold centipede. He was coming for her.\n\nHan Sen jumped before the pavilion, clutching the Shield of the Medusa’s Gaze. He activated Medusa’s Gaze. A weird light shone against the dark gold centipede air. It trapped them all in the air.\n\n“Freezing skills are strong, but to me, the king, they are trifling tricks and nothing more.” Nine Thousand King’s eyes looked cold as he drew a blade from his waist.\n\nThe sword looked extremely weird. Han Sen had seen many rare swords before, but he had never seen a sword this weird.\n\nThe sword was two fingers wide and four feet long. It looked to have been crafted from blood jade. The weirdest thing was that the sword had eyes. From the tip to the handle, there were some weird eyes all across it. Some of them were open. Some of them were shut. Some of them were half-open. They all looked different from each other. They all lined up and looked extremely weird and disgusting. They made people feel very uncomfortable. It gave people goosebumps.\n\nNine Thousand King said, “Nine eyes go through a thousand ancients. One sword slashes the underworld. Under my nine-eyed sword, nothing can survive. I, the king, believe in good morals. I was going to let you guys go, but if you guys want to die, then it is not my fault.” He then raised the nine-eyed sword."
}