{
    "chapter": 2421,
    "title": "Losing Control",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2421",
    "text": "Han Sen felt a chill. This was no longer funny.\n\nNing Yue’s mental endurance was almost as good as Han Sen’s, but Ning Yue had been dramatically affected by the green sword. Han Sen didn’t know what to do with the changes that were occurring.\n\nNing’s Yue body, his genes, and even his personality had undergone a shift.\n\nHan Sen couldn’t believe that Ning Yue now dressed entirely in pink and his personality had suddenly become so very sensitive. He was very cowardly now, and he had lost all of his decisiveness. He didn’t look like Ning Yue anymore.\n\nHan Sen even wondered if Ning Yue’s soul had been taken by a woman.\n\n“What is up with this xenogeneic space? Why are there so many weird things going on?” Han Sen frowned, and he subconsciously stepped farther away from the stone. He did not want to end up like Ning Yue.\n\nThe excavation of the stone fields continued. It took another seven or eight days for something strange to happen again. Someone managed to dig up a big rock that was leaking blood and had a hand coming out of it. The hand managed to break free and kill a dozen workers. It didn’t stop until Night Wind appeared and killed it.\n\nHan Sen’s experiments were still going on, too. Four groups had been affected thus far. They had all leveled up once, but only by one level. They didn’t level up after that, and no one else had leveled down, either.\n\nNow that Han Sen could confirm the effective radius of the stone, he could mark out a danger zone around the warehouse. But he didn’t call the ten teams back in. They still remained in their places, continuing the test.\n\nFor now, no one could be sure if the stone might begin acting differently. Either way, the experiment wasn’t going to stop.\n\nHan Sen didn’t enter the warehouse to look at the rock, but it seemed like the stone was benefitting everyone who got close to it. But after the one anomaly of what happened to Red Cloud, Han Sen wasn’t going to risk being careless.\n\nJust like usual, Han Sen called the ten teams over. After questioning them, he planned on going back to his room to eat with Bao’er. But Falling Leaf informed Han Sen that Miss Mirror wanted to see him in her office.\n\n“Miss Mirror has something important enough to call me in now?” From what Han Sen could tell, the digging job was being shoved forward as fast as possible. And they kept encountering problems. Miss Mirror had gone to the stone fields on her own, so if she had come back seeking Han Sen, he surmised something must have happened.\n\nHan Sen went to Miss Mirror’s office as he was instructed to. He knocked and entered. When he saw Miss Mirror, his greeting died on his lips.\n\n“You…” Miss Mirror had ended up like Red Cloud. She didn’t have that scary, mysterious presence anymore. Her lifeforce was weak. She was like a King now, that was certain. She was no longer deified.\n\n“Yes, I have become King class.” Miss Mirror looked calm, but Han Sen could still see the profound sadness behind her eyes.\n\nIt looked like downgrading from being a deified being had been quite the gut-punch for Miss Mirror. He respected the strength of her mind, but even a strong person like her would be shaken like this.\n\nHan Sen went silent. Then he looked at Miss Mirror and asked, “What can I do?”\n\nHe knew Miss Mirror wouldn’t ask him to come and see her for no reason. There were also limits to what she would tell a fake prince like him.\n\nMiss Mirror’s eyes were steady. “Reinforcements are on the way. It will take them two weeks to arrive, and we are losing control of what is happening here. It has escaped my grasp, and something even worse might soon occur.”\n\nHan Sen’s face looked glum. For a strong woman like Miss Mirror to make such a confession meant that things were really bad. It was almost unimaginable. Things must have been far worse than Han Sen himself expected.\n\n“Why don’t we just stop digging for now and leave this place? We can wait for backup to get here,” Han Sen suggested quietly.\n\nMiss Mirror shook her head. “It is too late. Before I left the stone field, we dug up another statue.”\n\nHan Sen froze.\n\n“A second statue like the one in the warehouse?” He asked, staring at Miss Mirror.\n\n“It was different. This time, it was a genuine statue. It has a thousand eyes and hands, and each eye has four pupils.” When Miss Mirror spoke of it, her breathing quickened. Her emotions were clearly still unstable.\n\n“Because of that statue, you became King class?” Han Sen asked.\n\nMiss Mirror nodded, and then she shook her head. “Within half an hour after digging up the statue, I dropped from being deified. But Night Wind, who was inspecting the statue with me, was fine. The other workers were fine, too. So, I cannot confirm that I fell because of the statue.”\n\n“In that case, we really should move. We should abandon these efforts, stop excavation, and get out of here,” Han Sen said.\n\nMiss Mirror shook her head. “I told you, it is too late. Look at my eyes.”\n\n“What the hell happened to your eyes?” Han Sen demanded. When he looked closer into Miss Mirror’s eyes, what he saw shocked him.\n\nMiss Mirror once had beautiful eyes that looked like phoenixes. Her pupils had been black, but now they were red. And furthermore, the pupils were split in half. The four red pupils were a deeply unsettling sight.\n\n“Are those pupils similar to the statue’s?” Han Sen asked.\n\nMiss Mirror nodded. “Everyone who saw the creature, including me and Night Wind, look like this. If we stray too far from the statue, we’ll act like addicts who need a fix. The further away from the statue we go, the stronger the feeling grows. Our desire to dig in the stone fields becomes irresistible. You have to keep digging to scratch that itch. The only way to satisfy the urge is to plow. It is the only thing that makes us feel better.”\n\nHan Sen’s face looked gloomy. Everything about this place was way too scary. Even deifieds were affected without knowing how or why. Han Sen couldn’t ensure his own safety in that place.\n\n“What can I do for you?” Han Sen asked again. The situation was beyond everyone’s control. He wasn’t sure that he could be of any help.\n\nIf he could have chosen, he would have left the xenogeneic space. The further away he got, the better.\n\nMiss Mirror started to answer, but suddenly, the office’s doors were banged open. Night Wind rushed in.\n\nHan Sen looked at Night Wind’s eyes. His pupils had turned red, and he too had a case of the double-trouble pupils.\n\n“What happened?” Miss Mirror asked, looking at Night Wind.\n\n“We unearthed stone doors in the stone field. They’re huge, as if they lead to some giant, ancient city,” Night Wind explained in a strained voice."
}