{
    "chapter": 2765,
    "title": "Escape",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2765",
    "text": "The bottle world was inside the hall of the Very High’s alpha. The restrictions there were extremely powerful. In all likelihood, not even a true god elite could access such a place without the Very High stamp that disarmed the restrictions.\n\nHan Sen was a man who had just become deified, and he was proudly announcing that he could use his own power to escape the alpha’s hall. But his certainty aside, he was still locked inside the bottle world. Anyone would think Han Sen was crazy for claiming to be capable of such a thing.\n\n“You need to think about this. My offer now is your only chance,” Exquisite said, looking intently at Han Sen.\n\n“Send me back. It will look bad if people find us here like this,” Han Sen said calmly.\n\nExquisite could feel what Han Sen was thinking, and she felt rather touched by it. He didn’t want her to get dragged into so much trouble on his behalf. That was why he was so determined to return to the bottle.\n\nBut Exquisite still didn’t understand where Han Sen was getting his confidence. It was outlandish to think he could escape a true god prison of his own volition.\n\nSuddenly, Exquisite’s face went blank. She sighed and said, “Now it is too late for you to go.”\n\nAfter that, she stopped hesitating. She took Han Sen back to the alpha’s hall and returned him to the bottle world.\n\nWhen Exquisite returned into the bottle with Han Sen, she found Uncle Nine waiting for her inside. He looked at Exquisite and frowned. “Exquisite, come with me.”\n\nHan Sen knew Uncle Nine must have found out that she had taken him away for a brief spell. It was fortunate that he didn’t actually leave. Otherwise, the Very High would have considered Exquisite to be a criminal.\n\nExquisite looked at Han Sen with a complex expression. Then, she followed Uncle Nine to leave the bottle world.\n\n“It looks like the Very High haven’t found out that the blood coral has escaped their seal and come back to me. It’s amazing that even their elders didn’t notice it was gone.” Han Sen was very curious about the blood coral, but although it seemed to be quite resilient, he couldn’t use it as a weapon. It was just a vessel for Old Blood Dragon Lady’s body.\n\nHan Sen continued to modify his Under the Sky and Break Six Skies until he couldn’t think of any way to take them further. Then he found the time to go to God’s Farm again.\n\nHan Sen carefully entered God’s Farm, but he didn’t see Gu Wan’er or God’s Knife anywhere. The carriage that was pulled by nine unicorns had also vanished.\n\n“Gu Wan’er should come back, right?” Han Sen was no longer worried about his safety. He was worried about what had happened last time. The knife or its master might have decided to stop Wan’er from coming to Demon Sheep Planet now.\n\n“What is God’s Farm, exactly? Is it a xenogeneic space or is it part of the normal universe?” Han Sen realized he hadn’t tried going back to the sanctuary from there. He knew the chances of it working were slim, but he didn’t mind trying.\n\nBut when he tested it, he really was transported back home. Even Han Sen was surprised, and he said, “If I can travel back here, that means God’s Farm is somewhere in the universe. It isn’t a separate dimension like Outer Sky. If that is the case, then I will be free if I can escape the Demon Sheep Planet’s restrictions.”\n\nIf Han Sen’s only problem was being trapped inside the bottle world, this would have made him extremely happy. But now, even though he was free, he couldn’t be happy because he had no way of saving Wan’er.\n\n“Should I tell Lone Bamboo about Wan’er? But I don’t know where to find God’s Farm unless I travel to it using the Four Sheep Cube. It is pointless to tell Lone Bamboo this. I need to figure it all out for myself first.” Han Sen went back home. He saw his baby daughter Ling’er and felt much more relaxed.\n\n“My dear Ling’er, when Dad was not around, were you being naughty?” He held Ling’er in his arms. He kissed her on the cheek and smiled.\n\n“Ling’er did behave. Daddy didn’t behave,” Ling’er said with a blink.\n\n“Since when have I been a naughty boy?” Han Sen asked curiously.\n\nLing’er looked at Ji Yanran, who was cooking in the kitchen. She quietly told Han Sen, “Daddy hasn’t been back for a long time. It has made Mommy very angry.”\n\n“How angry is she?” Han Sen quietly asked Ling’er.\n\nLing’er held onto Han Sen’s neck, placed her little mouth next to Han Sen’s ear, and whispered in a voice that only the two of them would hear. “Mommy said she would teach you a lesson when you came back.”\n\n…\n\nHan Sen stayed at home for a few days. Every now and again, he would return to God’s Farm. He still hadn’t seen Wan’er or God’s Knife, and he didn’t have any idea when they would return to the planet.\n\n“I can’t just keep waiting like this. I guess it’s time to see if I can break the defenses of Demon Sheep Planet.” Han Sen looked up into the skies above him. He became a xenogeneic and flew up off the surface.\n\nJust like last time, as Han Sen was about to breach the atmosphere, countless knife lights manifested around him. Each attack dealt damage that was equivalent to the strike of a primitive deified elite. The sea of knife lights seemed endless.\n\nHan Sen could have ignored one or two of those knife lights, but he couldn’t deal with them in the tens or hundreds. There were just too many of those knife lights. They swept toward him like a river, coming down on him without reprieve.\n\nHan Sen used his medusa shield to fight back, and although the shield didn’t break, the scary impacts knocked Han Sen down from the sky. He shot to the surface like a meteor, creating a huge impact crater when he hit the ground.\n\nHan Sen made several attempts to get past the planet’s defenses, but he realized he couldn’t escape the planet using brute force. Even larva class deifieds wouldn’t be able to break through the defensive net.\n\n“If my super god spirit body wasn’t being affected by Wan’er, I could escape. I haven’t been able to use super god spirit body for the longest time, though. It only stays active for a few seconds, and I don’t know if that would be enough time for me to escape.” Now that he had exhausted his other options, Han Sen knew he’d have to give it a try. He lifted his shield and flew into the sky once more.\n\nWhen his body could no longer take the impact of the knife lights, he lowered the medusa shield and activated his super god spirit mode.\n\nWhile he was in his invincible mode, Han Sen teleported. This attempt worked out much better than Han Sen had expected. His heart began to beat more quickly. He needed to teleport as far as he could in order to escape the planet’s defenses. But when he teleported again, he lost track of how far he had traveled. When he emerged from the jump, he found himself in a strange part of the cosmos. After a while, he noticed located Demon Sheep Planet behind him; it was so distant that it appeared to be the size of his fist. It looked like little more than a small moon from here.\n\nHis super god spirit mode came to an end. It had only lasted long enough for him to teleport once.\n\nAs Han Sen looked around, he saw a group of people flying past. He looked closer, and he noticed a particular Destroyed amongst them. It was Barr."
}