{
    "chapter": 197,
    "title": "The Charm of a Mature Woman",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_197",
    "text": "Wen Xiuxiu was now very unhappy--as an intern host and journalist of black and white boxing contest show, she was assigned to work for the famous Fang Mingquan.\n\nOriginally with her qualifications, she could not have been assigned to shadow Fang Mingquan who was a big shot right now. The only reason she was here was her prominent family.\n\nShe had thought she could show the world her talent under Fang’s guidance. However, the first task Fang had assigned to her was to go to Blackhawk Military Academy.\n\nThis black and white boxing competition on Skynet was sponsored by a well-known gaming platform, and all famous military schools had been invited to participate.\n\nWen Xiuxiu expected to be assigned to the schools that had ranked first or second last year, but Fang insisted that she go Blackhawk which was not even in top 16 last time. Although she had argued, Fang Mingquan still sent her there, and said there would be a surprise.\n\nWen Xiuxiu could not imagine there to be any surprise. She had checked the arrangement, and Blackhawk’s first opponent would be St. Germain, one of the top 4 last year.\n\nSt. Germain had been good at martial arts in general and had been among the top 4 in all kinds of items. They were especially strong in black and white boxing. They were only in top 4 in group match, but got the second place in the singles match.\n\nThis competition on the Skynet was a group game, but St. Germain would not lose to Blackhawk by any chance.\n\nWen Xiuxiu even doubted whether Fang Mingquan had got the names of the military schools mixed up and she was in fact supposed to be at St. Germain.\n\nAlthough Wen Xiuxiu had hinted Fang Mingquan several times, Fang did not seem to hear her and sent her to Blackhawk.\n\n\"Well, it’s the same game anyway, and I could always focus more on St. Germain.\" Wen Xiuxiu did not have much hope for Blackhawk.\n\nWen Xiuxiu understood that Blackhawk was not strong originally, and this year a lot of its main players had graduated, so Ouyang Xiaosan was the only one that had some skills.\n\nBut Ouyang Xiaosan was at best top 10 if put in a singles match. He alone would not change the result of the game.\n\nAlthough she was disappointed, Wen Xiuxiu still came to Blackhawk to do an interview and introduction of the players in advance.\n\nHolding her press credential and entering the campus, she was lost in the gigantic campus of Blackhawk. It was as big as a city and she had no idea where the black and white boxing players were training.\n\nWen Xiuxiu looked around at a green area and found almost all the students were in groups or pairs. Not far from where she was, a student was sitting alone on a bench, reading.\n\nWen Xiuxiu walked to him and carefully looked at the student, thinking, \"It’s so good to be young. Even a guy has such nice skin.\"\n\n\"Sir, sorry to bother you. Do you know where the Martial Arts Society is?\" Wen Xiuxiu flipped her hair as she asked, believing that as a pretty lady, she could easily charm a young boy into leading the way.\n\nThe boys looked up at Wen Xiuxiu, smiled and said, \"To go to Martial Arts Society, just follow this road and turn left at the third intersection, continue to walk two blocks and then turn right...\"\n\nWen Xiuxiu was still confused, and quickly put on a charming smile. \"Do you have a minute? Can you show me the way? I am really not familiar with this place.\"\n\n\"I'm sorry. I still have things to do and cannot do that. Would you ask someone else?\" The boy smiled and said.\n\nWen Xiuxiu suddenly felt terrible. She had been a campus belle when she was younger, and the prettiest girl no matter where she went. Although she was older than the students here, she still had her glamour. Now this young man was not even impressed by her beauty, and she thought it was quite unacceptable.\n\nUnwilling to give up, Wen wanted to say something, but saw a girl walking over to the bench and sat next to that student. She looked at Wen and asked the guy, \"Who is this?\"\n\nWen Xiuxiu was a bit dazed by the girl’s look. Even as a woman, she had to concede that the girl was gorgeous.\n\nAlthough the girl was not old enough, her youth and innocence were very attractive.\n\n\"She is asking for direction,\" Han Sen replied with a smile.\n\nJi Yanran looked at Wen Xiuxiu, blinked and asked, \"You are a military school student, right? Where are you going?\"\n\nWen Xiuxiu quickly took her press card out and said, \"I’m a reporter of Huaxing Station, and want to interview some students from the Martial Arts Society, but I don’t know where to find them.\"\n\nJi Yanran pondered and pointed to several guys near them, \"Those are the members of the Martial Arts Society. They should be able to take you there.\"\n\nWen Xiuxiu had to thank her and went that way.\n\nFortunately, this time things went more smoothly. These guys finally appreciated her beauty and took her to the Martial Arts Society with passion.\n\nThe Martial Arts Society was more or less the same as she had thought. Wen Xiuxiu did not pay much attention to their three bench players since only the five first team members had been announced. She also took for granted that since their first team was not impressive, their bench players would be even worse.\n\nBut when Wen Xiuxiu thought of the guy she met today in the school, she felt he looked somewhat familiar, but could not pin it down.\n\nIt was no wonder that she did not remember. Han Sen had not been exposed to the public after that commercial. He also had makeup on in the commercial, so it was natural that she had not recognized him."
}