{
    "chapter": 2423,
    "title": "Contagion",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2423",
    "text": "“I’ve been infected with whatever this is!” Han Sen realized grimly, and a stark chill rolled through his body.\n\nHe had no idea how or when he contracted this creepy condition. Until Miss Mirror pointed it out, he hadn’t even realized that the strange power had managed to sneak into his body and infect his eyes.\n\nMiss Mirror and Night Wind stared at him in astonishment. Han Sen had never visited the stone path, nor had he looked at the statue with a thousand eyes in person. But now, there was no denying that each of his eyes had two red pupils. That could only mean one thing: the power was contagious.\n\nIf it really was contagious, then that meant it was game over for every person in their camp. Even the reinforcements heading their way would be at risk.\n\nHan Sen reacted instantly. He turned around and ran out of the office, then he grabbed the guard outside and peered deeply into the man’s eyes.\n\nThe guard was about to shake him loose, but Miss Mirror and Night Wind came out to stop him.\n\n“His pupils haven’t changed.” Han Sen looked into the eyes of a few more guards. Their eyes were perfectly normal.\n\nThe next second, Han Sen pulled out his phone and called Falling Leaf’s number. It rang twice, and then Falling Leaf picked up the phone. She only answered the voice call, though, so there was no video.\n\n“Falling Leaf, is Bao’er nearby?” Han Sen asked.\n\n“Yes,” Falling Leaf answered.\n\n“Turn on your video chat,” Han Sen said.\n\n“Why?” Falling Leaf asked without turning on the video.\n\n“Just do what he told you to,” Miss Mirror said.\n\n“Okay,” Falling Leaf answered. She turned on her video chat, and her image appeared on Han Sen’s screen.\n\nFalling Leaf’s hair was a bit messy, and her clothing was misbuttoned. Han Sen had no idea what she had been doing with Bao’er all alone.\n\nBut that wasn’t important. Han Sen stared at her pupils and noticed they were normal. The colors were still the same, and there was only one pupil in each eye. Han Sen sagged a little in relief.\n\n“Dad!” Bao’er was sitting on the sofa, holding a pair of dice in her hands. Her voice sounded so sweet as she called out to Han Sen.\n\nBao’er’s eyes looked normal. That made him feel even safer. “Bao’er, stay in the room and play with Falling Leaf. Don’t go anywhere, and wait for me there, okay?”\n\n“Sure, Dad.” Bao’er nodded.\n\nHan Sen turned his attention back to Falling Leaf. “Falling Leaf, keep the door shut and don’t go anywhere. Don’t let anyone in, either, unless it is me.”\n\nFalling Leaf didn’t answer. She looked at Miss Mirror, who was still standing next to Han Sen.\n\n“Do as he says,” Miss Mirror said calmly.\n\n“Sure.” Falling Leaf nodded in agreement.\n\nHan Sen turned off the phone and spoke to Miss Mirror. “Find someone with unchanged eyes. We need to conduct a test.”\n\nMiss Mirror looked at Night Wind. Night Wind vanished without a word. A short time later, Night Wind re-appeared in the office again, pushing two people in front of him. They were two of the workers that Han Sen had positioned within range of the stone statue. One of them was Ning Yue, and the other was the man he had been teamed with.\n\nBecause Ning Yue had been farthest from the warehouse, he and his partner were the first people that Night Wind had run into.\n\n“You stay here.” Han Sen pushed Ning Yue out the door of the office and closed it. He pulled the Duke before the computer and restarted the video. He made sure that the Duke watched the entire thing.\n\nHan Sen, Miss Mirror, and Night Wind stared into the Duke’s eyes. After the Duke saw the statue with a thousand eyes and a thousand arms, the man’s pupils soon began to turn red. Seconds later, the color had deepened to a rich scarlet. Then the pupils started to split. In minutes, the Duke had red eyes just like Han Sen.\n\nHan Sen didn’t need to say anything. They all understood what was happening. Merely looking at the videotape containing an image of that statue could infect them with whatever cursed power that structure contained.\n\nHan Sen opened the door and let Ning Yue inside the room. His eyes were still fine, and there were no new changes there. He was able to confirm that when Han Sen asked.\n\n“No matter how you see that statue, you will be infected by its power.” Han Sen frowned. He used a few of his powers to explore his own eyes and figure out why they had changed, but there was nothing he could learn. As far as Han Sen could stretch his senses, the eyes felt normal. They didn’t seem to be under the influence of any foreign power.\n\nEven the Dongxuan Area couldn’t determine what had happened to his eyes. It was like his eyes were the same as usual.\n\nBut Han Sen could feel the same urges that Miss Mirror had described. He had a sudden impulse to head for the stone field. It was like an old smoker who hadn’t smoked all day; he desperately wanted to go out and buy a pack.\n\nLuckily, Han Sen had a stable mind. He was able to resist the impulse. If his mind had been weak, he would have run into the fields already.\n\nThe Duke screamed. His eyes turned red, and he started to gasp. He made an unnatural, swallowing sound, then turned to rush out of the office.\n\nNight Wind grabbed the Duke and pinned him to the ground. He used a substance chain to keep him locked in place.\n\nThe Duke fought like mad as he tried to shake the substance chain loose. His entire body shook like a junkie in need of a fix. His tears and snot began to drip onto the floor.\n\n“What do we do?” Han Sen asked, looking at Miss Mirror and Night Wind.\n\nThings were going bad very quickly, and this wasn’t something they could run away from. Complaining about the situation would be useless. They had to figure out a way to get free of this mess.\n\n“Maybe our answers lie beyond those stone doors. We might have to go there to find a solution to our current problems,” Night Wind said.\n\n“Have you tried destroying the statue with a thousand eyes and a thousand hands?” Han Sen asked.\n\n“I have tried to break it, but I was unsuccessful. That statue is harder than the average black rock. Our powers cannot damage it,” Night Wind said.\n\n“It looks like the stone door is the only way for us to proceed, then. The urges are getting stronger, and even with our powerful wills, we won’t last forever. We can’t wait for the reinforcements to get here. Let’s head to the doors while we still have control of ourselves.” When Miss Mirror made the decision, she didn’t sound hesitant. Her voice was firm and controlled.\n\n“Sure. Let’s go to that stone door and take a look.” Han Sen nodded. He wanted to see the thousand hands and thousand eyes statue, too.\n\nThey didn’t have any evidence that the infection could spread person to person if the video wasn’t involved, but at this point, who knew how the infection might be transmitted? If Bao’er and Ning Yue caught whatever this was, that would be bad.\n\nPlus, Ning Yue was already infected with something. It had become hard to tell if he was a man or a woman, and his personality had changed radically as well. The Ning Yue that Han Sen had known was gone.\n\nNow that Miss Mirror had made her decision, she immediately took action. Han Sen, Night Wind, and that Duke followed her to the stone fields.\n\nRed Cloud had fallen to King class, so they left her behind at the camp. She hadn’t seen the statue yet, so for the moment, her eyes remained normal. Instead of coming with them and putting herself at risk, Miss Mirror instructed her to take charge of the camp while they were gone."
}