{
    "chapter": 2798,
    "title": "Yin Ghost Head",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2798",
    "text": "Out of the top three in the universe, the Extreme King was the race with the most outsiders. They had also raised many deified outsiders for themselves. Most of those outsider deifieds were loyal, and they only worked for the Extreme King. They rarely returned to their own races.\n\nMister Yin was one of the outsider deifieds the Extreme King had raised. It was a Ghost Head elite that had been raised by Bai Wanjie and his faction. He worked for Bai Wanjie.\n\nGhost Heads were good at reading people’s brains. When it came to the transmutation class, Mister Yin was exceptional. Since he was able to extract the memories of a brain going all the way back to a victim’s birth, he only required enough time to bring results. He was also able to alter the memories of a person to control them.\n\nGhost Heads were able to turn enemies into friends. It was not difficult for Mister Yin to do that.\n\nReading shallow memories was something they could do whenever. When it came to reading the deeper memories, they needed to control the person first. It was even harder to change their memories.\n\nHan Sen had been locked up inside a supergravity cabin this entire time. When the cabin door opened, he saw Bai Wanjie enter. He was with a guy that looked like a big demon king piccolo.\n\nHan Sen checked the green-skinned person out. He also saw the two antennas on his head. He knew Bai Wanjie would not have invited this person in if it wasn’t for some specific reason.\n\n“Mister Yin, thank you for doing this,” Bai Wanjie said to the green-skinned creep.\n\nMister Yin smiled and said, “You are welcome, Mister Crown Prince. After all, this is my job.”\n\nAfter that, Mister Yin walked in front of Han Sen. Since Han Sen had been locked down by the supergravity pressure, he was unable to resist and move his body. He was only able to watch Mister Yin walk in front of him.\n\nMister Yin’s green eyes peered into Han Sen’s. His lips were lifted. He had a weird smile on his face as he said, “Do not be afraid, Little Child. This will all be over very soon.”\n\nAfter that, the green antennas on his head flashed with a green light. In the next second, the green light shot into Han Sen’s skull via the space between his eyebrows.\n\nBoom!\n\nThe green light quickly invaded Han Sen’s brain. It enabled Han Sen to understand what it was it had come there to do to him.\n\nHe wants to read my memories! Han Sen laughed coldly in his heart. He was not afraid of anyone trying to torture him. But by trying to read his memories, it was like a death wish for the invader. Even if he was unable to resist the man, the black crystal armor would not allow the invader to succeed.\n\nEven if the black crystal armor did not care about him, it would not allow anyone to scan Han Sen’s memories. That would just expose the black armor.\n\nAfter the green light entered Han Sen’s brain, the black crystal armor did not react. This confused Han Sen, but he soon saw Mister Yin’s face start to change. His eyes were wide open. His green skin began to expand and turn black.\n\nPang!\n\nMister Yin screamed and flew backward, hitting the cabin’s wall. He coughed up some blood.\n\n“Mister Yin!” Bai Wanjie frowned as he picked up Mister Yin from the floor.\n\nMister Yin wiped the blood off his mouth and stared at Han Sen with immense shock. He said, “This xenogeneic is weird. His head is like a rock. There is not a single message leaking out of it. Even my Ghost Brain power cannot invade his thoughts. Mister Crown Prince, is he a deified xenogeneic that is above larvae class?”\n\n“I do not know what level this xenogeneic is.” Bai Wanjie frowned and asked, “Do you think there is a way to read his memories?”\n\n“Right now, we can only use our race’s secret geno art Ghost Head Fall,” Mister Yin hesitantly said. “After using this geno art, even if a xenogeneic is larvae class, we can still read their memories. But by using this geno art, it will end up damaging the target’s brain a bit.”\n\n“What? How much will the target be damaged?” Bai Wanjie asked.\n\n“If we control it correctly, they will only lose a few of their memories,” Mister Yin said. “If things don’t go smoothly, and we have to force ourselves in, there can be even more damage. He might end up becoming a simpleton.”\n\nBai Wanjie thought deeply before asking, “If he becomes a simpleton, do you think we can still control his body?”\n\n“That would not be too difficult,” Mister Yin said. “We just need to write down the memories and make him do whatever you want. But he will never be able to think by himself again.”\n\n“That is fine,” Bai Wanjie said with a careless wave of his hand.\n\nWith Bai Wanjie’s permission, Mister Yin did not have to worry about anything. His antenna again flashed with a green bolt of lightning. This time, the green lightning did not strike Han Sen. It was going into the antenna. It made Mister Yin’s whole body crackle and fizz with green lightning.\n\nThis lasted about seven to eight minutes. After that, Mister Yin’s body built up with more and more green lightning. His entire body became a green shadow. It was like he was nothing more than something virtual.\n\nAt this time, Mister Yin raised his head and looked at Han Sen spookily. He used his hand to press Han Sen’s head.\n\nHis hands had already turned into green lightning. When his palm touched Han Sen’s head, it made Han Sen’s head pop and crack with lightning. It was like countless volts of green electricity surging into Han Sen’s brain.\n\nMister Yin’s whole body quickly became green lightning that was sent directly into Han Sen’s brain. It made Han Sen’s body shine with a green light. Even his hair was standing up straight due to the electric shock.\n\n“The battle power of the Ghost Heads is not too high, but their Ghost Brain is really quite overpowering. It is something quite rare in the universe. It is no wonder why Mother spent so many resources raising them.” Upon seeing all this, Bai Wanjie nodded. Raising an army to be used for one purpose was proving to be worthwhile. Mister Yin’s performance satisfied him.\n\nWith a Ghost Head deified like that with him, it was much easier for him to accomplish whatever he wished.\n\nWhile Bai Wanjie was thinking, he suddenly saw Han Sen, who was being invaded by Mister Yin, smiling in his direction. Han Sen gave him a disdained look.\n\nBai Wanjie’s heart was suddenly hit with a bad feeling. Before he could respond, he saw Han Sen’s body possess a green light. It was like a firework exploding. Then, it suddenly disappeared.\n\nBai Wanjie’s face changed. He could no longer feel Mister Yin’s existence inside Han Sen’s body.\n\n“Xenogeneic deified hunted. Yin Head Ghost: xenogeneic gene found. Obtained Weird Head Ghost beast soul. Deified gene already absorbed… Deified gene…”\n\nThe announcement kept popping up in Han Sen’s head. It had six deified genes.\n\nWhat a good man! He just gave me free deified genes and a beast soul. Han Sen complimented the gift basket. When Mister Yin entered his head, he knew he would end up dead.\n\nAs expected, the black crystal armor was triggered. A minor invasion was all that was needed for Mister Yin to end up dead a second later. He had become Han Sen’s snack.\n\nMeanwhile, Bai Wanjie looked terrible. He never thought he would be unable to extract Han Sen’s memories. He had also lost Mister Yin, whom he had raised for a long time."
}