{
    "chapter": 2347,
    "title": "Getting News",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2347",
    "text": "“I can’t even see a graveyard nearby. What important person died and is going to be buried here? Are they going to scatter the ashes into the ocean, maybe? Like a burial at sea?” Han Sen wondered.\n\nTo be entirely honest, Han Sen didn’t actually believe Miss Mirror’s claim. But with so many elites having shown up, something big had to have been going down.\n\nThe elites of the other races were all terrified of Miss Mirror. None dared to get close to her.\n\nMost of them milling around near the sea, though. They were all waiting for something to occur, just as Miss Mirror was.\n\nBut after a few days went by, nothing actually happened. Han Sen saw no evidence of the funeral that Miss Mirror had claimed would take place.\n\nIt had been six days by this point, and now, after all this time, Han Sen couldn’t but ask a question. “Miss Mirror, has the funeral not begun?”\n\nMiss Mirror was being taken care of by her servants in the meantime, as if she was on vacation. She had nice food to enjoy, and people served her everything. They almost moved a bathtub there for her. She was living in what was practically splendor. Han Sen and the blood kirin, on the other hand, hadn’t had a bite to eat over that entire length of time. Han Sen had reached the point where he could survive on the sustenance provided by absorbing universal energies, so while he would be fine, it was still pretty uncomfortable.\n\n“Why are you in such a rush? He isn’t dead yet,” Miss Mirror responded carelessly.\n\nHan Sen’s eyes widened, and he thought to himself, “They’re planning a funeral for someone who hasn’t yet died? And so many people are already here. Aren’t they the ones in a rush? If the dying guy knew about this, he’d probably be so angry that he’d have a heart attack and die immediately.”\n\nHan Sen thought this was a very strange scenario, but Miss Mirror seemed unwilling to answer any other questions. So, there was nothing he could do about it.\n\n“Miss Mirror, can I walk around? I am hungry, and I want some food to eat. Do not worry, I will not go far.” Han Sen looked at Miss Mirror.\n\n“You can go anywhere you wish. Just make sure you return before the funeral.” Han Sen hadn’t expected Miss Mirror to agree so simply. It was a quick response, as if she really had no desire to keep him imprisoned.\n\n“Thank you, madam.” Han Sen turned around and abandoned the peak. After a while, he turned back to take a look. Miss Mirror wasn’t watching him, and she hadn’t sent anyone to keep tabs on him. It seemed as if she really did not care.\n\n“Does she know that I won’t run off?” Han Sen thought that Miss Mirror was a very strange woman. He wasn’t going to dare trying to escape. He couldn’t allow himself to run until he had retrieved Bao’er, at the very least.\n\nAfter leaving the peak, Han Sen soon found that many elites from all sorts of races were present. Many of the races he saw were ones he had never seen before. After looking a little further, he found that a temporary market had been established.\n\nHan Sen felt relief well up in his heart, and he took off flying to the market immediately. There were many races occupying the various stalls. Lots of vendors had positioned themselves near the sea, many of them selling all sorts of xenogeneic items.\n\nThere were all kinds of levels, too. Some of the people around him looked like Viscounts or Barons, some looked like Kings, and some were of a capacity Han Sen couldn’t even identify. Those were very scary.\n\nAgain, he noticed that all the creatures there had water element powers.\n\n“This surely cannot be a coincidence. Is something going to happen here that is associated with water powers? I already have that Original Water King Body. Is that why Miss Mirror has brought me here?” That didn’t seem right, though. Captain Water Moon was a deified water elite. If this was an important opportunity for water-users, Miss Mirror wouldn’t have needed to bring a fraudulent prince there.\n\nHan Sen walked into the market. There were so many people and creatures there, so he figured it would be easy to collect some info. Everyone was talking to the vendors, after all.\n\nHan Sen walked around and watched the crowds before squatting down in front of a stall. He didn’t choose the stall because of its wares, but because the stall’s owner was low level. He could be bullied. Plus, it was one of the Kate. Therefore, in the consideration of other races, he was practically a nobody. His stall was in a corner and barely even noticeable.\n\nOf course, Han Sen wanted to bully him. It would be faster to get info out of him through doing that than by being pleasant.\n\n“Big Brother, what I sell are true water xenogeneic treasures. What would you like?” The Kate Baron smiled, introducing his unremarkable wares with genuine enthusiasm.\n\n“Who is your big brother?” Han Sen put on a dour expression.\n\n“Oh… I am sorry, Hot Man,” the Kate Baron said quickly.\n\n“That’s more like it.” Han Sen nodded, but inside, he thought, “No, I am here to play the bad guy. I should be called a boss.”\n\nPretending to be evil didn’t suit Han Sen very well, so he gave up the act. He pulled out a Viscount dagger and held it before the Baron. He said, “Do you know what this is?”\n\n“Handsome, I’m sorry! We do small business here. We only sell, and we do not buy. What about over there? That guy is so rich, he is sure to give you a high price.” The owner looked fairly glum.\n\n“Who said I am trying to sell you something? Look at me. Do I look broke enough to sell my goods to someone like you?” Han Sen tossed the dagger down in front of the owner and spoke with a rich tone of voice. “Answer my questions and this can be yours.”\n\n“You are here for information? You could have just told me that sooner.” The owner put the dagger into his pocket, patted his chest, and said, “Ask me anything, handsome. Nothing goes on here that I don’t know about.”\n\nHan Sen didn’t think the man’s information was going to be very reliable. For a Baron, he was talking a big game. He didn’t look worried about giving away something that he shouldn’t.\n\nFortunately, Han Sen wasn’t hoping to learn any secrets. He just needed answers to some simple questions.\n\n“What are you doing here?” Han Sen asked, looking around.\n\n“Handsome, don’t you see? I’m here trying to earn money!” Alang laughed.\n\n“Be serious; who cares if you earn money. I’m asking what everyone is doing here, on this planet!” Han Sen stared at Alang, already regretting asking the man for information. He was useless.\n\nAlang looked as if he had woken from a dream, and he said, “Ah, you are asking about that? Why are you asking this? Aren’t you here for the same thing? Here to watch the Ancient Water God?”\n\nHan Sen was surprised. There were stories of Water Gods in various races, but this one was special. And it was approved by the universe. Han Sen thought he had heard that this was a member of the Ancient God race.\n\n“Is the funeral Miss Mirror mentioned the Ancient Water God’s funeral? No way. The legends of the Ancient Gods say that they are all born deified. And they live so long, with a lifespan of a billion years. It is rare to see one of the Ancient Gods dying,” Han Sen thought to himself."
}