{
    "chapter": 1878,
    "title": "Purgatory Beast",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1878",
    "text": "When the Gana’s Holy Lady saw the item Han Sen was holding, her face changed completely. She looked at Han Sen with pretty eyes and said, “Where did you get this?”\n\n“Guna asked me to save you, but I am afraid I am too weak. Now I might have that chance, though,” Han Sen coldly said.\n\nThe Gana’s Holy Lady looked at Han Sen and said icily, “Don’t try to fool me. You captured Guna and stole the Gana Stone from her, didn’t you?”\n\nHan Sen was holding a small tablet. It was very ancient-looking. It had Gana text scrawled on one side, and a depiction of the Gana goddess on the other.\n\nBefore Han Sen came to the auction, Guna had given it to him. She told him that item would allow him to buy any Gana he wished to, and the Gana would have no choice but to agree.\n\nShe had not mentioned the name of the specific Gana she wanted Han Sen to bring, but she did say that it was her sister. She also told Han Sen he’d know who it was as soon as he saw her.\n\nGuna was right, as well. He did know, because Guna and the woman before him looked exactly the same. They were almost identical, like twins.\n\nHan Sen pressed the face of the tablet, and then the text and the goddess lit up.\n\n“A Kao called Gia captured her and tried to sell her. It is fortunate I saved her whilst on my travels. I was going to send her back, but it seems the Gana have fallen. So, I kept Guna on my aircraft. She asked me to save you, no matter what the cost. She also told me to take this with me to the auction. She told me that this tablet would ensure you were saved from the Kao. She taught me how to make use of it, too.” Han Sen was only being half honest with her.\n\nHoly Lady Gana looked confused, but she ultimately believed him. She took the tablet from him and said, “It is nice that Guna has made it to safety, but it is truly too late for us. Purgatory Heaven has started, and there is no hope of survival.”\n\n“Is there truly no other way?” Han Sen asked.\n\nGana Holy Lady looked at the gold Gana Goddess statue and gave a wry smile. “If you were a King, you might be able to escape and get clear of the planet before it is consumed by Purgatory Heaven. It doesn’t seem as if any of us here possess that power, though, does it?”\n\n“Talk about this later. Guna and my subordinates are on the ship. Is there a way to find them?” Han Sen was in a rush now. He was getting very afraid Little Meng’er might end up getting swallowed by the powers of Purgatory Heaven.\n\nThe Gana Holy Lady thought for a moment, and then said, “If Guna is with your fellows, they ought to be fine. But that sanctuary won’t last very long. Where is your ship right now?”\n\n“It is docked to the south of here,” Han Sen answered quickly.\n\n“Well, the least we can do is to try for it. Follow me at a pace no greater than three steps behind,” the Gana Holy Lady said. Then, she headed towards the darkness. Han Sen quickly asked Icebird Duke to follow them out into the darkness.\n\nThe Gana Holy Lady was glowing. Wherever she moved, no strange arms rose up from the ground. Han Sen and Icebird Duke stood right next to her.\n\nThe Duke that fought against Icebird Duke witnessed what was happening, and so he decided to follow them, too. But he was a few steps away from the Gana Holy Lady, and an arm managed to clutch his body.\n\nThe Duke gathered up power to fight back the arms that came for him, but it was pointless. He flew up into the sky then, but as soon as he took off, a gold light shot out of the clouds and sucked him into it. Then, he was gone.\n\nThe Nobles that wished to follow after them stopped. No one dared to step outside now.\n\nHan Sen and Icebird Duke were still able to follow the Gana Holy Lady, but she had been injured. Although Han Sen had healed her, she was still moving very slowly.\n\n“How about I carry you?” Han Sen wanted to speed up, but he couldn’t go any faster.\n\nThe Gana Holy Lady shook her head. “I have a bit of the goddess’ blood in me. I can temporarily suppress the Purgatory Heaven power, but that’s about it. I can’t control it. I don’t think I’ll be able to fully escape Purgatory Heaven. If I’m not physically connected to the ground, even for just a moment, we will find ourselves in purgatory immediately.”\n\nHan Sen had no choice but to follow her. The further they walked, the darker things became. And also, the dimmer her glow.\n\nThe arms surrounded them like toxic snakes on the ground. They would only roll and coil away when the Gana Holy Lady was no further than two steps away.\n\nWhen her light became weaker, her radiance reduced. Han Sen and Icebird Duke had to stick extremely close to her. They were almost pressing against her back.\n\nThere was a sudden shout. The Gana Holy Lady’s face changed, and she said, “No! Purgatory Heaven has developed faster than I assumed it would. The Purgatory Beast has been generated.”\n\nWhen she started to glow, Han Sen saw a shadow approaching. The shadow was able to camouflage itself in the dark, and only its eyes gleamed out from the black.\n\nWhen the shadow was only three steps away, Han Sen was finally able to see its face.\n\nIt was a black beast with two heads, and it looked like a hellhound. Two of its heads looked at them murderously.\n\nThe Gana Holy Lady bit her fingers to produce blood and then swung them at the beast. A droplet of that blood landed on the body of the beast, and it started to cry. It fell to the ground, dissolving into black smoke.\n\n“Nice! I did not know blood could be used like that.” Han Sen complimented the act.\n\nThat was just a newborn Purgatory Beast. It was weak. That was how my blood could suppress it. You guys shouldn’t try to fight. They may be weak, but ordinary powers are unable to touch them,” the Gana Holy Lady said.\n\nAfter that, another two-headed beast leaped out of the dark. It was going straight for Icebird Duke.\n\nIcebird Duke hummed. She generated an ice bird and then struck the Purgatory Beast. But her power went right through the fiend, as if it truly was just a shadow. The beast was still coming at Icebird Duke, soaring through the air unfazed.\n\nThe Gana Holy Lady waved her arm and sent a drop of blood to land on the Purgatory Beast. Again, it became black smoke.\n\nIcebird Duke looked glum. Her powers were completely useless against those things. She was less useful than a drop of blood, right now.\n\nThe three of them kept on walking. Not long after, their faces changed. Many Purgatory Beasts were approaching out of the dark. Their eyes were everywhere, and it was difficult to determine how many there were now.\n\n“It looks like I won’t be able to see Guna one last time before we die.” The Gana Holy Lady’s face looked bitter. There were so many Purgatory Beasts that there wasn’t enough blood in her body to defeat them. She’d wither herself dry if she tried, and it’d still be for naught. She couldn’t do it."
}