{
    "chapter": 2755,
    "title": "God’s Farm",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2755",
    "text": "The Four Sheep Cube was Han Sen’s only chance of escape. He couldn’t stop trying. He wouldn’t give up hope until he had tried journeying to all four locations.\n\nHan Sen gnashed his teeth as he pressed down another sheep head. The Four Sheep Cube was activated again, and it sucked Han Sen inside it.\n\nWa-la!\n\nHan Sen emerged from the Four Sheep Cube, his body already tense. He immediately had a look around. Luckily, things were different from the last location. Here, no scary xenogeneics were staring at him.\n\nThis place looked fairly ordinary. Han Sen was standing on an asteroid in an asteroid belt. He could see a lot of stars in the sky. There were very big stars all around him.\n\nHan Sen looked at the stars and realized there were many planets nearby, as well. He saw a planet with a lifeforce. Looking a bit hesitant, Han Sen flew down toward the planet.\n\n“Holy sh*t! Is it a grass field?” After Han Sen entered the atmosphere, he was surprised to see that the entire surface of the planet seemed to be covered in a grassy field. He could see a lot of sheep grazing in those fields. They were all crowded together, and the smallest flock of sheep had at least 1000 in their midst.\n\nThe sheep were a variety of different colors and breeds. Most of them looked thin and swift, like antelopes. Some of them were stock and powerful, like goats. Some of them just looked like ordinary sheep.\n\n“Did I fall into a sheep farm? It is a shame that cowardly Sheep I met in the sanctuaries isn’t here. He could translate for me and ask the sheep where this place is.” Han Sen could sense that the flocks of sheep were nothing mighty. The average sheep appeared to be no greater than Baron class. Even Viscounts were rare. Han Sen wasn’t accustomed to being surrounded by such weak creatures.\n\nThe other two sheep heads had sent Han Sen to very dangerous places, but now, he was on a world of prey animals. He wasn’t used to that.\n\nAs Han Sen flew down to land on the grass field, the flocks of sheep noticed him and raced to surround him. One of the sheep came forward to bleat at Han Sen while he was in the sky.\n\nBaa!\n\nHan Sen didn’t speak Sheep-nese, so he activated the Dongxuan Area and used it to read the sheep’s mind. He heard the sheep speak the universal language. It was saying to him, “Outsider! How did you come to God’s Farm?”\n\n“It is good that it can speak,” Han Sen thought happily. He looked at the sheep and said, “I was lost in space, and I found this planet by chance. I was hoping you could tell me what this place is. If it is possible, can you sell me a star map?”\n\nWhen the flock of sheep heard what Han Sen said, their response looked very human. They looked at each other, and then they started laughing.\n\nHan Sen had never seen an enormous flock of sheep all laughing themselves silly. It was a very strange sight. He frowned and coldly said, “What is so funny?”\n\nOne of the sheep laughed and said, “This is God’s Farm. We are the food that grows for God. Once you are here, you do not leave. You and I will become food for God together.”\n\n“I can come and go as I please. No one can keep me here,” Han Sen said in annoyance.\n\nThe flock looked at Han Sen with mirth. One of the sheep smirked and said, “Try it now, then. See if you can leave God’s Farm.”\n\n“This God’s Farm you keep talking about; do you mean the planet as a whole?” Han Sen asked.\n\n“Yes,” the sheep affirmed with a nod.\n\n“What is so hard about leaving here?” Han Sen crouched and then launched himself up into the sky like a rocket, intending to fly out of the atmosphere and leave that field-covered planet behind.\n\nHe had almost exited the atmosphere when he saw the wind change. It suddenly came together to form a giant blade that slashed toward him as he flew.\n\nHan Sen’s eyes narrowed. He generated a sword light in his hand and slashed toward the giant blade.\n\nPang!\n\nThe sword light came against the giant blade, and Han Sen felt a backlash of expended power wash over him. It knocked him out of the air. He fell back to the planet’s surface, and he hit the ground so hard that he created a large crater.\n\nThe giant blade disappeared as if it had never existed. Han Sen frowned up at the sky. The sheep were laughing. “Since you are here, you should accept your fate. You will become food for God sooner or later. You must accept this.”\n\nHan Sen didn’t believe this was God’s Farm, unless God was the biggest fan of lamb shanks ever. If all God did was grow sheep, he would have smelled a lot more gamey.\n\nHan Sen turned his attention back to the sky and jumped into the air again. He was headed for the cosmos once more.\n\nWhen Han Sen was almost out of the atmosphere, the giant blade reappeared and slashed toward him.\n\n“It is useless! Once you enter God’s Farm, you are God’s food. No one can escape,” the sheep proclaimed, shouting so that Han Sen could hear him.\n\nPang!\n\nThe next second, the eyes of all the sheep opened wide. They stared up in disbelief.\n\nRather than attempting to dodge the blade, Han Sen punched it. His fist came against the big blade, and the blade broke. The blade shattered like a chunk of badly-forged iron, and it disappeared in the air.\n\n“If that was God’s power, then God is pretty lame,” Han Sen thought to himself. He was planning to fly back to the field so that he could ask the sheep more questions about this place, but he suddenly saw many more blades appearing in the sky. A sea of swords rose before him, shielding the entire sky. They turned to point at Han Sen.\n\nHan Sen was shocked. He didn’t say anything, and he just teleported back to the grass field. He raised his head and saw the countless blades that blanketed the sky start to disappear. They were gone within seconds.\n\nHan Sen’s face turned grim. The power of a giant blade was as good as a primitive deified attack. If that many giant blades came down on him at once, not even Han Sen could block them.\n\n“We told you, this is God’s Farm. It doesn’t matter how strong you are. In God’s eye, you are just food,” the sheep said with a smile.\n\n“The God you are talking about; what does he look like?” Han Sen said, ignoring the blathering of the brain-washed sheep.\n\n“God is God. What else could he be?” the sheep answered, looking at Han Sen with disdain.\n\nHan Sen wanted to ask something more, but he suddenly saw a carriage fly through the sky. Nine white unicorns were pulling a white carriage as it headed for the grassy field.\n\nWhen the flock of sheep saw the white carriage, they started to shake on the ground. It was like they didn’t even have the power to run. It was all they could do to remain standing as they trembled. They lowered their heads, like they were ostriches that wanted nothing more than to put their heads in the sand."
}