{
    "chapter": 997,
    "title": "Falsified-Sky Sutra?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_997",
    "text": "“Why is the dragon scale inscribed with shura text?” Han Sen had tried his best to translate it, but it was mostly to no avail. So he turned his attention back to Dragon King and started interrogating him for information. But the spirit was tight-lipped, and no death threat Han Sen could make was enough to force him to talk.\n\n“It’s like the sky, but it is not. It is asura.” As Zero returned, bringing back the meatfeast of a hunt to the shelter, she started talking to herself when seeing the dragon scale.\n\n“Did you say something?” Han Sen asked Zero to repeat what she had said.\n\nZero pointed to the scale and said, “It’s like the sky, but it is not. It is asura.”\n\n“You know what’s written on this thing?” Han Sen’s excitement perked.\n\nHis excitement did not stem from Zero being able to understand the text, though.\n\nZero was a shura, in some way or another. Although he was surprised to learn she was able to read the ancient shura language, this was not what excited him.\n\nWhat excited him was what Zero had said. He recognized them, as they were the opening lines of the Falsified-Sky Sutra.\n\nZero nodded.\n\n“Can you read it out to me?” Han Sen asked, in a rushed manner.\n\nZero took the scale in her hands and started to read, as requested. “It’s like the sky, but it is not. It is asura…”\n\nHan Sen was frozen, as ninety percent of the text was the Falsified-Sky Sutra.\n\nHis heart pounded and his head pulsed as if it was going to explode.\n\nHan Sen could not understand why the Falsified-Sky Sutra had been written in an ancient shura language, on a dragon scale in the Third God’s Sanctuary. It gave him a headache, as he tried to comprehend all the possible implications this revelation conveyed.\n\n“What’s going on?” Han Sen asked himself, in complete disbelief.\n\nAfter Zero finished reading what was written, her hand gleamed with a power. All of a sudden, an invisible force was cast outwards against a nearby pillar with great intensity.\n\n“Falsified-Sky powers?” Han Sen was quickly taken aback.\n\nHan Sen had seen it many times at this point, so it was easy for him to recognize it.\n\n“Zero, have you learned this before?” Han Sen asked, as he grabbed her by the arms.\n\nZero shook her head, but Han Sen still asked, “And that’s the truth? You haven’t learned it? What about the Falsified-Sky Sutra?”\n\nZero shook her head, as if she had done something naughty. “I’m sorry! I didn’t mean to cast it like that, I was just giving it a go.”\n\n“It’s okay. You can practice it all you like, that’s not what I meant.” Han Sen realized his reaction might have scared her. So, he gave her the scale and comforted her to the best of his abilities.\n\nHan Sen had not practiced the Falsified-Sky Sutra to distance himself from the Luo family. Since Zero had suddenly just learned it, he didn’t see the harm in allowing her to continue practicing it.\n\nBut Han Sen was still perplexed over the day’s discoveries. He could not wrap his head around why the Falsified-Sky Sutra would have some kind of connection not only to Dragon King, but the shura, as well.\n\nHan Sen’s mother told him only members of the Luo family could learn the Falsified-Sky Sutra, but evidently, that was not the case. Zero had only just read it once, and she inadvertently cast it with as much ferocity as Luo Yin.\n\nLooking at Zero, Han Sen now wore a complicated look that came from his intense interest in her character.\n\nHan Sen left the hall shortly after this and went to a place where no one might intrude upon him in the shelter. There was a room there, and after closing its doors, he released Dragon King from the ring.\n\nThe hall was suddenly alive with the sound of screaming. Even the King of Hell himself would have shuddered at the sounds of those anguish-born cries.\n\nNo matter what Han Sen did to Dragon King, he would not talk. No threats or wretched manner of torture or inflicted pain would make him speak.\n\nThe asura sutra on the scale was the Falsified-Sky Sutra, and as incomprehensible as it seemed, Dragon King was not at all willing to elucidate the reasons why.\n\n“How could Dragon King plead for his life before, and yet now, he seems happy to die on behalf of maintaining the Falsified-Sky Sutra’s secrecy?” Han Sen wondered.\n\nSeeing Dragon King near death, Han Sen returned him to the ring.\n\nHan Sen really wanted to learn more, but for now, he had hit a dead end. With no further leads to explore, it’d have to be put on the backburner.\n\nHan Sen thought about asking his mother, but she was never keen on discussing anything regarding the Luo family. As such, he thought it was unlikely he’d learn anything from her about this entire affair.\n\nAnd it would probably upset her, if Han Sen did start showing an interest in the Luo family.\n\nHan Sen returned to the hall and continued dining on the mutant flesh Moment Queen had retrieved earlier. And now, his mutant geno points had maxed out.\n\nHe gave his new strength a whirl on the tester, and learned his fitness level was above fifteen hundred. This meant he was capable of opening his fifth gene lock.\n\nUnfortunately, his Qi Gong was trailing behind. He estimated it’d take another three months just to unlock the fourth tier.\n\nThe higher the gene lock, the harder it would be to unlock it. After the seventh tier, subsequent unlocks rested purely on talent and luck.\n\nFew super creatures and king spirits were capable of unlocking nine gene locks. And the number of humans reaching such heights was lower by an extremely large margin.\n\nTo kill super creatures in the future, though, Han Sen knew he’d have to get his gene locks open. And so he was determined to do just that. If he didn’t get them open, he wagered he’d have no luck in their hunting.\n\nWhen Han Sen woke up, he received a package from an AI. Strangely, it did not say from whom it was sent.\n\n“That’s weird. Who sent me this package?” Han Sen opened the package immediately, not concerned about the remote possibility of something dangerous residing within. The Alliance was able to scan packages, anyway. If there was a harmful substance, such as toxins or radioactive material, or even bombs inside, the package would never have been forwarded to him."
}