{
    "chapter": 1042,
    "title": "World of Charcoal",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1042",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“This cannot be incorrect. This is indeed the Phoenix Eye,” Brother Seven reaffirmed.\n\n“Then where’s the treasure?” Han Sen saw a mountain range in the distance, which only told him this place was massive. Locating anything there might be far more difficult than expected.\n\nBrother Seven looked back at his compass. He said, “This is strange. I cannot tell which direction we must go now.”\n\nBrother Seven touched the black grass on the ground, and when he looked at his hand, it was covered in black soot. The ground really was like charcoal. Then, he said, “I have no idea whatsoever what purpose this place serves, in a shelter, but I am certain some power presides over this place. A dangerous presence remains, one that keeps this world like one that was built from charcoal.”\n\n“It’s best we don’t split up,” Han Sen said, as he looked around.\n\nBrother Seven nodded, and he knew Han Sen would protect him.\n\nHan Sen was not very proficient when it came to discovering paths and going in the right direction, so he allowed Brother Seven to lead.\n\nAlthough Brother Seven was just as clueless about where the treasure might be found, he was good at planning routes.\n\nAs they walked, the landscape remained the same. The mountain, trees, and flowers were all still black.\n\nThere was great variation in the size and shape of the flowers and trees. There were thick, giant trees, and lots of tiny little flowers. Black as they were, they looked like motionless statues. They looked as if they could never die, and they’d be preserved in this state forever.\n\nBao’er thought the flowers looked incredibly pretty, and she wanted to hold one. But upon being allowed to touch one, the flower quickly collapsed into a mound of soot.\n\n“What kind of power can incinerate things like this?” Han Sen was quite surprised.\n\nBrother Seven could only say, “I have no idea, but if we encounter whatever has done this, we are sure to meet a swift end. Rather than cooked, I’d wager we’d be vaporized.”\n\nHan Sen did not expect Brother Seven to be so light-hearted, and of a mood to actually make half a jest.\n\nBut suddenly, they heard a noise coming from a distant black forest.\n\nWhen they tracked down the noise, they saw a white ram, grazing on the black grass of a meadow.\n\nThe contrast between the white ram and black earth was striking.\n\n“There are creatures here?” Han Sen was moderately relieved, upon coming to learn this.\n\nThe place had previously felt like a warped, alternate dimension. Seeing something else alive there made the place feel a little more real.\n\nIf this was all a hallucination, however, whoever created it had to be a supremely powerful being.\n\nBut if it was real, as he hoped, then at least he could use his powers.\n\nBao’er, seeing the fluffy ram, quickly ran over to it. She leapt onto its back and grabbed its horns—she looked exuberantly happy.\n\nThe ram was alarmed by its sudden mounting, and it took off running into the forest.\n\nHan Sen quickly gave chase, as the last thing he wanted right now was to lose Bao’er. If he lost her now, it’d be difficult to find her again.\n\nHan Sen guessed the ram was a mutant creature, and his hypothesis was correct. He and Brother Seven caught up with the ram with ease, and when they did, Han Sen grabbed the creature by its head.\n\nThe ram went soft and fell to the ground, with Bao’er clapping.\n\nBrother Seven wished to say something, but his face immediately changed.\n\n“Han Sen, let go of the ram,” Brother Seven pleaded with anxiety.\n\n“What is it?” Han Sen picked up Bao’er and turned to look at what had startled Brother Seven.\n\nThere were many more rams and sheep approaching. Their numbers had to be in the hundreds, and they all looked displeased and hostile.\n\nThe first ram they saw was fairly small in comparison to these others. Their horns were massive and sharp like blades.\n\nThe first ram was a mutant creature, but Han Sen guessed the others had to be sacred-blood creatures. With their power, all combined, they’d make for frightening foes.\n\nHan Sen’s fitness was only equivalent to that of a sacred-blood creature, so he could easily find himself skewered and trampled to death if he did not use super king spirit mode.\n\n“You guys have cute children! I was just giving this one a hug; I wasn’t being rough…” Han Sen started to stroke the mutant ram’s head, and helped it get back up to its feet.\n\nHe didn’t want to incite the ire and fury of the rams. To survive a stampede by those wooly fiends, he’d have to use super king spirit mode. But it was a draining talent, and he only sought to use it during the times where he absolutely had to. Not knowing what lay further ahead on this journey, too, he favored not making use of it now.\n\nThe hundreds of rams and sheep then baa’d with rage.\n\nThe rams started to rush towards Han Sen like a legion of superspeed tanks.\n\nHan Sen grabbed Brother Seven and took off into the air in flight.\n\nHan Sen didn’t want Brother Seven to get hurt, so he thought it best to take the man to a safer spot before deciding what to do next.\n\nBut unfortunately for them, the rams were able to jump fifty meters high.\n\nHan Sen swooped through the air like a bird, effortlessly evading the airborne attacks of the rams. He may have been safe and out of their reach, but the rams followed wherever he flew. And as they went, a chorus of baa’ing constantly sounded.\n\nThe rams were very powerful, and they each had to be sacred-blood in class.\n\nHan Sen initially believed losing their pursuit would be easy, but he was quickly proven wrong. And as he tried to escape, he noticed the white rams and sheep were starting to turn black.\n\nThe rams and sheep that banded together to assault Han Sen once looked like a cloud that was chasing him, but now, they were all black like an oversized chip of charcoal.\n\nIt was clear to see their speed and power had increased, following their change in color. But suddenly, Han Sen heard another sheep bawl.\n\nThere was a black male ram that looked different than the others coming. It ran and leapt towards Han Sen.\n\n“Super creature?!” Han Sen’s face changed."
}