{
    "chapter": 1941,
    "title": "Battle Buddha",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1941",
    "text": "Han Sen carried Hai’er as he ran, but it wasn’t because he had any sympathy for her. He wanted a witness. If he had one, it might prove useful further down the line.\n\nHan Sen used his rabbit shoes to run, but he still looked gloomy. Seven Spirit Buddha was keeping up with him, and the gap between them was slowly closing.\n\nAlthough there was still some distance between them, Han Sen was fleeing over the flat, unobstructed sands. There was no place to hide, and it would only be a matter of time before Seven Spirit Buddha caught up with him.\n\n“He’s just a Marquise?” Han Sen looked back. Seven Spirit Buddha was one kilometer behind them.\n\nHai’er was shocked, and she said, “Seven Spirit Buddha is a Marquise, but he is a genius amongst the Buddha. And Burning Lamp Alpha taught him personally. I fear not even a Duke could rival him. You need to run, because he is coming.”\n\nHan Sen wanted to run faster, but he was still just a Viscount. He was already moving as fast as the shoes would allow. “Seven Spirit Buddha! Why are you chasing me?” Han Sen shouted as he ran.\n\nSeven Spirit Buddha said grimly, “Amitabha!”\n\nHe didn’t say anything more. He merely focused on his pursuit of Han Sen, and he slowly reeled in the distance between them.\n\nHai’er looked grim, and she said, “It looks like he really wants to kill you. This is bad, man. If we don’t reach our destination, we’re going to die.”\n\nHan Sen suddenly slapped Hai’er’s body, sending a surge of energy into her. She found herself unable to move. She couldn’t squirm, and neither could she speak.\n\n“Stop talking. I can lose him,” Han Sen said to Hai’er as he hopped up a sand dune.\n\nBut Han Sen didn’t jump up there to remain on high ground. He slid down its other side, and he used the height of the dune to obscure Seven Spirit Buddha’s vision.\n\nThe moment Han Sen was out of sight, he patted Little Invisible. Then, a strange colorful power wrapped him up. Han Sen was able to blend into the desert itself. No eyesight could detect them.\n\nAfter crossing another thousand meters, Seven Spirit Buddha reached the dune. Then, he started looking around.\n\n“Mister Han, I know you are here. Come and fight me, student of Knife Queen. At least die with dignity,” Seven Spirit Buddha rumbled.\n\nNothing responded to him, though. Seven Spirit Buddha did not move from his position as he looked over the desert. He moved his lips, and a sound came out of his mouth.\n\nA whirlwind kicked up, quickly swirling into a choking sandstorm. It had a diameter of a thousand meters, and its thickness painted it like a yellow fog. Seven Spirit Buddha was convinced Han Sen was there, and he wished to use the sandstorm to reveal him. But when the sandstorm quelled, he was unable to see anything. It was still and quiet, and he could not see Han Sen.\n\n“Is he good with the element of earth?” Seven Spirit Buddha spoke to himself. He looked around and ventured in a specific direction. Then, he disappeared.\n\nIn the sky, Hai’er saw Seven Spirit Buddha vanish. She wanted Han Sen to free her, but she had no voice to speak with. She was yelling in her mind, “*sshole! Let me go! You are deliberately touching me.”\n\nShe could only think these things, since she still couldn’t control her mouth.\n\nHan Sen was in the air, and he didn’t go back down. Neither did he free Hai’er. He slowly flew higher and higher. He drifted up so gradually, it felt as if he wasn’t moving at all.\n\n“Wimp! Seven Spirit Buddha is gone. Why are you still being so careful? Let me go!” Hai’er was yelling in her heart.\n\nHan Sen’s forehead dripped with sweat. He was just a Viscount, and flying slowly cost more energy than flying fast. And on top of that, he was holding Hai’er. That cost him even more energy. After ten minutes, he traveled one kilometer.\n\nHai’er was going to go crazy, being unable to move or speak. If she could, she’d have been yelling at Han Sen.\n\nSuddenly, Hai’er saw the same dune that Seven Spirit Buddha had been standing atop. Seven Spirit Buddha had appeared there once again.\n\nHe was wearing a white robe, standing atop the dune. It was as if he hadn’t moved at all.\n\nHai’er was shocked, and she thought to herself, “I saw him walk away. Why is he still here? Can he teleport?”\n\nAmidst Hai’er’s shock, Seven Spirit Buddha mumbled something to himself. A light then came out of his body, glowing strangely from his chest. It looked like another seven spirits emerged from him and walked their own separate ways.\n\nNot long after, another seven spirits emerged from each of the seven spirits. They all went off in different directions, but the real Seven Spirit Buddha was still atop the original dune. After a while, he traveled west.\n\n“Buddha Clone? He is powerful.” Hai’er understood that the seven spirits she was seeing were actually just clones.\n\nBut producing clones like that was something only a King class Buddha could do. Seven Spirit Buddha was just a Marquise. His ability to produce seven clones to search for them was terrifying.\n\nHai’er was so happy right now that Han Sen had not freed her. If she had made a noise, Seven Spirit Buddha would immediately have known where they were.\n\n“This guy is pretty good. He’s just a Viscount, but he has that speed? I don’t know what treasure he collected to make him so fast,” Hai’er thought.\n\nHan Sen landed, and then he removed their camouflage. He also freed her.\n\nHai’er was being quite suspicious. She carefully looked around and said, “Is he really gone?”\n\n“He is for now, but I am sure he will be back.” Han Sen moved to rest on the sand.\n\nThen what are we waiting for? Let’s run!” Hai’er said.\n\nHan Sen did not move from his spot, though, and he calmly said, “His clones went off in eight different directions. Wherever we go, he will see us.”\n\n“Then what do we do?” Hai’er was not strong enough to deal with someone like Seven Spirit Buddha. Somehow, she had found herself depending on Han Sen."
}