{
    "chapter": 1192,
    "title": "You Are Too Weak",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1192",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen didn’t buy Hyperspace in the end, since he didn’t meet the ideal time king spirit geno point requirement yet. He still wanted to buy a hyper geno art that dealt simple, non-fancy high damage, too.\n\nBut he decided that could wait for the time being, so he could consult Moment Queen about her lending him time geno points.\n\nBack in the shelter, Bao’er leaped off the back of the white bear to go and sit on Han Sen’s shoulder. She was wearing cowboy boots, a cowboy hat, and had a large pair of aviator sunglasses on.\n\nHan Sen patted her head and then went to the Martial Hall.\n\nThere, Han Sen walked up to Moment Queen and said, “I have learned a new technique! Care to practice with me?”\n\n“I am too weak. Why don’t you ask your Blue Dinosaur to help you out?” Moment Queen said.\n\n“He is too strong for me, so I can’t practice with him. Besides, I’m in the mood to interact with you,” Han Sen said.\n\nMoment Queen’s eyes twitched, suggesting she was easy for him to bully.\n\nMoment Queen lowered her head and answered, “Fine.”\n\nHan Sen asked her, “Have you heard of this fellow called The King?”\n\n“Yes, I have,” Moment Queen answered with immediacy. In her heart, the mere calling of that name prompted her to think, “Ah, The King who must one day become a most glorious emperor!”\n\n“Does he use a skill that involves coins?” Han Sen asked.\n\n“I think so,” Moment Queen said.\n\n“Have you seen it in action?” Han Sen asked.\n\n“No, I haven’t.” Moment Queen had developed a compulsion to lie it seemed, as she snickered to herself on the inside, saying, “Of course I have, you dimwit. As if I’d tell you about it.”\n\n“It is good that you have not seen it, then. I have a power that involves the use of coins, too. I bet I’m better than The King with them, too,” Han Sen boasted, baiting her.\n\nHearing this, Moment Queen thought to herself, “Pah! You are nothing compared to The King, you imbecile.”\n\nMoment Queen despised Han Sen with every bone in her body, but she was bound to him in service. So, for now, she had no choice but to comply with Han Sen’s desire to practice.\n\nHan Sen could sense how much she hated him, but that was fine.\n\nShe used to lie about possessing the space element, when it was in fact time. And she seemed to have some relation to a lot of emperors. If she wasn’t useful, he would have killed her after her last attempt of betrayal.\n\nHan Sen reached out his right hand and made a coin appear between two of his fingers.\n\nMoment Queen had already been shocked. She didn’t expect he’d even be able to formulate a coin out of thin air. Of course, that could be little more than an illusion, just something for show. It didn’t illustrate Han Sen’s true proficiency, power, and expertise with the coin technique he wished to show her.\n\nHer face soon changed, though. After a small amount of time elapsed, the coin was able to gather up a vast amount of scary, wretched power.\n\nMoment Queen was able to detect and detail how much power was being amassed. If it kept on going, Han Sen could kill her.\n\n“Have I finally outlived my usefulness? Has the time come for him to kill me? Is this the day? Is this how I am going to go out? Will my existence be snuffed out by this monetary monstrosity?!” Moment Queen’s mind was riddled with such thoughts.\n\nBut if Han Sen truly wanted to kill her, he’d only have to use his mind.\n\nStill, the thought remained. And the stronger the power in that coin became, the more her anxiety and nervousness grew.\n\nPang!\n\nThe coin flew towards Moment Queen like a golden arrow, as the dimension around it twisted with the flight. Moment Queen’s face changed as she realized that the power in that coin could easily kill her.\n\nShe had initially believed she could fake an injury and end the session prematurely. But when the coin flew, pretending an injury was off the table. If she wasn’t outright killed, she’d at the very least be rendered a crippled mess.\n\nMoment Queen teleported a few hundred meters away. She believed she had managed to dodge the attack, but the coin’s flight halted in mid-air. The coin twirled and twirled, as if trying to suck her back to it.\n\nMoment Queen tried her best to escape that power, but the coin had been brewing for so long, not even a king spirit with nine of its gene locks open could escape such a thing.\n\nSeeing herself being drawn to the coin, she knew she’d be killed the moment she touched it.\n\n“He really does want to kill me?!” Moment Queen then used her power to slow down everything around her. Then she sped herself up to attempt an escape.\n\nUnfortunately for her, even that was in vain. She was unable to escape the wretched suction the coin was producing. She was pulled towards it.\n\nKatcha!\n\nMoment Queen felt as if a mountain had been dropped on top of her, and she felt all her bones break. The coin then disappeared. She felt the weight quickly vanish after that, too. She was alive, but she was now little more than a crumpled sack of crushed bones on the ground.\n\n“Wow. Why are you so weak?” Han Sen squatted down near her and shook his head.\n\nMoment Queen was infuriated by what he had done. If she wasn’t trying to be nice, she would have tried to dodge and escape whatever he attempted to do earlier. Now that he had the audacity to insult her, she was furious.\n\n“I really should have practiced with the Blue Dinosaur. This was a waste of time, eh?” Han Sen said as he turned to leave.\n\nMoment Queen then managed to wheeze out a few words, saying, “Hold on. I’m not done yet.”\n\nMoment Queen’s bones had all been broken, but somehow, she was still able to stand upright. As she shakily got back up to her feet, Han Sen was more than surprised.\n\nIt was as if time was going backwards, and the condition of her body was reverting to what it was before the coin ruined her. Her body was swiftly brought back to a good condition."
}