{
    "chapter": 2219,
    "title": "Strange Stone Hall",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2219",
    "text": "The small city was shaped into a simple square. The well was at the center of the city’s plaza, and at the end of every long street radiating out from the city center, the city’s walls were visible at the far ends.\n\nBehind the plaza was a stone palace, and on both sides of the gates stood stone statues. On the left side was a Nine-Life Cat statue. Aside from it being bigger than an actual Nine-Life Cat, it looked exactly the same in all its features. It even gave off an identical feeling. It was creepily similar.\n\nAnd on the right side of the gate was a statue of a warrior that was plated in armor. In addition to the armor, it wielded a bone knife. The warrior’s face and hands, which weren’t plated, were skeletal.\n\n“This statue must be General Ghost Bone, but if this is his city, then he is the owner of this place. Why would his statue be near the gate like a guard, then?” Han Sen then had an idea, and his breath caught in his chest. “The statues for the Nine-Life Cat and General Ghost Bone are before the gates like guards. Does that mean the owner of the palace was actually the Sacred leader?”\n\nHan Sen tried to think of other options, but he couldn’t come up with any other figure in Sacred who might have used those two as guards.\n\nHan Sen didn’t know the exact nature of the Nine-Life Cat’s association with Sacred, but General Ghost Bone was one of the ten generals. Surely only Sacred’s leader could command a man like that to guard the gates.\n\nHan Sen used his Dongxuan Aura to scan their surroundings. He couldn’t detect any other creatures in the vicinity. Perhaps Inspector Edward had already managed to find what he had come for and then left.\n\nHan Sen didn’t want to take the risk of leaving the well just yet, however. The gate ahead was open. With it being ajar, it was hard not to suspect someone might be there. He had to be careful.\n\n“You guys wait here; I will go and take a look.” Han Sen looked at Huangfu Jing, who was beside him in the water, then he touched Little Invisible. After that, Han Sen disappeared. He climbed out of the well in secret.\n\nHan Sen approached the palace, using his Dongxuan Aura to hide his presence completely.\n\nHan Sen walked in front of the palace with great care. When he looked inside the palace, he was stunned.\n\nBecause the city wasn’t that big, the palace was mostly comprised of one hall. From his vantage point, Han Sen could see everything in the hall. And curiously, there were many holes in the floor of the hall. They were like graves.\n\nThere were two people inside, and they wore badges that identified them as belonging to the Ice Blue Knights. They were resting atop a statue. After Han Sen saw what that upside-down statue depicted, he was even more surprised.\n\nThat statue looked exactly like the one he had been in the Human Emperor shelter. Han Sen thought the statue inside that palace would depict the Sacred leader, but oddly, it was actually a statue of the Human Emperor.\n\n“No way. The Human Emperor came from Sacred? These timelines don’t align. The Human Emperor was in the sanctuaries, and he had been there for many years. Sacred was already destroyed before he left the sanctuaries. So, how can his statue be here?” Han Sen walked over to the door and looked inside the hall. Aside from the Human Emperor statue, there was nothing else. There were only some stone tables and stone chairs.\n\nIncluding the Human Emperor statue, though, everything stone had been heavily damaged. At first, Han Sen could only see one half of the broken statue, as the other half was nearby.\n\nClearly, someone was looking for something in this hall. But whatever it was, they hadn’t found it yet. If they had, two of them wouldn’t have been guarding the area as they were.\n\nHan Sen looked at those two Ice Blue Knights, and he noted that they were neither weak nor strong. They might have been Dukes, but they didn’t belong to the Extreme King. One of them looked like Exploding Bear, while the other looked like a Dragon hybrid. He had the horns, but he didn’t have the dragon wings.\n\n“I say that Inspector Edward must be mistaken. If this was the holy place belonging to the Sacred leader, then how come we haven’t found the relic that we’re looking for?” asked the Fire Bear Duke with a sigh.\n\n“If Inspector Edward says it is here, then here it is. Now, shut up and go back to work,” the hybrid Dragon Duke said.\n\n“I want to work, but I would like to know how to work,” the Fire Bear Duke chuckled.\n\nThe hybrid Dragon Duke frowned and said, “Ice Blue Knight King didn’t come back in time, so it was up to Inspector Edward to deal with them. Otherwise, the knight king would have spotted something fishy going on. Just wait a little while longer. Inspector Edward will soon contact us and tell us what to do.”\n\nAt least Han Sen had learned that Inspector Edward hadn’t yet found what he had come there for. Han Sen kept eavesdropping, but he didn’t hear anything else about the holy place or the Sacred relic they were searching for.\n\nHe’d been able to confirm the presence of treasure, though.\n\nHan Sen didn’t enter the hall. He walked around the city first. Many of the places had been rummaged through, and many of the buildings had been toppled. The Inspector’s knights must have been searching there for a long time, but they hadn’t yet found what they had come for.\n\nHan Sen wasn’t good at finding things, so he wouldn’t be able to find where it was hidden, either. If Inspector Edward couldn’t find whatever it was, then Han Sen surely couldn’t.\n\nBack in the plaza, Han Sen looked again at the stone palace. He noticed there were no signs or plaques adorning it. The building was very roughly constructed, and there were no carvings or paintings upon its surface.\n\nBut judging from the statues around it, the palace shouldn’t have been built too long ago. If Han Sen had to make a guess, he’d wager it was only around 10,000 years old.\n\nHan Sen looked at the statues of General Ghost Bone and the Nine-Life Cat again. He confirmed that they were nothing special, and that they were indeed just statues. The materials for their construction had most likely come from the nearby mountains.\n\nHan Sen was annoyed by his lack of progress, so he summoned his Purple-Eye Butterfly beast soul. His right eye turned purple as his pupil split into four sections. He looked at everything around the palace, and he even examined the two statues.\n\n“Nothing… nothing.” His eye analyzed everything, including the statue of the Human Emperor. They were all made of ordinary rocks, a material that was everywhere across Planet Ice Blue.\n\nHan Sen kept looking around until something caught his attention.\n\nNear the Human Emperor statue was a cracked stone tile. It looked like it was supposed to belong to a canopy that had once sat above the head of the Human Emperor statue. The stone tile was a chunk of that canopy.\n\nThe Human Emperor statue had been cut in half, and the canopy had broken as well. It collapsed near the statue, and some of it broke into pieces, whereas other sections remained intact.\n\nWhen Han Sen scanned over the rubble, he saw that most of the stone fragments were ordinary chunks of rock. They were nothing special.\n\nBut Han Sen’s eye couldn’t analyze one of the stones.\n\nHan Sen’s eye was using a deified beast soul. If that deified power couldn’t analyze a piece of rock, then that was an anomaly that Han Sen found very, very interesting."
}