{
    "chapter": 2446,
    "title": "Don’t Move",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2446",
    "text": "“What are you doing? Step back! Don’t be rude to Brother Han,” Fang Qing Yu shouted, his face contorted in displeasure.\n\nBut the other men didn’t seem willing to stop. The Destroyed leader laughed and said, “Mister Fang, we are doing this for your own good. Our ride, Wind Cloud Bird, was consumed by that deified xenogeneic. Without a ship, we cannot travel through the Tianxia System. And now that there is a ship right here, we cannot deny that this is obviously the help of God.”\n\n“If you guys try this, then you are no better than pirates,” Fang Qing Yu said, not sounding happy at all.\n\n“Haha! Mr. Fang, you are right. We are pirates. Who else do you think would dare to escort you through a zone like the Tianxia System?” The people swapped glances with each other and laughed.\n\nOnce they were in the Tianxia System, they had been planning to rob Fang Qing Yu and kidnap Gu Qincheng and Elysian Moon.\n\nThey didn’t have much luck, though. They entered the Tianxia System, and mere minutes before they planned to execute their sordid little scheme, they encountered a deified xenogeneic.\n\n“You guys…” Fang Qing Yu’s face changed. He was too furious to say anything.\n\nWith that revelation, the situation made a little more sense to Han Sen. It would have been unusual for normal mercenaries to agree to escort Fang Qing Yu into such a dangerous place. Entering the Tianxia System was way too risky. If someone was willing to go there, they were most likely interstellar pirates, or they were on the lam like Han Sen.\n\n“You’re referring to us as ‘you guys’? Haven’t you heard of the Pirate? We are true Pirates, so if you know who I am, then show some respect. I only want money. If I don’t get it…” The Destroyed King laughed threateningly as his sentence trailed off.\n\nHearing the man’s claim, Han Sen didn’t know what to say. The guy was bluffing. The Pirates were a powerful faction, and there were many of them.\n\nThey robbed the amazingly rich and powerful, often entering high-race xenogeneic spaces to attack their prey. They wouldn’t behave like these guys, stealing from the weak in such a sneaky way.\n\nMany of the pirates started to approach Han Sen. Gu Qingcheng frowned and started to draw her sword, but Han Sen stopped her.\n\nHan Sen looked at the pirates and smiled. “It is good that you aren’t leaving. We need people here. We need men that are willing to tidy, clean, and make food. If you want to stay here, you may remain to do such things.”\n\nWhen the pirates heard that, they laughed until their eyes watered. The Demon man looked extra cocky, and he said, “The Rebate and Knife Queen might be famous, but we don’t care. Plus, you are only Knife Queen’s student. How dare you propose that we become your deckhands!”\n\n“Stop talking to him! As it is his wish, we’ll flip the offer around and make him the one who does the washing, cleaning, and cooking for us!” one of the pirates said.\n\nThey were fearless. They had seen the battleship from one end to the other. The ship was host to Han Sen, a little girl, and a very frightened woman.\n\nAside from them, there was only a little red bird.\n\n“Let me do it,” the Demon man said with a smile. He unleashed his area. He went over to Han Sen while saying, “Do you want to get out, or do you want me to help you? If you want me to help, you will…”\n\nBefore he could finish, Han Sen punched the man in the face.\n\n“D*mn you!” The Demon man suddenly looked terrifying. He lifted his fist and threw a punch at Han Sen that was imbued with Sky Demon powers. Very few Demons could make use of those powers, and the few that could were mostly of a pure Demon blood lineage.\n\nThe fact that the Demon could make use of Sky Demon powers surprised Han Sen.\n\nBut the Sky Demon powers, even at full charge, was useless against Han Sen.\n\nThat Demon man was stunned when Han Sen’s fist collided with his own. He had put all of his power into that strike, and Han Sen had blocked it.\n\nThe Demon man had shock written all over his face. His entire body stopped moving, and then a block of ice encased him.\n\nThe other pirates were shocked, too. The Demon man wasn’t a top King, but his Sky Demon power was nothing to trifle with. Han Sen had blocked that Sky Demon power and froze him in a single punch. That surprised them all.\n\nMany of the pirates pulled out their knives. Han Sen’s hands closed into fists, and then he rushed into them. He threw punches that wrecked each of their King areas and their powers. He froze the pirates one by one, leaving them standing on the deck, motionless and confused.\n\nThe pirates were dumbfounded. They were just a group of outlaws who weren’t really connected to the Pirate. And they had never witnessed a King with such impressive strength.\n\n“Don’t! Stay back! If you come any closer, I’ll kill her.” The Destroyed King had the quickest reaction. Upon seeing all his men frozen, he stumbled back toward Bao’er and put a knife to her neck.\n\nHan Sen had already frozen all the other pirates. When he turned to see the frightened Destroyed King holding a knife to Bao’er’s throat, he laughed and didn’t approach.\n\nThe Destroyed King looked at his men in disbelief. The Demon and two others had been Kings, but Han Sen had dealt with them as easily as he had the Dukes. They had all been frozen by Han Sen’s punches. The entire group only lasted a few seconds.\n\nHan Sen grinned at the Destroyed King. He didn’t come any closer.\n\n“Don’t take another step. If you do, what happens then is on you.” The Destroyed King’s heart began to pound as Han Sen gazed at him. The Destroyed pulled Bao’er closer to himself, wanting to retreat with her as a hostage. For now, all he wanted was to leave. The further away he could get, the better.\n\n“Uncle,” said a very young voice from the Destroyed King’s arms. When he lowered his head, he found that it was the little girl he was using as a hostage.\n\nThe little girl had a knife to her neck, but she didn’t look scared like most little girls would, however. She smiled at him, looking so happy. She even started to laugh.\n\n“Stop laughing!” the Destroyed King shouted angrily at the little girl, feeling insulted.\n\nBefore he could come up with another threat, though, the Destroyed King’s eyes widened in surprise and terror.\n\nThe little red bird upon the girl’s shoulder jumped into the air, and red flames began to spread from its flapping wings. It was like a volcano erupting. Under the incredible heat, the Destroyed’s King class knife suddenly melted into molten juice. But the fire in the bird’s eyes didn’t lessen; in fact, the bird seemed to grow even more enraged."
}