{
    "chapter": 1080,
    "title": "Crystallized Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1080",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was too injured to fly, so he summoned Disloyal Knight and commanded that he pick Han Sen up and fly him to safety instead.\n\nHan Sen had not been physically damaged, but the light had crystallized his organs, veins, muscles, and bones.\n\nWithout the demonic language, the light could not assimilate with Han Sen’s body or leave. It was there to stew and go hard, leaving him in a frightening condition.\n\nHan Sen had not been paralyzed, just made extremely stiff. But what was worse, with his body clogged—something which prohibited the traversal of his energies —he could no longer open any gene locks.\n\nDisloyal Knight delivered Han Sen back to the statue. There, Han Sen frowned and said, “Now that I’m injured, how will you get us out of here?”\n\nDragon King responded, “I couldn’t, previously. But now that I have absorbed the Ancient Devil light, that has changed.”\n\n“I thought you were one of Ancient Devil’s generals. If so, how did he not recognize you in the palace?” Han Sen was perplexed. Amidst all that he had endured, Dragon King had not disobeyed or betrayed him.\n\nDragon King said, “If that was truly Ancient Devil Emperor, I can assure you, you would not be breathing. I have already told you once: he has gone to the Fourth God’s Sanctuary. He’s been gone a long time.”\n\n“Then who was that, inside the light?” Han Sen asked.\n\nDragon King explained, “It must be Big Mara, left behind by Ancient Devil Emperor.”\n\n“Big Mara?” Han Sen asked.\n\nDragon King said, “Using his own genes, he created a doppelganger. A tulpa of himself, born from a geno seed. The doppelganger is not as smart, but the power is fairly comparable. I am unsure why it is still here, though, having taken the emperor’s place all this time. To think it is still conducting these geno tests…”\n\nDragon King then looked at Han Sen and said, “It may only be a doppelganger, but the light was as real as it gets. Why did you not accept it and become stronger? Instead, you let yourself end up in quite the condition.”\n\n“That’s personal, and it doesn’t matter anymore. You said you could get us out of here. Can we go yet?” Han Sen didn’t want to talk about it.\n\nNo matter how beneficial the light might have been, it was not something Han Sen wanted. To him, it might as well have been poison.\n\nDragon King spat out some light, similar to what Big Mara had done.\n\nHe took that light, which was thick and creamy, and wiped it on his eyeballs. Then, with bright gleaming eyes, Dragon King said, “By using this Ancient Devil light, I can guide us through the black mist that traps us here. If we avoid the dimensional tears, we can make our way out of Devil’s Realm. This squirt of light is the only one I have, so we need to get out now. If this runs out, we won’t have another chance.”\n\nDisloyal Knight continued carrying Han Sen, and they both followed behind Dragon King. Unfortunately, Dragon King was very slow, so to increase their pace, he hopped onto Disloyal Knight for a ride, too.\n\nThe creatures had yet to leave the shelter that was high above, so their journey was not plagued or hindered by any monstrous intrusions.\n\nDisloyal Knight continued at a hasty pace, allowing itself to be guided by Dragon King’s directions. Just as his light grew dim, though, they saw a different light up ahead. It was the light of the exit, and so they hurried towards it, relieved to be free of that place.\n\nThe sun was bright, and ahead of them was a large, sprawling forest. Looking behind them, all they saw was a black mist.\n\n“That was lucky.” Dragon King then sighed. If he had a body, he’d have been sweating all over.\n\nHan Sen asked, “If you were one of those generals, you should have been familiar with those creatures. Why were you so afraid, then?”\n\nDragon King said, “Afraid? Me? No. Your imagination surely goes places.”\n\nHan Sen did not push the matter, as Dragon King clearly did not want to tell him.\n\nThey picked a random direction to travel in the hopes of reaching a shelter. If they discovered a shelter, they could find out which region they were in.\n\nDragon King was one of the eight generals, and now, he was swiftly guiding Han Sen to a shelter.\n\nWhen they came across one, it was a knight-shelter that looked abandoned.\n\n“I hope the teleporter is still functional,” Han Sen said.\n\n“If it isn’t, that’s okay. We can always go and find another shelter. Following the war, all the shelters in a fifty-thousand-mile radius of us should be abandoned,” Dragon King said.\n\n“What happened in this war?” Han Sen asked.\n\n“Um, let’s go and see if the teleporter still works, shall we?” Dragon King obviously didn’t want to talk about it.\n\nHan Sen dismounted Disloyal Knight and staggered inside the shelter.\n\nHe was able to walk, and his powers were still there inside him, he just couldn’t make use of them.\n\nFortunately, the teleporter was in fine condition. Han Sen left Disloyal Knight behind and returned to the Alliance.\n\nHan Sen was unable to use the Blood-Pulse Sutra or the Dongxuan Sutra, so he had to return to the Alliance and heal.\n\nWhen he checked himself into the hospital, the results of his condition were dire.\n\nSome of his organs, veins, muscles, and bones had been wholly crystallized, and even some of his blood had suffered the same result.\n\nThe professional surgeons that examined him said there was nothing they could do for him, and that removal of the crystals was impossible.\n\nIf the crystallization had only affected a few of his organs, they could have easily been swapped out, but ninety percent of his body was crystallized. Even his brain had crystallized. If they replaced all the organs, they might as well have built a brand-new person."
}