{
    "chapter": 2931,
    "title": "Death Angel",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2931",
    "text": "Moon Shadow God could saw that her shadow blades weren’t working, so she revealed herself from out of the darkness. She was floating behind the shadow blades. She looked at Han Sen madly and said, “No matter how strong you are, you must die because of what you did to my son.”\n\nHan Sen coldly said, “Moon Shadow God, I pity you. I do not want to kill you. You should just go.”\n\n“Go? Of course, I will not go. If I cannot kill you, you are not going to escape.” Moon Shadow God said something that did not make any sense. Her shadow blades quickly blended into the dark and disappeared.\n\nHan Sen saw Moon Shadow God leave. He enabled the big goldfish to carry on leading the way. They did not travel for long when they saw a crack in the ground.\n\nIt was unknown how wide the crack was, but the stone lantern’s light could not reveal the other side of it. There was only darkness.\n\nHan Sen looked deeper. It was just darkness. He did not know how deep the crack was.\n\nHan Sen did not want to fly in that place. The danger meter was too high, so he looked to his left. He then looked to his right and decided to walk along the left side of the crack. He wanted to see if he could go around it.\n\nHe walked 10 miles, and the crack next to him had still not ended. It looked like a bottomless abyss. He did not know how far it went.\n\n“Weird. Why do I not see Ancient Abyss Grandmaster and the others?” Han Sen frowned. Ancient Abyss Grandmaster had not arrived there too long before them. Yet, all this way, he had not seen Ancient Abyss Grandmaster or his friends. That was not right.\n\nWhile he was thinking. Han Sen’s eyes froze. He saw a creature at the edge of the big crack.\n\nThe creature was dressed in black armor. It was like European, medieval heavy armor. The creature was sitting at the edge of the crack. It lowered its head and peered into the crack.\n\n“My name is Han Sen,” Han Sen said while looking at the armored creature. “I am just walking past here. I apologize if I am disturbing you. I hope you will not take offense.”\n\nThe armored creature gave no response. It just continued to sit where it was with its head lowered.\n\n“Is it dead?” Han Sen used Dongxuan Aura to check the armored creature’s presence. Who would have thought that when Dongxuan Aura touched down on the creature’s armor, the black armor would suddenly shine? It displayed many light symbols across it. When the light symbols flickered, the area around was covered with the light symbol and a bai sema. Han Sen and the others were locked into that bai sema.\n\nThe armor’s light symbol grew brighter. There was some air coming out of the armored creature. It looked like it was there, but it was not there. That air was so strong that it made Han Sen feel scared.\n\nHan Sen clutched the stone lantern and fell back. He threw a punch at the bai sema, but the power he unleashed was repelled by it. It almost resulted in Han Sen being thrown off the back of the big goldfish.\n\n“The death angel is activated. You are dead.” Moon Shadow God was outside the bai sema. She looked at Han Sen with rage in her eyes.\n\n“Are you saying the death angel was your work?” Han Sen looked at Moon Shadow God.\n\n“I would not dare touch the death angel,” Moon Shadow God coldly said. “It was the work of Sacred Leader. It is a scary machine that guards the holy garden. I just played a trick to have you stumble into it.”\n\n“A machine? It has such a big lifeforce. How can it be a machine? It is a living thing.” Han Sen looked at the armored creature in shock. That mysterious armored creature was now called a death angel.\n\nThe lifeforce of the being was very strong. It did not look like a machine at all.\n\n“You do not know anything. Sacred Leader knows everything. You will never understand that. It is not just a living machine. If Sacred Leader wants to, he can turn a stone into a living thing.” Moon Shadow God sounded angry. She went on to say, “I just wish I could avenge the death of my son through my own hands.”\n\n“Why would you risk so much for that kind of son?” Han Sen sighed.\n\n“No matter how bad he was, he was my son. You killed him, so you have to pay.” Moon Shadow God’s expression looked a little conflicted as she tried to force a look of true decision.\n\nHan Sen wished to say something more, but he saw that the death angel’s back was gleaming with light. Suddenly, giant, big light wings appeared.\n\nWhen the light wings spread, the death angel’s body started to float. It was now facing Han Sen. The eye of the helmet had two light beams. They were like spotlights shining on Han Sen.\n\nThe light symbols on the armor made it look half transparent. With the light wings, it made the death angel look like an angel descending to Earth. That scary presence made people feel a chill. It was like if the death angel moved its light wings, space and darkness would instantly rip.\n\n“Whoever comes to the holy garden… Die.” The death angel sounded emotionless. It was like a cold and emotionless machine. While it was talking, the death angel rose its right arm above its head. Its arm was like a blade rising. The flames were like they were blowing into the sky. It was like a burning flame slashing a sky light sword, and it was coming down on Han Sen.\n\n“This place does not look like the holy garden.” Han Sen looked around. Aside from the big crack, all he saw were broken rocks. He did not see any buildings, and there was certainly no garden.\n\nEven though the garden was broken, he should have still been able to see the ruins of it. There was nothing of the sort anywhere to be seen.\n\nUpon hearing what Han Sen said, the death angel appeared to be shocked. It lowered its head and thought.\n\n“This cannot be a machine. It must be a creature.” Han Sen did not think the death angel was a machine. No machine was able to think the way it did.\n\nMoon Shadow God coldly laughed as she said, “You are happy too soon. That big crack was supposed to be in the holy garden. Where you are standing is the entrance of the holy garden.”\n\nOf course, the death angel only thought for a moment before saying, “This place is the holy garden. You entered the holy garden, so you should die.”\n\nAfter that, the death angel’s armor carried a strong flame. It was headed toward Han Sen.\n\n“Dad, let me do this.” Han Sen wanted to move, but Bao’er suddenly spoke. She jumped off of his back. She was in the air. Her sunglasses flashed. Bao’er’s body started to change. She suddenly looked just like the death angel. The armor on her was very bright, and the light wings were big and white.\n\nPang!\n\nBao’er raised her arm too. She was learning death angel’s position of attack. Two powers collided in mid-air, which created a big explosion. It blew open the death angel’s bai sema. They actually tied, and neither of them was hurt.\n\n“How is that possible? Who is this girl? How was she able to turn into the death angel?” Moon Shadow God looked at Bao’er. She was in shock.\n\nHan Sen knew it was the power of the sunglasses, but the sunglasses could only morph a person into the shape of a creature. Once the creature was scanned, one could adopt the appearance of the creature. Then, one would also have the power of that creature.\n\nUnfortunately, the sunglass’s scan speed was not fast. It required time, and the scanning changes required a lot of power and energy. It was not just limited by time. One was not able to change into anything one wanted to. There were a lot of limitations."
}