{
    "chapter": 2518,
    "title": "The Plan Fails",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2518",
    "text": "Bai Wan Jie looked on from far away. Behind him were a hundred royal knights. They were all lined up in a formation, and the weakest knight in their ranks was King class.\n\nVery few races in the universe could gather up an army of knights like that. And Bai Wan Jie had only brought a small segment of their knights.\n\n“Dragon One and Dia Robber really have put a great deal of effort into this, but they put all their hope in Dollar. Letting him deliver the single most important hit, that was just too careless of them. If that strike was being delivered by Yu Shanxin, it would be a guaranteed hit. It is a shame they got Dollar instead. He isn’t even half-deified. This won’t turn out well for them,” Bai Wan Jie said grimly.\n\nThe yellow-clothed woman’s eyes moved. She quietly said, “This is the time Dragon One and the others reach the max.”\n\nAs the woman spoke, Dragon One was also shouting, “Dollar! Get ready to strike.”\n\nHan Sen heard the call and immediately pulled out the Dragon Tattoo Tooth Dagger. He sprinted into the battlefield and deployed his Dongxuan Area. The awareness of the Dongxuan Area rolled through his mind.\n\nBlergh!\n\nThe user of Ghost Shadow activated his area again. He helped Dragon One and the others avoid the sword net, but he was bleeding badly. Blood gushed from every orifice in his body, and after this last use of his power, he passed out.\n\nThe half-deified user of Mirror Doppelganger shone a light on him, bringing the man’s true self close and leaving a shadow in his place. His mouth was bleeding, and his face was all grey.\n\n“Back!” Dragon One shouted, Dragon blood spilling over his own lips as he did. That Dragon blood became a Dragon shadow that flew at the Gold Armor General. After it landed upon Gold Armor General’s back, it melted into the spell. The spell became red.\n\nWhen the Dragon blood Evilbreaker spell was activated, the Gold Armor General became incredibly angry. The yellow saw-like greatsword was lifted, and the fiend drew a circle above its head. The circle of swordlight blasted out like a shockwave.\n\nDragon One and the others were teleported away by the Galaxy teleporter, dodging that scary, rain-like swordlight. At the same time, the Gold Armor General’s body froze in place. He remained in the same position, with the golden greatsword held up over his head.\n\n“This is it!” Dragon One shouted with insane glee.\n\nThe Dragon blood Evilbreaker powers had activated before there was a single casualty. Right now, everything was copacetic, and everything had gone according to plan. Now, everything rested on Dollar’s shoulders. If Dollar could blind the Gold Armor General, then their killing of the beast was guaranteed.\n\nBut no one could be certain Dollar was up to the task, or that he’d be able to perform his assigned duty.\n\nAfter all, Han Sen didn’t have much time. He had to make his way past the rain of swordlight and get close enough to the Gold Armor General to blind both of its eyes. Doing all this would be very difficult, probably too difficult. Dragon One and Dia Robber weren’t completely sure that he could do it.\n\nOf course, if they hadn’t been confident, they wouldn’t have hired him.\n\nHan Sen’s body flashed toward Gold Armor General with blinding speed. When Han Sen came before the rain of swordlight, the space around his body warped slightly. He used a teleportation power. Although his abilities of teleportation took some time to prepare, Han Sen had put that into motion earlier. When he reached the rain of swordlight, his body was already in teleportation mode. He teleported behind the rain of swordlight, and he kept flying toward the Gold Armor General.\n\nDragon One was so excited to see this. His Dragon blood Evilbreaker spell was something he was very confident in. He had gathered up enough power to stop their foe for two whole seconds.\n\nHan Sen moved very smoothly, and within less than a second, he was hovering directly before the Gold Armor General.\n\nBecause it had taken him less than a second to reach the Gold Armor General, he had at least one second to blind the Gold Armor General’s eyes.\n\nIf this was a normal xenogeneic with King class power, Dollar could stab it multiple times. Although the Gold Armor General’s eyes were its weak spot, they wouldn’t be easy to pierce through. Dragon One was hoping Dollar would be able to blind both of its eyes in that sole second he had. Things would go awry if he was unable to do that.\n\nBai Wan Jie and the yellow-clothed woman were watching the show, their eyes focused on Han Sen. They understood that a single blow would determine the entire outcome of the battle. Dragon One’s success in hunting the Gold Armor General now depended on Dollar’s strike.\n\nSuddenly, the yellow-clothed woman shifted her eyes. She looked disappointed.\n\nAs Han Sen drew within striking range of the Gold Armor General, the monster’s body hissed like a steam machine. The pipes across its form released gold flames.\n\nThe stationary body suddenly moved. Its gold eyes turned to stare at Han Sen in front of it. Its gold greatsword began to move through the air, striking downwards.\n\nThe cogwheels spun, and the blade was groaning. A gold swordlight was emitted, unleashed like a chainsaw. The entire asteroid belt shook, and the darkness of space moaned. The realm was breaking under the force of that gold swordlight.\n\n“It’s over… the calculations were incorrect. We underestimated the Gold Armor General. That Dragon blood Evilbreaker power was only able to stop the fiend for a second.” Dragon One suddenly felt overwhelmingly cold. His stomach turned.\n\nDia Robber and the others were in shock, too. The pipes on Gold Armor General’s back were spitting out gold fire. They broke the Dragon blood Evilbreaker power, while the blood cape on his back rippled and waved. The cape was dyed a golden color.\n\n“It’s all over.” Everyone looked hopeless.\n\nThey had known from the beginning that if the Gold Armor General recovered its movements while Dollar was next to it, Dollar was a dead man. He would be unable to finish the plan of destroying the Gold Armor General’s eyes. It was impossible to tell if he would even get out of there alive.\n\nHe was too close to the Gold Armor General, and his entire body was barely the size of the Gold Armor General’s arm. Even if Galaxy teleportation was used, he couldn’t be brought back in time.\n\n“That is what happens when someone misjudges his own power.” Bai Wan Jie sighed in his heart.\n\nDollar was quite the character. If the crown prince had been able to hire him, he wouldn’t mind feeding another mouth. But Dollar had come and stolen his business instead. The Extreme King wouldn’t be sorry when he died. Nightmare, who was next to Bai Wan Jie, was wondering if now was the time to strike. Dragon One’s hunting plan had failed.\n\nThe yellow-clothed woman felt dismal and disappointed. She was interested in Dollar, and she wanted to see what he was really like. But because of Dragon One’s miscalculation, the plan had failed. The Gold Armor General was stronger than assumed, and Dragon One had placed Dollar in danger, directly in front of the Gold Armor General. There was nowhere to run or hide."
}