{
    "chapter": 151,
    "title": "Fang Mingquan’s Discovery",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_151",
    "text": "\"I cannot agree on this term. Can we use a different one?\" Han Sen said frankly.\n\nAlthough he was sure that he would not lose, but he would not bet with what belonged to others. It was a matter of principle.\n\n\"I know you will act this way.\" Ji Yanran looked like she had guessed this would happen. She said with disdain, \"Well, it’s fine if you do not teach me, but you will have to show me how it is done until I don’t want to watch anymore. Deal?\"\n\nHan Sen pondered and thought that should be fine.\n\nJi Yanran provoked him, \"Are you a man or not? You are so fussy.\"\n\n\"Right away.\" Han Sen signed both copies of the contract and scanned them with his comlink to approve with his personal code, which was key to the signature. None could imitate a signature since it was linked to one’s comlink number and personal identity.\n\nJi Yanran was delighted and thought Han Sen was provoked to sign. She quickly did the same.\n\n\"This one is yours. I will check on your matches later. Don’t be a dead beat.\" Ji Yanran proudly waved her copy of the contract.\n\n\"That's exactly what I wanted to say,\" Han Sen said with a smile.\n\nThe next morning, Fang Mingquan and his team started to prepare for the live broadcast. The main game to cover was Ouyang Xiaosan’s martial art game, followed by warframe and Hand of God games.\n\nFang Mingquan took some time to browse the Blackhawk online community, for he believed that it was the best way to know the school better.\n\nSoon Fang was attracted to one of the topics--many people were discussing who Ji Yanran’s boyfriend was.\n\nAs someone working in media, Fang Mingquan had heard of the name Ji Yanran, and knew that she was the president of Hand of God Society and campus belle. However, she was not a star and who her boyfriend was did not catch his attention originally as it would not be interesting to the viewers.\n\nBut Fang Mingquan still read that through, and was shocked and enraptured by what he had read.\n\nJi Yanran’s boyfriend had beaten Li Yufeng by 20 points in Hand of God. Such unexpected news thrilled Fang.\n\nHe was just worried that the live might be lackluster. If they simply showed Ouyang Xiaosan’s game, their ratings could not be great.\n\nAnd Fang had smelled something that had the potential to go viral about this topic of Ji Yanran's boyfriend.\n\n\"Liu, come and see this,\" called Fang Mingquan.\n\nLiu read the title with some doubts, wondering why Fang would show him campus gossip, which seemed to be of little use to their show.\n\nBut after Liu read the entire discussion, he opened his mouth wide and said after a long while, \"That is impossible. Someone who could beat Li Yifeng by 20 points would be in the top 10 of the whole Alliance. How is it possible that we never knew of such a person?\"\n\n\"There were many witnesses, so it could not be fake. You can browse and see what others say,\" said Fang Mingquan.\n\nXiao Liu read some more and became more and more excited, \"Fang, we should focus our live on the game of Hand of God. If we could get this master player on camera, our show will be a hit.\"\n\n\"Liu, you remember what the name of that student we met last night was?\" Fang Mingquan suddenly asked.\n\n\"No. Why did you mention him?\" Liu was puzzled.\n\n\"Don’t you remember what he had said? He said he could easily beat Li Yufeng by 20 points,\" Fang Ming recalled.\n\n\"You think that student is Ji Yanran’s boyfriend? That is unlikely. He is a freshman in the Archery Department, and a member of Heavy Warframe Society. All he signed up for was warframe items. How could he be Ji Yanran’s boyfriend? If he is that good at Hand of God, why didn’t he sign up for that?\" Liu could not believe that Han Sen was Ji Yanran's boyfriend.\n\n\"That’s what makes things interesting.\" Fang Mingquan smiled. \"He did enroll in most of the warframe items. Go move our equipment now. We will cover all the warframe games.\"\n\n\"Fang, since we cannot be sure that he is Ji Yanran’s boyfriend, isn’t this too risky? And even if he is Ji Yanran’s boyfriend and is great at Hand of God, it doesn’t mean he would do well in warframe as well.\" Liu was worried.\n\n\"There are enough media covering Ouyang’s game, so it doesn’t matter if we do it as well. Just do as I just told you,\" Fang Mingquan said firmly.\n\nAlthough he cannot be sure that Han Sen was Ji Yanran's boyfriend, Fang felt Han Sen was an interesting person. If he is not the strongest player, he will definitely be the most eye-catching one.\n\nFang Mingquan preferred taking the risk to following the crowd. It could turn out to be great. If not, there would not be too much loss.\n\nAlthough Liu did not agree with Fang Mingquan's idea, and did not believe that Han Sen could be Ji Yanran's boyfriend, he had to follow Fang Mingquan’s instructions.\n\nTheir media peers saw Huaxing Station removing the installed equipment and felt odd. When they asked if Huaxing was going after something big and found out Huaxing was going to cover the warframe items, they simply laughed.\n\nBlackhawk was just okay in warframe items. They would sooner broadcast the Hand of God games, as there were at least the beauty Ji Yanran and the master Li Yufeng.\n\nHuaxing Station had finally installed all their equipment at the site of the warframe games. They had to work overtime for that. Fang Mingquan continued to browse the campus online community.\n\nAlthough there were a lot of equipment in the warframe game site, they were mostly just backups of other media in case they wanted to say something about the warframe items during the breaks of Ouyang’s game.\n\nHuaxing Station was the only one that had their full set of equipment at the warframe game site, since martial arts were Blackhawk’s strong suit."
}