{
    "chapter": 2576,
    "title": "Escaping the Fortress",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2576",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen still wanted to conduct trades and collect more geno arts, but after one fruit meal, Li Keer was no longer interested.\n\nHan Sen still didn’t have time to learn Dragon Blood Evilbreaker, and he repeatedly ransacked his brain for ideas on how to escape the fortress. Although he was trying to plan a jailbreak, he had become quite close to the small Crocodile God. Now, the little Crocodile God was dependent on Han Sen for survival. It had become totally addicted to Han Sen’s wine.\n\nLi Keer stared at Han Sen. She looked at Han Sen and the little Crocodile God, who were currently lying on sunbathing chairs. While they soaked in the rays, Li Keer had to pour them their wine.\n\nThey had all been captured, and yet, she was being forced to serve Han Sen. That made her very angry.\n\n“Goon!” Li Keer stared angrily at Han Sen.\n\n“Hey, little Crocodile God, do you want to go and see the outside world? The outside world is better than this place. There are many pretty girls and a whole lot more wine. You might be able to find a pretty lady Crocodile God with nice, smooth skin. With your strength, small Crocodile God, the ladies would be crying to get you. You will become so famous in the outside world,” Han Sen coaxed, trying to convince the little Crocodile God to leave the fortress.\n\nHan Sen’s Dongxuan Sutra wasn’t as good at reading other creatures as the Very High Sense, but after he had been there for a while, he was still able to understand the behavior of the little Crocodile God. In that way, they could actually hold conversations.\n\nUnder Han Sen’s influence, the little Crocodile God was slowly becoming curious about the outside world. If the little creature had been alone, Han Sen would already have taken him off-world.\n\nBut the creature was too small, and the big Crocodile God wouldn’t let it leave. So, there was nothing Han Sen could do.\n\nHowever, Han Sen had noticed a window of opportunity. The big Crocodile God had to exit the fortress every few days, perhaps to find food. During that time, the little Crocodile God was tasked with watching over the prisoners. If they made a single move to escape or cause trouble, the little Crocodile God could call on the big Crocodile God to hurry back.\n\nExquisite and Li Keer had tried to escape many times, but they were always brought back.\n\nHan Sen didn’t try to run. He just encouraged the small Crocodile God to leave. If he was successful in convincing it, escape would be trivial.\n\nThe small Crocodile God, constantly hearing Han Sen describe the outside world, became enthralled by the idea. But it didn’t know how far away the world that Han Sen described truly was. He was talking about outside of the core area. He was talking about the geno universe. It was somewhere core area creatures couldn’t get to.\n\nOf course, the small Crocodile God didn’t understand the nature of the core area that he’d been born into. But now, he couldn’t suppress his giddiness to leave. He was ready to get out of there.\n\nIt had tried to run off before, but it hadn’t gotten too far. This time, Han Sen was able to convince it to go all the way. And it excitedly rumbled at Han Sen to come along with it in a daring escape.\n\nExquisite and Li Keer were frozen, almost unable to believe Han Sen had been able to manipulate the creature like that.\n\n“Lying to a child. How cheap!” Li Keer didn’t think it was fair.\n\n“Small Crocodile God, bring those two along. Otherwise, there will be no one to serve you. Then, no one will be able to tell how powerful you are.” Han Sen pointed at Li Keer and Exquisite.\n\nThat hadn’t taken much effort. He thought he was doing them a favor.\n\nThe small Crocodile God made some grunting noises, then flew into the burning sea.\n\nLi Keer and Exquisite were happy. Li Keer had just been decrying Han Sen for tricking a child, but now she was very grateful.\n\nThe small Crocodile God’s power wasn’t as great as the power of the big Crocodile God. Han Sen and the other two had to stick close to the small Crocodile God. They needed the protection of its gravity substance chains to avoid being melted by the scary burning sea.\n\nIt wasn’t too long before the small Crocodile, Han Sen, and the others were out of the cave. Han Sen and the small Crocodile God scoped out the vicinity with care. They didn’t see the big Crocodile God nearby, and that made them feel relieved.\n\n“Go! The pearly gates of this beautiful new world are opening for you. You will get wine, lady crocodiles, and the love and adoration of many different races.” Han Sen saw the small Crocodile God looking a little nervous. It was glancing back into the cave and seemed hesitant, so he tried to influence it a bit more.\n\nThe small Crocodile God rumbled happily. It jumped onto Han Sen’s hand and swung its claws around. It looked very excited.\n\n“He is just a child, and yet, he is so easy to trick.” Pleased with himself, Han Sen flew up and escaped the planet.\n\nExquisite and Li Keer were quick to follow. With haste, the three of them and the small Crocodile God left that planet of frightening gravity.\n\nThey hadn’t been away from the planet for very long when the bronze furnace joined them, whistling quietly and belching smoke. It had waited there patiently for Han Sen, which surprised him a lot. He thought it might have run off.\n\nThe bronze furnace was making a lot of noise as it came toward them. The small Crocodile God thought it was hostile at first. In response, the little creature swung one of its gravity substance chains and tied up the bronze furnace. The bronze furnace was stunned. It started to cry, believing it was going to be crushed by an immense force of gravity.\n\n“Stop, he’s one of us! He’s one of our people,” Han Sen hastily explained to the small Crocodile God.\n\nThe small Crocodile God let go of the bronze furnace. Due to the fact that the small Crocodile God was still lying on Han Sen’s head, the bronze furnace couldn’t leave and neither could it stay. It didn’t know what it was supposed to do.\n\n“Let’s go. We should leave this area now.” Han Sen didn’t know where the big Crocodile God had wandered off to. Since he didn’t know how far away it was, they needed to keep going as far as they could to avoid having any nasty encounters with the beast.\n\nTheir flight was surprisingly smooth, and the big Crocodile God didn’t show up. They brought the small Crocodile God with them as they teleported a few systems away. Exquisite and Li Keer used Galaxy Teleportation. They lost track of how many systems they traveled through, but they were fortunate enough to not encounter the big Crocodile God for the length of their journey.\n\n“We are free!” Li Keer couldn’t believe their escape had come about so easily.\n\nThe small Crocodile God had a lot of potential, but for the time being, it was only a primitive deified. It couldn’t trap them as easily as the big Crocodile God could. Li Keer and Exquisite could teleport away whenever they wanted to.\n\nThe small Crocodile God looked at Han Sen and made an inquisitive noise. Its eyes scanned the area around, indicating what it meant to say was, “Where is the wine? Where are the people?”\n\n“Don’t be hasty. We have just made it out. We still have a long way to go.” Han Sen needed to calm the small Crocodile God. And as he was thinking of a way to get rid of it, his heart jumped.\n\nExquisite and Li Keer also froze. They could feel something awful coming toward them. The blood drained from their faces.\n\n“Is the big Crocodile God coming?” As Han Sen suppressed the tension in his stomach, he figured out which direction the frightening power was coming from. A scary xenogeneic was headed their way.\n\n“What kind of xenogeneic is that?” Han Sen stared at the creature. It wasn’t the Crocodile God. It was a big snake that looked something like a dragon.\n\nThe snake was one hundred meters long, and its head was like that of a cobra. But on its wing-like neck, there were two rows of eyes. Each row had three bright green eyes.\n\n“The deified Six-Core Snake God?” Exquisite and Li Keer screamed. Judging from the way they were freaking out, that deified xenogeneic had to be something special."
}