{
    "chapter": 599,
    "title": "Strange Sensing Ability",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_599",
    "text": "\"Everything is born a-laya, it's already here, it is full and clear; the same as nirvana.\"\n\nHan Sen didn't receive any new icy powers after unlocking his first gene lock, but the strength of his body was dramatically increased. That wasn't the most important boon he had received, however.\n\nMost importantly, Han Sen's seventh sense had received massive amplifications. It had reached the max proficiency a human could achieve, which gave Han Sen a curious feeling.\n\nHe couldn't quite explain it, but it made Han Sen view the world in a different way. He could see things as he had never seen them before.\n\nHan Sen could not tell what future changes this talent would bring, but maybe it was because of his fitness that he didn't actually, fully unlock his gene lock. He felt as if he had unlocked it, as much as he hadn't. He couldn't quite put a finger on anything right now.\n\nHan Sen walked out of the training room with his gene lock opened. His heart felt strange, and as he walked, he felt as if the walls around him were disintegrating. He was able to see everything, beyond what any human eye could behold. But he also felt as though his body was being encased in ice.\n\nSound, temperature, light; these things and more became simple rules of additional deduction in his mind. So great was his vision now, that even if he closed his eyes, he could still see what was in front of him.\n\n\"This is too amazing. This feeling is too amazing!\" Han Sen wanted to be happy, but strangely, he was unable to feel any particular emotion. It felt as if everything was pre-purposed and almost expected, therefore nullifying the need to be explicitly surprised or happy.\n\nAs Han Sen continued walking, he suddenly noticed a woman removing her clothes; it was Annie. She had long legs, pale white skin, and massive boobs – he could see it all.\n\nBut when Han Sen paid closer attention, he noticed there was a wall separating them, and that Annie was actually in her changing room. It was a thick wall like any other, but his vision provided a clearer image than any thermal vision apparatus could.\n\nIn his current situation, however, Han Sen did not feel any sensation of lust. Viewing Annie's amazing body, he might as well have been looking at a mannequin. He noticed her being as naked as she was, but then turned and continued on his way.\n\nHe walked around the base and noticed a pain encroaching in his head. He knew that his fitness level would have difficulty supporting the unlocked gene lock. Therefore, to prevent further pain, he exited gene lock mode.\n\nHis body reverted to its prior feelings of being \"bound,\" and he lost the amazing feelings he had previously been drenched in. His fitness returned to normal and his seventh sense reduced.\n\n\"Although it did not bear the fruit of elemental powers, I like it. It's not bad.\" Han Sen finally smiled.\n\nAfter turning off his gene lock, his emotions returned. He no longer felt like one of the heartless monsters of the Xue family. Now, he was back to his former, chirpy self.\n\n\"I wonder what kind of powers I would have received if I had unlocked the gene lock with the Dongxuan Sutra? It would have been greater than Jadeskin, that is for sure,\" Han Sen predicted.\n\n\"Also, I wonder what my level is, compared to evolvers who have already unlocked their gene lock?\" Han Sen knew that Jadeskin basically increased the current talents and abilities his body possessed, with nothing extra. Therefore, he wasn't sure how he'd fare in a fight, going against those with elemental powers.\n\nReturning to his room, Han Sen called Huangfu Pingqing. Soon after, the communicator on the other end was picked up, and her image filled the screen. Han Sen almost felt his nose start to bleed.\n\nHuangfu Pingqing was only wearing a very thin pajama gown, which revealed a lot of skin. You could even see through the fabric, to a certain degree. Although not everything was on display, what could be seen was seductive and a little teasing.\n\n\"Little junior, why have you come looking for me? There must be a reason for this call. I doubt you're checking in to see how I am.\" Huangfu Pingqing seemed to deliberately lean forward, presenting Han Sen with a full-screen image of the trench that parted her perfect breasts.\n\n\"Senior, Queen told me that I should talk to you if I ever needed to seek her out.\" Han Sen's lips may have been moving, but his gaze had not. There would be no harm in such a stare, after all.\n\nNoticing his shameless gaze, Huangfu Pingqing felt a little awkward. She widened her eyes to stare back at Han Sen and grabbed a coat to veil her body. She then said, \"Why are you looking for Queen?\"\n\n\"Senior, please tell her that after much deliberation, I have decided to join her team,\" Han Sen told her.\n\nNow that he had successfully unlocked his gene lock, with his fitness at the top, he didn't need to worry about not being on par with the others on Queen's team. He was eager to see what sort of super creature they would be hunting.\n\nHan Sen knew it was extremely difficult for someone to hunt a super creature by themselves, so cooperating with others was not something he frowned upon.\n\nBy following Queen, he'd definitely have the opportunity to witness the true powers that super creatures held. After all, the silver fox was just a pup, and its strength must pale in comparison to a fully-grown super creature.\n\n\"She invited you onto her team?\" Huangfu Pingqing gave Han Sen a look of surprise.\n\n\"Didn't she tell you?\" Han Sen looked at her strangely.\n\nQueen told Han Sen to look for Huangfu Pingqing when he was ready to join her team, so it was fair of him to assume that she would know about the deal. Han Sen was surprised to learn that she wasn't aware.\n\n\"A person like her doesn't talk to me that much,\" Huangfu Pingqing said. Then, after a brief pause, she continued, \"But she's a proud woman; why would she value having a commoner such as you on her team? I remember a few evolvers requesting spots on her team a while back, and they had unlocked gene locks and everything, but they were turned down. Why would she turn down those evolvers but instead personally request your position on the team? I almost find it difficult to believe. You must be quite the charmer.\"\n\n\"I'm nothing special. I'm not the president yet; I still have a long road to traverse before I reach the top.\" Han Sen wiggled his nose as he spoke.\n\nHuangfu Pingqing had already built an immunity to Han Sen's shameless self-admiration. \"I will make sure to let her know, leastways. But, as for when you'll receive a response? I don't know. It all depends on her mood.\"\n\n\"I thank you, regardless. When I have retired from the army, remind me to buy you lunch sometime.\" Han Sen smiled.\n\n\"Okay, I'll hold you to that.\" Huangfu Pingqing returned Han Sen's smile.\n\nAfter their conversation concluded, Han Sen went to a testing lobby. He wanted to see what sort of power he had reached, having now unlocked his gene lock.\n\nTo do a complete test, Han Sen went to an exclusive testing lobby at the army base; not the ordinary, virtual-community one.\n\nAfter he selected his desired strength for the test, he entered the testing room. Inside, a half-human cyborg appeared in front of him.\n\nThis droid, designed exclusively for combat-testing, was built to resemble a human. It was actually composed of many other smaller robots. After a certain amount of damage had been dealt to the droid, it would shatter. But then, it could quickly rebuild itself."
}