{
    "chapter": 2790,
    "title": "Flower Seed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2790",
    "text": "Although the destructive power was not enough to kill the Flower Gods, they were able to make the Flower Gods lose their abilities of combat for a bit and fail to chase the swordsman.\n\n“Lone Bamboo really is so powerful.” Han Sen was shocked. He recognized the swordsman as no other than Lone Bamboo.\n\nEven though Lone Bamboo was strong, he did not have enough power to kill the Flower Gods. After all, they were creatures under the control of a god. They had special powers and were very difficult to kill.\n\nHan Sen pulled out his phoenix feather and flashed forward. It was one strike for one enemy. The Flower Gods struck by the phoenix feather burned. They were crying in pain on the floor. Not long later, the flowers on their heads turned to ash and their bodies returned to normal.\n\n“You have very powerful sword skills,” Lone Bamboo said. “What is your name?”\n\n“San Mu,” Han Sen answered.\n\nLone Bamboo was shocked. He looked at Han Sen with a weird face.\n\nThere’s no way this guy noticed something, Han Sen nervously thought.\n\nLone Bamboo said nothing more. The Flower God Leader and the others assembled. They were gasping as they asked, “Lone Bamboo, did you get my flower seed?”\n\nLone Bamboo smiled. “I have heard one of the elders of the race say the Flower Gods control the Space Garden through the use of a seed. I was going to go and claim it, but it is a shame that the location of the seed has been captured by a scary xenogeneic. Not even I can get inside there.”\n\n“Xenogeneic? What xenogeneic?” The Flower God Leader was shocked. The location of the seed should not have had any plants or plant xenogeneics around. Even if the Space Garden xenogeneics had mutated, there should not have been anything in that particular location.\n\n“I am not sure what kind of xenogeneic it is, but it is a kid in a red robe. He is bald and has a red mole on his head.” Lone Bamboo described what the xenogeneic looked like and said, “That xenogeneic’s power is weird. It can control the xenogeneic plants all around it. That place has been taken over by a dozen deified xenogeneic plants. I was unable to gain access.”\n\nWhen the Flower God Leader heard what Lone Bamboo had to say, his face changed. He screamed and asked, “Could it be that the flower seed has mutated and become a xenogeneic? If that is true, then that is most terrible.”\n\n“What is the flower seed anyway?” Xie Qing King asked.\n\nThe Flower God Leader knew there was no point in hiding things. He replied, “According to the records of my people, when the ganoderma lucidum’s spores landed on the corpse of the god, it absorbed the god corpse’s nutrients and transformed the Space Garden. As a matter of fact, the Space Garden is one giant ganoderma lucidum xenogeneic. That flower seed came with the ganoderma lucidum’s spore, but it did not grow. Even so, it had a weird connection with the ganoderma lucidum. If you possess the seed, you can make the ganoderma lucidum adhere to your commands. If the flower seed has mutated, we cannot control the ganoderma lucidum xenogeneic anymore. It will not just be the Space Garden that falls. There is no telling if we can make it out of here alive.”\n\n“In that case, it is worth going to check out what exactly happened.” Han Sen was not worried. Even if the flower seed had become a xenogeneic, he still had a chance to claim it.\n\nThe Flower God Leader looked worried as he led the way forward. Not long later, he saw the city ahead of them had already been taken over by plant xenogeneics.\n\nThe flower vines looked like serpentine dragons, and the flowers looked like giant butterflies. The giant flower trees had many women on them. Their lower bodies were like slithering snakes.\n\nThis area was like heaven for monsters. There were so many weird plant xenogeneics gathered there, and they were very scary.\n\nOn a vine tower that had a xenogeneic atop it, there was a child clad in a red robe. Its eyes were wide open as it checked out Han Sen and the others approaching.\n\nWhen the Flower God Leader saw the red-robed child, his face turned pale. He said, “That is it. That is what the flower seed has become. Its presence is just like the seed but stronger.”\n\n“Ah! Ah!” Han Sen wanted to ask something, but the red-robe child stood atop the tower pointing at Han Sen like a madman.\n\nNo one was able to discern what its meaning was, but they saw a xenogeneic with many butterfly flowers on it approaching. The trees began to move. Millions of butterfly flowers turned into real butterflies, and they call came at them like the rush of a tide.\n\n“Oh, no! Everyone, go back!” Lone Bamboo shouted. “This deified butterfly tree’s radius is far too wide. I am afraid this is not something you and I can go against.”\n\n“It is fine.” Han Sen’s heart jumped as he cast his Dongxuan Area. He was able to control the cogwheels of the entire universe in that portion of space. As he cast it, he saw all the butterflies in the sky appear to freeze. They were like stars that could not move.\n\n“You guys wait for me here. I am going to go check out that red-robed kid.” After speaking, Han Sen went in the direction of the vine tower.\n\nThe butterfly tree did not do anything, and the red-robed kid kept making “ah” noises. Han Sen saw the plant xenogeneics around the vine tower start shining with a god light. All kinds of power were coming toward him.\n\nHan Sen did not care for them. He kept going toward the red-robed child.\n\nSky Vine Radish had only just exploded. All of its genes had scattered across the Space Garden, and it had made the plant xenogeneics mutate.\n\nThe time was too short, and the plant xenogeneics were still mutating. They needed time to digest the Sky Vine Radish’s genes. Therefore, their levels were not yet too high. The xenogeneics that had become deified were only just primitive.\n\nHan Sen used his Dongxuan Area at the maximum level. He used it to stay the assault of every hostile power. The many scary plant xenogeneics that got close to him lost their power.\n\nEveryone saw Han Sen walk past the scary plant xenogeneics. Wherever he went, the plant xenogeneics fell back. Their scary powers were reduced. Han Sen walked past many scary plants all the way to the vine tower.\n\n“This person… Who is this person…” The Flower God Leader was in shock. No one was able to believe Han Sen was merely Xie Qing King’s bodyguard.\n\nA primitive deified had used his power to suppress many scary xenogeneics alone. That sort of power was something not even the Extreme King or Very High could muster. No high races produced individuals that intimidating.\n\n“It does not matter who he is. All you need to know is that he is on our side,” Xie Qing King said. His eyes were burning. Han Sen’s power made him want to become deified too.\n\nThe red-robed kid saw Han Sen approaching and that the scary plant xenogeneics were absolutely useless before him. He got annoyed and stared at Han Sen. His body produced a strange red light."
}