{
    "chapter": 1292,
    "title": "Moving Star Emperor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1292",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nFortunately, the jue was only shaking. Nothing else happened.\n\nHan Sen knew that, for as long as there was no alcohol inside it, there shouldn’t be any more incidents. For all he knew, it could have been having alcoholic withdrawals.\n\nBut as he continued to walk, the shaking of the jue became more vigorous. When Empty Witch brought Han Sen over to the west side of the shelter, it started to vibrate like mad.\n\n“There it is! When it is dark, you can see it shining bright like a comet,” Empty Witch said, as she pointed towards the object.\n\nHan Sen looked in that direction and saw a very smooth black rock. If Empty Witch had not mentioned it to Han Sen, he never would have guessed it was once a treasure.\n\n“That must be the Luminous Stone. If I pour wine into the jue, I bet you I can summon her,” Han Sen thought to himself.\n\nHan Sen did not know if there was any particular use to summoning demi-gods. He had asked Moment Queen about it, and she had no clue. All she could tell him was that various treasures, belonging to demi-gods, were known to have been left over in the Third God’s Sanctuary, and that was it.\n\n“If I want to know the answer to this, it looks like I’ll have to accept Dragon King’s proposal,” Han Sen thought to himself.\n\nIf it was an ordinary king spirit, Han Sen would have gladly given him the egg already. But he was one of the eight generals, and he had a connection to Asura. Han Sen wasn’t entirely sure if he should be trusted.\n\nAnd Yaksha, all this time, had not said a word to Han Sen about what happened with Ancient Devil Emperor, either. Even under the threat of death, he remained silent. This made Han Sen even more curious over the events that had transpired.\n\nHan Sen thought that if he could figure out what had occurred, he’d understand a lot more.\n\nAsura might have been related to the shura, and the shura were related to the Luo family. Zero could practice the Asura Sutra and the Falsified-Sky Sutra, and on her back, she possessed a Nine-Life Cat tattoo. Furthermore, there was a connection between Blood Legion and Han Jinzhi.\n\nHan Sen felt all this was connected somehow, and it was all just one big jigsaw puzzle. There was only one problem: he didn’t know what the whole picture looked like. And he wasn’t even sure if he had all the pieces of the puzzle.\n\nHan Sen needed more information, he felt. He had ownership over two key figures in this plot, but they refused to loosen their tongues about it. All he knew was that Asura betrayed Ancient Devil Emperor somehow.\n\nThe only other lead Han Sen had was in Baby Ghost. He once told Han Sen he was the vice-leader of Blood Legion, despite being a spirit. Han Sen wished he could crack open Baby Ghost’s brain to get a peek at what hidden knowledge he possessed and refused to reveal.\n\nAs it got dark now, though, Han Sen heard footsteps approaching. There was a spirit coming. He looked colder than the black of space, and many star-like orbs surrounded his presence. He did not look like the friendly sort.\n\nWhen he saw who this spirit was, he knew why, too.\n\nHe was Moving Star Emperor, and he had ranked tenth place in Divinity’s Bout. He was also Han Sen’s biggest enemy in the northwestern regions that he was practically ruling. He was Han Sen’s roadblock for expansion, and after two years of skirmishes and fighting, neither side had yet to prevail over the other.\n\nThe spirits all whispered how powerful he was.\n\nBut Moving Star Emperor was not one sole spirit. He had a host of powerful subordinates, hanging on his beck and call. It was through their support that Han Sen was unable to defeat him.\n\nMoving Star Emperor would have liked nothing more than to kill Han Sen then and there. Many of his subordinates had died during the battles he and Han Sen had waged, and it brought him great pain and anguish.\n\nHe thought Han Sen was a cheater, too, since he frequently used Holy Rhino and Little Silver for healing during their fights. Han Sen’s tactics were infuriating.\n\n“How could a pathetic human have been invited here?” Moving Star Emperor said, with a cold half-rhetorical question of insult and disdain.\n\nMoving Star Emperor didn’t start a fight, though. It just went to show how much influence Lotus Empress had over those who were attending.\n\n“She can invite whoever she wishes to,” Empty Witch answered.\n\nHan Sen was quite shocked, following this. Moving Star Emperor did nothing to Empty Witch. Empty Witch had only opened nine gene locks, but she could talk down to whoever visited there because she knew Lotus Empress had her back.\n\nMoving Star Emperor looked over to the Luminous Stone, though. And due to the night starting to settle in, it was beginning to glow. The darker it became, the brighter the light was. The light it emitted was warm, and it was beautiful in the way it scattered across all the lotuses around it.\n\nHan Sen felt as if there was a rhythm to the way that light pulsated, but he couldn’t hear anything to suggest there might have been music playing.\n\n“Perhaps silence is the greatest music.” Han Sen could feel it, but he could not hear it. He wasn’t quite sure what he was witnessing, truth be told. But it was more than just a simple glowing rock.\n\n“This dirty, down-trodden, filthy race can understand?” Moving Star Emperor said, with a clear effort to provoke Han Sen.\n\nHe didn’t dare to attack physically, but sticks and stones and all that…\n\nHan Sen did not participate in their battles, and he allowed Purple Emperor to lead. Therefore, Moving Star Emperor only had second-hand tales to estimate just how powerful Han Sen might have been. He was eager to learn the truth first-hand. If he could instigate a conflict right then and there, he thought it would be brilliant."
}