{
    "chapter": 2425,
    "title": "Broken City",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2425",
    "text": "“We can’t get into the city. Talking about it is useless,” Han Sen said, looking at the undamaged city door.\n\nNight Wind’s power was strong, and it far exceeded Han Sen’s capabilities. Han Sen didn’t stand a chance of opening Du God City’s door if Night Wind had failed, and Miss Mirror had fallen to King class. They really didn’t seem to have any options.\n\nNight Wind’s heart jumped. His sword of darkness slashed again, but this time, he wasn’t targeting the door itself. He turned his attention to the rocks all around, planning to dig out the entire tower that the door was set into.\n\nHan Sen and Miss Mirror stepped back and watched. Since the door was impassable, they couldn’t think of any alternatives. Night Wind’s plan was a desperate, last-ditch effort, not a well thought out strategy.\n\nThe dark substance chains kept whipping into the black rocks, and the rocks were shattered and swept away. More and more sections of the tower were revealed.\n\nHan Sen didn’t know how many floors the tower had once possessed, and that was because the tower had actually been cut in half. It looked like the whole building had been slashed by an enormous sword. The stone pillars in the front were all chopped off. The pillars fell smoothly from tall to short, as if it had been a very tidy cut.\n\nThe stone pillars were thicker than a water tank. There were multiple lines of pillars, and each line contained a dozen of them. The three of them stared up at the broken tower with wide eyes.\n\nNight Wind wasn’t one of the top deified in the universe, but he wasn’t weak by any measurement. Attacks backed by his full deified power were only able to leave small scratches on the city’s bricks. Cutting a single brick would be far beyond his abilities.\n\nWith that in mind, it was difficult to imagine the sort of power that would have been required to cut clean through this entire tower. Even thinking about it was frightening.\n\nIn the beginning, Han Sen wasn’t very hopeful that they would be able to enter Du God City from above. Surely such a large and powerful city would have some sort of bai sema or restrictive power in place. This wasn’t the sort of place that you could just climb over a wall to get into.\n\nBut now, the tower was broken, and the restrictive properties of the place must have long been abandoned. That meant gaining access would be easier than Han Sen had imagined.\n\nThe upper half of the city tower was missing. Night Wind slashed the rocks in various directions, but he couldn’t find the other half of the tower.\n\nThe bottom half of the tower was filled with rubble, and so Night Wind swung his dark substance chain. He moved the stones out of the way, clearing a path so the three of them could enter the tower.\n\nThere was little to see in the half of the tower that remained. A statue had once stood in the tower, but the upper half had been sliced through and taken away with the top half of the tower. The part of the statue that remained appeared to be sitting, and its legs were crossed. The three of them couldn’t tell what sort of statue it might have been originally.\n\nThe shattered remnants of stone beasts lay scattered around the statue. They had fallen, breaking across the floor. Judging by where they now lay, it was clear that they had once stood guard on either side of the statue.\n\n“It looks like a pretty savage battle was once fought here, but if that is true, how come we haven’t found the corpses of the creatures that must have died here?” Han Sen asked with a confused tone of voice.\n\n“Maybe we have. We’ve dug up a few severed arms, remember? Those limbs were ridiculously dangerous. Even once they had been amputated, the arms still managed to kill many of our workers. That certainly shows how scary the people involved in this battle must have been. Even their limbs possess indestructible power,” Night Wind said.\n\nMiss Mirror frowned. She looked toward Du God City and said, “If this is really Du God City, then this must be the sacred place for the Ancient God. Even the Extreme King have believed that Du God City was just a legend, not a real place that actually existed. The Ancient God have protected this city very seriously. If other creatures wished to attack Du God City, then the Ancient God surely would have fought back. But I’ve never heard any stories of the Ancient God having a battle on this scale.”\n\nAfter pausing, Miss Mirror said, “Based on what we’re seeing, this is a ruin of a god spirit’s battleground, probably from the very first era. How did the Ancient God claim it? The Ancient God might have the word ‘god’ in their title, but they are not actually gods.”\n\n“Maybe we’re making assumptions about what happened here. This might not be the ruins of a god spirit’s battleground,” Night Wind said.\n\n“Even if this isn’t, a fight like this must have shocked the entire universe. There is no way no one knows about this.” Miss Mirror shook her head.\n\nHan Sen thought and said, “Maybe Du God City really did exist, and it was just a forbidden place that was sacred to the Ancient God. But this city was already destroyed in the very first era. Maybe that is why no one has actually seen Du God City; maybe the Ancient God themselves don’t even know where to find it.”\n\n“That is possible. The Ancient God and the Very High are always so secretive and mysterious. Those two races already existed back in the Sacred era, and they were already very powerful. But they were suppressed by Sacred back then. They weren’t as famous as they are right now.” Miss Mirror nodded in thought.\n\n“If Du God City already existed in the era of the gods, and it was destroyed at some point afterward, does that mean there are secrets here that are associated with what it takes to become a god?” Night Wind sounded very excited.\n\nHan Sen shook his head. “Maybe not. For Du God City to be destroyed like this, it probably means that the Ancient God failed. Maybe the secret inside Du God City was already stolen? This might just be an empty city now.”\n\nNight Wind understood this line of reasoning, but he still held hopes of plundering Du God City. He said, “No way. There must be something inside this city. Otherwise, why are other powers trying to fight their way into the city?”\n\n“It’s hard to say,” Han Sen said quietly.\n\nIn truth, Han Sen also thought that there was something inside Du God City. But that item could be something very different from the secret to becoming a god. Perhaps some frightening people had survived the grand battle and were now deliberately luring people inside.\n\nHan Sen had a bad feeling about this place. They had found a stone that could turn a deified into a King, and a statue that had a thousand hands and a thousand eyes. Whatever was inside this creepy place, it wouldn’t be very nice.\n\n“Let’s head inside for now,” Miss Mirror told Night Wind. Night Wind went back to breaking up and hauling out the rubble.\n\nThe whole of Du God City was buried under an avalanche of stone. Even the structures and streets were all buried by rock. If Night Wind and the others wanted to proceed, they would have to move the stones.\n\nLuckily, all the rocks in the city had already been reduced to shattered rubble. There weren’t big chunks like what they had found outside the door. Because of that, they didn’t need tools to break up the rocks into smaller chunks. They just had to haul out the shattered stones.\n\nWith Night Wind’s powers, moving mountains wouldn’t have been difficult, so hauling away some rubble was really easy. He didn’t dare use his power to remove all the rubble, though. He was afraid of breaking something valuable buried under the stone. Also, on the chance that something was still alive and sleeping within the city, he didn’t want to wake it up.\n\nAfter the experiences that they’d had in recent days, even a deified elite like Night Wind would treat Du God City with an appropriate level of respect. He wouldn’t attempt anything stupid.\n\nNight Wind guided his dark substance chains, sliding aside rocks that were a dozen meters wide. After going past the tower, they found themselves in a plaza. Night Wind kept digging, removing one hundred meters of stone before coming to a stop. He stared at the place he had just dug up."
}