{
    "chapter": 1178,
    "title": "Angel Arrives",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1178",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Aargh!” The shadow inside the mirror continued to punch itself, causing Han Sen constant pain.\n\nThey both looked identical, but fortunately, it couldn’t—or at least wasn’t—making use of Han Sen’s full, insane powers. He’d have been killed fairly quickly if it had.\n\nHan Sen withstood the pain and threw a punch at the mirror.\n\nThe mirror did not avoid Qing Jun King’s attacks, but it made sure to dodge Han Sen’s. This lent credence to what Qing Jun King had told him, and he was relieved to hear she was telling him the truth. Only the person who the mirror mimicked could deal damage to it.\n\nWhen the mirror dodged, Han Sen decided not to waste any more time. He threw another punch at the mirror, but this time, it was with all nine gene locks of the Blood-Pulse Sutra. That, combined with Curse of Immortality, Jade-Sun Force, and his phoenix techniques firing on all cylinders, he was aiming to devastate the reflective fiend.\n\nPang!\n\nThe bronze mirror was sent flying backwards, directly into the barrier.\n\nAside from the shadow in the mirror, it did not look like the mirror could attack in any other way.\n\nBut the mirror was tough, that much was certain. Despite sending the mirror flying, Han Sen was unable to actually deal it damage. Not a single scratch blemished the glassy surface of the mirror, and much to Han Sen’s discomfort and pain, the shadow-self continued to self-harm.\n\nHan Sen gritted his teeth to withstand the constant pummeling and punched the mirror again. The mirror was against the barrier, so it was a clear shot. Like a hurricane, Han Sen unleashed a flurry of attacks against the mirror’s surface.\n\nHan Sen punched it countless times, but despite his best attempts, he could not shatter the mirror. And all the while, the doppelganger continued to hurt himself.\n\nThe shadow smiled, as if laughing and mocking Han Sen. He was spiting Han Sen, as if to say he was useless and there was nothing he could do to rectify the situation.\n\n“You think I’m a coward?!” Han Sen thought.\n\nHan Sen and Qing Jun King had seen the mirror together, but the mirror had chosen Han Sen for some inexplicable reason. Han Sen thought it must have meant the mirror believed he was the weaker of the two.\n\nHan Sen did not have any of his weapons on him, and the Blood-Pulse Sutra only bettered the body. It wasn’t really a skill that lent itself to dealing massive amounts of extra damage. It wasn’t a proper combat ability.\n\nHan Sen was unable to break the mirror, and he felt as if he had exhausted all options. He couldn’t think of anything else to do.\n\nHan Sen could have used super king spirit mode, but he didn’t want to expose himself as The King to Qing Jun King.\n\nHan Sen looked into his Sea of Soul. Little Angel and the gold raven were still in the process of evolving. And them aside, he had no super weapons to call upon.\n\nHan Sen might have been able to use Saving Money to break the mirror. But the shadow would hit Han Sen while he was performing it, which would render it ineffective.\n\nHan Sen could have summoned Disloyal Knight, but his attack power wasn’t very high. And if a pet beast soul could deal damage to Han Sen by striking the mirror, that would be very bad news for him.\n\nHan Sen could not think of a way out of this situation.\n\n“Next time I return to the Alliance, I need to get myself a strong attack skill,” Han Sen thought to himself.\n\nJust as Han Sen decided to activate super king spirit mode, he heard a movement stem from the Sea of Soul. Han Sen looked inside there, and he noticed a strange energy permeating it.\n\nThe Sky Fruit wasn’t very big, so the fight against the mirror was easily noticed by the other king spirits and super creatures.\n\nBaby Ghost and Dry Bone ran over, in shock at what was going on. When they looked into the mirror, though, they quickly understood what was happening.\n\n“This is bad. If Han Sen can’t break the mirror, this will most certainly be the end of him,” Baby Ghost said.\n\n“The bronze mirror has a reflective power. If someone else hits it, it means hitting Han Sen. We can’t help him. He has to help himself,” Dry Bone King said.\n\nIt was difficult to find someone else to go up against Qing Jun King, so if Han Sen was to die there, it’d be a grand shame.\n\nBut they couldn’t help. And if they tried, Han Sen would be beaten to death.\n\nAll the super creatures came over to watch the events unfolding around the mirror. They were waiting for Han Sen to fail, so they could take the geno treasure.\n\nQing Jun King looked at Han Sen, and she seemed to be deep in thought over something.\n\nAs Han Sen continued to beat the mirror, he was actually more invested in investigating what was transpiring in the Sea of Soul. The light around Little Angel was now very holy. She was like a flower in the midst of blooming, with petals opening to reveal what was inside.\n\nA powerful light was being unleashed, and it even frightened Disloyal Knight.\n\n“Has Little Angel finished evolving?” Han Sen was delighted, feeling the warmth and abundant power that was slowly swelling within the Sea of Soul.\n\nHan Sen thought a pet beast soul from another sanctuary needed to open gene locks for themselves, and he thought it’d take another long while for her to become effective enough to fight.\n\nBut seeing all that power now, Han Sen understood there was more to Little Angel than he had first thought. She was a lot more than simple eye candy. She was in battle mode already, and many of her gene locks had already been opened.\n\nThe petals had all peeled away now, revealing a package of bright golden light. The light sent ripples through the entirety of the Sea of Soul.\n\nWhen it was fully exposed, Little Angel’s form came to be. She was divine, clad in a beautiful white robe. She had angelic wings, and in her hands, she clutched a transparent greatsword. Her curly blonde hair waved, painting her like a goddess."
}