{
    "chapter": 1226,
    "title": "Thunder Hell Emperor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1226",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen used the Night Cloak every night to sneak into Thunder Hell Shelter. On the sixth night of doing this, he found a reduced number of super creatures and king spirits in the Thunder Garden. Understanding this, he knew the time to strike was now.\n\nHe swiftly returned to the underground shelter, and with everyone gathered around, he formulated a plan that would enable him to retrieve the spirit stone.\n\nHan Sen had been watching the proceedings of the garden for two nights. He wanted to ensure Thunder Hell Emperor had indeed gone and taken a hearty-sized posse of his best with him. If the spirit was gone, Han Sen would wait until the emperor had crossed a great distance and a quick return would be impossible.\n\nAfter Han Sen was able to confirm he was gone, things were looking up. Still, he couldn’t yet determine what would await him in the spirit hall. If he went inside, the Night Cloak wouldn’t work. It was a one-way ticket.\n\nOn the night of the third day, Han Sen hid everyone in his Sea of Soul, and if they couldn’t go in there, they were instead placed inside the Cruel Bottle. With the Night Cloak on, he snuck back inside.\n\nThe spirit hall was situated behind the garden. The super creatures and king spirits were again unaware of Han Sen’s infiltration.\n\nIf they noticed, by the time they did so, Han Sen would be crossing the spirit hall.\n\nHan Sen worried how many super creatures were acting as sentinels inside the hall, but there was no way of telling without exposing himself after stepping in. Whatever the case would be, he had to grab the stone and grab it fast.\n\nHan Sen could not return to Holy-Sword Shelter now. It was too late, and even if he beat the hostile forces there, taking on an emperor and his army would be incredibly difficult.\n\nPurple Emperor was not a complete emperor, so there was no chance of him being able to match Thunder Hell Emperor in combat.\n\nThe only way Han Sen could beat him, he figured, was by taking his spirit stone.\n\nThus far, Han Sen’s infiltration of the garden had been easy. He observed the geno plants all around and thought to himself, “When I’ve got the spirit stone; I need to get sucking.”\n\nHan Sen looked over at the hall, which was not too far from him now, and inched his way over to it. He noted how it had the soft, mystic grandeur of some ancient temple.\n\nGetting into position a small ways from the entrance, Han Sen summoned Little Angel, Disloyal Knight, and the rest of his compatriots. Everyone readied themselves for a battle and started running towards the gate.\n\nThe run-up to the spirit hall had environmental traps that frequently blasted black lightning all about. It tried to fry unauthorized intruders who sought to reach the hall.\n\nThe black lightning flickered out like craggy rocks, and sometimes like webs of electrocution. Fortunately, none came to harm, as all of Han Sen’s forces were able to avoid the lightning. With a hefty strike, they all reached the gate and pummeled it down.\n\nBoom!\n\nThe entire structure vibrated as the gate collapsed under the obliterating force. The noise was loud, though, and it might as well have been the sounding of an alarm.\n\nOld Huang and Little Zhao were talking to each other over the warming glow of a campfire as this transpired. Old Huang said, “Do you honestly believe that Han Sen can achieve something? I’m telling you, he cannot. Kids and their role models these days…”\n\nBefore he could finish berating his camp partner, the ground vibrated all of a sudden. It shocked him dearly.\n\n“What happened?!” Old Huang exclaimed and stood up.\n\nLittle Zhao looked over to the garden and said, “Look, something is happening over in the garden. Han Sen is striking!”\n\n“How?” Old Huang saw lightning and vines erupt over the garden walls he could only peer at.\n\n“Quick! Tell everyone to leave; we can’t risk killing each other,” Little Zhao said as he took off running to warn the others.\n\n“That could not have been him. You must be joking, surely!” Old Huang was quite the doubter.\n\n…\n\nInside the spirit hall, four super creatures and four king spirits stood as guards. The ones in the garden were quick to react, too, chasing the intruding crowd like wolves trailing blood.\n\nHan Sen told Thorn Queen to do her best to prohibit their passage and block them with her command of thorns and vines. Then, he, Xie Qing King, Purple Emperor, and Little Angel raced into the hall to engage the enemies before them.\n\nSuper creatures and king spirits ahead of them were snared into battle with Han Sen’s fighters, while he transformed into a gold raven and swiftly flew over to the statue’s forehead.\n\nHan Sen wanted to grab the spirit stone as fast as he could and not suffer any delays.\n\nThe creatures and king spirits were enraged as he soared above them all. They sought to react, but Little Angel and Xie Qing King were able to re-engage the attention of those that sought to break away and chase after Han Sen. Han Sen’s talons almost came into contact with the spirit stone.\n\nBut just before he could touch it, a monster leaped out of the spirit stone. It was Thunder Hell Emperor himself.\n\nHe was furious. He had been in the Third God’s Sanctuary for the longest time, and this was the first time he had ever committed suicide to respawn back at his spirit hall.\n\nSeeing the raven trying to snatch the stone, he threw a slap in its direction.\n\nHis palm quivered with the shimmering creation of a black hole. It was a terrifying move that warped the dimensions it traveled along. It looked like a black, hungry maw that wished to chew up and consume all in its path.\n\nHan Sen immediately felt the power head his way, so he reacted by throwing Snowball towards it.\n\nSnowball turned into a white ball and fell inside the black hole.\n\nLightning exploded inside that black hole, striking the white orb with frightening ferocity. The white sphere was getting pulled and twisted like dough, but it remained strong and didn’t break.\n\nHan Sen did not expect Thunder Hell Emperor to return so quickly, but he was past the point of no return. He had to take the stone now; it was now or never. Like a glorious phoenix that could transcend space, Han Sen soared with a blazing trail of fire in his wake and tried to grab the stone.\n\nThe super creatures that had followed Thunder Hell Emperor out were on their way back. But all the king spirits that had left had also committed suicide to return, too. The entire shelter brimmed with a hostile aura of terrible power."
}