{
    "chapter": 2493,
    "title": "Holy Area Grass",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2493",
    "text": "The Tianxia Peacock King wasn’t doing so well. Most of its plumage had been torn off, and only a few feathers remained on the bird’s tail. It was like a plucked chicken, or a paper fan that had been mostly shredded.\n\nWounds covered its body, and many of them looked severe.\n\nBut no matter how badly injured it was, this creature was still a powerful deified foe. The peacock’s eyes started to flash. It emitted a rainbow godlight substance chain, forming an area that shielded everything. Everything inside that area would be melted by the rainbow godlight. Anything inside the area would be reduced to dust, crumbling away in minutes.\n\nHan Sen and the others were better off inside the white whale. The hull of the white whale was very solid. When the rainbow godlight shone on it, slow trickles of dust began to slide off the ship’s hull. The process was obnoxiously slow.\n\nThe cloud and Bao Qin didn’t fare as well. When the rainbow godlight shone on the cloud, it started to become dust. Bao Qin’s armor couldn’t withstand the godlight either. The armor’s transformation into dust was very slow, but it was Bao Qin’s self-armor. If it was injured beyond the point of recovery, his entire body would be permanently damaged.\n\nThe Tianxia Peacock King’s target was the cloud. Its eyes glowed with a godlight that seemed focused on the cloud. The cloud was scared, and it quickly flew forward. But instead of trying to escape the area, it just hid beneath the white whale.\n\nThe Tianxia Peacock King’s godlights fell on the white whale and almost pierced through the hull.\n\n“Oh sh*t! Does that bad luck cloud hate me this much?” Han Sen whined. He turned to Bao’er. “Go faster! Lose it!”\n\nBao’er pushed the white whale’s power to the max. The white whale released a whale-like call, and then it broke lurched forward as if it planned to leave no matter what got in its way.\n\nThe cloud managed to close the distance, and again, it appeared beneath the white whale. The rainbow godlights fell on the cloud, and it melted quickly.\n\nSoon, the spider plant was revealed. The plant was very green, like flawless jade. The rainbow godlight shone on the spider plant, but the plant seemed immune to the godlight’s power.\n\nBao Qin was running in the opposite direction. He took refuge in some clouds, and when he looked back, he saw the spider plant. He screamed hoarsely, “Holy Area Grass! That is the Holy Area Grass!”\n\nWithout a second of thought, Bao Qin sent a swarm of substance chains toward the spider plant.\n\nThe Tianxia Peacock King’s target was the spider plant. When it saw that Bao Qin was trying to steal its prize, the rainbow godlight fired a laser at him.\n\nBao Qin raised his harp to block the rainbow godlight, but the deified treasure was quickly annihilated by the peacock’s powerful attack.\n\nBlergh!\n\nDust rained from Bao Qin’s body. He looked very upset about his loss, and his desire for the plant still showed plainly across his face. However, he was no longer willing to try and steal the spider plant. He ripped a hole in the fabric of space, teleported, and disappeared.\n\nAfter all, he wasn’t comparable to someone like Meng Lie. Even with the Tianxia Peacock King being as injured as it was, he couldn’t do battle with it. That would be a fight he stood no chance of winning, and he knew it.\n\nAfter Bao Qin escaped, the Tianxia Peacock King’s gaze returned to the spider plant. It wanted to eat the spider plant, but before it could swoop down on the plant, the plant flew away under some invisible force. It was being pulled to another location.\n\nThe Tianxia Peacock King looked in the direction the plant was being pulled. He saw a little girl standing atop the white whale. A little gold gourd was clutched in her hands, and it was that gourd which was sucking in the spider plant.\n\nWhen he saw this, Han Sen’s heart stopped. He didn’t even know when Bao’er had gone outside to use her gourd on the spider plant.\n\nThe Tianxia Peacock King squawked with anger. Its rainbow substance chains erupted like a volcano, and the sheer volume of its substance chains appeared to shroud the entirety of space.\n\nIt looked furious. Even when Meng Lie had attacked the bird, it hadn’t been this disgruntled.\n\nThat rainbow godlight was everywhere. It was like a rainbow sky had descended over everything.\n\nAfter Bao’er climbed back into the white whale, Han Sen sent the ship rocketing forward. But no matter how fast the white whale flew, it wasn’t fast enough to outrun the Tianxia Peacock King’s rainbow godlight.\n\nThe scary rainbow godlight landed on the white whale, and the ship’s shell began to disintegrate even faster.\n\nThe white body of the machine suddenly looked like a plume of grey smoke while it flew. A lot of dust and ash crumbled away, like some sort of ugly comet.\n\nThe white whale’s shell was melted by the rainbow godlight, revealing the bones of its interior structure.\n\n“We’re going to die! We’re going to die! I beg you guys… Return whatever you stole…” Ning Yue cried, gripping Han Sen’s leg.\n\nHan Sen’s eyes kept shifting around. With the rate at which the white whale’s hull was being eroded, he also knew things weren’t going to last.\n\nBut after seeing how Bao Qin’s reaction to the spider plant, Han Sen realized that the spider plant must be very precious. He had never heard of the Holy Area Grass before, but he didn’t want to concede and give it up now.\n\nBut the Tianxia Peacock King was still a frightening beast. The rainbow godlight it emitted seemed unstoppable. Han Sen and his companions weren’t strong enough to withstand the might of such a creature.\n\nThe pirates and the imprisoned Extreme King knights watched all this with terrified eyes. They were all in shock. Their eyes darted all around the melting white whale.\n\nIf the white whale was destroyed, not one of them would be able to escape all this. They would be turned into dust by the rainbow godlight.\n\n“Bao’er, take the item back outside…” Han Sen could think of no other way to deal with the Tianxia Peacock King.\n\nAlthough Bao’er didn’t want to, she wouldn’t disobey Han Sen. She took the spider plant out of the gourd and gave it to Han Sen.\n\n“Tianxia Peacock King, take this item and let us live!” Han Sen threw the spider plant out of the white whale, hurling it far away from them.\n\nThe Tianxia Peacock King, upon seeing the spider plant, gleefully raced towards it. It was no longer interested in attacking the white whale.\n\nHan Sen probably should have thrown the spider plant further, but the Tianxia Peacock King was far quicker than he expected. It appeared next to the spider plant in an instant. It opened its mouth and swallowed the whole thing in one gulp.\n\nNo one could stop the Tianxia Peacock King, and the spider plant vanished down the bird’s throat in an instant.\n\nAfter the Tianxia Peacock King swallowed the spider plant, it moaned to the sky. The noise was so loud that it rocked the Tianxia System. Han Sen didn’t speak the language of birds, but he could imagine how good that plant must have tasted for the bird to moan and groan in such pleasure.\n\nThe bird moaned for a long time, but the noise was suddenly cut short by a loud burp. The Tianxia Peacock King had suddenly become so full.\n\nHan Sen was still trying to flee the area in the white whale, but before he could get too far away, he heard a strange noise. It made him turn to look at the Tianxia Peacock King.\n\nThe bird kept burping and burping. It couldn’t seem to stop, and it looked like it was suffering. The creature seemed to have eaten too much.\n\nThe strangest thing was that its belly was swelling. It was like a slim lady had suddenly become eight months pregnant.\n\nHan Sen was stunned, but as he stared, he had a sudden thought. With a shock, he said, “Is that black cricket doing something inside the peacock’s belly?”"
}