{
    "chapter": 2279,
    "title": "A Needle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2279",
    "text": "Because Han Sen had used a fair amount of his own power, it activated the hell power in his body. The ghost statue came to life and flapped its wings. It rose above Han Sen, then dropped like a hawk, its feet outstretched to grab Han Sen.\n\nThere was no way he would be able to dodge. The ghost statue was drawn toward Han Sen’s hell power like a magnet. When its feet came down, they were going to smash Han Sen into a pulp. The statue fell, and its claws closed around Han Sen.\n\nDong!\n\nThe ghost statue’s claws grabbed the bird’s nest and tried to crush it. They failed.\n\nHidden safely under the bird’s nest, Han Sen felt a modicum of relief. If the bird’s nest was able to withstand the attacks of the ghost statue, then that meant he had a chance to fight back.\n\nPerhaps being under the cover of the bird’s nest calmed Han Sen’s hell power. Regardless of the reason, the ghost statue released the bird’s nest and returned to its spot atop the pillar.\n\nHan Sen spent a while thinking. He cast his Jadeskin power and threw a punch at the ghost statue.\n\nJadeskin’s power might be perfect for this work. Perhaps using that power wouldn’t trigger the hell power within Han Sen. Maybe he could avoid waking up the ghost statue.\n\nBut that line of thought soon proved to be naive. As soon as Han Sen teleported, he was sent flying again. Fortunately, he had the bird’s nest to absorb some of the blow. With its help, he was able to avoid death once more.\n\nBut even so, Han Sen was still bleeding a lot by this point.\n\nTeeth power… Suppress Evil… Turtle skill… Under the Sky knifeskill… Lone Bamboo’s swordskills… Thunder power… Fire power… Ice power…\n\nHan Sen used all the powers he could remember, but each one proved to be useless. No matter what power he summoned, the ghost statue would break it. Han Sen couldn’t touch the horrid thing, and it kept tossing him aside like a toy. If it wasn’t for the aid of the bird’s nest, he would have been killed many times.\n\nEven with the bird’s nest for protection, his impacts with the bridge had injured him. His wounds might not have been as bad as they looked, but they did look very bad.\n\n“Stop trying. Just go!” Yisha growled. She was feeling a complex mixture of emotions.\n\nHan Sen had that bird’s nest for protection, so he had some measure of protection from deified attacks. If there was a deified elite around, though, his ability to escape wasn’t guaranteed. But Han Sen was taking so many risks in his attempts to free her that Yisha couldn’t help but feel touched.\n\nYisha didn’t believe she had treated Han Sen all that well. She had simply given him resources. And she had only taken him as a student because of a bet she had once struck with a psychic. It was only afterward that she realized that having Han Sen as a student wasn’t all bad.\n\nWhen she realized that she had a student who would fight for her in a situation as dire as this, it was difficult not to feel touched.\n\nYisha would never have considered that Han Sen might be doing this because he didn’t want to lose an advantage. Her life being at stake was only a small part of it.\n\nHan Sen wasn’t going to lose Yisha and a half-deified blood kirin. That was why he kept trying and trying. He didn’t want to lose so much.\n\nHan Sen had the bird’s nest, so he wasn’t going to die easily. That’s why he kept trying. But the results of his attacks were not encouraging. Han Sen tried every trick in the book, but none of his powers could overcome the ghost statue’s power.\n\nThe ghost statue responded to hell power far too well. It was like cause and effect. If Han Sen had hell power, it meant he was going to get hit by the ghost statue. There was no other possible outcome.\n\nIn all his attacks, Han Sen hadn’t touched the ghost statue’s forehead once. Thinking about getting the hell blood out of the ghost statue’s forehead was useless, because he couldn’t.\n\nAs Han Sen kept trying and getting knocked back, even his armor was dyed red by the blood that spilled from him. Yisha’s expression looked pained.\n\nThe ghost statue struck Han Sen again and sent him crashing down into the bridge once more. This time, though, he stayed hidden beneath the bird’s nest for a while.\n\n“Are you dead yet? If you’re not, then get lost!” Yisha shouted angrily. But her eyes shimmered.\n\nHan Sen didn’t move. He was hiding under the bird’s nest, thinking about how he might break the hell power, or the connection between it and the ghost statue.\n\n“I have used all of my powers at least once, and even so, I haven’t been able to land a hit. The only possibility remaining is to use my super god spirit body. By using my super god spirit body, I can remove the hell power and avoid being harmed by the ghost statue. But if I do that, then Yisha will know that I am Dollar. This is bad.” Han Sen felt depressed.\n\nAfter everything he had been through, though, seeing Yisha and the blood kirin get killed was the last thing he wanted. He needed to try this, even if it meant exposing his identity.\n\nAs Han Sen was thinking, Yisha shouted, “Han Sen, are you dead yet? Get out of here if you aren’t!”\n\n“My Queen, why would one like myself die so easily? You underestimate the fortitude of your students.” Han Sen placed the bird’s nest on his head like a hat as he spoke to Yisha.\n\nHis body and face were drenched in blood, and with the bird’s nest on his head—although it was a very sober situation—it looked rather funny.\n\nYisha’s lips were shaking, but after a brief while, they returned to a cold stare again. She looked at Han Sen, opened her lips, and sprayed spittle at him.\n\nDrops of blood fell down on Han Sen like rain. Han Sen was surprised, and he wasn’t quite sure what Yisha was doing.\n\nDong-ong!\n\nWithin that sprinkling of blood, something landed on the bridge in front of Han Sen.\n\nHan Sen took a closer look. It was a red sewing needle. It was thinner than a hair, and it was around the length of a finger.\n\n“What is this?” Han Sen picked it up. He thought that something about the sewing needle was very unusual.\n\nIt felt like it was made of bone rather than metal. It was very small, but it was hollow inside. It was more like a needle for injection than a sewing needle.\n\nWhen Han Sen lifted the bone needle, he felt it summon power inside his body. His energy started to circulate.\n\nHan Sen stared with wide eyes; the power that was running was Blood-Pulse Plunder, which he had learned not so long ago.\n\nYisha said quietly, “Most of the items I brought along with me were destroyed. This is a small item I managed to obtain from a broken statue. Take it as a souvenir and go.”\n\nUpon hearing that, Han Sen suddenly became very happy. “The statue you mentioned, is that the one in the ruined palace?”\n\n“Stop wasting f*cking time! Get out now! Even if I die, you have to reclaim Planet Blade. Take care of my palace, because I don’t want anyone to touch my stuff,” Yisha snarled."
}