{
    "chapter": 2651,
    "title": "Star Tree",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2651",
    "text": "On a ship that was headed to the Andromeda system, a crystallizer woman turned to a man next to her. She looked afraid.\n\n“Are you a crystallizer?” she asked.\n\n“Yes,” the man said with a nod. He sounded rather cold.\n\nThe woman looked very surprised, and she said, “I can’t believe I have met someone of the same race here. My name is Lydia. You took the hall’s quest to venture to the Andromeda system to hunt xenogeneics, didn’t you?”\n\n“Yes,” the man answered. His emotions didn’t seem perturbed at all.\n\n“That is great. Can we combine forces and do it together?” the woman said.\n\n“No, we cannot,” the man answered.\n\nThe woman seemed disappointed, and she said, “That’s fine, I guess. What is your name, anyway? Can we exchange phone numbers? There are too few crystallizers here. We can contact each other.”\n\n“No, we cannot,” the man said. His face remained impassive.\n\nThe woman had spoken nicely to the man, but the man hadn’t reciprocated by the smallest amount. He never gave her a reply that was greater than three words.\n\nAfter they arrived in the Andromeda system, the ship’s passengers spread out as they headed to the various planets. The man got off the ship while the woman followed after him.\n\n“Why are you following me?” the man asked, turning around and looking at Lydia strangely.\n\n“It is because, in this universe, a crystallizer woman meeting a crystallizer man is a one-in-a-billion chance. I don’t want to miss out on such a rare opportunity. So, please, tell me your name,” Lydia responded, lowering her head and mumbling quickly. She spoke in a volume that only dogs could have discerned.\n\n“Yi Dong Mu,” the man finally spoke his name.\n\nLydia looked very happy to hear that. She raised her head, wanting to tell Yi Dong Mu something. But as she opened her lips, before she could speak, Yi Dong Mu’s dagger slammed through her heart.\n\n“Why… why…” Lydia couldn’t believe what had just happened. She stared at Yi Dong Mu with shock. She couldn’t believe the man would do something like this to her.\n\n“It is because I sense something dangerous within you.” Yi Dong Mu pulled his dagger back out of Lydia, sending the woman stumbling to the ground.\n\nHe looked at Lydia’s body, then turned around. He left and disappeared someplace into the mountains.\n\nShortly after Yi Dong Mu left, the lifeless Lydia opened her eyes. Weird flashes passed through her eyes, and she stood up like a wooden doll.\n\nAt that moment, Lydia looked like a lifeless robot. Her eyes were wide open, but they had no focus. It was like lots of data was scrolling through her eyes.\n\n“It failed again. Such a heartless killer. He killed a beautiful woman of the same race simply because he sensed danger. It is so hard to deal with this guy.” After a while, Lydia spoke to herself. “So annoying! I have now failed eight times trying to get close to this target. Another team failed to gain any information from him, as well. It is so hard to get information from others who have been in contact with Han Sen before. Since when did the crystallizers become so strong? It looks like this investigation will become quite difficult.”\n\nAfter that, Lydia’s body suddenly collapsed on the ground. Her light faded, and she looked like a dead body again.\n\n“Brother King, has anything special happened to you recently?” Wang Yuhang looked at his phone while chatting with Xie Qing King.\n\n“I made some new friends,” Xie Qing King said, with a cigar hanging from his lips. He was reclined in a CEO chair. He looked really relaxed as he spoke.\n\n“Me, too. But it looks like something happened with Han Sen. Is he in big trouble or something?” Wang Yuhang said.\n\n“Maybe not. Maybe they are just keen on investigating the boy. Otherwise, the people coming to ask us questions wouldn’t be so gentle.” Xie Qing King squinted while he spoke.\n\n“Then, what are we going to do?” Wang Yuhang asked.\n\n“If someone is giving you free money and beautiful women, are you ever going to say no? It would be very rude, and you would be missing out. That would sadden the person making the offer. Of course, we aren’t going to do that.” Xie Qing King laughed.\n\n“Teehee! That is what I thought, too. Lin Feng, Tang Zhenliu, and the others, as well. Can you please get in touch with them? Me being here is not a coincidence.” Wang Yuhang laughed.\n\n…\n\nEvery day, Han Sen remained near the lake and continued fishing out pages of the Xuan Yellow Sutra. For some reason, whenever it was Bao’er’s turn, she always ended up with actual treasures, and every time Han Sen fished, he ended up with a sheet of paper belonging to the Xuan Yellow Sutra.\n\n“This is so f*cking weird. Why can I only retrieve this geno art, page by page?” Han Sen wondered. He couldn’t think of an answer.\n\nAfter all, anti-material worlds were difficult to explain. Common sense and logic didn’t really apply to such places, and Han Sen didn’t want to waste time mulling it over. He just wanted to gather all the pages of the Xuan Yellow Sutra as fast as he could. He was keen to find out what sort of geno art it was.\n\n“A geno art that comes from the anti-material world. No matter how bad it is, it must be special, right?” Han Sen thought to himself.\n\nSuddenly, the triangle symbol on the small jade figure glowed. Han Sen knew Exquisite was on her way over. He carefully synced his thoughts with the small jade figure.\n\n“Find anything?”\n\nMoments later, Exquisite teleported right next to Han Sen.\n\n“Yes, but I did not get any fish. The stuff I’ve been collecting is pretty weird,” Han Sen with a strange tone of voice.\n\n“Underworld Lake is connected with the anti-material world. It is normal to fish up odd things. What did you get?” Exquisite asked.\n\n“I got some paper,” Han Sen said slowly. Liyu Zhen had seen these yellow sheets of paper before, so there was no use in hiding it. He had no choice but to reveal what he had found.\n\n“Paper? What sort of paper?” Exquisite asked with curiosity. Although anything could show up in Underworld Lake, it was rare to get something like paper.\n\n“About that…” Han Sen was frozen. When he thought about the lewd content on the yellow pages, he didn’t know what to say.\n\nExquisite could sense what Han Sen was thinking. So, she blushed and said, “Never mind. You don’t have to tell me. Whatever you get from Underworld Lake belongs to you. Even if you collect a deified treasure, it is all yours. When you leave Outer Sky, you can even take them with you.”\n\n“Thanks.” Han Sen pretended to be relieved.\n\n“I thought you always wanted xenogeneic resources. I have found some for you already. How much you get will depend on your power, though,” Exquisite said to Han Sen. She appeared rather mellow.\n\n“What do you mean?” Han Sen asked, curious.\n\n“Outer Sky has a star tree. The tree produces star fruit, and it is surrounded by powerful space xenogeneics. They are King class, at least. Of course, some can even reach deified. Now, you can collect the star fruit, but how many you can collect will depend on you.”"
}