{
    "chapter": 1823,
    "title": "Knife Rain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1823",
    "text": "The Rebate had people guide Han Sen into the vortex. When a white light began to beam from the vortex, Barons could enter one at a time.\n\nHan Sen was put in last place. And seeing that nine of the Barons had already entered, he did not hesitate to go in. As soon as the white light flashed again, he leaped inside.\n\nAfter Han Sen traveled through the wormhole, he found himself on a planet of sorts. He raised his head to the sky and noticed he was unable to see stars or moons. This wasn’t Narrow Moon. He was on a lone planet in the galaxy.\n\nThis planet was different from other planets. There were just plain fields stretching out until volcanoes rose out of the earth in the distance. Each volcano was dozens of miles away, and there were no mountains. Not even the slightest hill.\n\nAs Han Sen looked around him, he heard a big boom noise come from the closest volcano. It sounded like a roar, and it spat out a pillar of light.\n\nIt wasn’t just the nearest volcano that was erupting, either. It was every volcano he could see. With all those pillars shooting into the sky, it was a sight to behold.\n\nBut Han Sen knew something was wrong. When the volcanos erupted, there was no rising ash cloud or seeping lava. The column of light just shot up into the clouds and made them bright. They covered the entire sky.\n\nThe volcanos only erupted for a minute before stopping. Then, there were no pillars to be seen. But in the sky, the clouds were still getting brighter and brighter. They started to empty, unleashing a torrent of rain from above.\n\nAnd when the rain drew near, Han Sen could tell something was really wrong. It wasn’t just water he was seeing. The rain was a bevy of knives.\n\nThere were short knives, long knives, narrow knives, big and black knives, wing knives, flying knives. All those different types of knives were falling from the sky, until they hit the ground, covering the land in their abundance.\n\nHan Sen was shocked. There was nowhere to hide or take shelter amidst the knife rain. The best he could do was block.\n\nHan Sen did not have a weapon. He had wanted to bring a knife with him so he could use Tusk, but Yisha said there was no need to. Now he understood why.\n\nThis place had nothing but knives.\n\nSeeing that the kniferain would soon reach him, Han Sen grabbed one out of the air right before slashing the volleys away.\n\nThe kniferain only lasted a few seconds. Han Sen blocked all the knives assaulting him, and when he looked around, all he could see were knives for miles around. It was something of a knife treasury.\n\nThe knives were real, too, not illusions. Han Sen picked up a winged knife and a big black knife. One of them had been made from steel, and the other had been made out of some other metal. They felt good to wield, and as Han Sen used them to block the last of the falling knives, he could see marks left on the blades by the repeated collisions. The weaponry was real.\n\nHan Sen lowered his head and searched for a better one.\n\n“Don’t search! This is just the first round, so their quality will be bad. If you want a good one, you’re going to have to wait for the seventh round. Assuming you last that long, that is.”\n\nA Rebate man approached Han Sen, speaking coldly.\n\nHan Sen looked at him. He looked quite handsome, and he had black bunny ears. He was holding a knife that was shaped like an arrow. He must have picked it up from the rain, as well.\n\n“What’s your name?” Han Sen asked the Rebate man.\n\n“Black Steel, son of Black-Moon King.” The man stared at Han Sen, going on to say, “Two years ago, I begged my father to meet with Knife Queen. I hoped she would accept me as a student, but I was rejected.”\n\nHan Sen, hearing him say this, knew he was not a friendly chap. Trouble was coming.\n\nBlack Steel, holding his knife, continued walking toward Han Sen. “The queen took you as a student, but others have a tendency to say you are incredibly weak. I do not believe Queen would be so foolish as to accept one like that. You have to be superior, in some capacity. So, show me what you got.”\n\nAfter that, Black Steel’s knife came at Han Sen swinging. It thrashed towards him like lightning.\n\nBlack Steel’s knife was not a Teeth Knife. His skills were very aggressive, though. The narrow knife might have looked ordinary, but it moved as if it could slay an entire army.\n\nHan Sen’s hand swung the winged knife. It looked like he was slashing, but he wasn’t. It looked like he was stabbing, but he wasn’t. It looked very creepy as it approached Black Steel’s neck.\n\nBlack Steel swung his narrow knife, and they both collided with each other. The two knives were broken.\n\n“I did not expect you to have learned Queen’s Teeth Knife. Great.” Black Steel’s eyes looked on in excitement. He picked up a random knife from the ground and tried swinging it at Han Sen again.\n\nHan Sen still had his thick black knife, and he used it to employ Tusk. The quality of the blade was bad, so it broke.\n\nThey were both fighting amidst the knife rain. When a knife broke, they’d pick up another. Broken utensils were scattered all about. Black Steel was not losing, but he looked ill. Han Sen only used Tusk, and he did not change up his tactics at all.\n\nBut that simple skill still kept him in the fight with Black Steel, and he was not losing.\n\nTo Black Steel, this entire fight was turning into something humiliating. He met Han Sen’s eyes and said, “Is that all you’ve got!”\n\n“Yes. Before I met Queen, this is all I knew.” Han Sen nodded.\n\nBlack Steel was shocked. He stopped using his knife and asked, “When did she teach you this?”\n\n“A few days ago,” Han Sen said lackadaisically.\n\nBlack Steel looked even more confused, and he tried asking, “Aside from this skill, what others do you know?”\n\n“Others, but they aren’t very popular.” Han Sen could not expose the extent of his Knife Skill, but he was quite good.\n\nBlack Steel looked at Han Sen with continued confusion. He threw his knife to the ground and said coldly, “There is no point in beating you now, then. I will fight you once you have learned all of the Teeth Knife techniques.”\n\nHan Sen shrugged his shoulder. He was never interested in pointless fights.\n\n“What is this knife rain?” Han Sen asked Black Steel. Han Sen did not think he would be a difficult person to get along with."
}