{
    "chapter": 1059,
    "title": "Unicorn Beetle Mutation",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1059",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAsleep on the spaceship, with Ji Yanran in his arms, rested The Strongest Genius in the Alliance.\n\nJi Yanran had avoided watching the fight against the shura prince. She had been unable to cope with the thought of Han Sen being savagely beaten or even killed, all in the desire to accompany her on an expedition. She waited outside until news of what had occurred was known. A wave of relief unlike any other washed over her, upon hearing about Han Sen’s victory.\n\nHe had to have been tired, though. It was now morning, but Han Sen was still fast asleep.\n\nStill, in space, there was no day or night cycle; therefore, it did not matter what time he chose to wake up.\n\nAll of a sudden, though, Han Sen felt an itch. He scratched it away, but it returned to plague his nose. Han Sen’s sneeze woke him from his slumber.\n\nHe discovered a green unicorn beetle had climbed onto his face and had almost scrambled up into his nostrils.\n\nHan Sen pulled it away and put the familiar beetle down on the bed.\n\nHan Sen had received this beetle from a crystallizer ruin long ago.\n\nHe’d had it for a very long time, but there was nothing special about it he could tell. It was a strange creature, though. In the years Han Sen had kept it, it hadn’t had to drink or eat at all. It had remained the exact same as it was the first day Han Sen came into ownership of the insect.\n\nThere was one other curious aspect to the beetle. Han Sen had discovered that, if left alone without interaction for a long time, the beetle would begin to appear lazy and lifeless. And it was during this state that the creature’s colors would also begin to fade or at least lessen and dim.\n\nIf Han Sen ever wished to reverse this status, all he would have to do was pick it up, interact with it, and take it around with him for a few days.\n\nThese peculiar aspects aside, for all intents and purposes, the beetle was a lame creature that provided no obvious benefit. Or at least that was how it appeared, as Han Sen was still of the belief it was special and it had a purpose. Whatever that purpose was, he just hadn’t been made privy to it yet, he thought. The expedition he was about to embark on would be dangerous, though, so he made sure to bring it with him, hoping it’d prove useful somehow.\n\nJi Yanran was still sleeping while this occurred, so Han Sen removed himself from the bed with great care, as not to disturb her.\n\nSuddenly, the green plating of the beetle looked strange. The creature became translucent, revealing the presence of gears and cogs inside it, all in delicate motion. It was not unlike the inner-workings of an old watch.\n\nHan Sen was surprised, to say the least. Over the course of the last few years in which he had owned the beetle, he had yet to see anything remotely similar to this occur.\n\nJust as Han Sen approached the little creature to examine it, there was an announcement from the ship’s speakers.\n\n“We will be arriving at APX-706 shortly. Please convene at the meeting room before arrival.”\n\nThe announcement startled Ji Yanran from her sleep, so she quickly removed the blanket. With the slender curves and succulent portions of her divine body now on full display, Han Sen was suddenly overcome with the desire to return to bed—with her.\n\nUnfortunately, now was not the time for that. They both got changed and went to the meeting room, as instructed.\n\nHan Sen took the beetle with him, placing it in his pocket. He was going to check it out once the meeting was over.\n\nThe shura and humans gathered in the meeting room. Once there, they were shown an image of the planet on a projector screen.\n\nThe ruins they were going to examine were quite different from the ones Han Sen had seen before. The entire planet was crystallized, but it wasn’t obvious at first glance.\n\nOn the surface of the planet, it looked like any other lush planet would. The geography was wild and inviting, cloaked in thick and unspoiled greenery.\n\nThe planet’s atmosphere was primarily comprised of nitrogen and oxygen, making it an ideal candidate for future human colonization, as well.\n\nEventually, the spaceship touched down with a rumble.\n\nAfter they discussed what needed to be done on their mission, they separated again. They were going to start their investigation in three hours.\n\nDue to the injuries Yu Tuoshan had incurred, they were already two days late in beginning the operation.\n\nWhen the time to embark on the expedition came, the crew left the ship inside their warframes. While the atmospheric conditions had been revealed to be fine, the use of warframes was just protocol for the initial exploration of an unexplored planet. It was a precaution.\n\nAs Han Sen guided his warframe, he examined the unicorn beetle he had brought with him.\n\nAfter arriving at the planet, the cogs inside the beetle had been running faster than ever.\n\nHan Sen wasn’t sure what it meant, but it interested him enough to spend most of his time examining it.\n\nAside from those movements, though, there was nothing different about the creature. Even the beetle’s lifeforce had remained the exact same.\n\nEventually, they arrived at their desired location. Swiftly, they established a base of operation and proceeded to the entrance of the ruins.\n\nSurprisingly, at the entrance of these ruins, there weren’t many indicators of past crystallizer habitation. The presence of crystallizer technology was quite low, actually.\n\nOne thing Han Sen did find, though, half-hidden beneath the dense undergrowth, was a twenty-meter wide black crystal roulette board.\n\nOn that board, you could espy the presence of many lines and symbols that were commonly associated with the crystallizer civilization.\n\nThere were also markings on the board that extended all the way across. They were like partitions, or the slices of a cake that resulted in twenty portions.\n\nFour of the slots possessed a warning sign of sorts, but Han Sen wasn’t exactly sure what they meant or what they might have been indicating. No one else did either, just as no one knew what might be found deeper inside the ruins.\n\nWhen Han Sen first saw the roulette board, though, he was shocked.\n\nThe symbols were identical to the ones on the beetle. They were ones he was very familiar with. He didn’t even have to take another look at the beetle to confirm this.\n\n“Are these two things connected, by some chance?” Han Sen wondered, as he placed his hand inside his pocket.\n\nHe was going to touch the beetle, but he felt something else instead. He brought his hand back out of his pocket and noticed his fingers were bleeding from a newly-formed wound."
}