{
    "chapter": 2996,
    "title": "Light Scissors",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2996",
    "text": "One of the creatures had white hair. Its skin was black, and it looked like an old ape. The other one was like a spirit. It glowed with a green color. It was like a green ghost than one could see through.\n\nThe presence of these two xenogeneics was very powerful. They were clearly true god xenogeneics. That was undeniable.\n\n“Thanks for Godfather Han’s arrival. I am fine. Why do I not see Dollar?” Bai King smiled. It looked as if he did not care about the grudge he had with Han Sen in the past.\n\n“Dollar says he needs more time to prepare,” Han Sen replied. “He is preparing a powerful weapon. He will come later.”\n\nBai King nodded and said nothing. He pointed at the two xenogeneics and said, “This is Sun Moon God Ape. He is a powerful time element true god xenogeneic. This is Space Spirit. He is a space element true god elite. With their assistance and the power you and Dollar, the two of you elites, have, our operation will surely be a success.”\n\n“You are very thorough.” Han Sen turned around and asked, “I wonder, how will you break the time god power trapping Golden Growler?”\n\n“This is it.” Bai King did not talk crap. He brought out the treasure.\n\nIt was a gold pair of jade scissors. The scissors’ blades were metal and black in color. The bottom part was made of jade stone. It was pure white. The two blades were forged to look like a water dragon. They snapped together like two dragons playing orbs.\n\n“This treasure is called Light Scissor. It is made from the time element true god xenogeneic light dragon’s xenogeneic genes. That is how it was crafted. Our alpha killed the female and the male, the two light dragons. With lots of rare material and other xenogeneic genes, it cost them tens of dozens of years to forge. That is how the Light Scissors came to be. It is very good against time restrictions and bai semas. It should be easy to break Golden Growler’s time power. This will be the weapon that kills Moment God.”\n\nAfter pausing, Bai King went on to say, “I promised you I would let you have the scissors, but the light scissors are only supposed to be used by someone who has a time element power. I will let Sun Moon God Ape use of the scissors because he can provide us with the most help.”\n\n“Of course, the decision is still yours to make, Godfather Han,” Bai King said. “I am merely making a suggestion.” He passed Han Sen the light scissors.\n\nHan Sen tried using his own power. He found that he was unable to activate the light scissors. He needed a time element power to use the top-class true god weapon. Han Sen thought, “What a good fox. He knew I did not have time element powers, but he did not say only Sun Moon God Ape could actually use the light scissors. He is saying it is pointless for me to use it and only he can use it.” He coldly laughed. “But you have the wrong intentions. I am not very good at time element powers, but I researched it.”\n\nBai King watched Han Sen being unable to activate the light scissors and smiled. The Sun Moon God Ape looked quite cocky. He thought Han Sen would allow him to be the one who used the light scissors.\n\nAs Han Sen held the light scissors and looked at Sun Moon God Ape, when Sun Moon God Ape thought Han Sen was going to give him the light scissors, Han Sen’s body exhibited some changes. The light scissors released the sound of two dragon’s moaning. A black and white light was shining brightly. It turned into a pair of black and white dragons that circled Han Sen.\n\nSun Moon God Ape’s face changed. Bai King was shocked too, but his face quickly returned to normal. He laughed. “Godfather Han really is very unique. You have mastered time element powers.”\n\n“Just a little bit, but it was enough to use the scissors,” Han Sen coldly said. He put away the light scissors.\n\nThe light scissors were very strong, but they also cost a lot of power. Han Sen had just used them for a moment, and he already felt tired.\n\nSun Moon God Ape thought he would be the one to use the light scissors, but now there was no chance. He felt depressed. He was buzzing as he asked, “Why is that Dollar not here yet? Is he afraid of killing Moment God? Did he not dare come?”\n\nHan Sen looked at Bai King. He laughed and did not ask anything. It was unknown what he was thinking in his heart.\n\nHan Sen thought, “Although Bai King does not know Han Sen and Dollar are the same people, thinking he won’t suspect our relationship, perhaps he will think of something. This co-operative effort might be to test us. Fortunately, Bao’er can make use of the sunglasses. Otherwise, Bao King is sure to think of something.”\n\nAt this time, the few people saw Bao’er, in the shape of Dollar, come flying over.\n\n“I am sorry to keep you waiting,” Bao’er said. She was learning how Han Sen spoke.\n\n“It is good that you are here,” Bai King said with a laugh.\n\n“Since everyone is here, let’s just get into the temple in case something bad happens.” Han Sen summoned the Shield of the Medusa’s Gaze. He held the light scissors and the shield as he used time area. “Good!” Bai King nodded. No one had an opinion to share. Everyone just summoned their true god weapons and god personality armaments.\n\nBao’er turned on her evil lotus bai sema and sky bone armor. Her body shone with a purple light. It displayed a knife light that was like a saw. It covered her entire body.\n\nBai King summoned his God Spirit’s spirit body. Sun Moon God Ape and Space Spirit had their weird faces. Clearly, they had powerful power protection. Everyone used their powers before they approached the god temple because they were afraid that when they faced Moment God, they would not have the chance to bring out their gear.\n\nAfter preparing, everyone entered the god palaces.\n\nOnce they entered the realm of the god palaces, many creatures of the universe turned their attention to them.\n\n“Huh? Isn’t that Dollar? He is going to the god temple to kill a God Spirit again.”\n\n“Why is Bai King with Dollar?”\n\n“Whoa! Godfather Han Sen is there too. Last time, Moment God blew him up. He has dared to come back.”\n\n“Those two xenogeneics are not normal. It is such a powerful team. Which God Spirit are they going to challenge? It must be a Disaster class one.”\n\n“What Disaster class? Dollar was able to kill a Disaster class God Spirit by himself. Who needs Bai King and Godfather Han, those elites, all to fight together? I am afraid the God Spirit they are going to kill is an Annihilation class one.”\n\nMany scary elites in the universe were looking at Han Sen and the others make their approach.\n\nIn a palace on a red dwarf planet, the woman who was wearing a red qipao and using a red umbrella was looking at the sky. She gently said, “Master, Han Sen is going to challenge Moment God again. Should we go and do what Han Jinzhi told us to do?”\n\n“Do you think we should follow what he told us to do?” Human King sat on the throne. He looked as if he was smiling, but he wasn’t smiling. He watched Han Sen and the others enter the grounds of the god palaces.\n\nThe red-clothed woman was beneath her umbrella as she coldly said, “Although Han Jinzhi does not have an heir, Han Jinzhi did not have to do this. Han Sen is his great-grandson, so they will have a connection. Perhaps he is using us to help Han Sen break through the line.”"
}