{
    "chapter": 2477,
    "title": "Fighting Dogs",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2477",
    "text": "The Dragon’s groan rolled across the sky, and blood showered down like rain.\n\nLando was fighting the deified unicorn once more, but all Han Sen could see was the countless droplets of blood in the sky. They landed on the clouds and soaked into them. It was obviously Lando’s Dragon blood.\n\n“This is pretty bad. We have to find a way to escape this place.” Han Sen had tried to get out many times, but his power wasn’t enough to break the substance chains that formed their invisible prison. He would have to use his super god spirit body; otherwise, he had no chance of escaping.\n\n“Why are there no other xenogeneics or races watching us? If anyone was beyond this invisible shield, I could use my eyes to just teleport outside.” Han Sen was depressed. He kept looking around, but he couldn’t see a single creature.\n\nHan Sen guessed that someone had locked the place down on purpose. Otherwise, something would surely have come to watch the fight.\n\n“What kind of people want us dead so badly?” Han Sen shouted, turning his face up to the sky. He hoped to get some useful information from Lando.\n\n“No one wants you dead. We are just fighting bulls in an arena,” Lando’s voice echoed back. He was shockingly calm. It was as if, in addition to being unable to feel pain, he could no longer muster emotions.\n\nHan Sen understood what Lando meant immediately. They had become contestants in a sport. They weren’t matadors trying to baiting bulls while onlookers cheered; they were dogs fighting in a ring.\n\nThe reason that the scary deifieds hadn’t personally killed them was simple; the deifieds were enjoying the fight itself. Whether Han Sen and Lando lived or died, someone would still be entertained.\n\nTheir desperation to survive kept them fighting, but after realizing what was going on, Han Sen wasn’t optimistic about his odds of surviving this. He wasn’t optimistic at all.\n\nNo one wanted to be a dog that stubbornly continued to fight a losing battle. But he had no choice. He was like a puppet on strings. That powerless feeling made Han Sen’s chest made it feel like he was being crushed.\n\nPang!\n\nIn the clouds, another crack had been torn in space. Lando had just been sent flying.\n\nHis body was covered in blood, and there were wounds all over him. But even so, he was still fighting. It didn’t look as if he was going to give up.\n\nLando’s eyes were clear and focused. Han Sen could practically feel his desire. It was like he was saying, “You don’t like this? Then use your power to defeat them!”\n\nBoom!\n\nLando had blood all over him, but he still gathered himself and charged back toward the deified unicorn. It looked as if he was going to fight until the last drop of blood was depleted. Lando would never give up.\n\nLando’s emotions were mirrored in Han Sen’s heart, as well. This powerless feeling made him recall everything he had been through in his life. He had so many questions. His brain was full of things he needed to have explained. But no one else could. He was looking for answers all alone.\n\nHan Sen knew no one was going to give him answers, and that was because he was too weak.\n\nLike his father, Han Yufei. He had chosen to suffer everything alone to keep his wife and children protected. And he hadn’t divulged his past to anyone, not even Han Sen.\n\nAnd that was because Han Sen was a kid with no power. Telling Han Sen would have been useless. It would only put a greater weight upon his shoulders.\n\nA father didn’t want his kids to suffer or bear a weight they were never supposed to endure.\n\nPeople other than Han Sen’s father had different motives for withholding information. Rather than trying to protect Han Sen, they simply thought he was weak. What was the point in giving secrets to someone who was weak? It wouldn’t help them at all, and it might only lead to trouble.\n\nBut Han Sen had to explore these questions because when it was dark and quiet, they ran endlessly through his mind, looping over and over again. He might hate the feeling of being powerless, but there was nothing he could do about it.\n\nWeak. Not respected. Without the authority to choose his destiny. That was all because he wasn’t strong enough.\n\nThe feelings on Lando’s face were also deep inside Han Sen’s heart. This was why Han Sen wanted so desperately to be strong. He craved those answers.\n\n“This debt… I want those f*ckers to pay me back.” Han Sen gnashed his teeth as the blood inside his body boiled.\n\nThe killing continued, and the seven unicorn Kings couldn’t suppress Han Sen any longer. He killed countless unicorns, and they screamed at Han Sen in rage. They must have really hated him.\n\nSuddenly, Han Sen saw rainbow lights pouring down from the sky. Many of the unicorn Kings tried to use their areas to shield themselves from the light. The unicorns left exposed to the light suddenly caught on fire.\n\nThe light even reached those seven unicorn Kings, and they burned under the radiance. Their bodies started to fade.\n\n“Oh no!” Han Sen thought. He saw the black unicorn scream to the sky. A vacillating area of darkness had formed outside the creature’s body. Suddenly, it was coming for Han Sen.\n\nIt now moved so much faster than it had before, so much faster than Han Sen was capable of moving. Han Sen wanted to use his Blood Eye Evil God beast soul, but it was too late. He lifted his Ghost Teeth Knife and Thunder God Spike. He positioned them in front of his chest to block the incoming strike of the black unicorn.\n\nPang!\n\nHan Sen’s body shot away like an iron ball being fired from a cannon. Blood filled his mouth, and he heaved it out in a long spray. His chest felt as if it had exploded.\n\nWhen the deified unicorn’s power had buffed the unicorn Kings, the black unicorn’s speed and power had increased. Han Sen’s second-tier Jadeskin wasn’t enough to fight it.\n\nBefore Han Sen’s body came to a stop, two white lights blazed from the white unicorn King’s eyes. They broke Han Sen’s body.\n\nHan Sen’s body exploded like water, but he quickly recoalesced. Han Sen’s body regained its familiar features once again, but Han Sen’s face looked very pale.\n\nHe had his Original Water King Body to save his life, but he was still injured. Now that the unicorn Kings had been buffed up by the deified unicorn, Han Sen was no longer a match for them.\n\n“The deified unicorn’s buff is so scary! If he did that to me, how powerful might I become?” Han Sen’s face cycled through expressions.\n\nNow the purple and gold unicorn Kings were coming Han Sen’s way. Their scary area powers created fusiform shields. The different-colored shields had different powers.\n\nThe next second, the purple and gold unicorn Kings hit Han Sen, crushing his body."
}