{
    "chapter": 2201,
    "title": "Three Jade Drums",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2201",
    "text": "Stephen and Sonic Butterfly King kept talking as they completed their registration. Even Kings had to follow the rules of the Thousand Treasures.\n\nThe Thousand Treasures rarely had any conflict with those of other races, but their powers most certainly positioned them in the top ten races of the universe. Many suspected they could easily land a spot in the top five.\n\nStephen and Sonic Butterfly King readied themselves to leave, when suddenly a man and a woman entered the base. With them was a little girl. The two Kings frowned upon seeing them.\n\nThey hadn’t noticed that the man was Han Sen, but they felt the presence of the Jade Drum that Huangfu Jing was carrying. They frowned at her sternly.\n\nSince they had to register their Drums, there was no point in trying to hide what they had found.\n\nAnd in regards to the Thousand Treasures, they wouldn’t help a customer hide their Jade Drum, either. The Thousand Treasures wanted the universe to know every time someone found a Jade Drum on Planet Jade Drum. It would be very good for their business. So Han Sen and Huangfu Jing carried their Jade Drums openly.\n\nSince they were going to register their drums, they didn’t have to hide their identities, either. Every Jade Drum claimed would be advertised. So, Han Sen took Huangfu Jing to register their findings right away.\n\nSonic Butterfly King and Stephen saw Han Sen and Huangfu Jing approach the registration booth. They kept staring at Huangfu Jing’s bag. They could sense the Jade Drum inside, but they knew they couldn’t be 100% certain that’s what it was until they saw it.\n\nWhen Huangfu Jing took her Jade Drum out of her bag, the Kings sucked in a sharp breath of air.\n\n“A Jade Drum… That’s a Jade Drum!” Those of the other races saw Huangfu Jing reveal a Jade Drum, and many of them couldn’t keep themselves from shouting.\n\n“It has been a year since the last Jade Drum was found.”\n\n“Look at her presence. She is a Marquise at the very most. I can’t believe she was lucky enough to find one of those legendary Jade Drums.”\n\n“Haha! Is this good luck or bad? It will be difficult to determine. Things don’t always go well for a Marquise who finds a Jade Drum.”\n\nAll the Kings were talking quietly amongst themselves. The workers in the base were just as surprised to see the Jade Drum, as well. But they still registered it to her like it was nothing out of the ordinary.\n\nDoing business with the Thousand Treasures was reliable. They had even sold deified treasures before. Nothing bad ever happened in one of their places of business. They wouldn’t try anything underhanded to attempt to secure a Jade Drum.\n\nThey followed their procedures and protocol as was customary. Huangfu Jing handed in her access ticket, then struck her Jade Drum. After the registration was complete, the Jade Drum was confirmed to be an official possession of hers.\n\nStephen could not help himself from walking over to Huangfu Jing and asking, “Friend, are you selling that Jade Drum of yours?”\n\n“Sorry, I don’t plan on selling it,” Huangfu Jing said.\n\nShe was just an Earl. A Duke Jade Drum could be very beneficial to her, and it would be much safer for her to explore with it in tow. Killing xenogeneics would be much easier, as well. Huangfu Jing had no intention of selling it.\n\nOf course, that was also because no King planned on attacking her just yet.\n\nStephen frowned, but he wasn’t going to give up so easily. He went on to say, “Do not reject my request just yet. I am Stephen from the Naga. Give me your sum. Name any price. I won’t try to haggle you for a bargain.”\n\n“Sorry.” Huangfu Jing did not move a muscle, save to give him her quick answer of no.\n\nStephen’s face looked dire. So, Sonic Butterfly King came forward and said, “Kid, it won’t be easy to look after a Jade Drum. I can trade you my Duke-class Eight Sonic Butterfly for it. And on top of that, I will keep you safe. What do you say to that?”\n\n“Sorry.” Huangfu Jing’s answer was still the same cold response.\n\n“If you do not sell it right now, you will regret it the moment you set foot off of Planet Jade Drum. But by then, it will be too late. If you want to sell it, now is your chance.” Sonic Butterfly King’s face did not change during his speech. He smiled.\n\nHuangfu Jing ignored him and stepped away.\n\nSonic Butterfly King started to step closer to tell her something else, but Han Sen walked in front of him and said, “My friend told you she isn’t interested in selling it. Please ask someone else.”\n\nSonic Butterfly King’s expression turned to stone. “How dare you interrupt my talk with her?”\n\nHan Sen shrugged silently. He moved to the registry booth and revealed his own Jade Drum.\n\n“Another Jade Drum!” Everyone in the base was shocked. No one could have expected that two Jade Drums would be found on the same day.\n\nSonic Butterfly King was flabbergasted. He did not expect Han Sen to have a white Jade Drum, as well.\n\nThe workers looked very surprised. They completed the registration for Han Sen, indicating it now officially belonged to him.\n\n“Are you selling your Jade Drum? What I promised her will still apply to you, if you are willing to engage in such a transaction.” Sonic Butterfly King looked right at Han Sen when he spoke.\n\nHan Sen ignored him, which prompted Stephen to follow up. He said, “Friend, if you are selling the Jade Drum, I will pay a high price and keep you safe. You can name your price. Anything you wish.”\n\n“Sorry, but I have made no plans to sell it,” Han Sen answered, rejecting his offer.\n\nSonic Butterfly King looked gloomy, but before he said anything further, his eyes opened wide. He saw Han Sen bring out another Jade Drum.\n\nThis Jade Drum looked very strange. There were some red symbols across it, and it looked very different from the average Jade Drum.\n\n“It’s a… another Jade Drum… How is that possible?!”\n\n“D*mn! It looks like they are together. They found three Jade Drums. Did they find a special Jade Drum mine?”\n\n“This luck is truly crazy. They have managed to obtain three Jade Drums.”\n\n“That third Jade Drum looks wrong, though. It’s different than a normal one. It cannot be a mutant one, can it?”\n\n“If it is a mutant Jade Drum, then it will be worth a lot. We know that normal Jade Drums can become King class, but a mutant Jade Drum might go even higher.”\n\n“That is extremely lucky. It is too lucky. I’m sure such luck will result in a disaster for them shortly. They look low-level, but they have each earned a Jade Drum. Oof. They are very dead.”\n\n“That is not luck! That is pure danger.”\n\n…\n\nAs everyone discussed this, Stephen and Sonic Butterfly King stared at the Blood Scorpion Jade Drum, seething with greed. They didn’t even blink. The mutant Jade Drum was so exceptionally rare that it wasn’t seen more than once every ten thousand years. They could have been items that were higher than King class. Even King class people treated them like treasures.\n\n“I am sorry, sir. According to the rules of the Thousand Treasures, every creature can only take one Drum with them. You have already registered one…” the worker said to Han Sen.\n\n“I know. This Drum isn’t mine. It belongs to my daughter.” Han Sen pointed at Bao’er, and then he passed her the Blood Scorpion Jade Drum.\n\n“Then, we will have to see her play it,” the worker said, clearly not believing Han Sen. The worker looked back and forth between Bao’er and the Jade Drum.\n\n“Does she have to hit the Drum here?” Han Sen asked.\n\n“Yes. Those are the rules.” The worker nodded with absolute certainty."
}