{
    "chapter": 1682,
    "title": "Crisis",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1682",
    "text": "“Officer, Black Tiger and Lou Jia have been killed. Their operations failed. But, Han Sen entered Ancient Devil’s path of ascension and made it into the Alliance. Surely that can allow us to confirm that he is the heir of Han Jinzhi, yes? He could be protecting his family also, explaining why the two operatives were killed.” A man spoke to the officer with anger.\n\nThe officer did not say anything in response. He merely closed his eyes and retreated into thought.\n\n“Officer, we cannot delay. We do not have enough people and geno armors to spare. If we don’t strike the Han family now and force Han Jinzhi out, we will never get back the item.” The man gritted his teeth. “I am willing to take the team now and grab the Han family. I can draw Han Jinzhi out.”\n\nThe officer still did not say anything. He looked at the man coolly and said, “Yake, you are too impatient. You need to look beneath the surface.”\n\n“Officer, with things as they are, do you continue to believe Han Sen may not be related to Han Jinzhi? If he is not the heir of Han Jinzhi, how can he possess such power? How were Black Tiger and Lou Jia killed?” Yake demanded angrily.\n\nThe officer responded calmly, saying, “It seems like he is Han Jinzhi’s heir, but there is still something suspicious about it all.”\n\n“What is that?” Yake asked with an annoyed look.\n\n“If Han Jinzhi faked his death, why would he still go by that name?” the officer said.\n\n“Arrogance. He thinks the closer he is to danger, the further away from harm he is,” Yake answered.\n\nThe officer shook his head. “If that makes sense, then tell me: does it look like Han Sen has it?”\n\n“His body is strange…” Yake said.\n\n“He is strange, yes. But he does not have anything similar to that thing,” the officer said with a hard voice.\n\n“Perhaps Han Jinzhi has employed a trick to hide the item,” Yake continued to argue.\n\nThe officer sighed. “Yake, you know how precarious our situation is. If Han Sen is not an heir of Han Jinzhi, he would be a great help to us. He would be better-off alive.”\n\n“No way! He is Han Jinzhi’s heir. And if you aren’t going to do anything about it, I will do it myself. He has only just leveled up, so he’ll be in his weakest state right now. We can grab him with ease!” Yake spoke surely.\n\nThe officer frowned. “You have forgotten about Black Tiger and Lou Jia’s deaths already? Even if he is weak, he has someone to protect him.”\n\n“I will go with Rudy. If Han Jinzhi appears, I will kill him and take it back,” Yake growled.\n\n“We should wait. We should find out what Han Sen’s relation to Han Jinzhi is first,” the officer said.\n\nYake slammed the table and said, “Officer, we have paid an enormous price already! Snake Witch, Black Tiger, Lou Jia, and two geno armors have been lost! I cannot allow another fruitless sacrifice like that. I will get rid of the Han family, no matter what it takes!”\n\nAfter that, Yake left the hall.\n\nThe officer did not say anything more. He merely watched Yake leave.\n\nHan Sen was holding Littleflower atop the garden, sunbathing. Little Angel was scouring Skynetfor all sorts of information.\n\nLittle Angel was like a real human now that she had been given her body, and she was very interested in activities that were associated with Skynet. She watched many TV shows and played many video games.\n\nShe was not interested in true, proper knowledge. Games and the telly were all that snared her attention.\n\nShe was watching a TV show currently, while also playing God’s Hand. She only needed one hand to beat a hardcore player.\n\nGolden Growler lay on a chair next to Han Sen. As he lounged, he was drinking from four separate glasses at the same time. A straw ran from each one to his mouth.\n\nHe was also wearing sunglasses. The gold hair looked particularly good that day.\n\nBao’er and Zero had gone with Ji Yanran on some errands. Han Sen was afraid Ji Yanran might be in danger if she was left alone, and so he allowed Bao’er to go with her. He was confident in her strength now.\n\nHan Sen leaned back and looked off into the distance. He saw someone land on the top of a building tower that belonged to him.\n\n“Blind Man, good timing. I’ve been looking for you.” Han Sen was shocked, not expecting Blind Man to seek him out that way.\n\nThis was not usually his M.O., but that was okay. Right now, Han Sen really wanted to see Han Yufei. He needed to inform him of the consequences of producing geno armor.\n\n“Later. Listen to me first.” Blind Man looked serious.\n\n“Okay, go ahead.” Han Sen nodded.\n\nBlind Man did not beat around the bush, and he dove straight into the subject. He said, “God’s Organization has decided to get rid of you once and for all. Many elites will come, and so will your father.”\n\n“What did he say?” Han Sen asked.\n\n“Now that you are here, you cannot return to the sanctuary. You have to fight. He hopes you are sufficiently prepared, and\n\nasks that you send your Mom and Little Yan to hide in the sanctuary.” Blind Man looked apologetic as he spoke.\n\nHan Sen knew what all this meant. Han Yufei was not confident even he could win the fight that was coming. This was the best plan he could come up with.\n\n“How many elites do they have? How many geno armors?” Han Sen was surprisingly optimistic.\n\nHan Sen may have been weak, but he had a geno armor of his own. With Little Angel, Golden Growler, and Bao’er at his side, the four geno armors in total would prove a force to be reckoned with.\n\nFurthermore, Stay Up Late was there, and he lived with Han Sen. And he frequently watched over him. Han Sen had no doubt that the crystallizer would lend a hand if it came to a fight.\n\n“God’s Organization asked the New Community for aid. We don’t know how many people or geno armors they have, but after last time, we estimate they will bring at least three.” Blind Man looked glum."
}