{
    "chapter": 2690,
    "title": "Scary Primitive Deified Xenogeneic",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2690",
    "text": "Jail Demon Hall had been built for that xenogeneic. When Han Sen entered it, he couldn’t feel the restrictive effects.\n\nThe hall’s architecture was incredibly strange. The floors of an ordinary hall were usually flat or subtly sloped as they led up toward a stage. Inside this hall, however, all four sides of the hall led down a series of broad steps to a ten-meter-long stone platform at the bottom.\n\nThe stone platform was covered in symbols that Han Sen had never seen before. Although he had no clue what they meant, he could sense a strange power coming from the runes.\n\nAn ink-black stone pillar sat in the center of the stone platform, and it ran all the way up to connect with the hall’s ceiling. The upper portion of the pillar was covered in engravings and markings, but Han Sen’s attention was instantly drawn to the pillar’s base, and to the creature that had been bound there.\n\nThat creature looked vaguely humanoid, but the body was insectile. Its shell was blood-red, and a red horn rose from its head, making it look something like a unicorn. Its eyes also flashed with a bloody, crimson color. It was full of rage and murderous desires.\n\nWhile Han Sen observed that trapped creature, the creature stared up at Han Sen, too. It suddenly opened its mouth and revealed the jagged, saw-like teeth that adorned its maw. It let out a high-pitched scream at Han Sen.\n\nIt began to thrash around violently, and when it moved, the markings across the stone pillar lit up. The chains attached to the pillar also began to glow. They tightened their grip on the creature, making it harder for the furious being to escape from the stone pillar.\n\n“It really is a primitive deified.” Upon seeing the red substance chains appearing around the creature, a delighted expression crossed Han Sen’s face.\n\nOuter Sky had many xenogeneics, but most of them were very frightening. It would have been too risky for Han Sen to go out and pick a fight with some random xenogeneic. Now, a primitive deified xenogeneic had been handed to Han Sen on a platter. Han Sen was extremely pleased with the way this was turning out.\n\nHan Sen donned his Apollo Set, and then, the Apollo Wings fluttered slightly. They sent him zipping toward the stone platform in an instant. He turned his hand into a knife and slashed at the xenogeneic bound to the stone pillar.\n\nHan Sen was still using Under the Sky, but with the extra strength that the Apollo Set was giving him, a frightening substance chain knife air was unleashed as he activated the skill. His attack was like a sunlight blade as it came down against the xenogeneic’s neck.\n\nThe xenogeneic hissed like a viper, and its red substance chains exploded like a volcano. It broke free of the restraints of the stone pillar, and its talons flashed toward Han Sen like red blades.\n\nKatcha!\n\nHan Sen’s knife air was as strong as the strike of an ordinary primitive deified, but against that xenogeneic’s claws, Han Sen’s attack didn’t stand a chance. Before Han Sen could even attack, the creature had brushed aside his attack and rushed within striking distance.\n\nThe hand knife and the claws collided. The claws left deep cuts across Han Sen’s gauntlet. Three bloody scratches across his hand before to ooze blood. Fortunately, Han Sen was able to react quickly. He abandoned his attack and then teleported away. If he hadn’t reacted instantly, the creature’s blow would have amputated his hands.\n\n“Why is it so strong?” Han Sen wondered in shock.\n\nHe had just finished teleporting away when the xenogeneic was in front of him again. Its claws came down on his chest, cutting straight through the Apollo armor like it was made of butter.\n\nThe wings of the Apollo Set flapped. Han Sen quickly retreated, putting more distance between himself and the xenogeneic. But there was a glow of bloody light around the creature’s body, and it came for him again like a rocket. Its speed was unfathomable, and again, its claws were digging into Han Sen’s chest. The red substance chains became claw-like lights, and they carved five grooves deep into Han Sen’s chest. His ribs were almost visible through the wounds.\n\n“Is this guy really just primitive?” Han Sen muttered in consternation. He used Under the Sky and teleported rapidly as he attempted to get ahead of the xenogeneic.\n\nBut it was a futile endeavor. The xenogeneic seemed to predict every movement Han Sen sought to make. Han Sen had only just moved away when the xenogeneic was in front of him again.\n\nHan Sen screamed, his voice strained. A talon had perforated his stomach. If Han Sen hadn’t teleported away fast enough, his guts would have been strung across the floor.\n\nHe was fortunate that the Apollo Set was a deified treasure. But even so, beneath the sharp claws of that malevolent xenogeneic, it seemed no stronger than wet tissue. It didn’t have the defensive properties that a deified set of armor should have given him.\n\nHan Sen no idea what to do. Although he was fighting a primitive deified, it was only a doppelganger. His true opponent, the real body controlling the creature before him, was a scary true god deified.\n\nThis body was just a doppelganger, but it was undoubtedly the best that a deified could be at primitive class. It was in a whole different league than Shale, who had just become a deified.\n\nEven more frightening, its will and its movements were true god class. Han Sen was very proud of his will and power, but before a true god, his capabilities were measly. He was borrowing power from the Apollo Set so he could fight at a deified level, but he still couldn’t endure the xenogeneic’s attacks.\n\nEvery Very High that came to defeat this doppelganger would usually encounter a larva deified for them to kill. Transmutation class deifieds would still take a long time to kill.\n\nExquisite and Li Keer had told Han Sen this was only a primitive deified. They hadn’t told him how scary the creature was, though. Once Han Sen realized how powerful it was, he knew he shouldn’t push his luck and continue trying to fight it. He used his teleportation abilities to escape Jail Demon Hall. The attacks he had already survived had left him bloody and injured. If he kept going, there was no doubting the fact he would end up dead.\n\n“Is that xenogeneic really a primitive deified?” Han Sen asked, still clutching the wound in his belly. He looked at Li Keer and Exquisite with suspicion.\n\n“It is true. It really is a primitive class deified, but he is the greatest primitive deified alive. We thought that with your power and will, you could fight it. That is why we signed you up to take it on. I can only suppose we were too hasty,” Exquisite said, making sure that her voice sounded quite serious. Her facial expression was a carefully-crafted mask of disappointment. In her heart, she was actually thinking, “It is good for you to suffer failure every now and again. We don’t want you getting too cocky in the future.”\n\nLi Keer provided her own sort of comfort. She smiled and said, “Losing here is perfectly understandable. After all, you aren’t yet deified. Not being able to beat that fiend means nothing. How about this? We will find weaker deified xenogeneics that are easier for you to defeat.”\n\nHan Sen knew Li Keer and Exquisite wouldn’t be lying to him about this stuff. If they said that the xenogeneic was a primitive deified, then it probably was.\n\n“That xenogeneic really was strong.” Han Sen paused, observing Exquisite and Li Keer. Then, he said, “Is there a time limit to kill this xenogeneic?”\n\n“It will take six months for the Jail Demon Hall’s xenogeneic to build up enough power to escape its prison. Usually, our people try to kill it within three months, just to be on the safe side. If it escapes and gets in contact with the other xenogeneics in Outer Sky, it might be able to save its true self,” Li Keer said.\n\n“If there is still time, then I will try to defeat it again.” Han Sen didn’t want to just give up."
}