{
    "chapter": 1247,
    "title": "Shapeshifting Knight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1247",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThere was a lake before them, one that was illuminated by glowing algae that glinted along the surface. Due to it being dead water, it was too murky to see what lay below.\n\nHan Sen activated his Dongxuan Sutra and scanned the lake. At the center of the lake, he was able to detect something strong. It was almost frighteningly strong.\n\n“What was the super creature you two saw?” Han Sen asked.\n\nDry Bone King answered, “Let me ask Ghost Eye; the eye of his namesake is better than mine.”\n\nHan Sen waited for him to ask Ghost Eye.\n\nAfter Ghost Eye performed a pointing gesture, Dry Bone King turned back to Han Sen and said, “He described it as being seven meters long. It carried a purple shell on its back. He wasn’t entirely sure what it was, but he was clear that it had the power of a super creature.”\n\nHan Sen noticed the lake was three miles in length, so drawing something out from the murky pool would be difficult. And if he had to bring the fight to the super creature and battle it in the water, that wouldn’t be easy.\n\nHan Sen wished he had brought Water Fairy with him, as that would have made things much easier. But then again, he reassured himself, it was just a super creature. The three of them should be able to sort it out, no problem.\n\n“Dry Bone, use your heartbone. Perhaps your musical talents can scare the fiend into leaving the water,” Han Sen said. With the water being as dirty as it was, he did not fancy dipping his toes in it.\n\n“Okay.” Then, Dry Bone King pulled out his heart and began to pound it. Shortly after, ripples began to form at the center of the lake.\n\nThey waited a bit, but nothing further occurred. So, Dry Bone King got back to playing and went along with a disturbing melody.\n\nThe lake continued to quiver, and eventually waves began to form.\n\nBao’er covered her ears to block out the wretched sound.\n\nThe heartbone did not actually hurt Bao’er; she was just a musical aficionado of refined tastes. She thought the music being played was downright diabolical.\n\nHan Sen frowned. Despite the increased number of waves, the super creature was reluctant to exit the lake.\n\n“Don’t you have any better songs to play than that?” Han Sen asked.\n\n“Not really. I use it to disturb the lifeforce of my enemies; I didn’t invest time in learning any more melodies. It’s not like I want my foes to be dancing the mamba,” Dry Bone King said.\n\n“I could teach you a thing or two about the musical arts, let me tell you. Look at Bao’er’s face; that is the face of a soured critic. How do you expect to draw a super creature out of the lake with that awful tune?” After Han Sen said this, he played a melody he used to like when he was small.\n\nDry Bone King paid attention and tried to learn the melody Han Sen played for him, then he tried to copy it.\n\n“Dong! Dong! Dong-Dong! Dong! Dong! Dong-Dong!”\n\nBao’er was slowly able to remove her hands from her ears.\n\nAnd suddenly, the water at the center of the lake began to whirl. A purple shadow rose amidst the turmoil.\n\nHan Sen squinted and saw that it was a seven-meter-long lobster. It waved its pincers towards the lakeshore crowd.\n\nBao’er’s eyes were wide open, but not in fear or surprise. In fact, she looked hungry. She looked as if she wanted to eat the lobster.\n\nSeeing the lobster come towards them, Han Sen summoned his Disloyal Knight. Han Sen put the Twin Thunder Knight beast soul on Disloyal Knight, and fortunately, it did not seem limited to the thunder element.\n\nDisloyal Knight’s body immediately displayed a number of changes. His copper armor turned blue, as did the light of his halo. It was like a neon, fluorescent cyber halo now. Furthermore, the soft image of his halo had changed to look like a circular saw, with jagged edges representing the lightning that now fueled him.\n\nDisloyal Knight used his lightning halo on the lobster, and immediately after, the lobster itself started to turn blue.\n\nIt was slower and weaker now, to the point where it was starting to look paralyzed. But it wasn’t enough to disable the lobster entirely, as it was still able to leap into the air and attempt to strike Disloyal Knight.\n\nIts pincers were like garden scissors, spreading wide to cut him in two.\n\nDisloyal Knight looked like a rocket immediately after launch. He kicked up a sandstorm behind him as he flew upwards.\n\nPang!\n\nDisloyal Knight flashed like lightning himself. He soared past the pincers with ease.\n\nDisloyal Knight then returned to pummel the lobster’s head numerous times. Lightning began to fizz and crackle against its weakened carapace as the lake-emerged super creature’s movements became duller and duller, to the point that it appeared to have passed out. Unable to dodge, all the lobster could do was submit to getting pounded.\n\nWith lightning powering his fists, Disloyal Knight punched the lobster over and over without reprieve. The seafood nemesis had no chance of fighting back. In the end, Disloyal Knight was able to break open the entire shell of its head and mangle the brain inside its fleshy scalp.\n\nHan Sen was shocked as he witnessed the scene. He could hardly believe Disloyal Knight was able to do that all by himself.\n\n“Super Creature Lake Lobster killed. No beast soul gained. The flesh of this creature can be consumed, and you may also harvest its Life Geno Essence. Consume its Life Geno Essence to gain zero to ten super geno points randomly.”\n\nHan Sen was delighted to hear this announcement.\n\nAfter combining with Twin Thunder Knight, Disloyal Knight had received a great buff. The effectiveness of his halo, in particular, had increased immensely."
}