{
    "chapter": 2434,
    "title": "Weird Girl",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2434",
    "text": "Han Sen felt something very powerful coming his way. His body leaned back reflexively, trying to get away from it. The blonde girl leaped on top of him.\n\nMiss Mirror didn’t move as the girl jumped and wrapped her arms around Han Sen’s neck, her weight slamming into his chest and taking him to the ground. They both became entangled, just as the fifth picture on the screen had shown.\n\nHan Sen had prepared himself for the inevitable fight, and as they fell, Han Sen’s eyes started to turn white as he summoned his super god spirit body.\n\n“Big brother… Wan’er has been waiting for you to come back!” The blonde girl was riding Han Sen hard, and she now wore a beautiful smile. She clutched his face, lowered her head, and kissed Han Sen on the forehead.\n\nHan Sen was stunned. He didn’t know what was going on, but the glowing white in his eyes started to recede.\n\nHan Sen was still trying to summon his super god spirit body, but it vanished after the girl kissed him.\n\nSomething else disappeared, too; the blonde girl’s golden light rapidly faded into nothing. The blonde hair that had shone like a sun was now like a fire that had been extinguished. It darkened until she had a full head of black hair. Even her golden pupils were now as dark as ink.\n\n“I can finally be with big brother again.” Wan’er pulled herself back upright, sitting on Han Sen’s chest. She looked at Han Sen with her beautiful smile.\n\nThat sweet and happy smile made Han Sen freeze. At that moment, she looked so incredibly innocent.\n\nThe next second, her eyelids fluttered closed. She looked soft as she slumped down on Han Sen’s chest, and a few seconds later, she lost consciousness.\n\n“Hey, hey. Lady, you have it wrong. I’m not your big brother.” Han Sen shifted the girl who referred to herself as Wan’er, sliding his arms under her as he climbed back to his feet.\n\nHer skin appeared smooth, and it was very soft. Han Sen could no longer feel her scary presence and power. Her lifeforce had dropped to a tiny fraction of what it had been. Now she was as weak as a commoner in this universe, or perhaps even weaker.\n\nIf Han Sen hadn’t seen her transform with his own eyes, he never would’ve imagined that this black-haired girl was the blonde girl who had taken out the deified Night Wind in a single blow.\n\nHan Sen realized that the tattoo of the Nine-Life Cat on her back was now gone. The skin of her back was smooth and white as if the tattoo had never existed in the first place.\n\n“What is going on?” Han Sen frowned. When he scanned the girl, he confirmed that she had passed out, but she was still alive. Her lifeforce was so low that it was concerning, however. It was hard to imagine how she had been able to blast out the scary power she had used earlier.\n\n“Lady, wake up!” Han Sen pressed his finger to her lips to see if she really was in a coma or if she was just pretending instead.\n\nBut he quickly pulled his finger back, startled. The girl Wan’er didn’t wake up, and her pink skin was bleeding where Han Sen had pressed his finger, as if her skin was fragile and paper-thin.\n\nHan Sen hadn’t even used strength. With the strength she had previously demonstrated, there should have been no way for Han Sen to leave a mark on her body, even if he used his full strength. But he had just slightly tapped her lips, and now the skin was broken and bleeding. She was no longer what she had been when she first woke up.\n\n“What is this? What’s going on with her?” Han Sen looked at the girl weirdly.\n\nMiss Mirror eventually got back to her feet. She picked up the broken sword and tried to stab Lady Wan’er.\n\nHan Sen tightened his arms around the girl and dodged. Miss Mirror directed a hard stare at him. “What are you doing? Now is the best time to kill her. If she wakes up and becomes that blonde b*tch again, we won’t be able to kill her. Then we’ll be the ones to die.”\n\nHan Sen frowned and looked at the girl. He had thought about doing this, as well.\n\nHe knew Miss Mirror was right. The girl’s body was like that of an average person right now. A random strike could kill her. This really was their best chance.\n\nIf she woke up and engaged her blondie mode, he and Miss Mirror would be unable to touch her. They might be in grave danger.\n\nIn the sixth picture, there were only two faceless people. That meant one of them was gone. If they didn’t kill the blonde girl now, that meant one of them would have to die. What happened next might be a conflict between Han Sen and Miss Mirror.\n\nBecause of all these things, killing the girl really seemed like the best choice. It would certainly sort out many of their current troubles, and it could heighten their chances for survival.\n\nBut Han Sen still hesitated. What Wan’er said to Han Sen before she fainted made him think. He didn’t think he was actually Wan’er’s big brother, but killing a girl who wasn’t currently hostile and couldn’t fight back was something Han Sen couldn’t make himself do.\n\nAnd there was one thing that really did nag at him. His super god spirit body was supposed to be invincible, but the girl’s power had been able to cancel its activation. He was really confused about what had happened there.\n\nHis super god spirit power hadn’t been destroyed, just pushed back. Han Sen could activate the super god spirit body again, but the girl had done something that he had never experienced before. He cared deeply about what it could mean.\n\nMiss Mirror knew what Han Sen was thinking. She lifted the sword and pointed it at the girl, saying, “Don’t get fooled by what she said. She probably knew she couldn’t last long, and that’s why she said it. She wanted to give you a reason to keep her alive. Shouldn’t you know that she isn’t your real sister?”\n\n“She isn’t my sister, but I can’t do it.” Han Sen took off his jacket and covered the girl’s body.\n\nThe girl could have killed him, but she hadn’t. Han Sen knew that things were not as Miss Mirror was saying.\n\n“If you cannot do it, then I will do it!” Miss Mirror growled.\n\n“I’m sorry, but there is something I would like to ask her. Let’s decide once she has woken up,” Han Sen said as he held the girl.\n\n“You are a gentleman, but you seem to have forgotten what the sixth picture depicts.” Miss Mirror laughed darkly.\n\n“I didn’t forget. But you really don’t think that can predict our future, do you?” Han Sen asked calmly.\n\n“I don’t know if it can predict our future, but everything predicted by the prior pictures came true. We have to be careful,” Miss Mirror said.\n\nHan Sen knew Miss Mirror was correct. He sighed and said, “You should just go. Let me handle this. I will continue to explore. Even if the prophetic picture is correct, it doesn’t say that whoever isn’t in the picture ends up dead.”\n\n“You and I have exchanged minds. You know what my personality is like.” Miss Mirror didn’t move. She raised the sword and pointed it at the girl in Han Sen’s arms.\n\nHan Sen knew Miss Mirror’s personality well. She was ambitious, and that ambition compelled her to control every scenario. She wouldn’t allow others to dictate what course her future would take. Otherwise, she wouldn’t have gone to the stone fields in the first place. She only had to send Han Sen, Night Wind, or even Red Cloud.\n\n“My Lady, can’t you see that we are walking right into that prophecy?” Han Sen looked at Miss Mirror. He had never believed in the prophecy anyway."
}