{
    "chapter": 1317,
    "title": "Asura’s Betrayal",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1317",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Well, now that I know you’re on my side, I have a problem you might be able to help me with.” Han Sen went on to tell Dragon King about the coming siege Moment Queen had reported.\n\n“Are you saying the entire Third God’s Sanctuary is against us? And who is Godslayer Luo, anyway?” Dragon King asked, with widened eyes.\n\n“He was a human who slaughtered a bunch of spirits in this place,” Han Sen explained succinctly.\n\n“Are you sure? How could he have triggered the ire of so many emperors if all he did was go about killing and conquering, very much like what you have done?” Dragon King thought it was quite strange.\n\nHan Sen admitted, “I don’t know the full story behind it, I’ll be honest. But to make so many spirits and emperors hate him, he must have done something far worse than kill a bunch of pompous spirits. This is unusual, I’ll confess.”\n\n“This…” Dragon King did not believe he was hearing the truth. That wasn’t to say he believed Han Sen was lying, mind.\n\nHan Sen then slowly started to say, “I have heard that Godslayer Luo wields the power of Asura.”\n\n“Pah! Don’t feed me that cowpat. I’m the only person in existence who knows the true power of Asura,” Dragon King said, with confidence.\n\n“Isn’t it the Asura Sutra? And you’re the sole one? How can you know, but not the other generals?” Han Sen asked.\n\n“The Asura Sutra is…” Dragon King’s talk suddenly trailed off. When he resumed his speech, he said, “How dare you! Stop trying to trick me into telling you. This Godslayer chap couldn’t have the power of Asura, because he isn’t Asura.”\n\n“The Asura Sutra isn’t even that good. Zero learned it, and all she did was go a little hyper and kill a spirit. That’s what has prompted all the other emperors to take up arms and go after her. It’s a little too much of a coincidence, though, don’t you think?” Han Sen explained further.\n\n“But humans are unable to learn the Asura Sutra,” Dragon King said, resolutely.\n\nHan Sen then went to find Zero and bring her before Dragon King so she could demonstrate the Asura powers she could wield.\n\n“Impossible! Impossible. Impossible! Impossible. Impossible! How are humans able to practice the Asura Sutra?! Impossible. Impossible! Impossible,” Dragon King repeated, as if the shock had thrown him into a daze.\n\n“Godslayer Luo’s Falsified-Sky Sutra is practically the same as the Asura Sutra,” Han Sen told him.\n\n“You’re talking crap.” Dragon King refused to believe what he was hearing.\n\nHan Sen smiled and said, “I have a blood relation with Godslayer Luo; I am the true heir. It isn’t Zero. And I have read the Falsified-Sky Sutra and I can confirm, 100%, they are one and the same.”\n\nDragon King didn’t even say anything in response to this claim.\n\nSo, Han Sen spoke again, telling him, “My sister has practiced the Falsified-Sky Sutra, and I have seen her use it in action. The powers are the same, and now, I have a personal stake in all this trouble. The last thing I want, when she comes here to the Third God’s Sanctuary, is for her to suffer what I am about to go through. I don’t want emperors looking to bully her because of a skill she possesses.”\n\nDragon King appeared to be conflicted, but shock was the prevailing emotion. And he was feeling so much shock, he could hardly speak.\n\nHan Sen went on to say, “In the Alliance, there is another race of beings. They aren’t human, and they are whom we call shura. The Falsified-Sky Sutra was retrieved from a tomb belonging to one of their perished kings.”\n\nDragon King finally responded, and he asked, “What do they look like? These… shura?”\n\nHan Sen described their appearance, and Dragon King’s face distorted.\n\n“Can you tell me if there is a relation between the shura and this stuff?” Han Sen asked.\n\nDragon King told Han Sen, “I don’t know why I…”\n\n“If you don’t help me find a solution to this problem of ours, it’s us versus the rest of the sanctuary. We’re both in the same boat here,” Han Sen said.\n\nDragon King nibbled his lips before talking again. “Okay, tell me what you want to know. Personally, I don’t think anything I tell you will be of any service, but if peace of mind is enough, then I am here for your elucidation.”\n\n“Tell me what you can, then,” Han Sen said.\n\nDragon King sighed and said, “Fine. Even if didn’t tell you, the truth would have to come out eventually.”\n\nDragon King went quiet for a while, as if he was composing what he was about to say. Then, after a period of silence elapsed, he said, “You were right. Mister Ancient Devil summoned a demi-god with a Demi-God Geno Core, but you were wrong in the suggestion that he used us as the sacrifice. He was able to summon the super creatures and spirits necessary, but that aside, he required my help.”\n\n“Help?” Han Sen did not understand what help Dragon King could provide, or if the summoning of a demi-god even required help when he was able to do it so simply.\n\nDragon King said, “I told you that demi-gods will help you after being summoned. But, as with all things, it depends on their mood on that particular day. And what’s more, Ancient Devil Emperor did not summon a demi-god for aid.”\n\n“What did he want, then?” Han Sen had a guess in mind, but he still wanted to ask for confirmation.\n\nDragon King said, “He wanted to kill the demi-god and take the core for himself.”\n\nHan Sen was able to guess this, but still, hearing that was what Ancient Devil Emperor wished to do was rather unnerving to hear.\n\n“And what happened then? Did he succeed?” Han Sen asked.\n\n“Of course,” Dragon King paused, and then went on to say, “Well, success is all relative.”\n\n“And what is that supposed to mean?” Han Sen frowned.\n\n“Mister Ancient Devil did trick the demi-god, but it wasn’t him who killed the summoned one. And it wasn’t him who took the core,” Dragon King said.\n\n“Asura?” Han Sen was shocked.\n\n“Yes. He killed the demi-god and took the Demi-God Geno Core. That was what formed the basis of the betrayal incident you have long pestered me about.”"
}