{
    "chapter": 1323,
    "title": "One Sword One Kill",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1323",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen’s attitude had fanned the flames of the spirits’ hatred towards humans, whom most already despised. The four that had leaped forward to take him on all rushed forward to end him with one mighty, co-operative strike.\n\nA suffocating pillar of black smoke, a hefty boulder, a tornado composed of lethal winds, and a barrage of thin metal spikes all came towards Han Sen, ready to utterly destroy him.\n\nHan Sen was unable to turn back, since he had already committed to the fight and acted all pompous about it. Even if he did seek to flee, there’d be nowhere he could go, anyway.\n\nBut he knew he had to act swiftly and carefully. Taking on four emperors solo was no joke, and although those ahead of him weren’t a pre-composed team, they seemed to immediately meld together and co-operate well. Undoubtedly, they had been unified through the same desire of wanting to see the human squirm.\n\nStill, there was interest coming from the audience, in that they wanted to see how powerful he was. He had made a name for himself, so he couldn’t have been all talk. And they were keen to see how he’d respond to this sudden rush.\n\nAnd to those who had heard No God Emperor say what he had about Han Sen, their interest in the boy was tenfold. They were keen to see if he could live up to the lofty expectations established by the first Son of God.\n\nHan Sen pulled out a short sword and a longer one; Taia and the Phoenix Sword, respectively.\n\nWhen he moved, he ran towards the pointy punctures that were headed his way. When he was directly in front of them, he disappeared. He vanished in the blink of an eye.\n\nWhen Han Sen reappeared, the audience thought he was standing beside two emperors. Their initial glimpse was incorrect, for when their eyes came to focus on him again, they realized he had come before one emperor and wholly cut him in half.\n\nEveryone was shocked by this. In a one-versus-four fight, he had leaped fearlessly into the fray. Shirking a defensive formation, he jumped straight into an offense and mercilessly slew a spirit in a single strike.\n\nThe other emperors sought to fall back, realizing the grave mistake they had made. But before any of them could respond, another one was getting well-acquainted with the brutality of Han Sen’s swords. That was two down, two to go.\n\nThinking this bought them some time, the other two emperors began to flee as the screaming and squelching of their second fallen comrade rang in their ears. Daring to look back, they caught sight of the menace they had willfully engaged, and they saw Han Sen coming after them.\n\nAs if he could teleport at will, Han Sen popped up beside the third emperor and killed him with a swift flick of his sword.\n\nThe final emperor felt a chill run down his spine, and so he summoned the birth of a mountain to shield his behind. Thinking himself safe for a moment, and not hearing the sound of that stone crumbling, he turned around to take a look.\n\nIndeed, the shielding mountain had not been broken. But somehow, Han Sen was standing there, sword propped to the emperor’s throat.\n\nEven if Han Sen had gone around the mountain, it didn’t seem likely he could be that fast.\n\nAs he thought about how Han Sen had gotten to him so quickly, his thoughts began to drift. It was then that he realized he was now airborne. When he thought about why the land below seemed so distant, he belatedly realized Han Sen had hewn his head from his shoulders and sent his severed head flying through the air.\n\nEveryone was shocked at the power Han Sen could wield. They didn’t think such might was achievable, and they each and all felt a little apprehensive about their impending attack.\n\n“How can a human be that strong?”\n\n“What if he is the heir of Godslayer Luo?!”\n\n“His swordskills are impressive.”\n\n…\n\n“Is that the manner of power Godslayer Luo wielded?” Flower Empress asked.\n\n“It is not; that human is employing space and time,” the other woman on the ship said.\n\n“Wait, are you saying he uses both of those elements? And he can use them both together, at the same time?” Flower Empress asked again, with her mouth ajar in shock, hoping she had misunderstood.\n\n“Yes, but the kills aren’t 100% guaranteed like the Godslayer. That man never missed,” the woman said.\n\n“How do we beat that man, though?” Flower Empress asked.\n\nThe elements of time and space were woven into the fabric of all. Flower Empress couldn’t even begin to fathom a viable solution for how they might surmount Han Sen’s abilities.\n\n“Soon you will find out,” the woman said, before going silent again.\n\nFlower Empress was curious to learn more, but she didn’t dare ask. If the empress wished to tell her, she would have already. As such, she wasn’t going to push the subject. This empress was a strange one, after all.\n\nThe three-eyed spirit said, “The powers of space and time? Although that is not the power Godslayer Luo possessed, I would not say it is any worse.”\n\n“Fortunately, the hits are delivered by hand and do not wholly escape the watchful eye of a combatant. It is possible for an emperor to break his attack,” Gu Demon Emperor said.\n\n“And who might be able to do that?” the three-eyed spirit asked.\n\n“Him,” Gu Demon said.\n\nThe three-eyed spirit looked forward to see an emperor coming, riding atop a black dragon. He wielded two hammers and had come before Han Sen.\n\nThe three-eyed spirit looked rather happy, and he said, “Now I understand.”\n\nFlower Empress and Heavenly Empress weren’t really sure what was going on, and what might have been so special about the new challenger that had come before Han Sen.\n\n“Are you saying this emperor can break Han Sen’s power?” Heavenly Empress asked.\n\n“Yes. His name is Ming Xing, and he too wields the combined might of both space and time. If anyone can take on the human emperor, it would be him,” the woman said.\n\nFlower Empress quickly turned back to look at him.\n\n“My name is Ming Xing Emperor. I have come to kill you,” Ming Xing said coldly from atop his black dragon.\n\nHan Sen did not say anything, and he simply ran towards the dragon-rider and disappeared.\n\nHan Sen wasn’t much in the mood for talking on this day, especially when spirits were keen on recycling the same sort of rote dialogue that was supposed to be threatening. All Han Sen wanted to do was kill them and get the assault over with.\n\nMing Xing Emperor drew both his hammers and banged the two together.\n\nWhen the hammers collided, a black hole formed.\n\n“His hammers can create black holes, and Han Sen should be drawn into them as he goes. If he slips into one, there’ll be no return,” Flower Empress said, understanding the situation.\n\n“Yes, that is correct. Although the black holes are only temporary, they should be enough to trap him and forever remove him from the field of play. His body will be twisted in the broken dimension, so using space and time against Ming Xing is suicidal,” the woman explained, with further clarity."
}