{
    "chapter": 2853,
    "title": "The Conditions to Shapeshift",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2853",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen: Super God Spirit body\n\nGeno battle body: Xenogeneic (butterfly class)\n\nLevel: Deified\n\nProgress: 0/100\n\nLifespan: 2,658\n\nHan Sen looked at his information and noticed he had leveled up to butterfly. He was relieved.\n\nHe was also confused. Even though his ascension to true god level had failed, the weird changes deployed into his left eye had not disappeared. He had still managed to combine with the Extreme King’s Overbearing Eye.\n\nHe saw things in black and white. The effects were the same as they had been while he was undergoing the evolution process.\n\nHan Sen took out a mirror to inspect his eyes. He noticed there was not much difference between his left and right eye. His left eye’s pupil was darker, and the white of the eye was more brilliant. One was unable to tell the difference unless one looked closely.\n\nIt is good that nothing happened. Han Sen was not greedy. He knew he would become true god sooner or later, so there was no need to rush it.\n\nHan Sen’s heart jumped. The spell suddenly came out of his body. His xenogeneic mode had ended. Han Sen was his true self again.\n\n“Finally, I am back to normal!” Han Sen was happy. He went to have a look at his resources. He noticed his four battle bodies had also leveled up to butterfly class. It was the same as when he was in his xenogeneic mode.\n\nAlthough everything was back to normal, there was something troublesome he needed to fix. Han Sen was still with the Extreme King, so he had to maintain his identity as Holy Baby. Unfortunately, he could not become Holy Baby again, which created a serious problem.\n\n“I was so focused on leveling up that I totally forgot about that!” Han Sen felt a headache come on. He could not figure out a solution.\n\nIf Han Sen resumed being a xenogeneic, he would be recognized as Dollar. If he departed Nine-Defense Palace and people saw him, it would create chaos and turmoil for the Extreme King.\n\nWhile Han Sen was being troubled by this, he suddenly saw God appear in the Nine-Defense Palace and slowly approach him. Han Sen was unsure when God had even arrived.\n\nHe was only able to see God because of his left eye. God was actually quite far away from the palace that Han Sen was in.\n\n“Weird. God is white?” Han Sen was confused. God had harmed many creatures, which should have meant the accumulation of many crimes. Yet, Han Sen saw that God had a pure white color. There was no crime visible at all.\n\nHan Sen was speechless and thought, “I have no idea how the Extreme King’s Overbearing Eye judges crimes.”\n\nHe walked out of the palace and went straight to God. God looked at Han Sen, smiled, and said, “Congratulations, you became butterfly class!”\n\n“There is nothing to congratulate me about,” Han Sen said. “I became butterfly class, but I cannot look like a child again. The Extreme Kings will not recognize me. I do not know if I should expect trouble.”\n\n“That is easy to fix,” God said with a smile. “I can teach you a shapeshifting geno art. After using that skill, you can change your body into any shape you want. As long as you don’t expose yourself, not even true gods will be able to tell the difference.”\n\n“What must I do for it?” Han Sen asked. He was now on high alert when it came to God.\n\n“There is nothing you need to do,” God said with a shake of his head.\n\n“No. You should just tell me the price. I like a good price tag. I don’t buy things that don’t come with price tags.” Han Sen shook his head. He did not think God’s gifts were so easily plucked.\n\n“OK. If you want it that badly, I’ll apply a condition.” After pausing, God said, “From now on, you cannot kill any creature that says ‘I love you’ to you. You must let it live. Is that OK?”\n\n“Who would say those three words to me?” Han Sen was confused. He did not believe God could see the future. If God was able to see through it all, Han Jinzhi and that Sacred person would not have been able to defeat him.\n\nIf God was unable to see the future, why would he suggest something so ridiculous?\n\n“I do not know,” God said with a smile. “Do you agree to this term?”\n\n“Deal.” Han Sen nodded. Even if God had a trick up his sleeve, as long as he did not kill Han Sen, all would be fine.\n\n“This is a shapeshifter skill geno art from Namu. I edited it a little. It is quite an interesting shapeshifter skill. It will really change the shape of your body. It does not employ magic, so no one can see through it unless you expose yourself.” God showed the shapeshifter skill to Han Sen.\n\nShapeshifter skills required effective power management, which was something Han Sen was accomplished with. He was good at it in no time at all. The skill was easy for him to learn.\n\nGod glanced at Han Sen, who looked like Holy Baby again, and complimented him profusely. “It’s a very powerful talent. This shapeshifter skill has very high requirements for talents and genes. Only the Namu and a few races with a similar talent can practice it. I did not expect you to be able to learn it so easily. It seems as if your genes really are abnormal.”\n\nHan Sen understood that God had taught him this geno art as a test.\n\nHan Sen looked at God and asked, “What are you doing here?”\n\n“Did I not tell you that I was going to teach you how to use a god personality?” God asked. “I am ready now.”\n\n“How do you use a god personality?” Han Sen asked. “Do you need special tools?”\n\n“There is no need for such trouble,” God said. “Putting the god personality into the scabbard is the worst idea. In fact, a god personality has a materialized power. For creatures that are not a god, opening that kind of power requires an extra step. Follow me.” God suddenly jumped into space.\n\nAn old set of stairs suddenly appeared beneath Han Sen’s feet. They went all the way into the nothingness. Han Sen was not able to see what was at the end of the emptiness.\n\nHan Sen knew that if God was forcing him to go, there was no use resisting. He quickly stepped onto the stone steps and descended toward the emptiness.\n\nAfter he walked down the stone stairs, Han Sen felt as if he was stepping into a different world. He turned around to look, but he could no longer see the Nine-Defense Palace.\n\nHan Sen raised his head and looked at the top of the stone steps. He now saw a palace floating there. From far away, Han Sen saw that the old and mysterious palace had a plaque. It said it was the Sky Radish God temple.\n\n“Sky Radish temple… Is this related to Sky Vine Radish?” Han Sen was shocked. He checked out the temple floating in the air.\n\nAfter having a look, Han Sen discovered that the temple was made of old vines. The vines looked petrified. They were green and greyish. Han Sen would’ve thought they were just stones.\n\nGod was stepping onto the stairs. He went in front of Sky Radish temple and pushed open the temple’s doors. Han Sen saw that the temple’s hall had a god spirit inside. It was Sky Vine Radish."
}