{
    "chapter": 2858,
    "title": "Dragon Race Weapon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2858",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“The Dragons’ bodies make people really jealous.”\n\n“I told you so. How could Dragon One be killed so easily?”\n\n“He really is the world’s bravest. How can he still live?”\n\n“Causal powers are mysterious. Even if I watched it, I could not block it. But if you wish to kill me, Dragon One, that alone will not be enough.” Dragon One opened his eyes. He looked at Demon Alpha and said, “I do confess that you have what it takes to fight me. It has been a long time since I last had a good fight.”\n\nAfter that, Dragon One pulled out something. It was a 2-foot long golden rod. It was flat with a rectangular shape. It looked like a ruler. On top of it were numerous Dragon tattoos. They were beautiful and mysterious.\n\nThe woman recognized the gold Dragon ruler. “The Dragon race weapon, Blood Dragon Ruler, is in his hands. It looks like Dragon One is the leader of the Dragons.”\n\nSky Palace Leader seemed to have expected this. “The Dragons spent a lot on Dragon One in this generation. He became true god in a hundred years and will soon be the leader of the Dragons.”\n\n“With the help of the Blood Dragon Ruler race weapon, the chances of his victory increase,” the woman said. “Although Demon Alpha is strong, the Demons became a high race not too long ago. I do not think the Demons have a race weapon to challenge it.”\n\n“Maybe not.” Sky Palace Leader’s response meant nothing.\n\nRoar!\n\nDragon One was holding his Blood Dragon Ruler as he roared toward the sky. The Blood Dragon Ruler shone with gold. It became many Blood Dragon Shadows. There were eight different shapes of scary Dragon Shadows surrounding Dragon One.\n\nEvery Dragon Shadow was like a cruel beast that could destroy the world. They released a scary presence. It was like a random bite could swallow the whole universe and every galaxy.\n\nIn the next moment, the eight Dragon Shadows roared in tandem with Dragon One. They all raced into Dragon One’s body.\n\nPang!\n\nThe wings on Dragon One’s back flapped. His body rapidly started to expand. The gold light on his body was pretty, but his back kept flaring up with horrendously large bone spikes. His parted lips displayed menacing fangs. The horns on his head were scary. His draconic wings kept expanding.\n\nAnother Dragon head appeared on the side of his shoulder. Soon, there was another one and another one. Many weird Dragon heads kept popping up. Within the space of a moment, Dragon One had become a nine-headed, big, gold Dragon. It was like a scary beast that could claim the world. The nine heads stared down at Demon Alpha.\n\n“Very scary suppression. I can feel how powerful it is by just seeing it. Demon Alpha is facing Dragon One. How much pressure must he be facing?” Although Han Sen was just watching the fight, the nine-headed, gold, giant Dragon One was releasing a pressure that made it difficult for him to breathe. He felt as if he was going to suffocate.\n\nGod looked at the nine-headed gold giant Dragon and said, “The Dragons are very interesting. They can put their own gene blood and spirit into a race weapon. This kind of sacrifice is something that cannot be accomplished by many races in this universe.”\n\n“Aren’t these Dragon Shadows the power of the race weapon?” Han Sen asked with shock.\n\n“One of the Dragon Shadows is the soul of the Dragon’s race weapon. If it was an ordinary treasure, even the Dragons could not do it regardless of how much they wanted to. Let’s not say the treasure itself can take that much power. Matching the elements is an issue too. After all, even if they are Dragons, their elements can be completely different. There are seven different elemental gene Dragon true gods. It is hard for them to put their own blood power into the same treasure, but race weapons can completely sort out such a problem. As long as they are Dragons, their power will be absorbed by the Dragon race weapon. That was how Blood Dragon Ruler, which was formed from the genes of seven true gods, was made.”\n\nGod paused a moment and said, “With this race weapon, it is like fighting nine true god Dragons together. Even the top elites of the three highest races would probably have to end up dodging it if they had to use their power to fight it.”\n\nGod’s face looked excited as he spoke. “If the Dragon race weapon can continue to be passed on to each generation, then Dragon One will be putting his own gene blood and spirit into it. In the future, if another Dragon wants to do it when it reaches 100 or 1,000 Dragons, can you imagine how powerful it would become? Claiming the entire universe would not be difficult.”\n\n“It is not easy to have 100 or 1,000 Dragons. That would take a long time. Thus far, the Dragons have only managed to put the power of seven true gods into it. If you want 100 dragons or 1,000 dragons, god only knows how many billions of years we would have to wait…” Han Sen was not interested in these calculations. After all, human lives were short. He would never live to see that day.\n\nGod laughed and said, “God is immortal. A billion years to God is just a second. It is worth the wait.”\n\nHan Sen stopped talking. Since he was not immortal, these kinds of discussions with God hurt his feelings.\n\nBoom!\n\nOne of the nine-headed, gold, heads spat out a flame that scorched the sky. It covered most of space.\n\nDemon Alpha’s black shadow flickered. He exited the area where the flame hit. It looked like the fire was burning the sky. He quickly slashed downward with his hands. Suddenly, one of the nine-headed, gold, giant Dragon head’s eyes weirdly flashed. It was as if Demon Alpha’s body was imprisoned. His arms were raised. He could no longer move.\n\n“Fire element and space element power?” Han Sen was in shock.\n\n“After Dragon One combined with the Blood Dragon Ruler, it meant he combined with the Dragon Soul and seven true god class Dragon Power,” God said. “With his gold Dragon body, there are nine true god powers. Not many creatures in this universe can fight against him now. I cannot wait to see 100 Dragons gathering up. What a shame.”\n\nTwo more dragon heads instantly appeared to accompany the nine-headed gold Dragon’s form. One of them had laser eyes, and the other spat out black Dragon Breath. They all attacked the frozen Demon Alpha.\n\nEvery creature that watched the fight was shocked by Dragon One’s power. They thought Demon Alpha was going to die.\n\nThunder and Dragon Breath tangled together. Everything was being destroyed by those two scary powers. Demon Alpha’s shadow was going to melt. The darkness became lighter and lighter. Inside the darkness, Demon Alpha’s body was becoming clearer to see.\n\nWhen the shadow was whittled down to only a thin layer, people could see more of Demon Alpha.\n\nHan Sen kept his eyes focused on Demon Alpha. Now, his eyes were open wide. Inside the shadow, he saw a purple-haired, purple-eyed, Demon woman.\n\nAlthough he could not see her entire face, this Demon woman gave Han Sen the feeling he used to know her. She was very familiar.\n\nPang!\n\nThe thunder and Dragon Breath tangled together. The final layer was being faded away. Demon Alpha’s face was finally revealed.\n\nHan Sen could finally see Demon Alpha’s face. When he saw her, his body shook. He was in complete disbelief.\n\nDemon Alpha’s face looked exactly the same as Zero’s when she was in Shura mode. Even her body was the same. But Zero looked like a young lady, and Demon Alpha looked mature and cold.\n\n“Are Demon Alpha and Zero twins?” Han Sen was frozen."
}