{
    "chapter": 2583,
    "title": "It’s Hard to Tell if It’s Good or Bad",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2583",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen and the others had explored this island many times before. Aside from the mushrooms, there was nothing special to be found.\n\nThey had searched the broken battleship repeatedly, but nothing important was ever discovered.\n\n“Where is the white tiger taking us? Is he going to take us away from here somehow?” Han Sen wondered, intrigued.\n\nBut Han Sen was soon disappointed. The white tiger wasn’t planning on leaving the island. They came to a giant mushroom that was around three stories tall. The tiger walked up to the mushroom and slapped it. The mushroom fell over, revealing an underground cave that was hidden beneath.\n\n“There’s a cave below here?” Han Sen murmured in surprise. He didn’t know what material this island was made of, but the rocks were so hard that not even deified powers could shatter them.\n\nMaking a cave there would be very difficult.\n\nThe white tiger disappeared into the cave. After a while, it came out. It made some noises in Han Sen’s direction, as if it was hurrying him to go in.\n\nHan Sen saw that the snakes weren’t too far behind them. If they entered the cave now, the snakes might arrive before they had a chance to leave. That would thrust them into the maw of another nasty fight.\n\nBut as Han Sen thought about it some more, he realized that they had little choice if they wanted to stay on the island. The snakes would be their enemies as long as they remained on the island, and there was little they could do against the snakes in their current state.\n\nEveryone disembarked the white whale. Han Sen shrank the white whale and put it away, then dropped into the underground cave. The others couldn’t do anything except follow.\n\nThey had been inside the cave for less than thirty seconds when the snakes arrived, covering the ground like a black blanket. Many of the slithery serpents poked their heads into the cave.\n\nBecause there weren’t any mushrooms, however, the snakes didn’t seem to be very interested. After looking around the cave briefly, they crawled back out.\n\nHan Sen and the others continued to follow the white tiger. Han Sen soon realized that the cave was a natural formation, not a man-made hollow. That made him feel very relieved.\n\nIf it was man-made, then whatever made the cave could be very dangerous to them. If it was natural, on the other hand, there was a chance it was just an ordinary cave that could help them avoid disaster.\n\n“Why would that white tiger be so kind, bringing us to a cave to avoid disaster? Or is this part of a greater conspiracy?” one of the pirates asked.\n\n“Regardless, we need to keep walking. Unless you want to fight those monsters outside the cave, that is,” another pirate said.\n\n“Stop talking! We might as well explore the cave fully. Maybe that is where the white tiger stores its treasure. Who knows? We might be able to get something good out of it.”\n\nThe pirate crew was chattering among themselves when suddenly, they felt something emerge from deeper in the cave.\n\nIn fact, they did not see anything. They just felt something come forward.\n\nThe next second, everyone felt a chill. Their clothes billowed as a cold wind rushed up from deeper in the cave.\n\nThe cold wind wasn’t very strong. It was the type of wind that would only make tree leaves flutter gently, so it wasn’t harmful to Han Sen’s group. However, the wind made everyone feel weirded-out.\n\nOne of the pirates said, “Weird. There is wind underground. Does that mean there is an exit?”\n\nFang Qing Yu’s eyes brightened, and he said, “We’re assuming that we’ve been in the Black Hole Spider’s stomach, right? If the ocean is the creature’s stomach, there should be some organs that connect to it. Maybe accessing those organs can lead us to an exit.”\n\n“Sh*t! Does that mean the wind was a fart?” a pirate exclaimed, turning green.\n\nFang Qing Yu’s explanation made the others feel uncomfortable. But more than anything, they were just surprised. If this was true, they had a chance of escaping this hellish place alive.\n\nEscaping through the creature’s intestines did not sound pleasant, but it would be better than dying. No matter how nasty the trip might be, life was more important.\n\nEveryone was full of hope. Their morale was given a big boost, and they followed the tiger at an eager pace.\n\nThe tunnel twisted and corkscrewed, but in general, it was headed down. Some places were wide enough to let a plane fly through. Other places were so narrow that only one person could squeeze their way through at a time.\n\nAs they traveled, the cool wind continued to blow over them from below. It was a very soft wind at first, but the deeper they went, the stronger it became. The stone walls on either side of them were smooth, which was undoubtedly a result of their exposure to the constant wind. It was like they had been caressed for a billion years.\n\nAnd then, they heard another wind-like sound. It came with the noise of distant, rumbling thunder. It was like an endless thunderstorm raging with the echoes of breaking space. The pirates felt as if their eardrums were about to pop.\n\nFortunately, the wind wasn’t strong enough to hurt anyone. It was just ominous.\n\n“This is wrong. If this tunnel leads to the creature’s guts, then it cannot keep farting this much.”\n\n“Maybe this Black Hole Spider has an upset stomach?”\n\n“Please use your brains. Even if its stomach was upset, it would still need something to digest. That’s what makes you feel sick. We have traveled all this way, and yet, we have only found dry rocks. There is nothing.”\n\n“Then what do you think this place is?”\n\n“If I knew, I wouldn’t be talking to you about it.”\n\nThe pirates were arguing amongst themselves again. They weren’t arguing for fun, but they clearly needed to blow off some steam. They were trying to alleviate the stress of the situation.\n\nHan Sen had known early on that these weren’t the spider’s guts. And in the presence of all the wind made him feel quite strange.\n\nIf there was no exit down below, then the presence of wind was weird.\n\nHan Sen wanted to ask the white tiger, but the white tiger only continued to run forward. It ignored them. So, getting information from that creature would be unlikely.\n\nBoom! Boom! Boom!\n\nThe wind was coming up again. This time, it blew against them with greater strength. The force of the wind twisted the faces of the pirates into a variety of odd shapes. The skin of their faces flapped against their skulls with the wind.\n\nThe Marquise class Fang Qing Yu was almost blown away completely. His body lifted into the air, and Han Sen had to reach out and grab him to keep him from blowing away.\n\n“The wind is getting stronger here. Should we keep going?” The group drifted to a stop and looked at Han Sen. He was their leader.\n\nHan Sen was hesitating, too. He didn’t know much about the white tiger. Following the white tiger down into this random hole in the ground might not have been such a good idea, after all. If he could go back in time, he would not have led his people down there.\n\nAs Han Sen pondered their current circumstances, the white tiger noticed they were no longer following. It turned around and rumbled at Han Sen, telling them to hurry.\n\n“How about this? While the snakes haven’t reached us yet, so this seems like a safe place to rest. You guys stay here while I scout ahead,” Han Sen said to Fang Qing Yu.\n\nHan Sen didn’t care about the lives of the Extreme King knights and pirates, but he did care about Gu Qingcheng and Ning Yue.\n\n“Let us come with you.” Gu Qingcheng and Elysian Moon decided to follow, having no interest in staying behind.\n\n“Don’t leave me here!” Ning Yue jumped forward. She clung to Han Sen’s legs, knowing that following Han Sen was better than staying put."
}