{
    "chapter": 1320,
    "title": "Another Lock",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1320",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“If Ancient Devil Emperor killed a demi-god, what would he gain from obtaining a core and its blood? Minus the whole being erased business, mind you.” Han Sen wondered this, reflecting on all he had been told in his conversation with Dragon King.\n\nWith the magnitude of Ancient Devil Emperor power, he was the sort to have no problem ascending to the Fourth God’s Sanctuary and becoming a demi-god. From what he had heard, there would be no need for him to try something as risky as challenging a demi-god in the Third God’s Sanctuary.\n\nThere must have been a great benefit or bonus to achieve and retrieve, by willingly summoning a demi-god and attempting to kill one. Even the weakest demi-god would be no laughing matter to deal with.\n\nWhat transpired after Asura killed the demi-god went completely against what anyone imagined might happen. Even Ancient Devil Emperor must not have expected the results, and so that was a catalyst for Han Sen asking this.\n\nDragon King answered, saying, “Mister Ancient Devil said spirits and creatures, and now humans I guess, could only open ten gene locks. If you became a demi-god, you were unable to open any more.”\n\n“He must have opened ten of them, yes?” Han Sen asked. He thought this was a given, but asking for confirmation did not hurt.\n\nDragon King said, “He did, yes. But he was driven by the belief that more could be unlocked.”\n\n“There is an eleventh gene lock?” Han Sen asked.\n\n“Not quite. There is another gene lock, but it isn’t one of simple progression. It operates on a slightly different spectrum,” Dragon King said.\n\n“Okay, and what’s the difference?” This was the first Han Sen was hearing about such a thing, and he was keen to learn more.\n\n“Admittedly, I’m not entirely sure. Mister Ancient Devil didn’t tell us much about it, but other emperors pursued the opening of this gene lock, too.”\n\nDragon King continued, saying, “Mister Ancient Devil strived tirelessly to open it. He worked on it for the longest time, employing various different means and methods. He never was successful. The demi-god method was his last resort.”\n\nDragon King did not explain what this special gene lock was, so Han Sen was still at a loss.\n\n“Is No God Emperor like Ancient Devil Emperor, I wonder? Is he going after this special gene lock? The dude wrecks, and he could totally become a demi-god if he wanted to. There has to be something keeping him here, not wanting to ascend just yet.” Han Sen mulled the oddities surrounding his latest nemesis.\n\nHan Sen returned to the Alliance shortly after the discussion was over, at the behest of Ji Ruozhen who had given him a call.\n\nHan Sen picked it up and said, “Hey Dad, how’s Mom?”\n\nJi Yanran’s mother had been sick for a while. It wasn’t an illness of any life-threatening capacity, but he still thought it polite to ask.\n\nJi Ruozhen seemed to not be in the mood for the exchanging of social niceties, and he immediately asked, “Did you send all those humans back to the Alliance? If you did… is it true?”\n\n“Hmm, that depends. What did you hear?” Han Sen asked.\n\nJi Ruozhen explained to Han Sen, “The spirits believe a child of Godslayer Luo is in one of your shelters, and now they’re out for blood.”\n\nHan Sen told him, “Yes, I sent all the humans back. I’ll get this situation ironed out, though, don’t worry. And when I’ve resolved the matter, they can all go back.”\n\n“Hmm, what are you planning to do?” Ji Ruozhen asked.\n\nHan Sen told it to him straight, “Fight, of course!”\n\n“You really think you can pull a feat such as that off? You’ve accomplished things not thought possible, so I won’t doubt you. But you’re certain you can pull this off?” Ji Ruozhen sounded worried for Han Sen’s wellbeing.\n\n“Yes, I’m certain.” Han Sen answered Ji Ruozhen resolutely, with no room for doubts or second-thoughts.\n\nJi Ruozhen said, “Good. But take care, please. Take a step back and understand the gravitas of this situation, for the entire stake of humanity’s advancement in the Third God’s Sanctuary will be in your hands. You shoulder our future there, right now. If you lose, all will be lost.”\n\n“I understand it well,” Han Sen said.\n\nJi Ruozhen then muttered something inaudible before pausing. As if to compose himself, he then cleared his throat and spoke, “I said that as a president. As a father, it would pain me greatly to… see my daughter be upset.”\n\n“Don’t worry; I understand. I’ll see this through to the end and come away smiling. You have my word on that,” Han Sen spoke with the intent to inspire confidence.\n\nHan Sen went on Skynet next to read the news. Reports of what was going on were everywhere. You’d have to be living beneath a very large rock on some icy asteroid in the distant corners of the galaxy to not know what was happening.\n\nDismayingly, people thought Han Sen should quit while he was ahead. They thought he shouldn’t stand his ground, and that it would be best to retreat and throw in the towel.\n\nThe humans who had been sent to the Alliance were all worried for what their future would hold. If their shelters were lost, then they’d be unable to return, and their time in the sanctuaries was over.\n\nMany professionals analyzed the situation to the best of their abilities, and the general consensus amongst them was that Han Sen should leave, too.\n\nBefore things went any further, though, Han Sen decided to have dinner with Ji Yanran. Throughout the meal, her lips staggered on the precipice of saying something. She clearly had something on her mind, but some phantom force stayed her from speaking.\n\nHan Sen decided to approach her from behind, knowing what she was feeling. He embraced her from behind and spoke on her behalf. “Do you believe I can do this?”\n\n“Yes, but I’m afraid,” Ji Yanran said, stroking the arms that caressed her.\n\n“I would never do something that would prevent my return to your loving warmth. I will be careful, I promise. I don’t want my time with you to end, ever. I might not be the strongest, and things might turn awry, but if they do, I’ll run. I’ll run right through the teleporter, through that door, and into your arms. You’ll see me again.” Han Sen leaned down to kiss her, and then said, “Plus, I want a son. I can’t let myself die just yet.”\n\nJi Yanran laughed and said, “I’d rather a daughter, one that is like Bao’er!”\n\n“I wouldn’t mind a little princess of my own, either. Four or five of them would be ideal, I think. That would sure make for a lively household.”\n\n“Are you sure you don’t just want to revel in the exercise of making so many children?”\n\n“Well, that is always fun.”\n\n“Oh, you have some cheek!”\n\n“Ouch!”\n\nHan Sen then returned to the sanctuary. His companions had been on red alert, not wanting to miss the precise moment an approaching enemy could be spotted. This was not the time for sloppiness nor mistakes.\n\nA few days later, while Han Sen spoke with Xie Qing King, he saw a shadow begin to approach the shelter. It had the intimidating presence of a looming mountain that was set to swallow the earth.\n\nBoom!\n\nA giant landed atop the rubble of the ruined shelter, forming two craters; one for each foot."
}