{
    "chapter": 1069,
    "title": "The Conquest of Holy-Sword Shelter",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1069",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nInside Holy-Sword Shelter, Holy-Sword Emperor’s face was green. The other spirits there were all in fear.\n\nHan Sen and Xie Qing King were not sneaky in their approach of the shelter. Fearlessly, they waltzed before its gate. Before they had come, though, they had made stops at twelve of Holy-Sword Emperor’s other shelters, including Sword-Palace Shelter. They were each claimed, resulting in the destruction of Holy-Sword Emperor’s son’s spirit stone, too.\n\nHoly-Sword Emperor knew they were a force to be reckoned with, so his first idea was to run. But with his spirit stone embedded in his shelter, he knew fleeing would be futile.\n\n“Xie Qing King, I won’t forgive you for this!” Holy-Sword Emperor exclaimed, before running towards his treasury.\n\nHe opened the vault, and with great care, opened a certain metal box that was within. He picked something up, his expression emotional and complex.\n\nHan Sen was a little disheartened. Initially, he had only wanted to come straight to this shelter, so he could slay Holy-Sword Emperor and be done with the primary local threat.\n\nBut Xie Qing King had told him that to preserve their honor, Han Sen would have to take down all of Holy-Sword Emperor’s lesser shelters before tackling the big one.\n\n“Why is he just destroying all the spirit stones? Can’t he save some for me?” Han Sen wondered to himself.\n\nXie Qing King was nabbing all the glory, leaving only the bones for Han Sen to pick through. All he was able to get was the flesh of sacred-blood creatures, and that was only because Xie Qing King did not need or want any himself.\n\nHan Sen swore to never fight with him again, unless it was an emergency. He was too arrogant and selfish, he thought.\n\nIf Han Sen was strong enough, he might even have tried to kill him.\n\nAs disappointing as all this was, though, he couldn’t deny how good it felt. There he was, in the Third God’s Sanctuary, steamrolling through a multitude of shelters as if it were no more difficult than a Sunday drive. With no force able to oppose the duo, it felt pretty good.\n\nBao’er had also accompanied Han Sen, and she was sitting upon his shoulder. In her hands, she played with the bird-fish thing.\n\nNow, they were marching directly before Holy-Sword Shelter. Standing before its gates, Xie Qing King yelled, “Hey, yo! I am the Super Emperor, and I am the one who knocks… because I’m polite. Of course, if you keep this gate shut, I’ll just have to tear the gate down. It’s in the way of me killing you. That being said, if you’d like to concede, you may.”\n\nIf there was anyone else around, Han Sen would pretend he did not know him.\n\nXie Qing King was obviously having fun, though. He made another strange gesture and said, “I’m-a give you fifteen minutes to decide, punk. If you want mercy, you better get out here.”\n\nHan Sen spent that time observing the shelter that was before him. He couldn’t help but admire the grandeur of the place. It was a massive walled city. But it was disturbingly quiet. There was no noise coming from beyond the gate, and there seemed to be no creatures manning the ramparts or watchtowers.\n\nHan Sen used his Dongxuan Aura to scan the area, and that was when he saw Holy-Sword Emperor, standing above the gate.\n\nA hundred-meter-tall creature stood behind the king spirit.\n\nIn the sky, there was an ape flying around with bat wings. It was like a creature risen from the pits of hell. Or Oz.\n\n“Xie Qing King, we are both king spirits here. There is no need to take things to such extremes,” Holy-Sword Emperor began a speech.\n\nAlthough Han Sen’s golden raven was strong, he wasn’t entirely sure it’d be enough to take on Holy-Sword Emperor or his pets.\n\nHe couldn’t kill a fully-healed Xie Qing King, either.\n\nIn response to Holy-Sword Emperor, Xie Qing King immediately said, “Cut the crap, fool! You either fight me like a man or get down on your knees.”\n\n“Fine. But let it be on your head.” Holy-Sword Emperor started his signature move. A thousand swords rose from his hands, and he sent them all flying down towards Xie Qing King.\n\nXie Qing King then said, “That old chestnut? Oh, please!”\n\nXie Qing King threw a punch and generated a shockwave that knocked all the swords away. The entire skill was canceled by that single throw of a fist.\n\nRoar! The hundred-meter-tall beast leaped down towards Xie Qing King and Han Sen.\n\nIn that creature’s mouth, Han Sen saw something swirl. It was like a blood-red sea. If he was sucked into that vortex, he didn’t fancy his chances of survival very much.\n\nHan Sen received Brother Seven’s information, so he already knew what to expect from the two super creatures of the shelter.\n\n“Then we fight to our deaths, I take it?” Xie Qing King leaped into the sky with a silver light and threw a punch towards the super creature before him.\n\nThe hit landed, and it sent the super creature reeling backwards in agony. As it suffered the power of that blow, it screamed in pain. Still, it tried to use its talons to grab Xie Qing King’s head.\n\nXie Qing King threw an uppercut towards the incoming talons, eliminating its advance and giving the monster very sore fingers. The punch was stronger than the monster’s attack had been, and the additional force sent the creature flying away.\n\nThe other super creature swooped down with its bat wings to attack Xie Qing King, but it was a futile attack. Xie Qing King was so fast, he even had the time to reapply gel on his hair.\n\nSeeing this, Han Sen felt another stabbing cringe. Xie Qing King was now like a slut, reapplying makeup and pushing up her boobs before meeting new clientele.\n\nXie Qing King knocked away the airborne monkey, and with the coast clear, Han Sen took off running to get Holy-Sword Emperor’s spirit stone.\n\nHoly-Sword Emperor saw this, and so he quickly fired his swords Han Sen’s way.\n\nHan Sen transformed into a black raven. He was enveloped in a raging fire, which accelerated his pace. He effortlessly evaded the barrage of swords that were coming for him.\n\nAll the swords were broken and burnt. They smoldered and melted inside the ruthless flames that were left in Han Sen’s wake.\n\n“You took advantage of my injuries the last time we met, human. Do you think you can defeat me this time?” Holy-Sword Emperor looked enraged, and he drew out a single, menacing greatsword."
}