{
    "chapter": 1176,
    "title": "Hard Labor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1176",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen thought super creatures and king spirits were awesome beings of an unbridled power, coupled with near-prophetic intelligence and behavior that presented them as deity-like figures. This image he had of them became extremely distorted when he witnessed them enter the Sky Fruit: their grace was discarded in favor of being simple, hard-working miners.\n\nThe Sky Fruit nuts were not too tough, but the shells around them were like spherical bulwarks. To retrieve the nuts, the shells had to be broken. But there were also barriers to break.\n\nThe barriers were a little harder than the physical shells of the nuts. He had tried to break a shell with his Phoenix Sword previously, but he had been unable to. Without such weaponry, and with the barrier being stronger, he was in for a trying time.\n\nHan Sen accepted a shovel, given to him by Dry Bone King. Upon striking the barrier before him, he was only able to peel away a thin section. Digging through it all was sure to take a long time.\n\nThere wasn’t just one barrier there, either. The entire fruit was composed of various nut rooms, with entries separated by additional barriers of their own. Han Sen’s job was to break through the barriers to obtain the geno treasure that was said to reside inside. The lower tier creatures would then come and take the nuts.\n\nSeeing them all working hard, Han Sen’s mind drifted back to wonder who might have placed the slip of paper in his room. And why the note said what it did, telling him to follow Qing Jun King.\n\n“Weird.” Han Sen suddenly heard Dragon King’s voice, as if he had spoken directly into his ears. Han Sen looked around, seeing if anyone else might have heard him. It didn’t seem that way, so he peeked at his ring.\n\n“Don’t worry; this is a secret method of communication. They won’t hear me,” Dragon King said.\n\nHan Sen wanted to talk, but he didn’t know how to do so without alerting the others. He’d look like a madman, babbling to himself.\n\n“This Sky Fruit is weird.” Dragon King paused, and then went on to say, “I can’t feel the presence of geno treasure.”\n\nHan Sen thought, “The tree is dead. Isn’t the lack of a geno treasure normal?”\n\nIt looked as if Dragon King could read Han Sen’s mind, as he then said, “I can sense the presence of geno treasures, even if they haven’t been created yet. I know where they would be. Here, there is absolutely nothing.”\n\n“Forget about the treasure; just find out where the tree we’re looking for might be.” Han Sen used dongxuan aura to hide himself and his speech.\n\n“I don’t sense that, either,” Dragon King said.\n\nHan Sen wanted him to find out where the Sky Tree was. Now, unable to find a trace of it, Han Sen was starting to suspect Dragon King was seeking to double-cross him.\n\nHan Sen and Dry Bone King’s people continued digging for another hour, and that was when they uncovered a path that led to the nut.\n\n“This place serves as a junction that leads to four nut rooms. We should split into four teams to cover each path. Whoever finds the geno treasure first can claim it; if you can’t claim it, others can try,” Qing Jun King said.\n\n“Dry Bone, Baby Ghost, group up with Earth Beast,” Qing Jun King said.\n\nEleven people split into four teams. Qing Jun King did not put Han Sen in a team. One other super creature was left out, too, and so she said, “You’re new, so who would you like to team up with? Me or the creature?”\n\n“I’ll go with you,” Han Sen said.\n\nThis choice surprised Dry Bone King and Baby Ghost King. Qing Jun King was shocked, too. Qing Jun King’s face went cold again, and she walked towards the barrier. Dry Bone King wished to say something, but everyone would have heard him speak. Regretfully, he had to hold his tongue.\n\nHan Sen saw that he wished to say something, and guessed his words would have been something like, “You’re committing suicide.”\n\nBut Han Sen did not choose Qing Jun King because of the paper. He wasn’t afraid of her, and he could use this opportunity to find out why she so desperately wanted Qiu Ping to kill Zhang Yuchen.\n\nShe could have killed them both with the greatest of ease, so her need for drama seemed unnecessary and uncharacteristic of a king spirit.\n\nThey broke the nut and then started to work on another barrier. Han Sen was only able to dig up a thin slice each time, but Qing Jun King was able to dig up a whole lot more. It took them two hours to dig a path that was big enough. After going through, they arrived in another nut room. They had to dig a path that was big enough for the creatures to come through and carry the fruit out.\n\nFor now, though, they were alone together. Han Sen knew he had to be careful, but Qing Jun King seemed focused on the task at hand. She got to work on yet another barrier.\n\nHan Sen followed, but kept his wits about him.\n\n“This is strange. Real strange.” Dragon King’s voice started to sound in Han Sen’s ear again.\n\nQing Jun King was standing one meter away from Han Sen, so no matter how quietly he sought to speak, she’d hear any response he made to Dragon King.\n\n“I can feel the presence of geno treasure ahead. It is behind this wall, but it’s strange,” Dragon King said.\n\nHan Sen was happy, hearing he was about to stumble across the treasure. But with Qing Jun King there, they’d probably fight over its ownership.\n\nDragon King said, “There is something very wrong with this geno treasure.”\n\nHan Sen wanted to ask him for more details, but couldn’t on account of Qing Jun King being right next to him.\n\n“Furthermore, I know where the Sky Tree is!” Dragon King suddenly screamed."
}