{
    "chapter": 454,
    "title": "Take Me With You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_454",
    "text": "After killing the white mammoth, Han Sen had established his prestige in Goddess Gang. People had officially recognized him as the leader. Many young people even saw him as an idol.\n\nThe Goddess Gang had become more and more organized. Han Sen was very generous to the members that worked hard, awarding them with lots of meat.\n\nn\n\nHan Sen asked Yang Manli to specifically cultivate the young men like Xu You who dared to risk their lives.\n\nHan Sen’s arrival brought a revolution to the place. Although they still did not dare to hunt in remote areas or approach the spirit shelter, with Han Sen leading the team, they were able to kill lots of ordinary and primitive creatures at once in the mountains nearby.\n\nThis gave some hope to the evolvers in this place. They no longer needed to hold their breath and count the days.\n\nMany people who had not entered God’s Sanctuary in a long time and lost hope returned to the place after hearing the news, wanting to see if the legend was real. It turned out they were ecstatic. The world of ice and snow was no longer silent like before. People were active everywhere. Although it could not be compared to large human shelters, the situation was not that desperate. More and more people had their hold back and joined Goddess Gang.\n\nMore and more people told each other about the news, making those who had lost hope and her God’s sanctuary again. Therefore, Goddess Gang became stronger and stronger. With lots of meat to trade, the rich had also started to appear. Trade became more and more frequent and there had been a lot of transactions.\n\nBecause Han Sen rarely showed up, few people knew what he looked like. Most people only knew the name Han Sen.\n\nMore people thought of Han Sen as a legend, a living legend.\n\nAn evolver who had just entered Second God’s Sanctuary for a few months revived a place on his own and inspired lots of desperate people, which could only exist in a legend.\n\nObviously, more people recognized Yang Manli, the righthand woman. Many people assumed that Yang Manli was the goddess in \"Goddess Gang\" and thought she was Han Sen’s lady, the mistress of Goddess Gang.\n\nOf course, Yang Manli had also heard such assumption. In the beginning, she was shy and angry. However, it was impossible for her to clarify every time. After a while, she was tired of correcting others.\n\n\"Brother, it really is you. I finally found the organization.\" On this day, when Han Sen just teleported into God’s Sanctuary from the Alliance, someone suddenly ran at him and hugged his thigh full of tears.\n\n\"Zhu Ting?\" As Han Sen saw who it was, he could not help feeling dazed. He had no idea that he would run into Zhu Ting here.\n\n\"How dare you show your face? You really think I will not kill you, don’t you?\" Han Sen’s face became stern.\n\n\"Brother, it is meaningless to live in such a spot. Can I follow you? If I can’t, I would rather die. Just kill me!\" Zhu Ting would not let go of Han Sen’s leg.\n\nHan Sen chuckled inwardly and thought to himself, this guy is quite unlucky to be assigned here. He must have gone through many hardships. It looks like he’s going mad.\n\n\"When did you arrive here? How come I never saw you?\" Han Sen brought Zhu Ting to a quiet place and asked.\n\n\"After I ran away, I came to Second God’s Sanctuary directly. God knows I would be sent to this damned place. Every time I tried to kill a primitive creature, I would be risking my life. After such a long time, I have not even maxed out on ordinary geno points. This is no way to live… Two months ago, I went out to hunt and was almost killed by a mutant creature. I ran so far away that I only came back the day before yesterday. Since hearing about brother you, I have always been waiting for you near the teleport device…\" Zhu Ting complained tearfully.\n\nNaturally, Han Sen would not take Zhu Ting’s words too seriously. This guy was quite sly and full of ideas. He could also use poison well. Shameless and murderous, Zhu Ting was definitely a dangerous person.\n\nHowever, Han Sen did not want to kill Zhu Ting yet. Although this guy was dangerous, Han Sen did not think of him as a risk. In addition, Zhu Ting knew a lot of things that Han Sen was dying to know about, such as things about Han Jingzhi.\n\nZhu Ting was a bastard son of the Chens. It seemed that the Chens also knew about what happened in the past. Han Sen wondered what role they had played.\n\nHan Sen suspected that someone of the Chens was also a member of Unit Seven of Secret Service.\n\n\"So, you want to follow me. But why should I agree to that?\" Han Sen looked at Zhu Ting with half a smile. No matter what Zhu Ting wanted, Han Sen would like to collect something from him first.\n\n\"Brother, no matter what, I should be much more useful than those ordinary people, right?\" Zhu Ting blinked and answered.\n\n\"And much more dangerous,\" Han Sen replied quietly.\n\nZhu Ting said with a wry smile, \"Young master, big brother, you are the descendent of Instructor Han. How do I dare to harm you? If I really did something to harm you, even my father would beat me to death.\"\n\n\"The Chens is quite well-informed. However, I don’t remember any relationship between the Hans and the Chens.\" Han Sen was not moved at all. Everyone claimed to be a friend of Han Jingzhi. He could not tell who was telling the truth, so he decided to ignore all of them.\n\n\"Didn’t Instructor Han mention that my ancestor was also a member of the Secret Service, a colleague of his?\" Zhu Ting quickly said.\n\n\"I don’t know.\" Han Sen did not want to comment. He thought to himself, indeed, the Chens was also a part of the mission.\n\n\"It’s useless for you to say anything. Give me something solid. If you want to follow me, you must pay upfront first,\" Han Sen said.\n\nZhu Ting said with a sad face, \"After I came to this damned place, I have gained nothing and lost almost all the beast souls I brought from First God’s Sanctuary. Now I am so poor that all I have is money. Do you want money? Name a number, and I’ll pay you no matter how much.\"\n\n\"Don’t you still have Seven Twists?\" Han Sen said abruptly.\n\nHan Sen had always coveted Seven Twists from the Chens. Although he could fly with beast soul wings, the speed would be determined by the strength of the beast soul instead of his strength. Therefore, Han Sen was very interested in this technique that could send him in the air using what he got.\n\nHowever, Seven Twists was the family secret of the Chens. No outsiders could be taught. With such an opportunity, Han Sen wanted to test if Zhu Ting could teach him Seven Twists."
}