{
    "chapter": 2178,
    "title": "Frozen Barr",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2178",
    "text": "The Destroyed Dukes saw Han Sen use an icy force to freeze Barr on the spot. One of the Dukes looked on Han Sen with a sneer. “Ice powers are worthless against the real might of Barr.”\n\n“His power is evil. He has a body of chaos and a spirit of disaster. An ordinary Destroyed has three special talents; we can wield light, dark, and chaos powers. Barr’s power is different, however, due to the mixed blood in his veins. He has three amazing talents. He can use the evil power to kill. He can use the body of chaos to disturb things. And he can use his spirit of disaster, which is a mysterious power even to us. Each of them possesses incredible power, and together, they make Barr practically invincible.”\n\nThe Destroyed Duke coldly laughed and said, “Cold powers will not work on Barr. They will only end up making him even stronger. Let’s see what happens, shall we? Barr will break the ice very soon.”\n\nIt looked as if Barr was answering his words, for a squeaking noise began to come from his frozen form. It sounded like glass cracking under pressure.\n\n“Huh. That is a powerful body. Even my upgraded cold powers from Jadeskin can’t freeze him effectively,” Han Sen complimented his enemy.\n\nBut Han Sen was aware that if he had used his Jadeskin godlight in the beginning, Barr would have been unable to escape.\n\nBarr was now bursting with power because of their long, protracted fight. It had allowed Barr’s power-gain to build up a ton of momentum. If Han Sen had tried this sooner, Barr wouldn’t have been able to break free from the Jadeskin godlight’s freezing power.\n\nLuckily, Han Sen wasn’t depending on the Jadeskin godlight to freeze Barr. His other hand was holding a pistol. He lifted it and fired at Barr.\n\nA bullet with an ice light was fired. It hit Barr’s frozen body, and the Jadeskin godlight froze Barr once again.\n\nBut this bullet was different from the one with the earlier Jadeskin godlight. This bullet was equipped with a strange and hidden symbol.\n\nWhen Spell reached Marquise, a weird symbol began to appear on her ammunition. Its design reflected the symbol on Spell’s forehead. It was imbued with the power Spell obtained when she became a Marquise.\n\n“It is useless. No matter how much he tries to freeze Barr, it is all for naught. Doing this will only boost Barr’s resistance to the ice powers. Does Han Sen have a death wish?” The Destroyed Duke grinned haughtily.\n\nAfter firing, Han Sen blew across the barrel of the pistol. He put the pistol away and turned around to look at Han Meng’er. With a shrug of his shoulders, he said, “Let’s go. This guy is too difficult to fight. I am unable to kill him.”\n\nHan Meng’er and Zero had no opinion of their own, so they were swift to follow Han Sen’s decision. A Destroyed Duke loudly said, “Han Sen, there is no point in running! Barr is going to break that ice power. You cannot run. Once Barr has made you his target, there is no escape.”\n\nPang!\n\nHan Sen didn’t turn around. He simply drew his gun and fired a bullet at that Duke.\n\nThe Destroyed Duke’s face went white, and it was too late for him to dodge. The three heads shouted, while the six arms wielded three different orbs of light in a bid to deflect that incoming bullet.\n\nPang!\n\nThe tri-colored godlight hit the bullet, and the bullet exploded. A mushroom cloud rose from that spot, turning the place where the Destroyed Duke had stood into a small crater. The entire team was blown up into a bloody mess that painted the region. The Destroyed Duke up front was nothing but bits.\n\nThere were two Destroyed Dukes a little away from the group. They weren’t killed in an instant, but they were left to bleed out. Death would come for them soon enough. They lay writhing on the ground, looking up at Han Sen in horror.\n\n“You guys aren’t Barr, so don’t talk crap to me.” Han Sen put his pistol away and left the area with his companions.\n\nQing Li and the other Rebate were paralyzed on the spot. They knew Han Sen was strong, but they did not know he was that strong.\n\nHe was only a Marquise, but in a split second, he had wiped out an entire group of Dukes with a single attack. That level of power was scary to behold.\n\n“No wonder he shared the same name as Lone Bamboo. That is way too frightening.” Qing Li’s pretty eyes looked upon him with complete admiration. In her heart, she was thinking, “Should I keep begging him to be my teacher? Perhaps he should be my teacher instead of Knife Queen. But he already rejected me once before. Now he definitely won’t accept me.”\n\n“Barr will kill you… Kill you…” wheezed the two dying Destroyed. Blood was drooling out of their mouths.\n\nThey knew they weren’t going to live long, so they put their hopes of vengeance on Barr. They hoped Barr would be able to break the ice and kill Han Sen.\n\nThey looked upon the frozen Barr with excitement, hoping to see Barr burst free before they passed. They imagined Han Sen then being killed by Barr. It made their dying bodies grasp a smidgen of power to stay alive just a little bit longer.\n\nBut Han Sen and the others were already leaving, and the frozen Barr had yet to move. He was still holding the bone knife, and he was facing down like a frozen statue.\n\n“Impossible. How can that ice freeze chaos power? Impossible. Barr must be able to break the ice… He just needs a bit of time…” the Destroyed thought desperately.\n\nHan Sen and the others left the area. Barr was still frozen on the spot, not moving.\n\nAt first, the Destroyed were optimistic. Then, they were disappointed. And lastly, they looked to be drained of all hope. Their final breaths were spent staring at the frozen Barr. They did not close their eyes, but even so, Barr remained frozen. He did not move.\n\nOther elites soon came walking by, and when they saw the frozen Barr, they were stunned. When they realized Barr had been frozen by Han Sen, they were even more shocked.\n\nBarr was an infamous Duke, so it was hard to imagine how a Marquise had managed to trap him like that.\n\nThe Destroyed Nobles eventually came and took the frozen Barr away, but it was several hours before they arrived.\n\nThis was the first time Han Sen had used Spell while it operated with the power of a Marquise. He did not know what the new power was called, but that symbol had a strange power that would not fade away. So, Han Sen called it Eternity.\n\nHan Sen only wanted to freeze his foe for a while, so he could buy them enough time to vacate the area. Han Sen did not expect the Eternity effects to be so strong. A few hours later, Barr was still frozen."
}