{
    "chapter": 2220,
    "title": "Stealing the Stone Slab",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2220",
    "text": "That stone tile was lying amidst the rubble, and in order to pull it out, Han Sen would have to remove the cluster of rocks that buried it. Unfortunately, the two Dukes were still present. It’d be impossible to retrieve the stone without disturbing them.\n\nHan Sen tried to think of a way that he could grab the stone tile without drawing their attention.\n\nKilling the two Dukes wouldn’t be difficult for Han Sen, but if he wasted them, it’d alert Edward that someone had found the ruins. It would prompt the Inspector to investigate, at the very least.\n\nAfter all, the only non-xenogeneic residents of that planet were the Ice Blue Knights. Edward’s target would be someone from the base.\n\nHan Sen’s best bet was to steal the stone tile while avoiding drawing the guards’ notice. It would save him a lot of trouble.\n\nBut that Fire Bear and hybrid Dragon maintained their position atop the statue. They were facing the direction of the tile, and so taking it would be impossible for now.\n\nAfter thinking for a while, Han Sen abandoned the stone hall. He looked around the city and realized that he was currently in a desert with no creatures. There were no xenogeneics for Han Sen to lure their way.\n\nAfter a while, Han Sen returned to the well and summoned Little Star. He put Little Invisible on Little Star’s back, then asked the hidden Little Star to steal the tile.\n\nLittle Star could fetch things and move them through solid materials. He could just grab the stone tile through the rubble without attracting any attention.\n\nHan Sen only had to distract the two Dukes long enough for Little Star to make the tile disappear. That way, there would be no trace left behind, as the rest of the stones wouldn’t have been moved.\n\nAfter Little Star entered, he phased into the pile of stone rubble, and while the two Dukes were looking away, he swallowed the stone tile and slipped away with it.\n\n“Nice job!” Little Star and Little Invisible brought the stone tile back to him, and their success made Han Sen very happy. He tucked the stone tile into his pocket and took his companions with him to exit the city via the underwater channels beneath the well.\n\nHan Sen returned to the area he was supposed to be patrolling, and then he placed Bai Wenxuan inside Destiny’s Tower. He took Ji Qing with him to slay more xenogeneics, but while they were fighting, their recorder broke.\n\nThe content inside the recorder couldn’t be deleted. They had filmed Bai Wenxuan, and so the device had to be destroyed.\n\nHan Sen returned to the base to pick up another recorder, and things went well. No one was suspicious. The xenogeneics apparently had a habit of breaking recorders.\n\nWhen everything was settled, Han Sen went to his room in the base to rest. He also took the time to research the stone tile he had retrieved.\n\nThe stone tile looked very ordinary. The slab itself was only around the size of a man’s hand. There were no words or symbols on it. It had a slight curvature, sort of like a stone plate.\n\nHan Sen used the Purple-Eye Butterfly lens to examine it, but he couldn’t analyze its composition. He was unable to find out how it had been created.\n\nSince he couldn’t find out anything more that way, he put the stone plate away.\n\nHan Sen gathered his team and readied himself to kill xenogeneics again, and in a stroke of luck, the knights ordered them to clear out Lava Valley.\n\nThe team that was previously in charge of clearing Lava Valley had the misfortune to encounter a fiery Duke monster in the Lava Sea. Due to the injuries they had sustained, they were no longer able to work that area, hence the need for another team to be sent in their stead.\n\nFew teams wished to go there, due to the inherent dangers of the locale. But the other groups quickly began recommending Han Sen and his team.\n\nHan Sen happily accepted the task, as he wanted to go there anyway. He hadn’t expected things to work out this well, though. He didn’t even have to think of an excuse for going there. Without saying much, Han Sen rallied his comrades and took them to Lava Valley. His enthusiasm made the officer who had given him the task quite confused.\n\nThe valley was as long and winding as a dragon, and it stretched into the distance beyond what their eyes could see. Lava bubbled and spurted all around them, flecks of molten material rising like steam. Fire-attuned xenogeneics were everywhere. Many bird xenogeneics flitted back and forth near the walls of the valley, trying to capture the fiery xenogeneics—such as the fire bugs—that came from the banks of the river.\n\nHan Sen saw the Fire Crows. They were only a few centimeters long, but their red bodies flew so fast that it was hard to see that they actually had wings. They swirled around each other in a mass, like red clouds hovering over the valley floor.\n\nThe murders of Fire Crows swarmed and swirled over the lava river. They often swooped down to the surface of the lava stream and ate any fire bugs they could catch.\n\nAfter the Fire Crows caught the fire bugs, they would return to their nests perched in the higher walls. There, they’d feed their baby Fire Crows.\n\nThe Fire Crows had advanced reproductive abilities. They could make babies every few months. If they didn’t require such an extreme environment, their numbers would surely overtake the entire planet.\n\nJi Qing wished to show off. Upon seeing a swarm of Fire Crows, she drew her weapon and rushed towards them.\n\nHan Sen didn’t hold back, either, as he immediately sent a rocket toward the Fire Crows.\n\n“Xenogeneic Viscount Finger Fire Crow killed. Xenogeneic gene found. Obtained Finger Fire Crow beast soul.”\n\nHan Sen never got tired of hearing that announcement. He quickly went to check what sort of beast soul he had gotten.\n\nViscount beast soul Finger Fire Crow: Halo-type\n\nHan Sen froze. Halo beast souls were rare, but what he really wanted was a weapon.\n\nHan Sen summoned the Finger Fire Crow beast soul, and a flaming halo appeared around his feet. It was like there was a fiery bird circling around his legs. His body looked red.\n\nWhen Han Sen attacked, his attacks would deal fire damage.\n\n“A ring that deals fire damage. Hmm, it’s a shame there’s only one of them.” Han Sen felt depressed. Combining the Sun Raven beast soul with that would be a waste.\n\nLuckily, there were many types of fiery birds occupying Lava Valley. Han Sen had to look for a more suitable target. If he was unable to find one that was suitable, he would have to think about settling for the Fire Crow.\n\nWhile Han Sen began to work his way across Lava Valley, slaying xenogeneics as he went, a naked man with blonde hair was headed for Ghost Bone Town. He was smiling, and his body looked like Apollo’s. He was one of the Extreme Kings.\n\n“Mister Edward.” The Fire Bear Duke and the hybrid Dragon saw the Extreme King man approaching. They bowed very respectfully to him.\n\nEdward nodded. He looked around the hall, then stopped near the stone rubble and frowned. “Have you moved anything in the hall?”\n\nThe two looked very frightened, and so they said, “We have been following your orders exactly. We haven’t moved from that statue since you ordered us there, nor have we moved anything in the hall.”\n\nEdward nodded and asked, “Have you seen anything strange around?”\n\n“Nothing has been strange,” the two said after a moment of thought.\n\nEdward looked at the rubble. He thought for a while, then told the two guards to remain on the statue. He turned and left Ghost Bone Town."
}