{
    "chapter": 989,
    "title": "The Emperor’s Spirit Orb",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_989",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nMoment Queen stopped and explained, “If the ritual did not work, the emperor will not have been brought back to life. But regardless, his lifeforce is still in-play. If its existence continues in this way, it will instead become a spirit orb. Think of it as a weakened spirit stone, that is unable to revive anything. But, it can be consumed by other spirits. If another spirit consumes a spirit orb, they are granted a considerable number of self geno points.”\n\n“How do you know there’ll still be a spirit orb? What if the emperor has already taken it?” Han Sen frowned.\n\n“It sounds to me like Yaksha is the emperor who has put all this in motion. Perhaps something happened to him, long ago, and now he has returned to finish the task,” Moment Queen said.\n\n“And you think we can do combat with an emperor?” Han Sen still feared the spirit.\n\nThe aqua dragon had been unable to defeat Yaksha, and Han Sen himself had only opened three of his gene locks. Hesitance and doubts as to whether he could defeat such a foe were entirely reasonable.\n\nThe only reason he had chased after Yaksha thus far was because of Bao’er’s support and his newfound ability to obscure the seventh sense of others.\n\nMoment Queen, seemingly alarmed, tried to explain the gravity of the situation in a rush. “Yaksha came out of a ding and fought a dragon immediately after, you said. He will undoubtedly be in a weakened state, and if we go after him now, we can kill him.”\n\n“Don’t forget, your spirit stone is a part of your body. You can’t respawn if you fall in battle,” Han Sen told her.\n\n“I wouldn’t throw away my life by challenging a foe I knew I could not hope to beat. But you said there were several creature carcasses, scattered along the way here. That in itself tells me Yaksha is weakened. Pride is a spirit’s greatest shackle, and an emperor wouldn’t be willing to eat such low-life creatures unless he was absolutely desperate. Before he consumes the spirit orb he is after, he’ll be at his weakest. If we find him, we can kill him and take the orb for ourselves.”\n\nHan Sen thought what she had been saying made sense, and perhaps it would be best to nip this entire mess in its bud before things could get any worse. Han Sen didn’t want Yaksha to get any more dangerous. Moment Queen wouldn’t needlessly risk her life, and Han Sen needed all the self geno points he could get.\n\n“Fine. Let’s check it out.” With Bao’er by his side, he felt a lot more confident.\n\nIf Yaksha was able to, he would have killed the dragon when he fought it in the subterranean labyrinth. Yaksha had suffered much damage, and it was clear he had not yet recovered his health.\n\nMoment Queen raced through the trees, as Han Sen followed from behind.\n\nBao’er observed her surroundings with great interest as she clutched a bottle. She was like a puppy, swinging her head left and right to see everything she could.\n\nAlthough it seemed as if she was in the biggest rush ever, Moment Queen still exercised caution. But so far, after a great distance had been traversed, nothing curious revealed itself. The signature vines of the forest were still all-present, woven between each tree, but that was it.\n\nAfter crossing a distance of ten miles, Moment Queen stopped and said, “This is it. It’s right in front of us.”\n\nHan Sen stood near Moment Queen and saw a great clump of vines, all tangled together to form a sort of wall. It was rather like a wicker basket, except for its strong resemblance to a castle.\n\nAs they wondered whether or not to enter, something let out a sudden roar.\n\nIt sounded like a beast, one that used sonic powers to amplify its cries. It was so loud, they both felt as if their chests had been delivered a direct punch. They even spilt blood from their mouths.\n\n“There is a super creature inside,” Moment Queen said, as she wiped the blood from her lips.\n\nHan Sen, wiping his own blood, saw that Bao’er was completely unharmed. She looked in the direction the noise had come from.\n\n“Let’s go!” Han Sen wanted to leave.\n\nIf there was indeed a super creature inside, there was no feasible way they could defeat it.\n\nBut, before he could turn to leave, something appeared to exit the castle. Without wasting a second, he masked their lifeforces and moved to hide in the nearby bushes.\n\nIt was a giant centipede. It looked terribly wounded, and it wasted no time scuttling out and racing off between the trees in panic.\n\nNot long after, something else came out of the castle. It was Yaksha.\n\nYaksha looked to be in terrible shape, as well. His scaled-armor was entirely broken, and only a few roughed-up plates remained.\n\nOne of his arms had been almost completely severed. Only loose flaps and strings of skin connected it to his shoulder.\n\n“Godd*mn dragon king; I’m not done with you yet!” Yaksha shouted, while holding the arm that looked ready to drop. Then he disappeared.\n\nHan Sen froze. It was a horrible sight, seeing him in such condition, and he wondered what had occurred. From what he could guess, Yaksha had been set-up.\n\nMoment Queen frowned and looked at Han Sen. She said, “I have heard about the existence of a certain dragon king before. If it resides inside that castle, we may have a struggle ahead of us.”\n\n“What do you mean?” Han Sen saw Yaksha fleeing the area, and his expectations of obtaining a spirit orb had gone with him.\n\nMoment Queen said, “Dragon King is a famous emperor of the Third God’s Sanctuary, and he possesses the power of dragons. Everyone obeys him, and if he failed to reach the Fourth God’s Sanctuary, I can’t imagine my chances. They’d be far slimmer, to say the least.”\n\n“Are you still going to risk entering that castle?” Han Sen asked, as he looked at the menacing construct.\n\n“Not even Yaksha could defeat Dragon King; I doubt we’d fare any better,” Moment Queen said.\n\nHan Sen nodded. He didn’t want to risk Bao’er’s life by bringing her inside, either.\n\nAs they turned to leave the area, though, Bao’er leapt out of Han Sen’s arms and rapidly crawled inside the castle."
}