{
    "chapter": 1253,
    "title": "The Egg That Loves to Drink",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1253",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nPang!\n\nThe bottom of the bottle broke again.\n\nThis time, Han Sen had been staring at the red egg that was still inside the pot.\n\nHe couldn’t sense a lifeforce within the egg, but the moment the bottle shattered, Han Sen saw a light swiftly beam out from it.\n\nHan Sen was shocked. His Dongxuan Sutra was stronger than ever, but it hadn’t been able to sense anything. His plain old eyesight, however, could.\n\n“Must I suffer trouble even if all I want to do is boil an egg?!” Han Sen mused as he eyed the egg with a soured look.\n\n“Something is wrong.” Han Sen then realized that the drink that had been spilt on the floor was missing. The cave wasn’t particularly warm, so it didn’t make sense for the ground to have dried up already.\n\nAs Han Sen frowned, he suddenly smelled the scent of alcohol.\n\nBecause the bottle broke, Han Sen hadn’t taken immediate notice. The fragrance he detected now was coming from the bubbling pot.\n\n“Is this thing boiling itself with alcohol?” Han Sen wasn’t quite sure what to think.\n\nThe egg was strange, that much was certain, but Han Sen was not worried about the mischief it was causing. Even if it turned out to be a hostile super creature, he knew he could take it down.\n\nHan Sen had Disloyal Knight and Little Angel by his side, so slaying a super creature would be a trivial task.\n\nThe egg showed no more activity in the pot, but that scent of alcohol was unmistakable. Han Sen turned to take a look at Bao’er on her airbed, but she was still merrily drinking from her bottle of milk.\n\n“It looks like the egg’s not interested in breaking bottles. Maybe it really is just fond of going after alcohol.” Han Sen grabbed himself another drink.\n\nThis time, Han Sen poured it into the pot.\n\nAfter doing this, the symbols on the egg began to glow brighter. It seemed as if something would soon hatch. But still, Han Sen could not detect a lifeforce. And if he didn’t know any better, he’d still believe the egg to be dead.\n\n“Strange.” Han Sen had a lot of confidence in his Dongxuan Sutra, so this puzzle was perplexing to him.\n\nIt might make sense if an emperor was masking its presence and avoiding detection of the Dongxuan Sutra, but this was just an unborn creature egg. Not even berserk super creatures could avoid his detection.\n\n“I need to find out what you are, you little blighter.” Han Sen grabbed a few more bottles and emptied their contents into the boiling pot.\n\nHe would be better off if the creature was born, Han Sen believed. If he could then kill it for a Life Geno Essence, he could nab a few more super geno points.\n\nSo, Han Sen wanted to see what was inside it.\n\nHan Sen summoned Disloyal Knight and Little Angel, and then the three of them all stared at the egg intensely.\n\nSomething strange was going on, that much was for sure. But all of a sudden, the red color of the egg vanished, and only the pure, clean color of white remained. Strangely, though, it almost looked like it was bleeding. The color red was returning slowly.\n\nThe white egg began to run red, but the red only appeared around the strange symbols. Against the plain white, the color red now really stood out.\n\nHan Sen knelt closer, wanting to get a better look at the egg in the water. Regardless of what was inside, Han Sen was determined to kill and eat the creature.\n\nKatcha!\n\nA lot of small cracks began to form across the white of the egg, and they were spreading quickly. It wouldn’t be long before its entire surface was webbed. But strangely, the area of the symbol with waves was completely free of these cracks.\n\nHan Sen pulled out Taia and Phoenix Sword. Then, he summoned the Ancient Devil Soldier beast soul, which granted him his devilish horns and wings. Little Angel clasped her Angel Sword, while Disloyal Knight shone with a blue light that illuminated the entire cave.\n\nThey all stared at the egg intensely, ready to kill it the moment the residing creature was born.\n\nThe alcohol and water mixture was still bubbling and boiling, and Han Sen thought that if a chicken emerged, it’d taste delicious.\n\nKatcha!\n\nThe egg cracked even more now, and its surface was nothing but a webwork of crevices. Even the red portion of the egg was cracking now.\n\nThe red areas were beginning to peel and fall into the pot like thin strawberry flakes. The red part only covered thirty percent of the egg, so Han Sen still had trouble trying to determine what was within.\n\nHe tried scanning the egg again, and weirdly, he could still not ascertain what the creature was or what it was going to be.\n\nKatcha!\n\nThe rest of the egg broke. The entire egg began to fall away and collapse like a jigsaw puzzle, leaving something behind.\n\nHan Sen saw it, and all he could ask himself was, “Why in the sanctuaries would something like this be inside an egg?”\n\nHan Sen had seen many strange things in his time in the sanctuaries, but this was most certainly winning the award for the strangest thing to emerge from an egg."
}