{
    "chapter": 2896,
    "title": "Red Temple",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2896",
    "text": "The giant xenogeneic’s skeleton looked like the bones of dinosaurs. There were wings on its back, but only the bones of its former appearance remained.\n\nOn the ground below the xenogeneic’s bones, everything appeared petrified. The surface was very rough. There were many carvings on the bones. There were symbols and lines. There were weird crystals on the symbols and lines.\n\n“This is the true space demon dragon,” Bai Kanglang said while staring at the bones.\n\n“This must be the skeleton of a true god class true space demon dragon,” Bai Wanjie said. “The legends say the true space demon dragon had teleportation powers. Mister Alpha used the true space demon dragon’s bones to complete a space teleporter. It was very expensive.”\n\nAll the princes and princesses complimented the Extreme King Alpha’s method, but Han Sen did not think that place had been made by the Extreme King Alpha.\n\nAs they walked out of the true space demon dragon’s skeleton, they saw an island. There was a blue sea around it, but the seawater was extremely dark. It was like ink. There were no waves.\n\nOn the left side of the sea, Han Sen saw a wooden bridge. The wooden bridge was straight. It was a path to get across the sea. Although the sea had many clouds around, they could still see the other end of the wooden bridge. It was another island.\n\nBecause the sea’s clouds were so thick, the light grey mist severely hampered their vision. They could only see a blurry shadow lurking on the island.\n\nMost of the prince and princesses tried to use geno arts to look at the island. They immediately discovered that no matter if they used their vision or senses, they both became greatly worse in the grey mist. If they tried any further, the entire effectiveness would be gone.\n\nPrince Swordstar said, “It looks like the island is our destination. Let’s go to the island first.” He instantly started flying toward the island.\n\nHe had flown about 6 to 9 feet when a sudden scream sounded. Prince Swordstar was sucked down to the ground. It was like a magnet had claimed him.\n\nBecause he wasn’t prepared, Prince Swordstar did not react. He fell to the ground and felt a lot of pain. It seemed as if he had fallen poorly.\n\n“Air-restricted area,” Bai Wanjie said with a frown.\n\nJust that height was enough to make Prince Swordstar fall like that, meaning it was obvious that it was an air-restricted area.\n\n“It is no wonder why there is a wooden bridge,” Bai Lingshang said, looking at the wooden bridge.\n\nSeeing what happened to Prince Swordstar, no one dared to recklessly do anything else. They watched for a while and decided that the bridge was the only way to proceed. The prince and princesses stepped across the bridge and walked to the island ahead of them.\n\n“What is this sea? The water is dark like ink. I cannot see what lurks beneath the waves. There is no wind. There aren’t any waves either. There is not a single movement.” Prince Swordstar kept watching the sea as he walked. He seemed to be annoyed.\n\nThis annoying feeling stemmed from nervousness. When Han Sen looked at the black sea, he felt the same way. He could not blame Prince Swordstar for feeling the way he did.\n\nThe other prince and princesses felt the same way as well. They just did not behave like Prince Swordstar did and show it on their sleeves.\n\n“The Extreme King would not actually put their princes and princesses in danger, right?” Han Sen looked at all the prestigious princes and princesses, but his gaze lingered on Bai Wei.\n\nBai Wei looked more mature than she did before. She appeared beautiful and young, but the atmosphere around her did not go well with her age.\n\n“It looks like Bai Wei has grown up a lot.” Han Sen sighed. He looked away to prevent staring at her too much. Otherwise, she might have noticed something.\n\nThe bridge was 30 to 40 miles long. The entire journey made them nervous, but nothing eventful or dangerous transpired. From far away, they could see the island looked like a volcanic island. It was very low around the very high center. It looked like a volcano.\n\nThere was a red, metallic palace on top of the volcano.\n\nHan Sen looked at the palace. The title of the palace was written in the generic written language of the universe, “Red Temple.” It was just those two words.\n\nHan Sen looked at the palace. He was shocked. The word “temple” was not very common in the universe. The temples Han Sen knew about were the ones occupied by God Spirits.\n\nThis metal palace was named Red Temple. Han Sen thought it was quite strange.\n\n“This should not be the god temple with the God Spirit inside. Otherwise, there would not be the word temple.” Han Sen thought about it, which made him more curious. He wondered what might be inside the Red Temple.\n\nSeeing all of the princes and princesses leaving the wooden bridge, Bai Wanjie suddenly stopped everybody. “Wait a second.”\n\nEveryone turned to look at Bai Wanjie. They did not know what he meant.\n\n“What has the crown prince learned?” Prince Qing Xia asked.\n\nBai Wanjie pointed at the wooden bridge. He pointed at a wooden said. It said, “Thousands of armies on the wooden bridge. Red Temple only keeps the undead.”\n\nEarlier, everyone was lured in by the Red Temple by its peak. They had not observed the bridge. Now, Bai Wanjie pulled their attention to the sign.\n\nBai Lingshang did not understand what it meant, so he looked at Bai Wanjie and asked, “Crown Prince, do you know what it means?”\n\nBai Wanjie shook his head. “I do not know.”\n\nPrince Qing Xia said, “Thousands of armies crossing the bridge is not difficult to understand. It means out of many, many people that cross, only one goes through. This has a similar meaning to the thousand dry bones that are now famous. If it says only one of us can go across this bridge, it makes little sense. It also says that the Red Temple is home to the undead. That cannot be understood. The undead means us or the people in the Red Temple. Nobody knows.”\n\n“Since we are already here, there is no point in turning back,” Bai Kanglang said. “Let’s go to the Red Temple first.” He walked forward and stepped off the bridge.\n\nSeeing Bai Kanglang be so brave, Han Sen smiled. He could guess what Bai Kanglang meant.\n\nThousands of armies crossing the bridge one at a time likely meant something. Perhaps the first that crossed would be the recipient of something good, which is why Bai Kanglang said that. It was not that he was born brave. Plus, the more he walked, the more careful he was.\n\nThe princes and princesses saw Bai Kanglang exit the bridge without danger. They quickly decided to follow.\n\nSeeing all the prince and princesses safely arrive, Bai Kanglang looked a bit disappointed.\n\nThey walked up the Red Temple’s stone stairs. They noted how the entire structure of the temple was built from metal. From afar, it looked like a bead of fire.\n\nPang!\n\nEveryone was checking out the Red Temple when they heard a loud noise. The Red Temple’s door opened by itself."
}