{
    "chapter": 1249,
    "title": "Pretty Chef’s Request",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1249",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“What would you like to eat?” The beautiful chef smiled with a warmth that could melt ice.\n\n“We’ll eat whatever you recommend.” Han Sen proceeded to sit down with Bao’er near the kitchen.\n\nIt was difficult for Han Sen to believe Xue Feiyan was a chef.\n\nHan Sen couldn’t help but wonder to himself, “Is the food she makes actually edible? I hope it doesn’t arrive cold.”\n\nHan Sen wouldn’t be surprised if she served a heaping bowl of human flesh, quite frankly.\n\nBut since he was there, and he had been treated so well by the restaurant, he wasn’t quite willing to run for the door just yet. He was going to stay and witness whatever she decided to prepare.\n\nXue Feiyan did not talk much. She went straight into preparing food, and as Han Sen watched her operate, he couldn’t help but be impressed by her chopping skills. There was an artistic quality to the way she wielded her knives.\n\nThe grill was hot, and as the food sizzled atop it, a delectable aroma wafted out of the kitchen to tantalize the noses of the eager diners. Han Sen and Bao’er actually found themselves rather excited, and they stared at the cooking meat with wide eyes.\n\nProfessional chefs really were in a league of their own, and Xue Feiyan’s skills in the kitchen far exceeded Han Sen’s.\n\nAfter the food was served, Bao’er ate what was on her plate like a ravenous pig. Her chubby face was smeared with grease.\n\nIf this was an all-you-could-eat buffet, Han Sen wagered Bao’er would end up emptying the pantry.\n\n“I did not expect you to be able to cook so well. I appreciate your grace, hospitality, and excellent service,” Han Sen praised her, as he prepared to pay.\n\nXue Feiyan smiled in return and said, “There is no need for you to pay. But might I confess a problem I have? Perhaps you could help me with it.”\n\n“What is it? If it’s a reasonable request, I can certainly be of service,” Han Sen said.\n\nXue Feiyan placed her hat down on a table and then took off her uniform. Then, she went to sit down near Han Sen.\n\nXue Feiyan maintained her professional image, for when she removed her uniform, her body was revealed to be fitted with a tight white dress that delicately cradled her every curve.\n\n“If you can’t do this for me, then I deem the deed impossible,” Xue Feiyan said.\n\n“Okay, go on.” Han Sen was delighted she was willing to request his assistance, and what’s more, it seemed as if she was confiding in him something personal. She seemed to have difficulty mustering the courage to tell him what issue plagued her mind.\n\nXue Feiyan said, “I have actually been here for several months. Every night, I wait in the hope that I can see you. Two of my family members have found themselves trapped in the Third God’s Sanctuary. They are in the Thunder Hell Faction. If you can rescue them, we will pay you handsomely.”\n\n“Where are they, exactly?” Han Sen asked.\n\n“It is a king-class shelter called Blood River Shelter,” Xue Feiyan explained.\n\nHan Sen said, “If news of them being trapped has reached you, I doubt they are in any immediate danger. I’ll check the place out, regardless. Then, after some reconnaissance, I’ll tell you what I can do.”\n\n“Thank you. And believe me, you have our full support. Now and forever!” Xue Feiyan said, in praise.\n\nBefore they left the restaurant, Xue Feiyan provided Bao’er with a lot of different desserts for the road.\n\nHan Sen thought about Blood River Shelter for quite a while. He had always wanted to take down a king-class shelter, anyway. Han Sen could not take on emperor shelters reliably, but he could most certainly assault a king-class shelter.\n\nAfter all, he now had the silver fox back. It even had its tenth gene lock open. This could be a great opportunity for him to collect a few more Life Geno Essences.\n\nXue Feiyan provided Han Sen with the location of where he needed to go, and indeed, he fancied heading out there to see what was what.\n\nWhen he arrived home from the restaurant, he teleported back to the sanctuary. There, he took Bao’er and went towards the shelter Xue Feiyan had told him about.\n\nWith the silver fox and everyone else back protecting Thunder Hell Shelter, even if Saint Fan decided to show, he could return quickly.\n\nSince Thunder Hell Shelter wasn’t a mobile shelter, though, it had to remain there and thus, remain guarded.\n\nWithout a shelter, the plants would dry, and Han Sen needed waterdrops. The more super beast souls Han Sen collected, the more waterdrops he would need to make them berserk, after all.\n\nBecause this place was in the Thunder Hell Faction, the super creatures and king spirits had all taken flight. After half a day of travel, Han Sen saw a red river running to the east of him. It was wide like a sea.\n\nHan Sen frowned. He had been told Blood River Shelter resided on an island in the middle of that same river.\n\nHe didn’t expect the river to be so wide, though, and even from where he was standing, he could sense a wretched presence residing there across the water.\n\nHan Sen didn’t take a straight road to where he was supposed to be going. Instead, he decided to go to where the Xue family members had been spotted. He wondered if he’d be able to confirm their current condition from that same place.\n\nAfter a while, Han Sen saw three peaks in the distance. Strangely, they looked like steamed buns.\n\nHe found a green field to rest in for a while. The two Xue family members were supposed to be on patrol, and they would pass through there."
}