{
    "chapter": 2496,
    "title": "The Story of Genes Leveling Up to King Class",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2496",
    "text": "Despite countless attempts, Han Sen never succeeded in activating The Story of Genes’ cogwheel. But now, things were different. Han Sen had the peacock king’s soul robe. Through the buffs provided by the peacock king’s beast soul, his power could rival that of a deified. With deified power behind him, Han Sen believed he’d have what it took to finally put the self-cogwheel in motion.\n\nAfter a few days, Han Sen found the right time to do that. He locked himself in an isolated room and fired up The Story of Genes to get to work on his leveling up plan.\n\nHe summoned his peacock king beast soul, and the feathery soul robe appeared around Han Sen. The peacock symbol on the back of the robe began to glow.\n\nHan Sen’s heart jumped. The rainbow peacock symbol suddenly became a peacock king shadow. It floated behind Han Sen.\n\nMany rainbow godlight buffs flowed into Han Sen’s body then. Rainbow-like colors shimmered through his aura, generating a substance chain.\n\nWith that unlimited soul power, Han Sen cast The Story of Genes and used the rainbow godlight to push his self-cogwheel.\n\nKatcha!\n\nThe rainbow godlight that could destroy planets was able to push The Story of Genes’ self-cogwheel, but the cogwheel only moved a tiny amount. It looked like an old door with rusty hinges. It was only slightly ajar.\n\nHan Sen was thrilled, though. He kept pushing the rainbow godlight power into the self-cogwheel. The soul robe allowed Han Sen to summon a mind-boggling amount of power, and yet, it seemed to be fighting an uphill battle as it struggled to push the self-cogwheel.\n\n“Such much power, yet it can barely move The Story of Genes’ self-cogwheel. If I used my own power, I have no clue when I would be able to get it moving. Perhaps I would have to wait until all my other geno arts were deified before I could push The Story of Genes to King.” Han Sen was shocked.\n\nThe self-cogwheel moved steadily, and after it completed one cycle, it started to move faster and faster. The spell symbol was getting brighter and brighter, too.\n\nIn the end, Han Sen was able to release his power, and the self-cogwheel was able to spin on its own. The door to the universal core hall was opened for him. Han Sen entered and discovered that he was actually someplace new. It was vastly different from the place he had expected to enter.\n\n“Using different self-cogwheels to enter the core area spawns me in different places, and that means I can appear in four different locations. That is interesting.” Han Sen didn’t stay for long. He proceeded to exit the core area.\n\nThe Tianxia System was too dangerous, so now wasn’t the time for him to kick back and have a relaxed xenogeneic hunt.\n\nThe journey, however, was surprisingly free from strife. They traveled through the Tianxia System for another two weeks. Along the way, they didn’t encounter any other deified elites. Han Sen was able to deal with ordinary xenogeneics and Kings easily.\n\n“Little Captain, you can do it. You can do it. You can do it… Captain, you can do it. You can do it. You can do it. You can do it…” Han Sen and Bao’er were playing Old Man. The pirates were watching. They kept shouting and clapping as they did. If people didn’t know better, they would believe this was a television commercial.\n\nIn that fun atmosphere, it looked as if they were having a simple competition. Han Sen appeared relaxed, but he suddenly became serious.\n\n“Bao’er, guess which card this is,” Han Sen said with a smile. He was looking at Bao’er’s two cards.\n\n“You guess.” Bao’er smiled and blinked at Han Sen.\n\n“You’re getting smart, Little Evil. Not even I can see what you’re thinking about these days.” Han Sen looked at the two cards but hesitated. He couldn’t tell what the two cards in Bao’er’s hands were. He couldn’t tell which was the ghost card and which was the card that he needed.\n\nIf he picked the wrong card, and thus ended up with the ghost card, he would stand no chance.\n\nHan Sen looked at the nearby pirates. He wanted to see if he could read their faces to learn where the right card was, but he received no answer.\n\n“Daddy, stop looking at them. They cannot see what card I have. You can’t learn anything from their faces.” Bao’er smiled beatifically and said, “This time, I’m going to win.”\n\nHan Sen smiled. He reached his hand out to a card and said, “I want this card.”\n\nAs Han Sen touched the card, Bao’er’s face changed. But it was only for a moment.\n\nHan Sen suddenly let go of that card and picked up the other. He flipped it over to reveal a three of hearts. It paired with Han Sen’s three of spades.\n\n“Why… why I lost…” Bao’er clutched her face, looking destroyed. She threw the ghost card down on the table.\n\n“Ha! Ha… your father is your father forever!” Han Sen laughed and stroked her head.\n\n“Do it again! I’m going to win,” Bao’er pleaded while gripping the cards.\n\nHan Sen coughed into his hand. “I think I’m busy now. Let them play with you.” Han Sen quickly stood up and shoved a pirate down to play with her.\n\n“This little girl is getting too smart. I almost got fooled by her. I cannot play with her anymore because losing would be way too embarrassing,” Han Sen thought, touching his nose.\n\nBao’er wasn’t happy that she had finally found a chance to play with him, and she had still lost. She felt quite depressed because of this, and she took it out on the pirates. A short time later, the bodies of all the pirates were covered in stickers.\n\nHan Sen went back to his room and summoned Spell. Ever since The Story of Genes had become King class, Han Sen had tried to figure out what The Story of Genes’ area did.\n\nThe Blood-Pulse Sutra’s self-cogwheel didn’t connect with any universal cogwheels, but it could still push the self-cogwheels of other creatures. The self-cogwheel of The Story of Genes was completely independent, though. It just kept spinning in place, all alone. It didn’t connect with anything.\n\nAside from making Han Sen’s body and genes stronger, he hadn’t discovered what The Story of Genes’ area did.\n\nSpell had become King class when he pushed his self-cogwheel. Some of her abilities had gotten stronger, but otherwise, she had gained no new forms or powers.\n\nAside from her body getting better, Spell was the same as when she was a Duke.\n\nHowever, Han Sen had been surprised to discover a self-cogwheel in Spell’s body.\n\nSpell was just his geno armor, much like the Dongxuan Armor. They were just by-products of geno arts. They shouldn’t possess their own self-cogwheels.\n\nBut Spell was like a real creature, and she had her own self-cogwheel. That really surprised Han Sen.\n\nIf he hadn’t been investigating how to use The Story of Genes, he probably wouldn’t have looked at Spell’s body with the Dongxuan Aura. It might have been a long time before he discovered her self-cogwheel.\n\nSpell’s self-cogwheel was the same as Han Sen’s self-cogwheel. It was like a copied version.\n\nHan Sen was sure that it wasn’t his own self-cogwheel, though. And that was because he was unable to control Spell’s cogwheel.\n\nHan Sen’s eyes suddenly widened. “Does that mean The Story of Genes’ self-cogwheel is designed to push Spell’s own cogwheel?”"
}