{
    "chapter": 1300,
    "title": "Demi-God Arrives",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1300",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe entire place had turned black, like an infinite, suffocating abyss. The only point of light was that of the jue, a sole beacon in a sea of darkness. It guided Han Sen. And in turn, Han Sen guided Lotus Empress. He led her through the realm of black until he reached another point of light.\n\nThey approached it, and there their eyes focused on a glowing goddess statue.\n\n“It looks like Mother.” Lotus Empress spoke as if her mind was vacant, drifting in a far-off reverie. She couldn’t take her eyes off it.\n\nWithout the jue, the other emperors and super creatures were frightened. They had unwittingly found themselves trapped in a dark place no eyes could pierce. No God Emperor frowned and swung his No God Sword in an attempt to form of a vortex and exit the black prison he had been led to.\n\nUpon the altar, the jue flew above the statue depicting a goddess and set the stone ablaze with a mesmerizing fire.\n\nThe statue started to slowly come alive, with a single hand raised. A lifeforce began to sputter through the dark, drifting into the palm of the hand as if it were accepting a blessing.\n\nThe last time Han Sen triggered the altar, there was no sacrifice on offer. In retrospect, that may have been why the statues were displeased and wished to kill him.\n\nThis time, things were different. There were countless emperors and super creatures in the area, and there were none of them that Han Sen and Lotus Empress were particularly fond of and wanted to keep around.\n\nFrom out of the dark behind them, screams now began to erupt. There were cries of fright and bellows of agony, as the collective felt their lifeforces being stolen. It wasn’t happening too fast to stop, but it was going at a speed that would soon see it over if nothing drastic was done.\n\n“What’s going on?”\n\n“What have you done?”\n\n“We can talk about this! We can talk things through.”\n\n“Why are you doing this to me? What did I ever do to offend you?!”\n\n…\n\nNo one could escape the darkness and the draining of their life, and all they could do now was fall to their knees, begging and pleading for a mercy they weren’t going to receive.\n\nNo God Emperor wasn’t like them, though. He scanned what little of the darkness he could in an attempt to locate Han Sen and Lotus Empress.\n\nWhile his vision had been hampered by the darkness, his lifeforce was the only one that wasn’t draining. He could grip and hold it tight, not allowing the smallest modicum to seep out.\n\n“Let me see what you’re both up to, eh?” No God Emperor was fearless.\n\nHe hadn’t seen what it was like for a demi-god to arrive in the Third God’s Sanctuary, though. He had no clue what was actually transpiring, and thus, that bravery could do him a disservice.\n\nNot many people had seen a demi-god return to the Third God’s Sanctuary. Even Moment Queen hadn’t heard of such a ritual.\n\nLotus Empress, in the midst of all that was going on, appeared to be just as clueless. She asked Han Sen, “What is going on?”\n\nHan Sen was fairly aware of what was happening, despite his surprise and awe at it all. The Blood-River King he had unknowingly tried to summon before was so weak, he now assumed, because its sacrifice hadn’t been strong enough.\n\nNow, things were very different. An incredible source of power was being drawn to the statue as if it were a conduit.\n\n“This is an altar to summon a demi-god. The person I am hoping to summon is the prior owner of the Luminous Stone. She herself: Night Empress,” Han Sen explained.\n\nLotus was extremely surprised to hear this, and almost found it difficult to believe. She asked him, “Can you really summon Mother?”\n\n“I hope so, and from what best I can tell… it seems to be working,” Han Sen said.\n\n“This is great!” Lotus Empress stared at the statue with utter glee, like a wide-eyed child on the precipice of seeing something awesome unfold.\n\nAfter absorbing the exorbitant amount of lifeforces, the statue was beginning to resemble an actual person. It seemed to be taking on the shape of Night Empress, alive and in the flesh.\n\nSuddenly, the statue’s forehead began to glow and illuminate the entire area.\n\nEveryone could now see the altar Han Sen and Lotus Empress were situated near.\n\nMost of the creatures and spirits had suffered a loss of half their lifeforce.\n\nUnfortunately for the two near the altar, No God Emperor was as powerful as ever. He came striding towards Han Sen now, swinging his sword with the immediate desire to cut him down.\n\nAs this happened, a strong force landed on Han Sen just as it came.\n\nThe power of No God Emperor finally started to get sapped, and the force and power the spirit had unleashed were absorbed by the statue that had previously brought the land pure darkness.\n\nNo God Emperor could not believe his power had been robbed, just as he was about to kill the pestering human once and for all.\n\nThe statue then opened its eyes to look upon the crowd that had gathered.\n\nLotus Empress noticed the eyes were eyes that belonged to her mother, and without hesitation, she found herself running to the statue, calling, “Mother, I missed you so much!”\n\nNight Empress held her hair as this occurred, and said, “I did not expect you’d be able to summon me here to the Third God’s Sanctuary.”\n\n“Oh, Mother! That wasn’t me. That was Han Sen.” Lotus Empress then went on to explain everything that had transpired that day.\n\n“How dare you disrespect my daughter and all she has built for herself!” Night Empress looked upon all the creatures and spirits in the vicinity with unparalleled anger.\n\nAnd in return, every other being felt incredibly frightened.\n\nBefore Night Empress became a demi-god, she was the strongest in the Third God’s Sanctuary, without equal. If they had known Lotus Empress was her descendant, they wouldn’t have dared to treat her as they had."
}