{
    "chapter": 2529,
    "title": "God’s Wonder",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2529",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was fighting with the wolf god’s doppelgangers when he suddenly felt the space around him shift. He was shocked. He prepared to strike, but then he saw that it was Li Keer who had appeared.\n\n“Come with me.” Li Keer grabbed Han Sen’s arm. Her body jolted and teleported away, taking Han Sen with her.\n\n“I cannot believe Lady Li knows the geno art called Galaxy Teleportation.” Han Sen looked around. He noticed that he was now far away from the planet occupied by the wolf god. Even the bronze furnace had been brought along with them. He was shocked.\n\nHan Sen had always been interested in learning Galaxy Teleportation, but he had never taken the time to learn it.\n\nHis lack of knowledge wasn’t just limited to Galaxy Teleportation, either. He had only learned a small amount of any kind of teleportation. His talents in the field took too long to prepare for use, and he just hadn’t taken the time to learn proper teleportation. That was why he didn’t yet have Galaxy Teleportation.\n\nSo, seeing Li Keer’s casual use of Galaxy Teleportation made Han Sen somewhat envious.\n\n“It’s just a simple trick. If you want to learn it, I can teach you.” Li Keer smiled at Han Sen as she spoke.\n\nHan Sen raised his eyebrows, then asked Li Keer. “What do you need me to do?”\n\nHan Sen didn’t think Li Keer would teach him a skill like Galaxy Teleportation for free.\n\nPlus, Han Sen wasn’t even sure if he had the chops to learn it. Those that could make use of Galaxy Teleportation usually had been born with the talent. The capacity to learn the skill was innate.\n\n“It’s just a small trick. If you want to learn it, I can teach you; I won’t require anything in return. But Galaxy Teleportation does require talent and power. I don’t know if you have what it takes to learn it.” Li Keer smiled.\n\n“Yes, of course, I can learn it,” Han Sen quickly said.\n\nThe chance to learn Galaxy Teleportation for free wasn’t an opportunity that Han Sen was going to turn down. Whether he could learn it or not, he was going to try.\n\n“Then let’s talk as we go. If you want to learn Galaxy Teleportation, you must first learn Teleport. If you cannot use Teleport, you cannot use Galaxy Teleportation…” Li Keer winked.\n\nLi Keer didn’t lie to Han Sen. As she taught Han Sen about Teleport, she guided them steadily toward the core bronze tripod.\n\nHan Sen had already learned a thing or two about Teleport from the times he had used Break Space Flash. He knew the fundamentals, but Li Keer was actually teaching him various types of Teleport. He needed some time to adjust to that first.\n\nBut Han Sen still managed to learn what she was teaching him quite quickly. The techniques that she taught were quite different from Break Space Flash. There was no delay; he only had to think, and he would teleport.\n\n“This is the real power of teleportation,” Han Sen sighed.\n\nBut Han Sen had only just started studying these new techniques, so the distance of his teleportations was limited. His accuracy was poor, as well. He could only teleport accurately within a distance of five hundred meters.\n\nWhen Li Keer saw how quickly Han Sen was picking up teleportation, it caught her completely off guard. She didn’t allow that surprise to show in her face, though.\n\nLi Keer wasn’t just teaching Han Sen ordinary Teleport. She had decided to teach him a skill of the Very High called God’s Wander. It was part of the Very High Sense. Even if they possessed space powers, beings that had learned Teleport couldn’t learn God’s Wander without first practicing the Very High Sense.\n\nOrdinary Teleport skills had a delay. The only question was how long those delays were. Some delays were so short they were barely noticeable at all. The basic Teleport was similar to the highly advanced God’s Wander in that regard.\n\nBut Teleport was the weakest of the skills. After it came Galaxy Teleportation. And lastly, there was God’s Wander. After reaching the highest level of God’s Wander, you could travel across entire systems with a minor thought.\n\nNormal Galaxy Teleportation couldn’t achieve this. The further one wished to travel, the longer it would take to prepare, as well.\n\nLi Keer taught Han Sen God’s Wander. She wanted to confirm the similarity of Han Sen’s geno art with her Very High Sense.\n\nWhen she confirmed that Han Sen could oh-so-simply learn something like God’s Wander, it revealed many things. It was a surprise how much faster he learned the skill than Li Keer had when she was in her infancy. Li Keer was very shocked.\n\n“What kind of person is this? He can use a geno art similar to the Very High Sense? Has someone stolen our Very High Sense? No way! Without the body of a Very High, you cannot learn the Very High Sense. Only the Sky can replicate a part of it, which was how they created the Textless Book.” Li Keer was full of wonder.\n\nBut she didn’t think Han Sen had practiced the Very High Sense or the Textless Book. If he had one of those, he would have known how to teleport already.\n\n“He can’t be like the Very High. And he doesn’t seem to be one of the Sky. Human; what kind of race is that?” Li Keer’s curiosity was driving her nuts.\n\n“If I can get Dollar to become my silkworm, a silkworm that can learn Very High Sense, what will happen? Throughout the entire history of my race, there has never been a silkworm like this. It will be easy for him to become a butterfly.” Li Keer was so excited, she kept thinking, “I wonder what the people in my race will think when they see me with a silkworm like this.”\n\nAfter Han Sen learned Teleport, Li Keer taught him some of Galaxy Teleportation. She left out the part about God’s Wander.\n\nHan Sen believed Li Keer’s teleportation skill Galaxy Teleportation was very similar to the Dongxuan Sutra. Using the Dongxuan Sutra and Galaxy Teleportation together when he teleported actually made the process much easier.\n\nBut there was a limit to how quickly Galaxy Teleportation could be learned. Before Han Sen could learn it in full, they arrived at the home of the bronze tripod.\n\nAccompanying Li Keer had benefitted Han Sen greatly, so he wasn’t slow in moving to help her with the bronze tripod. He took the bronze furnace with him as he swooped forward. The half-deified bronze tripod was strong, but it couldn’t withstand the attacks of Han Sen and his bronze furnace. Shortly after Han Sen began the attack, he killed the creature and cut it in half.\n\nAfter Han Sen delivered the bronze tripod core gene to Li Keer, he asked, “Is one enough, or do you require more?”\n\n“One is enough. It is just a secondary material, however. The primary material is a core deified xenogeneic’s core gene. I cannot hunt such a thing down.” Li Keer sighed.\n\nHan Sen didn’t speak. He had learned two geno arts, Teleport and Galaxy Teleportation, but that wasn’t enough for him to consider hunting a deified xenogeneic on someone else’s behalf.\n\nLi Keer went on to say, “Teleport and Galaxy Teleportation you have learned, but there is one more part. But I have to seek out a deified xenogeneic first. I don’t have the time to teach you.”\n\nHan Sen’s eyes brightened. “There is another part to Galaxy Teleportation I can learn?”\n\nLi Keer looked at Han Sen and laughed. Han Sen knew what she meant, and so he said, “If I help you kill that deified xenogeneic, can you teach me the final part?”"
}