{
    "chapter": 1879,
    "title": "Killing Purgatory Beasts",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1879",
    "text": "On the aircraft, Guna was able to witness the changes transpiring outside the window. She screamed, “Guya activated Purgatory Heaven?”\n\n“What is Purgatory Heaven?” Wang Yuhang asked Guna.\n\nWhen Han Sen left, Wang Yuhang, Han Meng’er, and Lady Chef were tasked with watching Guna, in case she got up to any mischief during his absence.\n\nGuna gave a wry smile, and she shook her head. “It looks as if the Gana cannot be saved, after all. It is good, I suppose, that we all die here. No one shall live now.”\n\nAs Guna was speaking, a noise came from outside.\n\nWang Yuhang wanted to take a look at what was going on, but before he reached the door, an arm shot up from the floor. It shocked Wang Yuhang, and he quickly leaped up on the nearest table.\n\n“What the hell is that?” Wang Yuhang could see that those same arms were starting to pop up all across the floor. Only the bed was devoid of hands, so he jumped over to it for safety.\n\nHan Meng’er and Lady Chef went to the bed, as well. Lady Chef drew out her cleaver and tried to hack the hands. But it wasn’t long before one of her hands was grabbed.\n\nLuckily, Lady Chef was able to pull back quickly. If she hadn’t, she’d have been pulled forward and been a goner.\n\n“What was that? Please don’t tell me you don’t know,” Wang Yuhang asked Guna.\n\nGuna, looking all cocky, said, “Have you heard of the deified item of the Guna? It’s Purgatory Heaven.”\n\n“No, I haven’t.” Wang Yuhang and the others were confused. They had just arrived there, after all, so it was extremely unlikely they’d know about it.\n\nGuna rolled her eyes and said, “Ignorance! How can you guys know nothing about our famous deified item? Anyway… That item has been activated. So, we are now all going to die.”\n\nWang Yuhang smiled and said, “I don’t think so. If it is an item of your race, there must be a way for you to deal with it.” “No.” Guna shook her head.\n\n“If you don’t have a way, then why are the arms unable to close in on your proximity?” Wang Yuhang did not believe what Guna was telling him, and so he gave her a smug smile.\n\nGuna rolled her eyes and said, “I have the blood of the Gana Goddess. So, I can hold them off for a little while. It’s not very effective, though. Purgatory Heaven has just started, so this benefits me a little. When the Purgatory Beasts come, however, I can assure you it’ll be useless.”\n\n“What Purgatory Beasts?” Wang Yuhang asked.\n\nGuna didn’t bother answering, and then, they heard a growling noise inside the room. When the growl came, Guna’s face changed, and her radiance increased to light up the room with a warmer glow.\n\nA black beast with two heads crawled out of the ground. The ship’s floor was no longer alloy. It was like mud.\n\nNow, she no longer needed to explain what a Purgatory Beast was.\n\nDragon Lady summoned a big fork. Holding it, she drove it forward to strike the beast.\n\nThe fork went right through its body, and it was as if she was trying to fork a shadow. The beast was still coming.\n\n“It’s useless. The Purgatory Beast has been generated by a deified item. It is still early, so they are relatively weak right now. But even so, they have deified powers. Ordinary powers won’t hurt them in the least.”\n\nBefore Guna finished speaking, a black arrow went flying into the beast’s head. The beast squealed as the arrow pierced the phantom flesh of the body. The power was so strong, the creature was pinned to the ground and exploded. The beast’s pieces then dissolved into black smoke.\n\nGuna’s eyes opened wide, and she looked at the black-clothed lady. She tried moving her lips to speak, but words could not come.\n\nHan Meng’er had oh-so-simply killed a Purgatory Beast. And it wasn’t long before another appeared. Han Meng’er drew a black arrow and blew up the head of the next Purgatory Beast that revealed itself.\n\n“What is up with this woman? She is just a Baron! How could she kill a Purgatory Beast? Although these Purgatory Beasts are weak, it should still take a King class elite to kill one. They are born from the powers of a deified item.” Guna was flabbergasted, watching Han Meng’er slay the Purgatory Beasts with arrows.\n\nNo beast was able to show up in the room for long, as each one was killed by Han Meng’er.\n\n“No wonder she is called Death Goddess! Only Han Sen can compete with her.” Wang Yuhang spoke fondly, after seeing the Purgatory Beasts get killed so quickly. He gave her a big thumbs-up, too.\n\nOut on the streets, Han Sen, Icebird Duke, and the Gana Holy Lady were surrounded by a legion of Purgatory Beasts. Icebird Duke’s body was brimming with an icy power, and she cast her scary icebird to try to freeze all the beasts.\n\nBut the icy birds went right through the bodies of the beasts and didn’t hurt them at all.\n\nIt wasn’t because her ice birds weren’t powerful; the Purgatory Beasts were simply too high-level. No one without special powers could damage them.\n\nApparently, Icebird Duke was not capable of doing this. She couldn’t restrict the Purgatory Beasts.\n\nHan Sen brought out his Ghost Teeth Knife. He tried attacking one of the creatures that drew near, but even the Ghost Teeth Knife was slicing clean through without hurting the foe.\n\nTeeth power was useless against Purgatory Beasts. Unless Ghost Teeth Knife had been activated to its fullest, like when he was in the Raven palace, it was a useless tool to wield.\n\nThe knife had only been activated back then because the sun raven was too powerful. These Purgatory Beasts weren’t that powerful, and they simply smelled like death. And because of this, the true strength of Ghost Teeth Knife could not activate.\n\nThe Holy Lady Guya kept swinging her hands. She cast blood to attack and end the beasts, but she could not do this for that long. There was a limit to how much blood she could part with. She couldn’t deal with them all.\n\nGuya knew a lot about death, so she wasn’t upset about the prospect of dying. What did make her sad, though, was not being able to see Guna one last time.\n\nHan Sen gathered up some power of his own. He used the godlight from Jadeskin, which was at Viscount class, but it still wasn’t enough to work on the beasts.\n\nAs Han Sen frowned and fell into thought, he heard the sound of a gunshot. A white armored person with two revolvers appeared, repeatedly pulling at the triggers.\n\nEach bullet came out to strike a Purgatory Beast, transforming each and every one into a puff of black smoke."
}