{
    "chapter": 64,
    "title": "Shura’s Martial Art",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_64",
    "text": "\"That’s really me?\" Han Sen couldn’t believe he looked so good. The way the video was edited made him blush a little.\n\nAt that time, he was only doing what he could to help the children out. Although the fall in the end looked tragic, he was in fact able to kick the Shura off him and fly away when they were about to hit the ground. It was not quite as risky as it looked.\n\nThe Shura was already badly injured and had died from the fall.\n\nHan Sen knew that he just got lucky. If the Shura hadn’t already suffered severe injuries, Han Sen would probably have fled or died.\n\nMoving his body around, it still hurt so much that Han Sen had a hard time breathing. He didn’t dare to go to the hospital, but luckily it wasn’t too bad, for none of his vital organ was hurt. Having taken some medicine, he was recovering slowly but steadily.\n\nHen Sen had gained something from it as well. The katana belonging to the Shura was taken home by Han Sen, which was so much better than the weapons made by human.\n\nShuras were much more advanced in making alloy weapons than human. Han Sen had heard since a long time ago that Shuras’ katanas were awesome. Even the black-horned Shuras used better katanas than Z-steel weapons. Now what Han Sen had was a katana from a golden-horned Shura, which should be the best of the best. There was simply no product of the same level as this katana.\n\nHan Sen wielded the katana and felt that it was frighteningly sharp as it felt as if it could break the air.\n\nHan Sen no longer dared to try the katana out with any weapon for he knew the katana was probably even sharper than his Z-steel dagger.\n\nThe video was so widespread that Han Sen was also worried that people might recognize the katana and thus himself to be Dollar. So he had decided to make some changes to the katana, which were mainly to change its color. He spray painted the katana in a golden color so it looked as if it were made of brass. He also ordered a cheap but flamboyant sheath on the Skynet so no one could tell it was a Shura katana when it was in the sheath.\n\nIn fact, Han Sen did not intend to use it in front of others. These were just precautions he took.\n\nHan Sen had also wanted to replace the hilt of the katana to make it even less recognizable, but was unable to remove the hilt. However, he found a bead embedded in the hilt and took it out. To his surprise, the bead was hollow.\n\nInside the bead, there turned out to be a small memory chip. Han Sen inserted the chip into his device, trying to figure out what was stored there.\n\nWhat he didn’t expect was that there was a Shura's martial art recorded in the chip, which was called Bladestorm. The description said it was the top secret of a Shura aristocratic family.\n\n\"Can a human learn Shura's martial arts?\" wondered Han Sen. After reviewing Bladestorm, he was convinced that he could learn it as long as his physical fitness level was high enough.\n\nHan Sen started to try and practice Bladestorm and didn’t encounter too much obstruction, which meant his physique had reached the prerequisite of Bladestorm.\n\nBladestorm sounded like weapon skills, but it could also be used without any weapon. The key was to fully explore the potentials of one’s body in order to launch swift and powerful strikes. If one became skilled in Bladestorm, one could launch those strikes with any part of one’s body.\n\nHan Sen hadn’t recovered at the moment anyway, so he didn’t go back to God’s Sanctuary and stayed home practicing Bladestorm. Lin Beifeng was the only one who called daily to check when he would go back to Steel Armor Shelter and start to hunt. Qin Xuan thought he was just hiding from Son of Heaven, so she didn’t call.\n\nHan Sen checked his ringing comlink and it was Lin Beifeng again. He hesitated before picking up.\n\n\"Sen, how come you are still not in God’s Sanctuary? I’ve been waiting for you,\" lamented Lin Beifeng. Han Sen didn’t even turn the video chat on because he was depressed enough just by listening to Lin’s voice.\n\n\"I will not hide from you. The truth is that I am recently preparing for a big campaign,\" Han Sen said mysteriously.\n\n\"What kind of campaign do you have in mind? Count me in!\" said Lin Beifeng eagerly.\n\n\"I won’t disclose the details now, but at least we’ll be able to hunt mutant creatures.\" Han Sen was telling the truth. He was planning to go into Dark Swamp as soon as he recovered. He couldn’t guarantee sacred-blood creatures but there would surely be mutant creatures.\n\n\"Sen, you must count me in...\" said Lin Beifeng hurriedly.\n\n\"I’m working with others on this, so the team members are fixed and I cannot add anyone in,\" Han Sen kept Lin Beifeng in suspense before he continued. \"But I’m short of money recently, and if you can provide me with some Z-steel arrows with 5 percent Z-steel, I will send you part of my share of the preys, and it won’t be less than an entire mutant creature.\"\n\n\"Excellent. I’ll send you those arrows right now,\" replied Lin Beifeng without demur.\n\n\"Hang on. I’m busy at the moment. Just have the arrows ready and I’ll contact you when I’m ready,\" said Han Sen.\n\n\"It’s a deal then. Don’t eat your own words,\" Lin Beifeng still felt insecure.\n\n\"You can rest assured that you will get your share.\" Han Sen had been concerned where he could get some nice arrows. Now that Lin Beifeng was willing to sponsor him, he was all set. It was mutually beneficial as well. He would give Lin some mutant creature meat when he came back.\n\nIn the worst-case scenario, if he couldn’t hunt anything, he could still evolve any creature into a mutant one using the black crystal in a few days and pay Lin with that.\n\nHan Sen rested at home for a dozen days before he fully recovered. While he was resting, he did nothing other than practicing Jadeskin and Bladestorm. Eventually he could start to use Bladestorm."
}