{
    "chapter": 2280,
    "title": "Are You Afraid of Needles",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2280",
    "text": "“If you weren’t there, what would be the point of me staying in that palace of yours?” Han Sen asked distractedly as he turned the needle over in his hands.\n\n“That is my business, just do as you’re told,” Yisha said.\n\nHan Sen smiled at Yisha. “I must apologize, my Queen. I am a guy who would rather have his freedom and be able to relax as he chooses. I’m not a fan of staying put and looking after something. You should really go and take care of your own palace.”\n\nYisha returned his smile with a wry one of her own. “If I could return, I wouldn’t be talking to you right now, would I?”\n\nShe started to say something more, but suddenly, Han Sen froze. He was staring at the ghost statue, and with a flick of his wrist, he tossed the needle toward it.\n\nYisha sighed. She had spent some time researching that bone needle. It was almost completely indestructible, but it had no power. She had been unable to feel any power residing at its tip. If she had been able to use the bone needle and any power it possessed to break the ghost statue, she wouldn’t have been bound there when Han Sen found her.\n\nBut Yisha stared with a slack jaw as the bone needle sailed toward the statue, completely unimpeded. The ghost statue had knocked Han Sen to the ground countless times, but it didn’t react to the bone needle at all. It merely watched the bone needle strike its forehead.\n\n“This… How is this possible…?” Yisha’s eyes were wide. She gazed at the strange scene with disbelief.\n\nWhen the bone needle pierced the ghost statue’s forehead, the needle lit up red. It shone brighter and brighter, and before long, the ghost statue started to shake. The noise of breaking rocks began to rumble around them.\n\nPang!\n\nThe next moment, the statue fell to pieces. The grip holding Yisha and the blood kirin was suddenly released. They fell to the bridge, the shattered remains of the statue’s hands falling around them.\n\nThe blood kirin was injured, but it hadn’t lost much strength. It gathered itself back up, and its signature red cloud swirled around it.\n\nYisha was close to death, and the blood in her body had almost run dry. She was very weak, and she didn’t have the strength to react. She fell to the ground limply.\n\nHan Sen caught her in his arms to prevent her from hitting the bridge. He smiled and said, “My Queen, it looks like you are going to have to tend to your palace after all.”\n\nThe purple air across the entire jade bridge began to spread and thin. Giant rocks began to fall. Yisha was held in Han Sen’s arms. As she looked up at Han Sen from below, her heart started to feel strange.\n\nShe had never seen a man from a lower angle. She was always the one up high. She had never felt like this before, and suddenly, she started to feel even weaker.\n\nAs the last pieces of the ghost statue fell, the purple air across the bridge began to evaporate. Han Sen, the blood kirin, and Yisha started to return to normal. The jade bridge that had seemed endless now looked as it previously had. They could see the other twelve jade bridges around them and the thirteen teleporters in front of them.\n\nFox Queen and the others, however, were gone. They must have traveled through the teleporter and left that palace.\n\nBecause the blood kirin was injured, Han Sen opted not to ride it. He was still holding Yisha as he strode across the jade bridge.\n\n“You’re not going to go through the teleporter?” Yisha asked weakly from where she was cradled against Han Sen’s chest.\n\n“Of course I will, but before that, I want to walk across the rest of the jade bridges,” Han Sen said with a smile.\n\nHan Sen wanted to walk the thirteen bridges for one simple reason: he wanted to get each statue’s power.\n\nAfter Yisha gave him the bone needle, he realized that the bone needle was a xenogeneic treasure that combined with Blood-Pulse Plunder. If he used Blood-Pulse Plunder by itself, he would need to beat the enemy first. He couldn’t use Blood-Pulse Plunder to take away an opponent’s blood pulse until the enemy didn’t have enough power to fight back.\n\nIf Han Sen was squaring off against an extra-strong enemy, though, there was always the chance that he might not be able to beat them. During times like that, Blood-Pulse Plunder wouldn’t be very useful.\n\nBut with this bone needle, things were different. Han Sen could imbue the bone needle with the powers of Blood-Pulse Plunder. After that, he only had to put the bone needle into an enemy’s body, and the bone needle would plunder the enemy’s blood pulse. Han Sen only needed to stick the needle into a foe.\n\nThat being said, the bone needle wasn’t powerful on its own. Han Sen would have to use his own strength. But piercing a needle into an enemy was still far easier than trying to beat an opponent that had him bested.\n\nThe statues on the thirteen bridges were each prepared for the combination of Blood-Pulse Plunder and the bone needle. The bone needle could easily pierce the statues and take the hidden blood pulse power that resided within them. Han Sen would basically have to repeat what he did to the ghost statue. The bone needle had a concentration of power now, too.\n\nIt was just a drop, but it was a blood pulse hell power. It was a deified power.\n\nThere had to be something similar on the other twelve bridges. That was something Han Sen was most assuredly not going to miss out on.\n\nHan Sen switched positions and carried Yisha on his back. He walked to another jade bridge, and just as he had expected, the first half was safe. When he approached a statue in the middle of the bridge, he used the bone needle to absorb the blood pulse power inside the statue. The statue then fell, and the bridge lost its protection. It became an ordinary jade bridge again.\n\nHan Sen walked through the rest of the bridges and took the blood pulse power from the statues. Yisha’s surprise was written plainly across her face, making it obvious that she had no clue why the bone needle was so powerful in Han Sen’s hands.\n\nYisha had picked up the bone needle, but she had no idea that the needle had to be used in conjunction with Blood-Pulse Plunder. She didn’t have Blood-Pulse Plunder, so aside from its sturdiness, the needle had no utility in her hands.\n\nThe second Sacred Leader statue had been destroyed for some reason, so Han Sen hadn’t been able to retrieve the bone needle personally. Yet it landed in his hands anyway when Yisha volunteered it.\n\nThe Sacred Leader had blocked all the routes, but something had been left on each path for those that traversed it. The items were connected with each other in ways that Han Sen hadn’t yet figured out. The Sacred Leader’s full plans were still a mystery.\n\nThe Silver Sycees, Blood-Pulse Plunder, the bone needle, thirteen blood pulse powers—they were all very rare and valuable treasures. At this point, he could easily start a fight with a deified being.\n\nThe treasures were meant to be obtained through tests given by the Sacred Leader. No one had realized how scary the Sacred Leader’s treasures could be.\n\n“My Queen, are you afraid of needles?” Han Sen asked Yisha.\n\nYisha was shocked, and she did not know what he meant.\n\n“I mean, are you afraid of being pricked with a needle?” Han Sen blinked and asked.\n\n“Are you going to give me a shot?” Yisha looked at Han Sen.\n\nHan Sen lifted his bone needle while he smiled at Yisha. “Close your eyes if you are afraid. The pain will be over in a second.”\n\nAfter that, Han Sen thrust his bone needle into Yisha’s chest. A drop of hell blood came out, and it blended into Yisha’s own blood.\n\nIf he wanted to survive, he had to get rid of Fox Queen. And unless another deified elite challenged her, it was unlikely Fox Queen could be defeated.\n\nEven with Han Sen’s deified blood pulse, his actual power wouldn’t be deified. Yisha, however, was different. She was half a step away from being deified herself. Getting the hell blood pulse would give her a boost towards the lofty goal of becoming deified. This was their best chance of taking the Sacred Leader’s treasure."
}