{
    "chapter": 1917,
    "title": "Stealing Spring Water",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1917",
    "text": "Han Sen quietly drew out his Ghost Teeth Knife. He stood near the spring and waited for it to erupt. Sword Know frowned, but he didn’t attack Han Sen. He knew the Kings were watching him. If they fought Han Sen now, Yisha wouldn’t be very forgiving.\n\n“Don’t think Knife Queen’s protection grants you the ability to do anything you want. When the spring erupts, you better not stop me. I will fight you for it,” Sword Know said grimly.\n\nHan Sen continued to ignore him, and he just focused his attention on the spring’s eye.\n\nSword Know, seeing Han Sen being so arrogant, was enraged. He was an Earl, and Han Sen was just a Baron. That made him very upset. He wished to say something, but someone came closer to the spring’s eye. It was Moon Wheel King’s eldest daughter, Rebecca.\n\nThe person directly behind Rebecca was the Viscount of the Tego. He had also become an Earl now. The change happened after he fought the xenogeneics.\n\nNot long after, seven or eight Earls arrived. They had all just become Earls, as well. They didn’t make it obvious like Sword Know had by making themselves Earls as soon as they arrived.\n\nBut they knew what they were each trying to do, and so no one raised a fuss to blame one another.\n\nThe people that the Kings had sent were the Earls that needed to take the spring water. The Viscounts did not come. They took a path through the mountains, to prohibit the xenogeneics from coming in. They were killing all that dared to try.\n\nSuddenly, near the spring’s eye, the red mist vanished, revealing a black tunnel. It was only around the size of a man’s fist, and it was difficult to determine how deep it went.\n\nAfter the mist faded, a red light shot out of the cave. It fired straight up into the sky like a red beam. The beam was around an arm’s thickness. It rose into the sky, but it did not spread out. It looked rather weird.\n\nThe Viscounts and the Earls knew the red mist spring was now erupting. The Earls quickly positioned themselves so they could steal the water.\n\n“Get away!” The Tego Earl came at Han Sen, holding a big knife.\n\nThe spring eye was too small, and the surrounding area was fairly limited. Seven to eight people were already there. Han Sen had taken the best spot, and the Tego wanted to push him away.\n\nHan Sen stared at the man, because he was not going to budge for anyone.\n\nThe Tego Earl’s eyes looked cold. He swung his Ghost Head Knife at Han Sen. The black knife looked like the gaping maw of a tiger, ready to swallow him up.\n\nRebecca and the others were shocked. They weren’t expecting Tego to go all in. He really wanted to kill Han Sen.\n\nGenuine fights often made the avoidance of death a difficulty, but Han Sen was Knife Queen’s student. Even if Rebecca was the one who wanted to kill him, she’d have to think twice about doing such a thing. It was rare for the Tego to do something like this so recklessly.\n\nBut the Tego Earl had been sent here by Shadow King. The others now thought that this might have made sense.\n\nShadow King was a very cruel individual. He controlled the Rebate’s Dark Moon Hall, and often committed to acts that destroyed families. He wasn’t like any of the other Kings. His men were fearless, unlike ordinary Nobles.\n\nHan Sen merely moved his legs and evaded the Tego Earl’s attack. He quickly leaped above the Tego’s head.\n\n“Good.” The Tego had expected Han Sen to move away with that speed. His left hand punched upwards, though, with a lion’s roar to accelerate it. It was something that was even scarier than the blade he wielded.\n\nNow everyone realized his proficiency actually lay in fist skills and not knives. The attack was just to trick Han Sen.\n\n“Scary guy. He must be a part of Dark Moon Hall,” Rebecca thought to herself.\n\n“Han Sen is either going to die or be heavily injured,” Sword Know and the others guessed. Han Sen was fast, but the Tego Earl could anticipate and match his speed. They were so close to each other, and the latter was a far stronger fighter. If he wasn’t going to be merciful, Han Sen was a dead man.\n\nSeeing the Tego’s facial expression, though, it seemed unlikely that he’d be handing out mercy.\n\nAs the fist-like tiger come up to Han Sen, Han Sen accelerated. In the air, he flew around like a hawk and avoided the Tego Earl’s fist attack. Then, he used his Ghost Teeth Knife to slash the felon’s neck.\n\nThe Tego Earl’s neck had a small slice. It wasn’t a deep cut, but it was bleeding. And what’s more, it emitted a purple mist.\n\n“What are those shoes Han Sen has? They’re so fast! That speed is equal to the best even a Marquise can achieve.” Rebecca and the other Earls were all in shock. They looked at Han Sen’s rabbit shoes with ravenous greed.\n\nThe Tego Earl had been struck with Teeth power. The wound was small, though, and he was an Earl, so the power spread slowly. It’d be a little while before much damage was inflicted.\n\nThe Tego Earl roared with anger, and he wished to strike Han Sen again. But then, the spring eye flashed red. A red ball shot into the sky. It was so fast, not even Han Sen could react to it in time.\n\nBut as it went higher, it slowed down. When it reached a hundred meters in the sky, the red ball exploded. It was like a firework, and the spring water came out with it. There was a scatter of seven to eight drops.\n\nThe Tego Earl did not have time to fight Han Sen. Rebecca and the others were rushing up into the sky to collect the red waterdrops. But after rising a mere dozen meters, something suddenly flashed and sent them back down. They couldn’t even eat dust.\n\nRebecca and the others were shocked. Han Sen was far too fast, and he was going to take two to four drops of the spring water.\n\nThey had clearly underestimated Han Sen’s speed. Han Sen was flying like a phoenix, with the speed of shooting shadow. He managed to take every single waterdrop, and not leave a single one for the others.\n\nEveryone was so mad, they wished to fight Han Sen. But then, another orb came shooting into the sky. Everyone was shocked, and they all tried to get the spring water that would be inside this second ball."
}