{
    "chapter": 2990,
    "title": "Love Killing Pigs",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2990",
    "text": "Pang!\n\nHan Sen’s body was like a sponge being squeezed by the young man’s hand. Suddenly, another version of his body appeared behind the young man.\n\nA weird power movement was coming out of Han Sen’s fingertips. It tapped the back of the young man’s head.\n\nThe young man coldly laughed. “If it was four holy spirits combined in one, perhaps it would work against me a little. With just the Kirin’s holy spirit, you cannot damage my God Spirit holy body at all.”\n\nThe young man’s expression quickly changed. He noticed that Han Sen had not used the Holy Kirin’s power. He had just been tapped on the back of the head.\n\nAfter that hit, Han Sen was sent flying a thousand miles.\n\nThe young man turned around. He coldly looked at Han Sen and said, “I said, I am better than Qin Xiu. I am the true immortal God Spirit holy body. Your power does nothing to me.” Han Sen’s finger had not even hurt his scalp.\n\nHan Sen remained silent. He quietly looked at the young man.\n\n“Stop wasting time. After I kill you, I will reunite you with your son in the pits of hell. I will make sure you don’t end up too lonely there.” The young man raised a hand. He wanted to combine the power of his holy body and the God Spirit power.\n\nWhen he raised his arm, the young man’s eyes looked smaller. He saw that his finger was uncontrollably shaking. It was steadily shaking faster. It was like his finger was playing piano in the air.\n\nIt was not just his hands. The young man quickly discovered that his entire body was shaking. His muscles were twisting, and his blood vessels were jumping. He was shaking more than a person with Parkinson’s disease.\n\nHis body was powerfully shaking, but the young man could not feel anything wrong. It was like the body that was shaking was not his.\n\nThe young man brought his hands together, but he could not stop from shaking. He screamed at Han Sen. “You! What did you do to me?”\n\n“Nothing. I just don’t like trouble. Fighting powerful creatures can be tiring, so that is why I prefer turning powerful creatures into pigs. Then, I kill them as they squeal. It is easier that way.” Han Sen looked at the young man calmly. He lifted his cause karma knife. The holy flame on the knife was wildly shaking.\n\n“What are you? How dare you talk like that directly in front of me. Die already!” The young man flashed a blue light. He was going to grab Han Sen.\n\nJust as he moved, his bones and flesh appeared to recede. The blue god light was fading away. The crystal god body was suddenly smaller. He now had a common body.\n\n“How is that… Impossible… My God Spirit holy body…” The young man was in complete shock. He peered at his hands.\n\nHis hands were already leaving God Spirit mode. His entire God Spirit body started to wilt soon after. His life force and presence were shrinking. He dropped down from true god level to butterfly class.\n\n“Right now, aren’t you just a pig for me to kill?” Han Sen raised his knife and swung it.\n\nMany knife streams were in the sky. They moved with Han Sen like a galaxy going into the young man’s body. “Argh.” The young man forced himself to use his holy body’s time and space power, but butterfly time and space powers were not enough to block Han Sen’s stream of knives.\n\nPang!\n\nThe young man’s body was hit by the knife stream. He exploded with a blue light. A trail of blue light quickly went into the darkness. In the darkness, the young man gnashed his teeth and yelled, “Han Sen, I will kill you!”\n\nHan Sen ran into the darkness, but he could not see that young man’s body again. He frowned.\n\nHan Sen looked back. He saw a pile of blue metal chips on the floor. Han Sen used his Purple-Eye Butterfly to take a look at the chips. He quickly discovered that those pieces belonged to a metal doll. It had to have been a treasure for copying one’s body for survival.\n\n“What a shame I did not kill him.” Han Sen looked at the bodies of the demon lady and the others. He waved his hand, and their bodies were collected in Destiny’s Tower.\n\nHan Sen did not like them much. If it was not for Littleflower, he would have killed them while he was destroying the holy palace.\n\nNow that they were dead, Han Sen was not going to be sad. They were true god class bodies. Han Sen wanted to take them back and see Littleflower’s reaction when he saw them.\n\nIf Littleflower had no objections, Han Sen would happily turn them into geno fluid. He looked at the ruins of the holy palace and departed the big barren systems. After leaving the big barren systems, he teleported back to Space Garden.\n\nHan Sen thought, “Super God Spirit body and Super Spank are powerful, but I am not sure what power that was. After killing the God Spirit, they will be destroyed and not leave anything behind. To me, that is not beneficial. I will be unable to get God Spirit genes or God Spirits. I also won’t be able to get God Spirit armaments. I will be unable to make myself stronger.” He thought he should kill low-level God Spirits first to find the god personality armament that was suitable. Then, he could move on with saving Golden Growler. After returning to Space Garden, Han Sen saw Nine Thousand King. He had delivered the xenogeneic genes to Space Garden, which was how he had avoided being killed.\n\nHan Sen told him about the demon lady and the others being killed. He also told him about the young man. When Nine Thousand King heard all of that, he was infuriated. He gnashed his teeth and said, “He is a traitor.” “Do you know him?” Han Sen asked.\n\n“How could I not know him? He was the master’s favorite student. The master even gave him a name. They shared the same name even. His name is Qin Lan. Master treated him like a son. His reputation was higher than the 10 generals. I did not expect him to betray everything.” Nine Thousand King looked very angry. He wanted to skin Qin Lan alive and get rid of Sacred’s traitors.\n\nHan Sen asked Nine Thousand King about Qin Lan, but Nine Thousand King did not know much. He did not know Qin Lan was a gene clone of Qin Xiu. He did not know anything.\n\nThe xenogeneic genes Nine Thousand King brought surprised Han Sen. There were many true god class and butterfly class xenogeneic genes. There was enough there to make Little Angel true god class. Han Sen thought, “The leftover resources can make someone else true god class too. Who should I give them to first?” Aside from Little Angel, who was able to combine herself with him, the others could help him out in less obvious ways. It was hard for them to match him.\n\n“There is no rush with this matter. I’ll just leave things as they are for now. I have to put a god personality into a god personality armament first.” Han Sen found a chance to be Dollar again. He took the god personality to the god palace."
}