{
    "chapter": 2782,
    "title": "God Corpse",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2782",
    "text": "Bai Wanjie used a deified weapon to slice straight through a Flower God’s brain. But even though its bisected brain and body fell into the soil, the creature healed so fast that the process could be seen with the naked eye. The creature was back on its feet in moments.\n\nThat big Space Garden was filled to the brim with the acoustics of killing. The Kings were basically all dead, and the deified elites themselves were not faring very well. Deified blood was everywhere.\n\n“Let’s go!” Han Sen looked at Lone Bamboo. The talented Sky still had the power to fight, so Han Sen wasn’t too worried about him. He grabbed Xie Qing King by the arm and flew tens of thousands of meters away, heading deeper into the Space Garden.\n\nThe lower reaches of the Space Garden weren’t too safe, either, but Han Sen had detected the presence of Violet somewhere around there. Han Sen sensed that Violet and a few other Flower Gods had survived the violent rapture, and they must have escaped to someplace below.\n\nA few of the Flower Gods emerged, and Han Sen swung his fists to punch them away like sandbags.\n\nMany of the enraged beings tried to stop them, but Han Sen couldn’t be stopped. He fought his way through the Space Garden to reach the deepest recesses of the realm. He eventually came before a tree, and he struck the trunk, knocking a big hole in it. The tree was apparently hollow, and Han Sen hauled Xie Qing King inside with him. Once they were inside, Flower Gods that were chasing them backed off.\n\n“This place seems weird,” Xie Qing King said quietly as he followed.\n\n“Indeed, it is weird,” Han Sen agreed with a nod, glancing around warily.\n\nThey were walking down a subterranean path, but the walls around them were not made of dirt or stone. They were very large vines that had woven themselves together like a solid wall. Furthermore, the vines were semi-transparent, and so they looked like blood vessels. Han Sen could barely make out the shape of the vines, but he could tell something was moving inside them.\n\nThey hadn’t walked for very long when they suddenly saw the space ahead of them start to widen. It led to a giant, empty void. Countless tendrils had gathered together to form the walls of that giant underworld.\n\nHan Sen found Violet and the other Flower Gods there. They were standing in front of a huge vine that connected the floor to the ceiling.\n\n“Violet, you are a very evil man. Your tricks have brought harm to a lot of good people. Do you think you can get away with such acts in this universe?” Han Sen asked, walking slowly up to Violet.\n\nBut Violet and the others didn’t even spare him a glance. Their hands were folded in a praying gesture, and they were mumbling something to themselves.\n\nViolet did answer him, though. He coldly said, “If we didn’t do this, the Flower Gods would have become extinct. There would have been no future for our people.”\n\nAs Violet spoke, Han Sen and Xie Qing King reached him. They looked at what he was keeping his attention on, and they saw a creature inside the pillar of tangled-up vines in the center of the enormous room. It was sitting there, and it looked like a giant.\n\nThe creature had to have been 100 meters tall. Its entire body was like jade. The surface of its flesh shimmered like crystal. Tentacles coiled around its body, latching onto the creature in various places. They kept absorbing a substance or energy out of the giant.\n\n“What is it?” Han Sen asked, looking at the giant that looked like a jade statue. He felt a familiar presence from the giant.\n\n“He is God,” Violet answered, his eyes looking very impassioned and earnest.\n\n“God? What kind of god is he?” Han Sen asked with a frown.\n\n“He has no tier. He isn’t like those rubbish deified creatures. This is an actual god. It is God, and God can do anything.” Violet’s expression looked like that of a deranged madman.\n\n“How do you know he is really God?” Han Sen finally understood why that giant had a familiar presence. It was because, even though the being seemed to be dead, its body still had that feeling Han Sen despised. It wasn’t really God. It was a god like King Jun.\n\n“I just know it,” Violet coldly grunted. Then, he quickly explained, “The Space Garden you have come to know used to be a small ganoderma lucidum. It was only the size of a man’s hand. But due to an accident, the small ganoderma lucidum’s spores landed on the god’s dead body. It absorbed the god’s power, and it has been growing all the way up until now. The ganoderma lucidum’s body became its own xenogeneic space, and it spawned so many xenogeneic plants… If this being is not a god, then what sort of creature’s corpse could offer such power?”\n\nHan Sen looked at the jade giant. For all he knew, gods couldn’t attack creatures of the universe. But also, the creatures of the world shouldn’t be able to touch them, either.\n\nIf that jade giant really was a god like King Jun, even if he died, it shouldn’t be possible to use his corpse as a base that other beings could grow off of.\n\n“What is this thing? Could it really be the corpse of a god?” Han Sen’s heart pounded as he tried to think.\n\nBefore Han Sen could ask anything further, Violet kept on talking. He seemed pretty excited.\n\n“Our ancestors witnessed the beginning of the ganoderma lucidum’s parasitic claiming of the god’s corpse, and they guarded this place with their lives. They tried to figure out what the god was, exactly. But they were never able to find out. Our race, however, started to grow many flowers on our heads. These flowers gave us the ability to evolve quickly. Although we have been developing quickly, we’ve been struggling to catch up to the other creatures of the universe, which have been evolving for billions of years. The speed of our development has accelerated dramatically, though. It was like a big jump for our people.”\n\n“After many generations of research, we finally found a way to absorb god’s power directly… We just had to turn ourselves into plants. We have imitated the ganoderma lucidum’s parasitic claiming of the god’s corpse, in a way. It absorbed the god’s corpse’s power, and we intend to do the same.”\n\n“I don’t think that your plan is going all that well. Those Flower Gods have power, but it looks like they were driven insane in the process.” Han Sen now understood why the Flower Gods suddenly possessed such frightening levels of power. It was due to them leeching off the god corpse’s energy.\n\n“Yes. But we can say that we succeeded as much as we can say we failed. We used the tentacles of the Space Garden to allow ourselves to absorb the god corpse’s power faster. We don’t need to eat the xenogeneic plants to gain god’s power anymore. This way is faster, and our people are evolving much faster, which proves that our theory was correct.”\n\n“In the past, it was impossible for us to gain a deified elite. But right now, after directly absorbing the power from the god’s corpse, everyone has started to become deified like it was the easiest thing in the world.”\n\nAs he said this, Violet’s face was brimming with pride. “But it is a shame. Right now, at this time, a complication has shown up in the bodies of most of my people. They cannot handle the power of the god, and so they have started to become plants. Even their thoughts are starting to decompose. They even buried themselves in the soil to behave more like a plant… But I am different…”\n\n“Why are you different?” Han Sen knew this was the most important point. He stared at Violet, who was looking more insane with every minute that passed.\n\nViolet’s face looked so prideful; it couldn’t be described. “I am the chosen one. I can accept God’s power. I won’t become a vegetable like the rest of my people. I do, however, have a minor issue. I have to pass a test that God himself gave me.”"
}