{
    "chapter": 1853,
    "title": "Wish",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1853",
    "text": "Han Sen did not like making wishes. He knew what had happened to Dawn, Uncle Bug, and the Ning family’s Second Mister, and it had completely soured him on the concept of making wishes.\n\nHan Sen did not think Skygod was a good character.\n\nChiron Earl had made a wish, but he was killed alongside the rest of his helpers.\n\nHe did not know if Wind Viscount had made a wish, but he had died, too. And on top of that, he had infected the rest of Han Sen’s people back at base with the sacrificial marking.\n\nHan Sen did not say anything. And there were only two wishes he could realistically make. One wish was to ask Skygod to erase everyone’s markings, but that was something that Skygod was suspiciously leading him to request. If he wasn’t leading Han Sen on, he wouldn’t have mentioned the possibility in the first place.\n\nHan Sen did not think he was any more important than Wood Duke. But Skygod had spoken a lot more to Han Sen, and so it was fairly obvious that Skygod wanted something from him.\n\nHan Sen couldn’t make this wish. Even if everyone did get their markings removed, the egg was still around. The infection, in some way, would go on. And on top of that, Han Sen only had one Raven feather.\n\nHe could also wish for the Raven to be born without the need for a sacrifice.\n\nAccording to what Skygod had told him, if the Raven was born, the markings would be useless. The people with them would not be hurt, and if anything, those who had been marked would only benefit.\n\nBut Han Sen couldn’t be sure this was the truth just because Skygod had said so. It might just be another way that Skygod was trying to deceive him.\n\nIf this was the truth, there was the whole matter of pondering what to do once the Raven was born. It required a grand sacrifice for its birth, so only the gods knew how much it would later require, as it grew up.\n\nAt least it wouldn’t have the ability to kill, presumably. But that couldn’t be known until it was born. It could actually be scarier once it was born than when it was in the egg.\n\nWishes like that seemed too dangerous to Han Sen. But the silver fox, Xie Qing King, and Gu Qingcheng possessed the mark. If he didn’t sort this out soon, everyone here could die.\n\n“Make your wish.” Sun Skygod’s voice boomed again, echoing across the hall.\n\nHan Sen did not bring out the steel feather yet, though. He just asked, “Lord Skygod, is there anyone else like you, that can grant a wish through sacrifices?”\n\n“This has nothing to do with your wish,” Sun Skygod said.\n\n“It has nothing to do with my wish, but I had a few friends who made a wish to a so-called god. Their dreams might have come true, but ultimately, their lives all turned to misery. I am afraid of ending up like them. I don’t want to make a wish and find myself unable to enjoy it,” Han Sen said slowly.\n\n“I am not that kind of god,” Sun Skygod said.\n\n“So, you are saying there are other gods like you?” Han Sen’s eyes turned bright. He had been looking for that god for a long time, but he had never been able to pick up on a single lead. He hadn’t expected to find one here.\n\n“You cannot compare those fake gods to someone like me,” Sun Skygod said in irritation.\n\nNow Han Sen knew that other gods did exist. And now Han Sen wanted to know information concerning the gods Skygod knew, and whether one of them was the god that the Seventh Team had encountered.\n\nHan Sen wished to ask something more, but Sun Skygod said, “I am going to rest. Give me your feather and make the wish now, or wait another thousand years.”\n\n“I appreciate the offer. I’ll think about it, and maybe I’ll make this wish in a thousand years,” Han Sen said, then tried to exit the purple-bronze palace.\n\nWhen he had entered the palace, he stayed near the door. He didn’t enter too far, so he thought he could bolt outside quickly enough if something bad happened.\n\nBut now Han Sen noticed he had underestimated Skygod. As he tried to reach the door, the door suddenly looked so far away. He wouldn’t be able to reach it.\n\nYou are a little creature no greater than an ant. Where do you think you are? You cannot come and go so simply. Make your wish with your feather, or I will send you to hell. You will suffer for the rest of eternity, mark my words.” Sun Skygod sounded a little peeved.\n\n“I told you I have no wish to make,” Han Sen responded.\n\nThen think about it, right here, right now.” Sun Skygod coldly went on to say, “But hurry. You might end up dying before you are able to make a wish.”\n\nHan Sen frowned, not understanding what Skygod meant. But soon, he did.\n\nHan Sen’s fingers and hair grew quickly. He began growing a long beard, as something else occurred to his skin.\n\nTime has sped up!” Han Sen’s face changed.\n\nWood Duke and all the others were shocked. Controlling time really was something only a god could do.\n\nHan Sen looked at his body. With the speed he was aging, his few-hundred-year lifespan would be over in a few hours.\n\n“I am Skygod. I can do anything, if it is what I desire.” Skygod sounded cold. It didn’t look as if he was showing off, though. This was something ordinary for him.\n\n“In that case, why don’t you just take the feather. Why do I have to make a sacrifice?” Han Sen’s body was getting older, but he wasn’t panicking yet.\n\nHan Sen had the powers of space and time himself. Although he wasn’t as strong as Skygod, Skygod couldn’t bluff him. When Han Sen spoke, Skygod went quiet and did not say anything more.\n\nHan Sen’s body kept getting older. His hair had reached his feet, and the beard had reached the ground. He wanted to leave the hall, more than anything. But even at full-speed, he couldn’t reach the door. It was always one step away from him.\n\n“Old Han, I am coming!” Xie Qing King shouted, wishing to barge into the hall. He did not care if there was a god inside or not.\n\nGu Qingcheng pulled out her sword named Pure. She readied herself to help Xie Qing King and Han Sen.\n\n“Don’t come in! I know what to do.” Han Sen’s shout prevented Xie Qing King from coming in."
}