{
    "chapter": 2175,
    "title": "Shocking Destroyed Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2175",
    "text": "Barr’s hand came into contact with the tip of the arrow, and the expressions on Barr’s faces hardened. A black light that looked indestructible cloaked his hand, and it looked like the arrow would shatter against it.\n\nThat black arrow seemed to be sharper than expected, though. And when the black arrow came against the black light, it did not break. Barr’s power was unable to deflect it. The arrow flashed into Barr’s hand like black lightning, and it spun as fast as a drillhead.\n\nThe black light broke, sending a flurry of sparks everywhere. Everyone watched as the arrowhead drilled into his hand, tearing through skin and bone. Blood spurted from the entry wound.\n\nThe arrow had pierced right through Barr’s hand, much to the utter disbelief of Qing Li, the Destroyed, and the Rebate that were watching. They stared as the arrow proceeded towards his heart.\n\nDong!\n\nBarr fell backward and struck out with his bone knife. It hit the arrow and made a very loud noise. Finally, however, he had managed to break the arrow.\n\nJust as everyone thought that was the end of the matter, they heard an explosion. The broken arrow exploded, becoming a black sun that swallowed Barr’s body.\n\nWhen that scary power faded away, the black light went with it. Qing Li and the others could see that the bone armor Barr had worn was now all gone. His big body was exposed.\n\nBut his body was heavily injured, too. Blood was everywhere, and his bones and organs were clearly visible through his wounds.\n\nNo one could believe a Marquise’s arrow had just damaged Barr like that, oh so simply.\n\n“How… is that possible… This is Barr…” The Destroyed Dukes were all in complete shock. Not even most Dukes could have hurt Barr in that way.\n\nQing Li and the Rebate were in shock, as well. They didn’t expect this sort of result. They never thought Han Sen’s faithful Marquise ally could wield such wicked strength.\n\nHan Sen was just as surprised as the others, though. He hadn’t expected Han Meng’er to be that strong, but he knew that was her talent and ability. Power like that at Marquise level was definitely competition with what Break Six Skies offered. Pure and utter devastation, when wrought like that, was incredibly scary.\n\n“If Meng’er learned Break Six Skies, combining her power with the explosive abilities of that geno art, how strong could she possibly get?” Han Sen got excited as he thought about the prospect.\n\n“This is amazing!” The injured Barr looked very excited. He was still gripping his bone knife, and he now looked like a wolf that had found some prey. He began to shine red.\n\nBarr’s wounds, as grievous as they were, were healing extremely quickly. The gashes on his body closed as they watched, and his power and presence were starting to erupt like a volcano.\n\nHis black shadow loomed like a black beast. It was like the whole of the earth had been covered in the shadow of something terrifying. A roiling power was swallowing up the whole region.\n\nHan Meng’er did not move when faced with that presence, though. She simply drew the string of her bow. Immediately after, a black arrow went soaring through the skies and headed for Barr. It was like a black thunderbolt going right for him.\n\nBarr’s unnerving excitement hadn’t diminished, and he started to dance as he swung his bone knife. His faces were filled with demonic joy as he tried to strike the arrow.\n\nBut when the bone knife almost came into contact with the arrow, the arrow behaved like magic. It vanished into thin air, and when it appeared once more, it was already at his chest.\n\nThe diamond-like arrowtip started to shred the flesh of his torso. The black arrow pierced through his chest and punctured his heart.\n\nShtoom! Shtoom! Shtoom!\n\nAn entire murder of black arrows soared through the skies at him, fast as lightning. Barr kept swinging his bone knife, but he was unable to break a single arrow.\n\nAll of those arrows were like magic. Whenever Barr’s bone knife was about to come into contact with an arrow, it would just disappear. And by the time it reappeared, it would already be digging into Barr’s flesh.\n\nIn a split second, Barr’s body had been riddled with at least a dozen arrows. It was like he had been pierced by black thunderbolts.\n\nQing Li and the others were all frozen. They couldn’t believe the sight that their eyes were relaying to them. The Destroyed Marquises and Dukes were all thinking to themselves, “How is this possible… That is Barr…”\n\nBoom!\n\nHan Meng’er, still holding her bow, fired another arrow at Barr. And when this one plunged into him, it exploded. It split into a number of black suns that quickly worked to ravage and shatter Barr’s body.\n\nDong!\n\nWhen that scary bone knife fell from the hands that clutched them, it struck a rock. It quivered in the rock at an angle, the hilt rising over Barr’s shattered body. You couldn’t find a single complete muscle from the messy slop that remained.\n\nThis was a very shocking turn of events. Qing Li and the other Rebates all stopped. They looked at Han Meng’er, who was standing in front of Han Sen. Her cold but pretty face would forever be branded into their minds.\n\nHan Meng’er didn’t rejoice, though. She frowned and looked at Barr’s bone knife.\n\nSuddenly, the scraps of flesh that remained began to move. The bits and pieces were all drawing together.\n\nNot long after, the flesh started to assemble itself and come together. The tom muscles and bones recomposed and rebuilt themselves. The figure of Barr was wholly reassembled.\n\nHe looked like a doll that had been ripped apart, then sewn back together. There was still a number of seams across his body, of course; they looked like centipedes writhing over him.\n\nThe scars disappeared quickly, and a living Barr stood before them once again. He picked up his bone knife, looked at Han Meng’er merrily, and said, “I haven’t enjoyed a delicious fight such as this in a very long while. My stomach’s already rumbling, you know. Feeling hungry is a wonderful feeling. Now, however, you are my prey. Tell me your name, so that I may remember and record the dish that you will become.”\n\nThe onlookers stared with open mouths. His body had been ripped apart, but then it had reassembled itself really quickly. Barr’s power seemed to be stronger now, too.\n\n“Impossible… impossible… The Destroyed cannot heal themselves, can they? And no, that was far too incredible to be referred to simply as ‘healing.’ It is as if he can actually revive himself…” Qing Li looked at Barr in sudden fear.\n\n“That is why Barr is Barr. And this is only the beginning.” The Destroyed Dukes laughed.\n\nAlthough Han Meng’er’s power had been a surprise, they were still quite confident that Barr would be the victor. Barr might not have been a pure-blood Destroyed, but he was most certainly the strongest among them."
}