{
    "chapter": 1942,
    "title": "Nowhere to Hide",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1942",
    "text": "“We need to find a way to exit this Heaven. We might have escaped for now, but there’s still a chance we might be found by Seven Spirit,” Han Sen said.\n\n“If you do not know how to get out of here, then you should know that I don’t, either,” Hai’er said. She thought for a moment. “Can’t you turn invisible? If we stay invisible, then Seven Spirit’s clones won’t be able to find us, will they?”\n\nHan Sen shook his head. “There are limitations to remaining invisible, as I cannot keep it up for long.”\n\nLittle Invisible could make Han Sen invisible, but Han Sen was carrying another person. It would be too much for him to handle. The creature was still just a baby. And after the amount of time they had spent invisible earlier, all its energy had been drained.\n\n“What do you plan to do, then?” Hai’er was standing atop a dune. She scanned the desert, afraid their nemesis would return.\n\n“Don’t stand there,” Han Sen told her, motioning her down from the top of the dune. Then, he said, “I thought you were of the Pirate. You might just be Viscount, but you should be able to stay alive, right?”\n\n“Normally, of course. Even if there was a Duke on our heels, I could stay alive. But this is Seven Spirit, so I can’t be entirely sure.” Hai’er gave a wry smile.\n\n“If it was just one clone, do you think you could make it out?” Han Sen asked, after some thought.\n\n“If there was just one, then I guess I could. But my method can only protect me.” Hai’er looked glum, saying that.\n\n“That is enough. I will go to Seven Spirit’s true self. His clones will be coming for me, but that will allow you to go back the way you came and leave. If Seven Spirit does not recall his clones, though, then you’ll be on your own,” Han Sen said.\n\nHai’er looked at Han Sen and said, “Why are you helping me?”\n\nHai’er hailed from the Pirate. She found it hard to believe a stranger would help her formulate a plan of escape at his own expense.\n\nHan Sen smiled and said, “No matter what reason he has for trying to kill me, he waited until only the two of us remained. That means he doesn’t want others to know what he wants to do. If you make it out, perhaps he’ll give up on the idea of killing me. And if he doesn’t give up, at least you can spread the news of what actually happened. You could inform Knife Queen. If you can’t, I’ll die for nothing. Vengeance won’t be sought.”\n\nHan Sen paused, then went on to say, “Seven Spirit is coming after me. I cannot escape, and this is the only gambit we have available.”\n\nHai’er looked at Han Sen for a while, and then spoke. “If I can make it out, I will inform Knife Queen.”\n\n“It’s a deal, then. You walk east, and I’ll go west.” Han Sen looked at the time, and then continued. “He should be on his way back by now. Go on, and good luck.”\n\nHan Sen stood up and ran to the west. Although Hai’er was worried, she knew if she went along with Han Sen, she might very well die. So, she went east.\n\nHai’er did not dare run too quickly, though. She was afraid Han Sen might use her as bait, so just in case, she went slowly.\n\nIf Han Sen was going west, Seven Spirit should bump into him first whenever he turned back. When that occurred, she would have her chance to escape.\n\nHan Sen was not that graceful, though. He walked west, looking around as he went.\n\nBecause he had been in that place for a while, and the music affected people a lot, it was fortunate Han Sen’s will was as strong as it was. It didn’t affect him as it did the others.\n\nAfter a while, Han Sen stopped walking. He looked around and buried himself inside one of the dunes. Once inside the sand, he cast Petrify to turn himself into stone. Not even a deified elite could find him there.\n\nNow, all Han Sen had to do was wait. He was going to wait until Seven Spirit came past. And when the hound did, he’d emerge.\n\nIf Seven Spirit was walking slow, then Hai’er should encounter a clone. If she did, she’d surely attract Seven Spirit in that direction. But Han Sen wasn’t certain she’d entice the attention of Seven Spirit himself. If Seven Spirit found out that Hai’er was alone, he’d still want to search for Han Sen, more than anything.\n\nHan Sen reviewed every possible way this situation could unfold, and he formulated a method for dealing with each circumstance. Suddenly, though, he felt as if a being had just walked past. He was buried under the sand, though, and he couldn’t use Dongxuan Aura to be certain. He couldn’t be sure that it was Seven Spirit.\n\nThe creature was slowly heading east. He had walked past where Han Sen was hiding, headed on an eastbound trajectory. Han Sen assumed it had to be Seven Spirit, since who else would walk backwards when they were this late in the game? Han Sen waited until the presence went by, hoping to head the opposite direction after Seven Spirit passed.\n\nBut Seven Spirit only walked east for a bit before turning back. He was searching for something.\n\n“Han Sen, do you want to die down where you are? Or do you want to go out fighting?” Seven Spirit Buddha asked.\n\nHan Sen frowned and thought, “Weird. How does he know I’m here?”\n\nHan Sen was a little worried, but he didn’t move from his position within the sand dune. If the felon knew where Han Sen was, it was likely that he’d already have attacked. He wouldn’t bother talking.\n\nSeven Spirit waited a bit for a response to come, but none came. He didn’t actually know where Han Sen was. But it seemed as if he knew Han Sen was somewhere nearby, as he didn’t leave the approximate region.\n\n“He must have a way to sense my general presence, but he can’t find me. This is a tough spot to be in,” Han Sen was thinking.\n\nSeven Spirit stopped. He mumbled something, and then the sand was kicked into turmoil again. The wind whipped into a raging tornado. Wherever it went, the sand flew everywhere. It dug up a thousand meters of desert.\n\n“Marquises are stubborn. It must be costing a lot of power for him to keep searching that way,” Han Sen thought. It also made him feel disappointment.\n\nEven if he had turned into stone, Seven Spirit would find him if he dug too deeply into the sand.\n\nHan Sen was not in a rush to move, however. He waited for the tornado to come. He wasn’t going to move until he was found, in the hope that Seven Spirit would exhaust most of his energy."
}