{
    "chapter": 2729,
    "title": "Good Fortune Pool",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2729",
    "text": "“How could this happen?” Shale’s face had gone blank with shock. He shook himself, turning to go back to the Star Tree.\n\nLi Chun Qiu stopped him and said, “It is too late to go back now. We’ve been gone for too long, and the creature must have escaped into Outer Sky and disappeared by now.”\n\n“With Han Sen guarding Star Tree, I don’t think it will have been able to run off so easily,” Shale said.\n\n“If I was unable to detect the real Six-Eared Macaque, I don’t think Han Sen could have done so, either,” Li Chun Qiu said emotionlessly. “And even if he did discover it, do you really think he could stop the Six-Eared Macaque from escaping the Star Tree?”\n\n“It was all my fault. I couldn’t distinguish the fake body from the real one,” Shale said.\n\nLi Chun Qiu shook his head. “There is no need to blame yourself. The Six-Eared Macaque’s fake body was really good. Not even I was able to detect the real one. This blame doesn’t lie on your shoulders.”\n\nAfter pausing, Li Chun Qiu provided further comfort by saying, “Outer Sky has countless xenogeneics. You’ll be able to hunt some more creatures soon, but don’t leave just yet. Han Sen will visit the Good Fortune Pool soon. We can go after he does it.”\n\nShale nodded. “The Good Fortune Pool will certainly change his power, but it affects every creature differently. I wonder how much Han Sen will benefit from it.”\n\n“I don’t believe any will receive a benefit as grand as you received,” Li Chun Qiu said flatly.\n\n—\n\nHan Sen thought Li Chun Qiu and Shale would come looking for the Six-Eared Macaque, but after waiting a while, he didn’t see them return.\n\nThe next morning, Han Sen told Little Number Six to guard the Star Tree with the other xenogeneics. Bao’er decided to stay behind as well, and Han Sen headed to the Good Fortune Pool by himself.\n\nHan Sen was in a rush to get to the Good Fortune Pool because he wanted to use it before Exquisite and Li Keer found out about it.\n\nHe wanted to use the pool to bring Jadeskin and the Dongxuan Sutra up to half-deified. If the two girls were there, he couldn’t risk using those two geno arts in front of them.\n\nIn truth, the Good Fortune Pool wasn’t really a pool at all. It was more like a well. According to what Han Sen knew about it, the water inside the Good Fortune Pool wasn’t really water. It was a fluid created from the remains of dead xenogeneics.\n\nThat was what the Very High had told Han Sen, at least. Whether or not it was true, he didn’t know. No one knew for certain what lay at the furthest reaches of the Good Fortune Pool. Not even true god deifieds could reach the bottom.\n\nAlthough the Very High elites couldn’t physically reach the bottom of the pool, they had analyzed it and determined that it contained the bodies of a giant group of deified xenogeneics. Those powerful deifieds must have died there billions and billions of years ago, and their deified flesh had remained there ever since. Over time, their essence had liquified and filled up the hole of their grave to become the Good Fortune Pool.\n\nThe process had worked something like the formation of oil.\n\nBecause the Good Fortune Pool had many deified genes inside it, it could reinforce the genes of the creatures that bathed in it.\n\nThe benefits that a person received were determined by how long they could stay inside the pool and how much of it they could absorb.\n\nAll this information on the Good Fortune Pool was just guesswork on the part of the Very High, though. As for the truth, no one knew for sure.\n\nBut when people entered the Good Fortune Pool, some could trigger the water of the pool to create something weird.\n\nOnce in the past, a golem had entered the Good Fortune Pool. He reacted with the water, and everyone nearby had a vision of an ancient deified xenogeneic hitting a sky statue. Because of this weird vision, that golem seemed to absorb far more water than other creatures. The water seeped all the way through his body, and then the golem went on to achieve so much. It almost became a true god. Although it failed in the end, it was a miracle that a golem had been able to accomplish as much as it did.\n\nHan Sen didn’t expect himself to be able to trigger some sort of vision. He merely hoped to absorb as much Good Fortune Pool water as he could.\n\nThe Very High theorized that the reason some people could trigger the strange scenes inside the Good Fortune Pool was because they could reach the deeper parts of the pool. When the swimmer encountered the remains of beings whose power operated on the same wavelength as his own, a vision could be triggered.\n\nThe bloodline of the humans was derived from the crystallizers, and the history of the crystallizers didn’t go back very far. There was no way they had reached the Outer Sky all that time ago, only to end up buried inside the Good Fortune Pool. So, Han Sen didn’t think his presence would activate a vision.\n\nAccording to the Very High, the Good Fortune Water accumulated as the deified genes in the grave began to mutate. Those mutations always yielded something good.\n\nOf course, if someone absorbed too much and mutated too far, it might harm their bodies. The key was in how much one could take. Overindulging in the water was risky. If a person took too little, the changes in his body wouldn’t be obvious. In regards to how much they should take, it all depended on the swimmer’s fitness and durability.\n\nHan Sen stood outside the palace that housed the Good Fortune Pool. He didn’t see Li Chun Qiu, but Shale was also standing outside the palace. It looked as if the lion-headed man might have been waiting for him.\n\n“Brother Shale, can I use the Good Fortune Pool now?” Han Sen handed the Good Fortune Spell to Shale.\n\n“Of course. I was waiting here so I could open the Good Fortune Hall for you,” Shale said. He accepted Han Sen’s Good Fortune Spell, then took out a similar spell of his own. He slid the two spells into the locks on the door.\n\nKatcha-cha!\n\nThe Good Fortune Hall’s door slowly opened. Shale made a welcoming gesture and said, “I hope you can use the Good Fortune Pool to gain strength and become deified.”\n\n“I hope so as well, Brother Shale. I’m going in now.” Han Sen gave the man a nod and walked into the Good Fortune Hall.\n\nIn the center of the palace, there was a pool made of jade stone. The water was utterly still, without a single wave or ripple upon the surface. The water should have been transparent, but because the pool was so deep, it was completely dark. It looked like a portal to hell.\n\nAlthough the pool was as calm as a deep well, Han Sen could feel the scary presence coming from it. The quiet pool of water was surging with energy like an erupting volcano. It was hundreds of thousands of times scarier than the lifeforce of a deified creature. Just standing next to the pool, Han Sen felt as if his body would melt.\n\n“What an insanely powerful lifeforce. No wonder this Good Fortune Pool is legendary,” Han Sen said quietly to himself. Without hesitation, he jumped headfirst into the Good Fortune Pool.\n\nWhen Han Sen jumped into the pool, Li Chun Qiu suddenly appeared next to Shale. He watched the Good Fortune Pool with Shale.\n\n“I wonder if Han Sen will become deified inside the Good Fortune Pool,” Shale said to himself.\n\n“He is just a crystallizer. Unlike you, he won’t receive old xenogeneic blood and trigger a vision. There’s no way for him to gain much. He won’t become deified, but he will earn a few benefits to help him along,” Li Chun Qiu said dispassionately."
}