{
    "chapter": 1015,
    "title": "Blood-Wing Beast King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1015",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen calmly observed Liu Yuxuan. Han Sen was dexterous in the arts of assassination, and when his Jadeskin had allowed him to open his eighth sense, he gained the ability to detect any hostile feelings towards him.\n\nAlthough Liu Yuxuan had hid it well, Han Sen could sense he meant to do him harm.\n\nOf course, Han Sen did not say anything just yet. The road they would go along together had to be safe, because schemers and backstabbers like Liu Yuxuan rarely put themselves in dangerous situations.\n\nEveryone followed him, and as he led the way, many creatures came into sight. When they saw the turtle, though, they ran off and posed no threat.\n\n“With me here, nothing for the next three hundred miles will lay a finger on any of you.” Watch the creatures run off, Liu Yuxuan puffed his chest up and spoke with an arrogant tone of voice.\n\n“It’s nice to have you here with us,” Wang Yu said.\n\n“Soon, we’ll be passing through the territory of a super creature. But again, you needn’t worry. I, Liu Yuxuan, am here to safeguard you all.” He continued to speak with the same snobbish mannerisms.\n\nLin He and Lin Weiwei responded with simple grace, saying, “Thank you for your service.”\n\n“Well, we are friends, aren’t we? I am especially fond of you, my dear Weiwei. This is the least I can do for you,” Liu Yuxuan said.\n\nIn his heart, his real emotions were actually like curdled milk. He snickered to himself, saying, “That super creature is a good friend of mine, and I often please his son. He’ll do me a favor, for sure. Once I get him to deal with the rest of this annoying congregation, I can whisk Weiwei home to my bedroom chamber.”\n\n“And I’m not letting Han Sen get off the hook by granting him a swift death. They’d all be on their way to the shelter right now, if it wasn’t for that snotty brat. He’ll die slow.” Thinking of his bestiality fetish, a pleasurable chill ran down Liu Yuxuan’s spine. Then, he looked over to Han Sen.\n\nHan Sen was, much to his surprise, was looking his way as well. He was smiling, but that smile almost felt as if he had been able to read his mind.\n\n“Has he noticed something amiss? Does he know what I’m up to?” Liu Yuxuan was spooked.\n\nHe mulled it over a bit, and then comforted himself by saying, “Pah! That is preposterous. He doesn’t know a thing; he’s a noob that’s somehow fumbled his way into the Third God’s Sanctuary. I should ease up a bit.”\n\nLiu Yuxuan presented a smile back and said, “There is no need for you to worry, Brother Han. I can keep you safe.”\n\n“Gee, thanks,” Han Sen said in response.\n\n“Fool. Even if you did max out your super geno points, here you are, waltzing into my trap without a single suspicion. You numbnuts,” Liu Yuxuan thought to himself, cackling on the inside.\n\nCliffs adorned both sides of the valley, and there were many caves dotted across them. There were many winged beasts in the area, and a few thousand of them populated the skies.\n\nThe group was a little nervous and antsy, seeing that many creatures were lingering above them.\n\n“Again, there is no need to worry,” Liu Yuxuan said, then screamed into the skies.\n\nAfter that, all the beasts returned to the caves as if they were afraid. Then, they just watched from the darkness of their holes.\n\n“You are good,” Wang Yu said.\n\n“Later, I will summon the super creature’s son. He’ll come over and meet us. Under his protection, we can travel further along the valley. Nothing will attack us, then.” Liu Yuxuan’s tone of voice was already changing, as if he had a mouthful of plums.\n\nHe had spent a long time studying the language of creatures. After much time, he had learned a fair few words, and this was a talent few people had.\n\nTo his credit, he was a smart man. Few humans were ever treated with even a modicum of respect in spirit shelters. Liu Yuxuan had done well for himself, to have gotten to the position he was in. What’s more, his skills of observation were in fine shape.\n\nHe let out another scream, to summon the super creature’s son. This scream was different, though, and in the language of creatures, he mentioned he had brought a grand bounty of food with him. Except for Lin Weiwei, everyone else was up for sacrifice.\n\nNo one there spoke the language of creatures, so no one had a clue what to expect.\n\nAfter the scream, an echo of response came from further down the valley. A red beast appeared and came before them.\n\nIt had blood-colored wings that were thirty meters wide, and horns decorated the monster’s head like those of a goat.\n\nChen Hu, upon seeing this, couldn’t help blurting out, “Wow, you really are good!”\n\nHan Sen had fantastic eyesight, and he saw a small beast atop the big beast’s back.\n\nLiu Yuxuan’s face changed when he saw the big beast appear.\n\nHe had only wished to summon the super creature’s son. He hadn’t expected he’d end up summoning the big one that the son rode upon.\n\nHe rarely ever got to see the king, and he was only used to interacting with the son.\n\nLiu Yuxuan would have had some control over what happened if only the son had shown up, as he had planned. With the blood-wing beast king there, as well, he’d be helpless in controlling what might happen.\n\n“Maybe I shouldn’t have mentioned the presence of a sacrifice. I think a simple summoning of the son would have been better,” Liu Yuxuan thought the beast king had come over upon hearing there’d be much food on offer.\n\nWhatever happened next was entirely up to the hulking, airborne monstrosity. He could only hope it’d leave Lin Weiwei alone.\n\nIf the beast wanted to eat Lin Weiwei, as heartbreaking as it’d be, he knew better than to protect her. He only wanted her as a pretty toy, and it wasn’t worth risking his life for her."
}