{
    "chapter": 2562,
    "title": "Chain Demon Crocodile",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2562",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe bronze furnace refused to go forward, so Han Sen had no choice but to leave it behind. He went on ahead with Li Keer and Exquisite.\n\nThe bronze furnace continued to spit out fire behind Han Sen, creating a sentence that read, “Don’t go. There is danger!”\n\nHan Sen asked the bronze furnace what the danger was, but it didn’t elaborate. All it did was continue to warn Han Sen of some danger, and that he should stay away from there.\n\n“You wait for me here.” Han Sen didn’t think there was any reason that he should be afraid; there were few creatures in the core area that could threaten him these days.\n\nThe three of them kept flying. The bronze furnace was too reluctant to follow them.\n\nAfter a short while of flight, the three of them saw a xenogeneic soaring through space. As soon as they noticed the xenogeneic, the creature noticed them, too. It roared and flew over to them.\n\nThe xenogeneic growled like a crocodile, but it looked to have been built out of red metal. Bat-like metal wings spread from the creature’s back, and it flew very quickly.\n\nLights gleamed across the edges of its metallic body as it cast an area. Metal chains appeared within that area, shooting out and binding anything that moved.\n\nHan Sen and the others were tied down by those metal chains. Han Sen struggled and noticed that the metal chains were so strong, they were too hard for even him to break them.\n\nHan Sen summoned his strength, but suddenly, there was a flash. The creature was cut in half, and the chains that bound them vanished.\n\n“Pardon me,” Exquisite said coldly. Then, she flew over to the King xenogeneic and dug out its xenogeneic gene.\n\n“Lady Exquisite is quite strong,” Han Sen complimented.\n\nThe hit earlier was nothing short of perfection. It happened so fast that Han Sen hadn’t even seen what skill she unleashed to destroy that xenogeneic. Her skills were strong, there was no doubt of that.\n\nBut it made Han Sen curious. It had been a long time since he’d stayed in Sky Palace, but he had never heard of Li Keer or Exquisite in the time he spent there. With their powers, there was no way he could have avoided hearing stories about them.\n\nExquisite, with an absence of emotion, said, “That was an ordinary space cutting skill.”\n\nHan Sen laughed and said nothing. Space geno arts were difficult to practice. Exquisite made it sound as if the skill was nothing extraordinary, but Han Sen knew she was just acting.\n\n“We’ve just arrived, and already we’ve encountered a King xenogeneic. We are lucky. We should be able to earn a lot from this trip,” Li Keer said.\n\n“Are the xenogeneics around here the same as that one?” Han Sen asked.\n\n“Yes. These xenogeneics are called Chain Demon Crocodiles. They rule this area. There are many Marquises and Dukes here. Kings and half-deifieds, also. There is a legendary crocodile god here, as well, but we have never seen it,” Li Keer answered.\n\nHan Sen nodded. Then, the three of them proceeded. There were many Chain Demon Crocodiles in the nearby asteroids. Crocodiles began to emerge from the asteroid belts, and while Han Sen examined the creatures, Exquisite was already moving.\n\nExquisite immediately flew over to the Chain Demon Crocodiles, her white clothes trailing behind her. There were tens of thousands of them, but most of them were low level. Han Sen didn’t see a single King class crocodile in their midst.\n\nJust as Exquisite was about to reach the hordes of demon crocodiles, her body suddenly vanished from sight. The geno art used by Exquisite was familiar to Han Sen. She had teleported.\n\nBut Exquisite’s proficiency with teleportation abilities had already reached Space Teleportation. She was able to cross great distances with the skill. Han Sen was unable to see her amidst the crocodile group.\n\nIn the blink of an eye, Han Sen heard a squeal. Then, Exquisite’s body appeared before them again. In her hand, she held a xenogeneic gene that was shaped like a metal cogwheel. It was the same xenogeneic gene that could be found in the King class crocodiles.\n\n“Let’s go. There was only one King there. Killing these lower-level ones is pointless,” Exquisite said. Then, she flew away.\n\nHan Sen watched Exquisite leave. He thought of something, and a smile crossed his face. Then he followed.\n\nHan Sen didn’t know if Exquisite was deliberately stealing the King xenogeneics, but if this was to continue, Exquisite was going to kill all the Kings. If that happened, this trip would have been a waste of time.\n\n“The Sky can be so scary. I’ve never heard of Exquisite before, but she is so strong.” Han Sen then got to thinking about how he might steal the demon crocodiles from beneath her nose.\n\nWith Han Sen’s speed, any crocodiles below King class had no hope of chasing after them. They would be left in the dust.\n\n“The giant planet up ahead has loads of demon crocodiles. Should we go there?” Li Keer pointed at the planet as she spoke.\n\n“Sure.” Han Sen nodded. If there were lots of crocodile Kings, then he wouldn’t have to fight against Exquisite for the kills.\n\n“This planet is like a white dwarf. Its temperature and gravity are scary, so be careful,” Li Keer warned them.\n\nHan Sen looked at the dark red planet and was shocked. Compared to ordinary stars, white dwarfs were very small.\n\nBut this white dwarf up ahead was very large. It looked like it would take forever for them to fly to it unless they used Space Teleportation. Luckily, though, the core area’s space wasn’t like ordinary space. There wasn’t a lot of space between the planets like there was in the Alliance.\n\nThey entered the orbit of their destination, and Han Sen felt the heat immediately start to burn his body. A powerful force of gravity was pulling him down.\n\n“This gravity is very strong.” Han Sen was shocked. Even with his level of power, he could still feel the effects of that gravity. The mass of that planet was unimaginable.\n\nWhile it was an annoyance, Han Sen could still fly with that amount of gravity. As he dropped toward the planet, he felt like the powerful forces acting on him were slowing down everything around him. Even Break Space Teleportation was really slow now.\n\nQuickly, Han Sen discovered two Chain Demon Crocodiles lying on the planet’s surface. This made Han Sen very happy, because the two Chain Demon Crocodiles were Kings. They had dark red metal armor that looked very intimidating.\n\n“Are the demon crocodiles on this planet King class?” Han Sen thought it was possible. The planet’s temperature and gravity were scary, after all. Ordinary demon crocodiles probably couldn’t survive such conditions.\n\nIf Duke demon crocodiles went to the surface, they probably wouldn’t even be able to move there. The scary gravity would probably crush them, not to mention the insane temperatures that would likely melt their bodies."
}