{
    "chapter": 1889,
    "title": "Temporarily Passed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1889",
    "text": "“Where is Icebird Duke?” Yisha asked Han Sen as they stood on the Knife Battleship.\n\n“Queen, I do not know where Icebird Duke is.” Han Sen gave her a wry smile. He wasn’t planning on admitting anything. Plus, no one had survived on that planet, and they were all trapped in Purgatory Heaven. As long as he did not admit what had happened, no evidence would be unearthed to suggest otherwise.\n\n“How can you not know? Icebird Duke should have been by your side at all times, protecting you!” Yisha spoke to him calmly, but Han Sen could detect what was really boiling beneath the surface. If he gave her the wrong answer, God only knew what would happen.\n\nHan Sen did not hesitate to tell her, “Icebird Duke and I went to Planet Crooked Rock. I wanted to see if I could recruit a few of the Gana, but when I arrived, I realized I had no chance. So, I asked her to help me recruit. But then, the Kao revolted. They put the Gana on auction. We were invited, so Icebird Duke went ahead to the auction. With someone else to recruit on my behalf, I didn’t bother going.”\n\n“And then what happened?” Yisha asked.\n\n“And then I recruited them. Before we got back to the ship, the entire planet was veiled by gold clouds. And there were many arms coming out of the ground, alongside many beasts that crawled out of some nether. We tried to hide in a cave, and we fought those monsters side-by-side! After a day of this, the beasts, arms, and clouds disappeared. When we got back to the ship, we noticed Icebird Duke was gone, and so were many others! Everyone else on the entire planet was gone too.”\n\nHan Sen cooked up a hearty mixture of lies and truths to sell the story. He had to keep running with this yarn, whether or not Yisha believed him.\n\nYisha looked at Han Sen, Han Meng’er, Dragon Lady, Wang Yuhang, and then looked back to Han Sen. “How did you deal with those creatures and the arms?”\n\n“Those arms were scary! Our powers didn’t do anything. If we were grabbed, we’d be pulled into the ground. The beasts were even scarier! Our powers did nothing to hinder their assault. Only Spell and Meng’er were able to fight them,” Han Sen said.\n\n“You are saying that Spell and her powers can defeat the Purgatory Beasts?” Yisha asked with a frown.\n\n“Yes, but they can’t deal with the arms. But we survived because of this item. It enabled us to shred the arms.” Han Sen presented her with his Knife Blank, showing it off.\n\nYisha took the Knife Blank and gave it a stroke with her fingers. She released some sort of purple power onto the Knife Blank, but the power could not be absorbed.\n\nYisha looked shocked, and she said, “This Knife Blank is godly! It is no wonder it could cut through those hell hands.” “With the god element, does that mean it is a deified item?” Han Sen was happy to hear this.\n\nYisha shook her head and said, “It is not a deified item. It is just a material for a deified item.”\n\n“That is great! I can forge it into an item of some sort, then, yes? You should take this knife, my queen. You should forge it into a godly knife, and make it something properly deified. And then, you can shock the whole universe!” Han Sen said quickly.\n\nYou are willing to give this to me?” Yisha smiled at Han Sen, as she held onto the Knife Blank.\n\n“Of course! You are my master, after all. Your glory is my glory. If you achieve more, I would be even more proud. This is just a meager Knife Blank. If I had a deified knife, I’d give that to you first. If your life is getting better, then my life is sure to improve, too.” Han Sen looked awfully sincere.\n\nYisha looked much nicer now, but she gave it back to Han Sen. “You are nice, but this Knife Blank was obtained in the Knife Grave. It’ll be difficult to forge it, and it isn’t too godly. I can’t make it into something powerful, I am afraid.”\n\nAfter a pause, Yisha continued speaking to Han Sen. “I will ask someone else to escort you to Planet Eclipse. I am going to Planet Crooked Rock, where I hope to find a lead on the whereabouts of Icebird Duke. I will avenge and destroy any who has done something bad to Icebird.”\n\n“Icebird Duke was put in danger because of me. I should go with you,” Han Sen said.\n\n“It’s okay. And by the way, don’t tell others you have been to Planet Crooked Rock. That will bring unnecessary hassle. It’d be bad.” After a brief talk with Han Sen, Yisha sent him on his way to Narrow Moon. She went ahead to Planet Crooked Rock.\n\nHan Sen felt a lot of relief when he was back. Somehow, he had made it through. Even if she did not believe him entirely, he should remain safe as long as she was not able to find any evidence that contradicted his story.\n\nHan Sen brought his companions into the base. Then he gave Wang Yuhang a truckload of xenogeneic genes, wanting him to get stronger and generate a geno armor.\n\nAlthough there was a Marquise class armor, Han Sen was worried that the man was so weak that he’d end up getting killed anyway.\n\nHan Sen had nothing but Baron class xenogeneic genes, but that was fine for Wang Yuhang. And after a few days, Wang Yuhang’s xenogeneic gene tally reached one hundred.\n\nWang Yuhang started to evolve, and he ended up generating a black geno armor.\n\nBut he couldn’t evolve a second time, so Han Sen gave him a Magnet Fruit. He made it and became a fully-fledged Baron.\n\n“Little Uncle! Your geno armament is cool.” Han Sen looked at Wang Yuhang’s geno armament in surprise.\n\nWang Yuhang’s geno armament was a black dirt bike. It looked like a vintage model, but it looked sweet.\n\n“Haha! I knew I was born a special chap. It looks pretty bad*ss, huh? If you need anything, I got your back.” Wang Yuhang looked so cocky, sitting on his new bike.\n\n“What powers does it have?” Han Sen asked with curiosity,\n\n“It’s awesome!” Wang Yuhang said, then started the bike. He drove around the base and returned to Han Sen. He proudly said, “What do you think? Fast? Powerful?”\n\nThe speed is okay, but what else does it do, aside from carry you?” Han Sen asked.\n\n“I can run over people!” Wang Yuhang sounded a bit weak.\n\n“So it deals no damage. Does it have any other function? Like, can it fly? Can it carry you across water?” Han Sen asked.\n\n“Bro, this is a bike! You are talking about boats and planes.” Wang Yuhang laughed.\n\nHan Sen felt his heart sink. This bike was like any other he could buy. It could drive him around and little else."
}