{
    "chapter": 2718,
    "title": "Geno Protoplasm",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2718",
    "text": "But as its body shrank, the substance chains rising from its scales grew more defined. The process of leveling up to deified seemed to be going as smooth as butter.\n\n“If the black crystal can immediately elevate a xenogeneic to deified, that is so scary! The fact that the black crystal could affect creatures in the sanctuaries was impressive, but it wasn’t too shocking. Those creatures have good genes, but their life energy is low. The energy necessary for a King class xenogeneic to become deified is daunting, though. In elevating the Immortal Dragon to deified in just a few short days, the black crystal has revealed that it contains a truly terrifying amount of power,” Han Sen thought to himself. He was in shock.\n\nAlthough Han Sen had set the test up himself, he was still struggling to come to terms with its success.\n\nThe Immortal Dragon’s body continued to change, and on the tenth day, the creature looked like it was made out of crystal. Its body shone and glittered in the light. Its body glowed with power as it merrily generated substance chains.\n\nAll around the beast, the plants began to grow like mad. Han Sen stared at the sight in awe.\n\n“It looks like the Immortal Dragon is really becoming deified,” Han Sen thought. Then, he saw the Immortal Dragon raise its head in pain. It let out a strange screech, and its holy substance chains erupted like a volcano.\n\n“Is it going to level up now?” The holy light substance chains wrapped entirely around the Immortal Dragon, and the creature looked like a small sun. Han Sen had to squint slightly, but he still couldn’t see through that blinding light. He could only feel where the Immortal Dragon was. It had scary energy swirling around it like a nuclear reactor.\n\nHan Sen had to teleport some distance away from the Immortal Dragon to keep from being injured by the intensity of that light.\n\nA few minutes later, the scary power started to fade away. When the holy light dimmed enough for Han Sen to see the Immortal Dragon again, his jaw fell open.\n\nThe Immortal Dragon was gone. There was only the black crystal remaining, in the precise spot the Immortal Dragon had been moments before.\n\n“This… what is this…” Still reeling, Han Sen summoned his Purple-Eye Butterfly and checked out the area surrounding the black crystal.\n\nThe Immortal Dragon was not there. All traces of the Immortal Dragon had vanished, as if the creature had entirely disappeared. Aside from the black crystal, there was nothing left. Even the snake scales that had littered the ground had vanished.\n\nHan Sen carefully walked next to the black crystal. He looked at the black crystal and noticed that although it still looked pretty much the same, he could see something within its crystalline depths. There was a shadow fading away inside the crystal, and it seemed to resemble the Immortal Dragon.\n\nIt happened within the blink of an eye. The Immortal Dragon’s shadow disappeared, and the black crystal returned to looking like it had before. It was as if nothing had happened at all.\n\n“How could this happen?” Han Sen shivered slightly. He was secretly happy, though. “It is lucky I didn’t eat the black crystal myself. If I had, I might have ended up like that Immortal Dragon. It looks like this black crystal is different from the one I found before.”\n\nHan Sen stared at the black crystal on the floor, but he didn’t dare touch it. What had just happened was way too weird.\n\nAs he looked at the black crystal, it suddenly began to move. It bounced violently around on the ground like a bean in an earthquake.\n\nKatcha!\n\nAfter a moment of that, the black crystal suddenly opened. Han Sen was watching the black crystal the entire time, but he still couldn’t have described the dimension-bending way in which the crystal changed. It might almost have been more accurate to say that the crystal simply transformed.\n\nA minute of startled silence later, Han Sen realized that the black crystal was starting to resemble the Immortal Dragon. But while the original Immortal Dragon had been snow-white, this new Immortal Dragon was colored the same, bottomless black of the crystal. The black crystal continued to change, refining the form of the dragon. In the end, a living Immortal Dragon shaped from black flesh stood in front of Han Sen.\n\nThe next second, the black crystal dragon opened its eyes and locked onto Han Sen with an unreadable stare.\n\nHan Sen stared back at the creature. He had no idea what was going on. He didn’t even know if it was the same Immortal Dragon.\n\nA man and a dragon just gazed at each other for some time. Neither of them did anything.\n\nIn Han Sen’s Sea of Soul, the sleeping black crystal armor suddenly activated. It flew out of Han Sen’s Sea of Soul and grabbed the Immortal Dragon that had once been a black crystal.\n\nThe Immortal Dragon didn’t try to resist as the black crystal armor grabbed it.\n\nA miraculous scene began to unfold. As the black crystal armor touched the black dragon, the dragon returned to looking like a crystal again. Before Han Sen could figure out what was going on, the black crystal armor had flown back into Han Sen’s Sea of Soul, still holding the black crystal.\n\nAt the same time, the black crystal unleashed a mysterious power that sealed Han Sen’s body and his Sea of Soul. To anyone looking at Han Sen from the outside, his power would now seem dim and uninteresting. Only Jadeskin’s power seemed to reside within him.\n\nHan Sen was suspicious. He didn’t know what the black crystal armor was doing.\n\nBut he knew the black crystal armor wouldn’t have taken action without good reason. In the past, the armor had only activated when there was a dire need for its aid. Those situations were often related to the Geno Hall.\n\nAs Han Sen frowned, he saw someone approaching from far away. In a moment, the man was only a few steps away from the Star Tree.\n\nWhen Han Sen saw the person’s face, he was shocked. The man looked like one of the Very High, but Han Sen knew that he wasn’t. Han Sen recognized the man’s face.\n\nWhen Han Sen and Li Keer had entered the Destiny’s Tower in the desert, he met a statue of a god that called himself Empty God. The statue had the same face as this man. But the god statue’s presence was nothing like the being that was standing in front of him now.\n\nAlthough they looked exactly the same, this man had an unmistakable presence. If the god statue had been sitting next to him, no matter how alike they looked, the god statue would seem like little more than a servant.\n\n“This can’t be Empty God’s true body, can it?” Han Sen’s heart jumped. He suddenly understood why the black crystal armor had gone into hiding.\n\n“Weird. Earlier, I sensed geno protoplasm. Where has it gone now? Did someone else get here first? No way. This area belongs to me. There’s no way that one of those guys sensed it sooner than I did.” Empty God frowned. Then he looked at Han Sen, who was sitting under the tree.\n\n“Have you seen a weird creature around here?” Empty God asked, walking up to Han Sen.\n\n“What weird creature?” Han Sen asked back.\n\nEmpty God frowned. He shouldn’t have asked that question; there was no point. Even if some creature in this universe had seen the geno protoplasm, they wouldn’t have recognized it.\n\n“Well, since a god is now here, it is your lucky day. I can fulfill any wish you desire. Speak one wish, and I will make it come true for you.” Empty God looked arrogantly down on Han Sen."
}