{
    "chapter": 1072,
    "title": "Devil Fang",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1072",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“What was the Devil Orb you spoke of?” Han Sen asked.\n\n“Ancient Devil Shelter possessed a tree, cultivated by an emperor. The tree itself was simply named ‘Devil.’ If it bore fruit, it would have been able to create demonic dimensions. Unfortunately for Ancient Devil Emperor, he was unable to find success in this venture.”\n\nDragon King paused briefly before resuming his speech. He took a deep breath and explained, “This Devil tree was destroyed during the war, but the wood of the tree splintered to form little Devil Orbs. When destroyed, these Devil Orbs contain the power to transport others to this Devil’s Realm.”\n\nHan Sen was disappointed, learning the orbs were a one-way ticket.\n\nAgain, though, he heard the distant sound of a baby crying. It was exactly the same as what he had heard earlier.\n\nDragon King also heard the noise, and he told Han Sen, “Devil Fangs have found us. They remain in a constant shift of mutations. They could be super creatures; we should go!”\n\nHan Sen asked, “Go where? Can we reach the shelter that is high above?”\n\n“Of course not; that is where the super creatures reside. Who knows how strong they have become?” Dragon King preached.\n\n“Then where in the sanctuaries can I go?” Han Sen asked.\n\nDragon King did not know where they could go, either. There were cracks everywhere in the fabric of this dimension. They couldn’t just flee senselessly.\n\nWhen a dimension gets distorted or twisted or broken, going in one direction could leave you going in another.\n\nDragon King caught sight of a Devil Fang racing out from the black mist, but much to Han Sen’s relief, he was able to gauge its strength as being only sacred-blood in class.\n\nSuddenly, a dozen more raced out of the black. Their ravenous, hungry maws snapped towards Han Sen.\n\nDragon King swiftly returned to his ring, but he couldn’t be faulted for this. He really was in a state of weakness, and he’d have been unable to deal with a single one of the fiends, most likely.\n\nHan Sen drew Taia and Phoenix Sword and remained as fearless as ever. With Bao’er and the bird atop his shoulders, he ran forward to greet the monsters.\n\nWhen a sword cleaved its way through a Devil Fang, green blood gushed from the fleshy crevices. Using Double Fly, Han Sen was able to effortlessly slay four of them. The rest weren’t waiting around, though—they were still coming.\n\nEven when Han Sen hewed the limbs of the creatures off, they still wriggled their way forward for a taste of his fresh meat.\n\nGreen blood started to form a pool around Han Sen, and the level rose the more he killed.\n\nAfter killing a dozen of the Devil Fangs, their numbers were replenished with a greater sum that lurked in the darkness out of sight. Now, another fifty sought a taste of the human.\n\nBut Han Sen was unfazed. He carried on fighting as his clothes became drenched with the green blood. Even Bao’er’s face had been splashed with the stuff, which made her quite angry.\n\nNot happy with the constant soaking, Bao’er brought out her mini-gourd and pointed it towards the monsters.\n\nThe group of Devil Fangs that remained were immediately frightened by its power of suction, and they tried their best to scramble away to safety.\n\nBut it was useless, and they were each and all sucked into the gourd.\n\nA few dozen Devil Fangs were sucked into the gourd in nearly an instant. Others that were thinking of taking their fallen brethren’s places now had second thoughts, and they elected to stay away.\n\nHan Sen was delighted, as it had been a while since he had received Bao’er’s support. He kissed her and said, “Good job! You make daddy proud.”\n\n“I am good,” Bao’er said, with a smug grin.\n\n“You are the best.” Han Sen looked to the Devil Fangs he himself killed. Then, he got a fire going so he could cook them.\n\nHan Sen was starving after all the fighting, so now was a good time to cook and eat. While he ate, he could also mull his predicament and figure out how he might leave the realm.\n\nDevil Fangs were ugly, but the meat appeared similar to beef. So, they at least looked tasty. Han Sen cooked it to the accompaniment of a mouth-watering sizzle.\n\nBao’er sat down near the fire, watching as the meat slowly roasted.\n\n“It’ll be done in a sec.” Han Sen wielded his makeshift cookery like an artisan. He seared the meat perfectly, and a tantalizing aroma rose under his expert hands.\n\nHe brought out a crate of salts and spices. With a sprinkle here and there, the energizing scent deepened, and it got their tongues wagging for a taste.\n\n“Devil Fang meat consumed. Sacred Geno Points +1.”\n\nAfter Han Sen took a bite, he heard the announcement and was happy. He looked over to Bao’er and the bird, and saw them nibbling and pecking with delight at a portion of the meat.\n\nAfter eating a slab of the meat, Han Sen was full. But Bao’er and the bird were able to consume five slabs.\n\nDevil Fangs continued to howl, out somewhere in the darkness. They were too afraid to come any closer, but still, Han Sen thought it was rather strange for him and his companions to dine comfortably with danger not too far away.\n\nHe had managed to get four sacred geno points from the meal, which placed him at the number seventy. Soon, he believed, he’d max out the tally in full.\n\n“This might end up working out, after all. I’d say it’s a lucky thing, for me to end up here. This realm is full of easy kills, and if my good fortune holds out, I might even be able to slay a super creature, too. Heaven knows I need more of those geno points,” Han Sen thought to himself.\n\nThe sounds of howling grew closer over time, though. Eventually, Han Sen was able to catch a glimpse or two of the creatures, lurking in the darkness.\n\nBut suddenly, that was the least of their concerns. A giant, red Devil Fang came storming out of the black. It raised its blood wings and stared down at the fireside trio."
}