{
    "chapter": 1709,
    "title": "The Greenhouse Changes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1709",
    "text": "“What is this?” asked Xie Qing King, holding his nose and looking at the bodies and the liquids around them.\n\n“They are creatures held for testing and experimentation. Some are prototypes of something else—like him.” Old Cat jumped toward one of the crystal tanks, and he spoke with eyes fixed on it.\n\nHan Sen and Xie Qing King looked at Old Cat, and then observed the strange creatures contained within the tank.\n\nHan Sen could not describe what it was. It looked like a human, but a bug at the same time. It had human limbs, but the head had the eyes of a fly, with the multitude of lenses.\n\nAnd while the limbs were like a human’s, the joints were those of bugs. It looked very weird.\n\n“It’s just a disgusting bug.” After Old Cat said that, he leaped onto the tank and began slapping it with a paw. He obviously intended to break it open.\n\n“Are you ready? Dead or alive, it doesn’t matter: behead the thing as soon as you are able to,” Old Cat said to Han Sen.\n\n“Yes.” Han Sen was in agreement Pang!\n\nThe crystal tank broke, and the liquid and the bug man came spilling out.\n\nHan Sen did not say a word. He simply summoned the white geno armor, and with his hand like a blade, struck the neck of the creature.\n\nThe hand, now clad in the gauntlets of the armor, made a metallic striking noise when it hit. Han Sen’s power and geno armor had only been able to make a slight scuff on its neck.\n\nFortunately, the bug-man showed no reaction. It looked to be already dead. But just to be safe, Han Sen gave it another hundred cuts until he was able to break its shell.\n\nThe meat inside was like jam, and there was no blood. It looked like it had been dead for quite some time.\n\nGod knew how many times Han Sen had to hit it after that, but eventually, the head was lopped off. As he worked on it, he thought to himself, “This thing is so tough! Thankfully, it is dead. If it wasn’t, this would be quite a lot of trouble.”\n\n“Han Sen, according to the terms of our deal, if it was dead when we found it, the item we came for belongs to me. You’ll hold up your end of our bargain, correct?” Old Cat saw the bug-man’s head fall off and quickly jumped on it to speak.\n\n“Fine. Suit yourself.” Han Sen did not plan on stealing from him, so he just walked back a few steps and watched the Old Cat. He was keen to see what he was going to obtain.\n\nOld Cat used his claws to scratch away at the bug-man’s armor. A deep crack was instantly formed, and that gave Han Sen quite the shock.\n\nHan Sen knew Old Cat was not weak, but the action it had just performed was rather shocking.\n\nEven if Han Sen used the glove, he knew he’d have much trouble trying to break the shell. It wouldn’t have been easy. Old Cat was certainly much stronger than he was letting on, and much stronger than Han Sen’s own estimation.\n\nOld Cat’s claws were sharper than a surgeon’s scalpel, that was for sure. In no time at all, he was peeling the creature open. And before long, pulled back a paw that was holding something green.\n\n“What is that? A stone?” Han Sen looked right at the item in Old Cat’s hands.\n\n“Those are its guts.” Old Cat looked so happy to have obtained the jade-looking guts.\n\nHan Sen didn’t see where the cat put it, but he still asked, “They look like rocks, not organs. What are they truly for?” Han Sen asked.\n\n“This is good stuff. You’ll know all about it once you get out. With how you are now, you won’t understand.” After Old Cat dug up the guts, he ended his search. He jumped and said, “Let’s go, there is nothing left.”\n\nXie Qing King, meanwhile, wasn’t feeling too good about this. He said, “While we’re here, shouldn’t we explore more of this strange place?”\n\n“Do you think we have come here to sightsee? You’ll die if you explore anymore.” Old Cat rolled his eyes and started walking out\n\nHan Sen and Xie Qing King looked at each other, and then followed after Old Cat, so they could be led back to where they had initially come from.\n\nThe three of them walked past the greenhouse, and as they passed it, Old Cat hunkered a little and asked, “Did you touch the stuff in there?”\n\n“We were with you. You know that we didn’t take anything.” Xie Qing King said.\n\n“Old Cat, what’s going on?” Han Sen asked, looking across the greenhouse.\n\n“Someone has been digging in the soil.” Old Cat stared at the disturbed earth.\n\nHan Saw it, too. It was like a freshly dug grave, with soil churned up everywhere.\n\n“You didn’t dig this, did you?” Han Sen asked, with a frown.\n\n“If I did, why would I ask?” Old Cat madly rebutted.\n\n“If it wasn’t you or us two, might there be other creatures around? And if that isn’t possible, maybe the thing buried dug its own way out,” Xie Qing King said.\n\nHan Sen and Old Cat looked glum. No matter what the case was, this was bad news.\n\n“Let’s get out of here.” After Old Cat said that, he started to run.\n\nHan Sen and Xie Qing King ran as well. They ran for a while, but eventually, their faces fell. They had run dozens of miles, but they hadn’t escaped the vicinity. They found that they had walked in a loop, ending up back at the greenhouse and the fresh hole.\n\nIt gave them a very bad feeling. They looked around, but it was all quiet. There didn’t seem to be anything else there that was alive.\n\nHan Sen’s Dongxuan Aura could not feel the presence of other creatures. But they fell silent and went to examine the deep hole.\n\n“Keep going!” Old Cat told them to keep going, and so they did. This time, however, they walked faster.\n\nIt wasn’t long before the three of them ended up back at the greenhouse.\n\n“How can this be happening?” Xie Qing King wasn’t afraid, and he was actually quite happy to see the greenhouse again. Han Sen and Old Cat looked at each other and prepared to run, but suddenly, they heard a strange noise.\n\nPang! Pang! Pang! Pang!\n\nThe soil around the grave started to explode. Many more black holes were created, and the entire graveyard looked like one giant beehive."
}