{
    "chapter": 3029,
    "title": "Don't Belong to This World",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3029",
    "text": "Qin Xiu’s God Spirit level and universe level were quickly devolving. Even though he had combined with the holy spine and an Annihilation class God Spirit, his level was suddenly lowered to something comparative to a Disaster class God Spirit. He was also getting worse.\n\nLittleflower’s universe level was falling too. True God, Butterfly, Larva… It kept going down.\n\nSky Palace Leader and the other elites were both shocked and happy. Han Sen had the name Han Godfather, but no one would have believed he had the power to defeat Qin Xiu.\n\nSeeing Qin Xiu’s body’s God Spirit level drop from Disaster class, the geno hall no longer protected his body. He stopped hesitating. Han Sen used the strongest power possible to try and kill Qin Xiu and remove the universe’s biggest threat.\n\nAll kinds of power that could destroy the sky and ground rained down. It was all going to kill Qin Xiu. Suddenly, there was the flash of a shadow. Qin Xiu disappeared. The space was broken by a scary power. It caved in and became a black hole.\n\nVery High Leader shouted, “Han Sen, what are you doing? If you don’t kill him now… What if\n\nhe…”\n\nEveryone saw Han Sen use one hand to grab Qin Xiu as he appeared on the other side of space.\n\nThey quickly noticed something. Qin Xiu had taken over the body of Han Sen’s son. Han Sen would not watch his son be killed.\n\n“Han Sen, Qin Xiu is a demon that wants to destroy the universe,” Very High Leader said. “We cannot grant him a chance. Kill him now, or there will be consequences.”\n\nHan Sen coldly responded, “I don’t care what Qin Xiu thinks, but my son cannot be allowed to die.”\n\nSeeing Qin Xiu’s body devolving, Han Sen grabbed him. “Qin Xiu, leave my son’s body. I don’t care about anything more than that. I don’t even want to take your life.” The blue light in Qin Xiu’s eyes was very cold. He could not move because Han Sen restricted him, but he laughed and said, “Han Sen, I never imagined you would be able to reverse the blue blood gene power. That is a genius move. I never tried it before, so that surprises\n\nme.”\n\n“Stop talking crap! Leave my son’s body!” Han Sen grabbed Qin Xiu and kept using the Xuan Yellow Sutra power on him. He continued to suppress Qin Xiu’s body and ensure he continued to devolve.\n\nQin Xiu laughed like a madman. It was like he had not heard what Han Sen had told him. He spoke to himself and said, “I should have guessed this. That is very good. I am so happy.”\n\nver\n\nHan Sen wanted to say something, but a grand power suddenly came out of Qin Xiu’s body. In his eyes, which were once dim blue, there was a light that was red. The blue patterns on the armor turned red. The light was scarier than it was when it was blue. It was like his whole body was wrapped in a red flame.\n\nThe light on the back of the wings had even turned red. It turned the whole of space red. The universe was reflecting the color red.\n\nHan Sen’s power struck Qin Xiu’s power. It was blasted away. Their faces looked dim.\n\nVery High Leader and the others were incredibly shocked. Anyone was able to tell that Han Sen had learned the power that could make God Spirits drop their level.\n\nIn the past, Qin Xiu was invincible. Now, he had Han Sen’s power. Wouldn’t that make people hopeless?\n\nuy\n\nSeeing Qin Xiu’s power explode, his God Spirit and body levels had recovered. Very High Leader immediately roared. He pushed his Very High Sense to the max. His entire body combined with the universe’s rule power. He became sheer pressure focused on Qin Xiu. At the same time, he shouted, “Before he recovers, we must kill him!” Many elites of the universe did not hesitate. They all used their strongest powers to attack Qin Xiu.\n\nBoom!\n\nQin Xiu looked at the sky and roared. A shockwave of red blasted out of him. It broke the powers wielded by Very High Leader and the other scary elites. It also blasted their bodies away. The most shocking thing was that Very High Leader noticed their bodies were devolving. They themselves were dropping to butterfly class and continued to devolve. Aside from Han Sen, no one else escaped that power.\n\n“It is all over,” a Very High elder said. His face was pale. He looked utterly hopeless.\n\nIt was not just him. The elites of the entire universe knew it was over. Qin Xiu had learned Han Sen’s power, and he was doing even better with it.\n\n“Thank you, Han Sen,” Qin Xiu said. “Without you, I would have never thought the blue blood’s gene power could be used this way.” His entire body blazed with a blue flame as he approached the geno hall.\n\n“I did not create this,” Han Sen said as he stared at Qin Xiu.\n\n“I know,” Qin Xiu said with a nod. “If I have guessed correctly, this was done by Old Cat. But you are the one who performed it. That is your achievement.”\n\n“Get out of my way,” Qin Xiu said. “You cannot stop me. With your power, I will break the geno hall and have its destruction benefit you. I can make you become the leader of the world. I can make you bigger than God.” “Leave Littleflower’s body,” Han Sen seriously said. “I don’t care what else you do.”\n\n“If you insist on trying to stop me, do not blame me for forgetting your kindness of taking care of Wan’er,” Qin Xiu said. His body exploded with a blood flame. He teleported to Han Sen and tried to grab him by the chest.\n\nHan Sen generated the power of the Xuan Yellow Sutra again. He threw a punch at Qin Xiu. Two blood powers combined. Han Sen noticed his Xuan Yellow Sutra power was going into Qin Xiu. It gave Qin Xiu more power.\n\nQin Xiu grabbed Han Sen’s fist and calmly said, “You are strong. I will give you that, but your power originates from me. No matter how hard you try, you cannot be greater than me. In this universe, aside from me, no one can really use this power. Do you know why?”.\n\n“Why?” Han Sen wanted to shake Qin Xiu’s hand away, but he noticed his body’s power was not listening to him. It was like he had been sucked in by a very strong magnet. He kept going toward Qin Xiu.\n\n“Because I do not belong to this world,” Qin Xiu said. “My power does not belong to this world. And you, you belong to this world. Even though your body has my gene blood, you do not have the power to control the world. Old Cat spent so much effort and even died placing his faith in you, but he will never understand his plans were doomed to failure. He was wrong from the very start.” He used his other hand to grab Han Sen’s forehead through space.\n\nHan Sen felt his Sea of Soul shake. Destiny’s Tower lost all control. It flew out of the Sea of Soul and went into Qin Xiu’s hands.\n\nKatcha!\n\nDestiny’s Tower broke. The stuff inside fell out, including Wan’er. Qin Xiu used one hand to hold her body."
}