{
    "chapter": 1102,
    "title": "God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1102",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBack in the Martial Hall, exiting super king spirit mode, Han Sen felt a little nauseated and weak. It wasn’t as bad as he believed he’d end up, though, and he thought he still had what it took to fight again.\n\nHe thought it’d take longer to kill Fei Yu King. By fighting face-to-face, Fei Yu King lost as soon as he allowed the first coin to touch him.\n\n“I didn’t think I’d knock him down so quickly. I clearly underestimated myself. With such a decent result, I might as well have another fight.”\n\nHan Sen initially predicted he’d be unable to continue fighting after the first battle, but he was wrong. He didn’t know who he’d be going up against next, though.\n\nHan Sen found out his next opponent was merely a royal spirit.\n\n“A royal spirit? Oh, please. I can kill that thing in one hit. It shouldn’t take too long.” Han Sen was overjoyed.\n\nIf things continued that way, and he could finish the next four fights with similar results, he could retire for the day and rest.\n\nHe could possibly be fully refreshed and rejuvenated the next day, and thus able to fight again.\n\nHan Sen found out his next three opponents were royal spirits. He killed them easily.\n\nThe last opponent disappointed Han Sen, though. It was another king spirit.\n\nIf it had opened nine gene locks and wasn’t as dumb as Fei Yu King, it might prove a difficult battle.\n\n“I’ll see what condition I’m in after the next three fights.” Han Sen was in the Martial Hall, searching for the final opponent. He wanted to get an idea for how strong he might be.\n\nHan Sen found him engaged in his second fight. He could immediately tell an opponent such as that would be difficult to compete with.\n\nHe had indeed opened nine gene locks, and furthermore, he was attuned with the earth element. He could summon stone walls and the like, perfect for blocking the rain of coins.\n\nHan Sen thought, after fighting the next three royal spirits, he’d only have half an hour left of his super king spirit juice.\n\nEven with his brightest estimations, he didn’t think he could defeat that king spirit in half an hour.\n\nThe second round for Han Sen began shortly after. His opponent was on the stage already. Not wanting to waste a single precious second, Han Sen activated his super king spirit mode and ran towards the stage in haste.\n\nHan Sen was going to kill the royal spirit as fast as he could.\n\nBefore he engaged the royal spirit, though, it knelt before him and said, “Greetings. I am Prince Yunsha. It is an honor to share the stage with you.”\n\nBefore Han Sen could clock his opponent, Prince Yunsha conceded the fight. Han Sen won again, all without lifting a finger. Then he returned to the Martial Hall.\n\n“Did you see that? A spirit knelt before Dollar!”\n\n“He is a god! Since when do spirits behave like that, before a human they do not even know?”\n\n“Am I dreaming? This cannot be!”\n\n“It must be staged. Why don’t you go out there and see if they’ll kneel before you.”\n\n“Even if it was only a royal spirit, it’s still pretty nuts to comprehend how willing it was to concede and kneel before the guy.”\n\n“I can’t believe this.”\n\nHumans were driven into a frenzy. They had never seen a spirit so willing to kneel before a human before.\n\nThis was something they could only see in their dreams. For such a possibility to be a reality, they weren’t sure what to think.\n\nUpon seeing it happen, many people believed they were merely lucid dreaming.\n\nBut what happened next made everyone even more insane: the following two royal spirits did the same thing. They introduced themselves and threw in the towel immediately after.\n\n“Am I dreaming? Have those spirits gone nuts?”\n\nToday was a day none would soon forget. It was one for the history books.\n\nIf Dollar was previously a name synonymous with power, today it became synonymous with God.\n\nFor spirits to obey and worship him like so, they all figured he had to be a god.\n\nSpirits and humans were different. Spirits could respawn, and thus, they could not be afraid of death.\n\nDeath was something they could get used to, even. Self-destructing was no big deal in such a place, and if humans ever got their spirit stones, they could do it almost happily.\n\nSpirits would sooner accept death than bow before humans, which made this all the more stunning. But this was also a part of why humans believed themselves to be superior to spirits.\n\nBut Han Sen had not only just killed a king spirit, he made spirits obey without a fight. He didn’t have their spirit stones in hand. There was no real risk of death for them. Han Sen had done something spectacular. The gesture of what he had done was far more impressive than killing a spirit.\n\nDollar, in the hearts of humans, was no longer just a strong guy who brought their race glory in battle.\n\nThere were many human elites, yes, but none had done what Dollar did. None had made spirits obey before.\n\nHumans were incredibly excited now, especially those who were enslaved by spirits. Han Sen was a beacon of hope for them.\n\nSpirits weren’t aware of what humans were thinking, and they thought it was ordinary for other spirits to obey The King. He was far more powerful, after all.\n\nIn the Martial Hall, Han Sen frowned. He could only last another half an hour. If he was going to battle his next opponent, his window of opportunity to do so was small."
}