{
    "chapter": 177,
    "title": "Shooting the Commercial",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_177",
    "text": "The whole process of shooting the commercial lasted a total of thirteen days, much less than the original plan. Liu Changming and Xu Wenchang were more than satisfied with the result.\n\nHan Sen too was happy about everything. In addition to working with a beautiful actress, he also ended up having his Silver Killer modified.\n\nAfter the modification, Silver Killer was not only equipped with a weapon system, but also shrunk in size. It was only as big as a fifteen-inch laptop at this point and Han Sen could take it with him anywhere.\n\nLiu Changming told him that it was the best the current technologies could reach and a breakthrough in science had to be made before its size could be further reduced.\n\nIn accordance with their agreement, Han Sen was also given an SKTS, which had a special Digang mark on it, meaning it could enjoy life-long free maintenance service. Unless this warframe was completely scrapped, anything could be fixed for free in a Digang maintenance station.\n\nOf course, if it was located within the range of door-to-door service, that could also be arranged.\n\nThis type of maintenance service was not commonly seen, and only two SKTS had the mark. One belonged to Han Sen and the other to Yu Qianxun.\n\nAnd Han Sen's Silver Killer was also stamped with this mark.\n\nBut when Han Sen looked at his own SKTS, he made a small request to Liu Changming.\n\nBecause of the special properties of a biological warframe, its color could not be changed. An ordinary SKTS was in silver and even the owner added a coating on the outside, as long as the warframe was turned to its compressed form, the coating would disappear.\n\nSo, Han Sen’s request was to ask Liu Changming to add some blue patterns on his SKTS.\n\nHan Sen had already had his Silver Killer and was not interested in driving SKTS. With some decoration, it could at least look impressive when he took it out for a spin.\n\nLiu Changming agreed, but the color-changing was quite difficult and required high-level technology. If the warframe were to be made entirely blue, it would be easier. However, to add blue patterns required the professors in the laboratory to manually change part of the particle structure.\n\nWhen Yu Qianxun found out about Han Sen’s request and saw the holographic design of the blue and silver warframe, she requested the same patterns in red to be put on hers.\n\nFor this reason, Han Sen stayed at the base for several more days and did not immediately return to school.\n\nIn more than half a month, Digang had been pushing its campaign, but none of the consumers had seen the look of the super biological warframe.\n\nA revolutionary creation, a land mark in the warframe history… all the words Digang was using were viewed as a tale-spinning effort.\n\nThe competitors also turned the public opinion against Digang, and reduced the company into a passive position.\n\nDigang did not issue a counterattack, but was quietly waiting for the press conference to be held on September 1, when they would launch the new super biological warframe.\n\nFinally, on September 1, Digang held the press conference on time.\n\nDifferent from the press conferences before, this one was hosted by Liu Changming personally. Facing the journalists from all the major press in the Alliance, he said only one sentence, \"Please enjoy epoch-making creation presented to you by Digang.\"\n\nAfter that, a holographic commercial started to play and all the audience were placed in a campus in the spring time, with breezes blowing gently.\n\nThen, they saw a beautiful girl sitting under a tree next to the playground, reading a book, her silky dark hair slightly fluttering. The scene was so breathtaking that the audience were afraid their breath might disturb her.\n\nSunshine, green grass, and the beautiful girl brought them back to their innocent schooldays.\n\n\"Yu Qianxun, I knew it would be her,\" all the journalists were thinking.\n\nThe recent Digang products were all endorsed by Yu Qianxun, with great market effect. Therefore, everyone thought Digang would continue to hire her and it seemed that they were right about it.\n\nThe scene was followed by a close-up of the book in her hands. In the sun, it felt like the ink could be smelled.\n\nHowever, darkness suddenly fell on the pages and Yu Qianxun looked up, frightened. A grotesque, giant warship appeared in the sky and covered the entire school like a dark cloud.\n\n\"A Shura warship!\" The journalists recognized what it was.\n\nBang!\n\nAn ugly warframe fell to the ground, leaving a deep pit. The warframe stood up, the sword in its hand yearning for blood.\n\nNext, Shura warframes flooded out of the monster-like Shura warship. The monsters descended from heaven at the same time, turning a sweet scene into hell.\n\nThe earth was shaking, the gunfire was roaring, and the students were crying and running around.\n\nThe girl played by Yu Qianxun was also desperately running, holding the book in her arms. But how could her legs carry her faster than the Shura warframes? Not to mention the warframes were everywhere.\n\nA suffocating despair spread in the hearts of all the audience.\n\n\"Ah!\"\n\nAt this critical moment, she tripped over something and fell to the ground, and the book fell in front of her.\n\nStruggling to sit up, she reached for the book in panic. When she turned back, she saw the school under attack and the frightening groups of Shura warframes rushing over.\n\nSeeing the despair on her face, everyone was heartsick at once, wishing they could save the poor girl.\n\nBut there were too many Shura warframes, and one of them had even slashed at the girl with a sword.\n\nBang!\n\nA silver box suddenly hit the bloody sword aside, the letters \"TS\" engraved on the box.\n\nThe silver box finally fell into the hands of a boy in school uniform, who pressed the box and threw it up in the air."
}