{
    "chapter": 575,
    "title": "Absorbing Ice Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_575",
    "text": "Xue Yi Kuang was like a demon. His eyes gleamed red and his body was wholly crystallized. The atmosphere around him swirled with a biting frost. Although it couldn't deal damage, if an ordinary person were to touch it, it would make them feel as if they were falling into an ice cave.\n\nHan Sen used all of his power to run his Ice Skin skill, and it was only enough to repel the invasion of the frosty air that sought to consume him. He did not dare touch Xue Yi Kuang's actual body because his ice powers were simply too strong.\n\n\"The talent that I stole really isn't that reliable. It's the same first tier Ice Skin, but there is such a big difference. What could have gone wrong?\" Han Sen thought to himself.\n\nWhen he learned Ice Skin, he did not use a geno solution. Unless the Ice Skin Xue Long Yan possessed was fake, what other explanation could there be for it being so weak?\n\nWhen Han Sen was learning Nano Crystal, he used a geno solution to complete the first tier of Ice Skin. At first, Han Sen was really glad about learning Ice Skin. But right now, this knock-off Ice Skin was proving itself to be worthless against Xue Yi Kuang's version of it.\n\nHowever, Dongxue Sutra's formation was amazing. Although Xue Yi Kuang had opened his first lock and became incredibly powerful, he still could not hurt Han Sen.\n\nThat being said, it did little to sway Xue Yi Kuang's resolve, and the blizzard that encompassed him only seemed to grow. His eyes were blood red, and his fists flew quicker than the tumultuous waves of boiling water.\n\nHan Sen continued to dodge, falling back as he did. Xue Yi Kuang was too fast, though, and he did not dare let Han Sen slip away from the battleground he had established. He was putting him in a very dangerous situation.\n\nBut in the midst of all this, Han Sen noticed something quite strange. The frosty air that was bursting out of Xue Yi Kuang was being doused by Han Sen's Ice Skin. He didn't think much of it at first, but after a while, he started to feel that the power he had been suppressing was now inside him. It coursed through his entire body, empowering him.\n\nThe absorbed frost gathered up in greater and greater amounts, but it did not hurt Han Sen. It mixed with his insides, becoming a part of him.\n\n\"Does this mean I can absorb Xue Yi Kuang's frosted air?\" Han Sen thought to himself, happily.\n\nWith this absorption of ice power, his Ice Skin seemed different. Han Sen could not put his finger on it exactly, but his body did not seem to be bothered by the plumes of frost Xue Yi Kuang continuously emitted.\n\nPang!\n\nHan Sen was wearing his Blood-Scale armor. He threw his own fist to collide with Xue Yi Kuang's. He was unsatisfied with the absorption of the atmospheric ice power and thought the amount he had consumed was not enough. He wanted to see if he could absorb the power right from the source—Xue Yi Kuang himself.\n\nWhen the fists connected, however, he felt an overwhelming stock of ice power absorb into his body. Within seconds, his arms, half his body and his entire blood flow became frozen. His exterior was quickly encased in ice, removing his ability to fight or even move.\n\n\"Go die.\" Xue Yi Kuang's eyes burst with a flame of hatred, painting Han Sen with the color of murder. One last fist sought to drill itself into Han Sen's body.\n\n\"Oh, crap! The ice power was too much for my Ice Skin to consume immediately.\" Han Sen was terrified, and his mind raced with a thousand thoughts of how he might escape this dire predicament.\n\nBoom!\n\nThe silver fox on Han Sen's shoulder finally moved. Like a silver thunderbolt, it leaped towards his master's enemy and tore into Xue Yi Kuang's fist with its talon. With a flash of lightning, the ice that surrounded his fist was shattered, and his entire body was sent flying away. Electricity consumed Xue Yi Kuang, and when he hit the ground, his body was adorned with wretched scorch marks. His hand that suffered the dig of the talons had been blown to gory bits and pieces, revealing the bone of his arm.\n\nXue Yi Kuang looked at the silver fox with utter surprise; he was shocked.\n\nThe silver fox howled madly, and like an illuminated shadow, it jumped on top of Xue Yi Kuang.\n\n\"Aaaargh!\" Xue Yi Kuang flailed his arms madly to try to stop the attacking fox, but they did nothing. His chest was torn open with a collection of scratch marks, and blood started gushing like a fountain. The terrifying power of the thunderous fox had shattered every last bit of ice that dressed Xue Yi Kuang.\n\nThe silver fox seemed to be really mad, and it angrily circled Xue Yi Kuang like a silver shadow. Thunder and lightning cracked the sky as it observed its master's opponent.\n\nXue Yi Kuang, who was so strong, was utterly defenseless under the paws of the silver fox. Once more, the silver fox pounced to pierce its talons into Xue Yi Kuang's body, drawing rivers of blood. His body was now a collection of bloody ravines and black, scorch marks.\n\nXue Yi Kuang was terrified, repeatedly screaming in fear. The ice power inside him resumed its activity, but without the strength to bear it, he became encased in an icy sarcophagus of his own making. The silver fox had firmly proven the abhorrent power that resided within it, and there was nothing Xue Yi Kuang could do to revert the tides of this fight.\n\n\"It really is a super creature. It's only a pup, yet it is frighteningly powerful.\" Han Sen's mouth was agape. Even though he had always suspected that the silver fox possessed an undemonstrated strength, he never thought its power would be so fierce.\n\nXue Yi Kuang, who had opened the first gene lock, lacked any remote chance of resisting the attacks of the silver fox. All he could do was watch himself get electrified.\n\nPang!\n\nA silver lightning bolt struck Xue Yi Kuang's chest. It lifted him into the air and away until his body crashed into an icy wall. There was so much force in the throw that the wall shattered as Xue Yi Kuang barreled through it. His body was now like charcoal, and he fizzed and crackled with residual electricity. His body convulsed and twisted madly with no refrain.\n\nIt looked as if he couldn't breathe, and whatever gasps he could manage were going to be amongst his last.\n\n\"No way! This is impossible,\" Xue Yi Kuang cried out. He had great trouble keeping his eyes open. He stared over at the silver fox, that stood atop the snow softly and elegantly. He could not believe he was going to be killed by what looked like a mere fox.\n\nThe silver fox turned into a silver shadow one last time and bolted over to Xue Yi Kuang again.\n\n\"Aaaargh—\" Boom!\n\nXue Yi Kuang could not even finish his scream before a mighty flash froze him like a black, charcoal statue. As a stiff wind blew, what was once the body of Xue Yi Kuang succumbed to a gust and drifted away as nothing more than dust and echoes.\n\n\"So, Xue Yi Kuang died just like that?\" Han Sen opened his eyes widely, trying to observe the traces of black dust floating upon the breeze.\n\nHe had been so used to seeing the silver fox tame, calm, and harmless, that he had almost forgotten that it was a fierce super creature. Seeing it become something so scary and violent was quite shocking.\n\nHe then returned his thoughts to the current state of his body, which was still mostly encased in ice. The blood inside was little more than ice, as well. If he couldn't defrost himself soon, he would perish.\n\nHan Sen slowly turned back on his Ice Skin, and he felt the ice that covered him start to thaw. It gradually turned into a frosted air that swirled its way into his body.\n\nThe silver fox quietly sat on the snow beside Han Sen. It did not even blink as it observed the ice seep back into the ground as water.\n\nThe icy air that swirled in and around him started to be expelled, returning to the atmosphere without form. His iced skin became crystal, and his flesh and bones turned transparent.\n\nAs time passed, the amount of power Han Sen expelled got heavier and heavier. The transparency of his flesh and bones increased, and you could now see his veins."
}