{
    "chapter": 332,
    "title": "Playing Go",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_332",
    "text": "After falling from the cliff, Han Sen summoned his wings and flew away. The turtle looked down the cliff and turned around. It obviously had no intention to chase Han Sen.\n\nWhen Han Sen joined the rest of the group, everybody was overjoyed to see him.\n\n\"Han Sen, we are alive thanks to you. I am so sorry that I almost got you killed,\" said the professor, feeling guilty.\n\n\"It's not your fault, professor. This is all on me. Han Sen, you can punish me as you like. I owe everything to you,\" Lu Mingda said with his face flushed.\n\nJin Rijie wanted to add something but was interrupted by Han Sen, \"We were all just trying to protect Professor Sun. You just did not know how scary the turtle was. It's okay.\"\n\n\"Rest assured, Han Sen. You have saved all of our lives. If you ever need anything, we will be here for you,\" said Jin Rijie seriously.\n\nAfter some discussion, the group decided to return to Glory Shelter for maintenance before they came back for the turtle.\n\nHan Sen took the opportunity to go back to Blackhawk. He quickly logged in Gladiator, opened his friend list and found Queen online. Han Sen was overjoyed and hastily sent her an invite.\n\nThe kiting skills he learned from Queen were still faulty. There were many things that he failed to understand.\n\nIf he could actually learn the kiting skills from Queen, maybe he could fight the turtle without relying on speed. Therefore, Han Sen wished to fight her another time and observe her kiting skills.\n\nHowever, Han Sen did not know whether Queen would agree to fight him. After all, the two of them were too far apart in strength. If Queen were there, she would have killed the turtle easily.\n\nHan Sen estimated that a super creature should have a fitness level around forty, while the strongest humans in First God's Sanctuary could only reach twenty in some aspects. Most good men usually had an average fitness index of fifteen.\n\nEven those who had maxed out on all four types of geno points in First God's Sanctuary only had a fitness index of thirty, which was still not enough for one to kill a super creature.\n\nHowever, an evolver with a fitness level beyond 100 like Queen would be able to kill a super creature easily.\n\nAn evolver would not be able to return to First God's Sanctuary, unless the evolver had just evolved. Even for Queen, when she was an unevolved person or had just become an evolver, she would not have been able to fight the turtle.\n\nHan Sen was not sure whether Queen would agree to fight him, but he wanted it so much. One more round! Just one more round.\n\nSeeing Han Sen's invite, Queen was dazed. Her setting was not to accept invites from strangers, and she had never had a friend before, so she had never received an invite.\n\nSeeing the invite was from A Soldier on Warship, Queen hesitated and clicked yes.\n\nHan Sen was exhilarated to see Queen and her amazing kiting skills again. After the countdown was over, Han Sen immediately ran toward her. He did not dare to wait for her attacks. Their fitness levels were so different that he would be killed immediately. After all, his fitness index was only thirty, while hers was probably 100.\n\nQueen only dodged the punch like last time, and did not fight back.\n\nFeeling excited, Han Sen threw his other fist at her and made a step.\n\nQueen was surprised. Han Sen's punch and step were not as simple as they appeared to be. Although he was not that fast, in Queen's eyes, his moves were unexpected.\n\nHan Sen's step was almost like her kiting skills, making it impossible for her to force Han Sen into a corner.\n\nIs he copying me? Queen's gaze fell upon Han Sen. She continued to observe.\n\nVery soon, queen was certain that Han Sen was mimicking her kiting skills. Although there were many errors and defects in his movements, it was amazing that he could achieve this level in such a short amount of time.\n\nQueen did not rush to end the combat. She wanted to see how well Han Sen could do.\n\nKiting skills were not for anybody. It was easy to learn, but hard to become a master at.\n\nIt was like playing Go. Whoever knew the rules could play, but it was extremely difficult to excel at Go.\n\nQueen was good at kiting skills. At least among the opponents that she had met, no one could match her level.\n\nHan Sen's performance more or less surprised her. He was a bit green and was still making mistakes, but in her eyes, he had his own understanding of the skills. Also, Han Sen was sensitive about what she wanted to do. These proved that Han Sen was talented in this matter.\n\nAfter testing Han Sen's level, Queen stopped thinking about it. Being talented was one thing, but whether he could go far was another.\n\nQueen did not say anything but continued to dodge Han Sen's attacks. However, Han Sen suddenly felt much more pressured. It became more and more difficult for him to determine where Queen was going.\n\nThey were like two players at a Go game. Han Sen was the weaker player and his every step was in Queen's calculation. There was no way he could fight back. Very soon, Han Sen was pushed to the corner like last time.\n\nBang!\n\nWith another kick, Han Sen was eliminated. When he returned to the game, Queen had already gone off-line.\n\nHowever, Han Sen did not feel upset, but more excited than ever. He was not sure if Queen was intentionally teaching him. Her last few steps were indicating the weaknesses in his kiting skills, which was why he felt terrible toward the end.\n\nThis was not a bad thing for Han Sen, but a good thing.\n\nQueen was like a teacher, helping him find his mistakes.\n\nWhether she was intentional or not, Han Sen was grateful to Queen. Kiting skills were crucial for him to hunt super creatures.\n\nAnd kiting skills like this could not be practiced through tutorials like hyper geno arts. Han Sen had gained an incredible asset through fighting Queen.\n\nAfter downloading the video of their combat, Han Sen left Gladiator and when to the warehouse of Heavy Warframe Society. While watching the video, he pondered what he could do to refine his kiting skills.\n\nIndeed, Queen was trying to indicate Han Sen's mistakes to him in the last few steps. There were not many people were interested in practicing kiting skills. Since Han Sen was interested, she was willing to give him some tips.\n\nHowever, what she did casually meant a great deal to Han Sen, and added to his chance at killing a super creature.\n\nIf I could use kiting skills to avoid the turtle's attacks, I will never be defeated. This way, I will find a chance to kill it sooner or later. Han Sen became more excited."
}