{
    "chapter": 2866,
    "title": "God Sadness Appears Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2866",
    "text": "Boom!\n\nPurple light shot into the sky. It became an empty sky crack in space. A silent, sad mind was all across the universe.\n\n“It’s a god’s sadness… That is a god’s sadness… Dollar killed… It is a real god spirit…” In the universe, many spirits were looking at the god’s sadness appear in space. They were all in shock.\n\nOrdinary creatures were doubting Sky God Armor’s identity. When the god’s sadness showed up, they stopped doubting. “Oh, my God! Dollar really did kill a god spirit.” “The human Dollar. Can someone tell me what sort of race a human is?”\n\nneo\n\n“This is madness. Another god’s sadness. This era is madness. Is the chaos of the Sacred era repeating?”\n\nThe elites who knew what Sky God Armor meant looked at the god’s sadness weirdly. They even lost interest in talking.\n\nA butterfly xenogeneic had managed to kill a god spirit, and he was holding a god personality armament in his hands. They wanted to know who this Dollar was.\n\nMany elites used all kinds of tricks to learn his identity, yet none of them were able to uncover who the elusive Dollar was.\n\nGod stared at Han Sen and thought, Why would he have Sky Vine Radish’s spirit? Why would it be controlled by him? Is there some sort of power restricting Sky Vine Radish’s spirit?\n\nAfter the fight was over, Dollar’s name was known across the entire universe.\n\n“This Dollar is a little weird. If Little Mountain leader encounters him, there might be some trouble,” the green-haired beast said with a look of seriousness. He was very confident in Golden Growler’s abilities.\n\nAfter watching Han Sen defeat Sky Armor God, he was not so sure if Golden Growler was capable of achieving first place.\n\nThe woman near him coldly said, “He was able to defeat Sky Armor God not through his own power, but on a weird geno art and the god personality armament. He is just a butterfly class opponent. The god personality armament is strong. With his butterfly body’s movement, he cannot beat Little Mountain Leader. That geno art he has is a law power. It is similar to the second leader of the Extreme King’s power. That power is useless against the Little Mountain Leader.”\n\n“You’re entitled to say that, but this Dollar guy is strange. It is like there are some problems with him,” the green-haired beast said with a frown. He could not identify what the problem was.\n\nHan Sen returned to the garden. God looked at him like he was smiling, but he was not smiling.\n\nHan Sen knew that God would be suspicious about his ability to make use of the Sky Vine Radish. He was not surprised.\n\nIt did surprise Han Sen that while God did look at him, he did not ask anything.\n\nHan Sen looked at God with curiosity as he asked, “Do you not want to ask anything?” “If there is something you wanted to tell me, you would tell me without me asking,” God coldly said. “If you did not want to say something, you would not answer me even if I asked you. Why would I bother asking?”\n\n“Aren’t you good at talking deals? Maybe I will tell you if you talk about deals.” Han Sen laughed.\n\nGod shook his head and smiled. He said, “I prefer to discover secrets myself. Things are more interesting that way.” Han Sen was shocked. He did not expect God would say such a thing. The plans he had made were useless now. He suddenly did not know what to say.\n\n“Sky Vine Radish’s god temple… Sky Armor God has one too, right? Can you take me there again?” Han Sen had two god personalities. If he did not go to the temple, the god personality seemed useless. Han Sen had yet to find a way how to refine the god personalities he had.\n\nGod shook his head. “No. You can go there, but you will have to go there by yourself.”\n\n“How do I get there?” Han Sen asked.\n\n“You will know when you enter the geno hall,” God said with a smile.\n\nHan Sen was speechless. He guessed the temples might have been inside the geno hall, but he did not think he could go to the geno hall just yet.\n\nHe didn’t say anything. Han Sen kept watching the god fights, trying to observe the opponents he might later go up against.\n\nBecause the opponent in the next round had yet to finish, Han Sen did not know who he would be going up against. He knew none of his future opponents would be easy. The geno god fights had been going on for a while. There were no more weaklings. They were all top deifieds now.\n\nIn a palace in the Extreme King, Ancient Abyss Grandmaster bowed and said, “Mister, the eye skill Dollar used was similar to our second leader of the Extreme King, Extreme King’s Overbearing Eye. Holy Baby’s body combined with the Extreme King’s Overbearing Eye. He should be familiar with that geno art. “Do you think Holy Baby is Dollar?” Bai King put down his pen. He raised his head and looked at Ancient Abyss Grandmaster.\n\n“They are both very similar,” Ancient Abyss Grandmaster said. “Although Holy Baby might not be Dollar, if Dollar can use a law skill to beat a god spirit, perhaps Mister Holy Baby can too.” “Sure, I will deal with this,” Bai King slowly said. “Is there anything more?” Ancient Abyss Grandmaster sighed and said, “There is progress in the big barren systems. I have calculated the location of the entrance to the old Sacred ruin, but we have run into some trouble.” “What trouble?” Bai King asked with a frown.\n\n“Sky Palace’s people were there,” Ancient Abyss said. “I am afraid they located the entrance too. We are asking for your advice.”\n\nBai King was silent a moment before saying, “Don’t do anything yet. If Sky Palace wants to go in, let them go in first. We will follow.”\n\n“Sure. I understand.” Ancient Abyss bowed and left the palace.\n\nAfter Ancient Abyss left, Bai King thought, Holy Baby. He reached his hand out to take something, but quickly pulled his hand back. He shook his head and said, “Whatever. Things are already in motion. There is no turning back. We have to keep going.”\n\nHan Sen thought it was Bai King who had come looking for him to ask about the Extreme King’s Overbearing Eye. Surprisingly, Bai King did not go and find him.\n\nDoes the power in my left eye that different from the Extreme King’s Overbearing Eye that Bai King did not even suspect anything? Han Sen wondered.\n\nGod seemed to know what Han Sen was thinking. He laughed and said, “The Extreme King must have their suspicions on you, but Bai King is here. Even if they do, they cannot do anything to you.” “Is Bai King not suspicious?” Han Sen asked.\n\n“Of course, he is not suspicious,” God said with certainty.\n\n“Why?” Han Sen did not understand why Bai King was not suspicious.\n\n“Because he knows you are Dollar. There is no need to be suspicious if he knows.” God laughed. “Huh? Why doesn’t he ask anything?” Han Sen’s suspicions were not minimized because of the answer.\n\n“Because there is no need to ask,” God said. “It does not matter if you are Dollar or not. To him, all that matters is that you keep living.” “Why does he want me to keep living?” Han Sen was even more confused.\n\nGod laughed and did not answer. He said, “After winning one more round, you will breach the top 100. Then, you will be able to leave your name on the geno god list. Will you feel successful?”"
}