{
    "chapter": 2417,
    "title": "The Advantages of Gene Transference",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2417",
    "text": "Han Sen took a moment to look around, trying to place where he was within the core area. He wasn’t in the mood to hunt core xenogeneics at the moment. After he had confirmed his location, he just returned to camp.\n\nHan Sen walked out of his private room, then suddenly jerked to a stop. Falling Leaf and Bao’er were staring each other down. Falling Leaf’s face, meanwhile, was covered in paper.* She was holding two cards, and she looked very serious.\n\nBao’er, on the other hand, was holding one card. She looked gravely at Falling Leaf’s two cards.\n\n“Which one should I choose?” Bao’er wondered, carefully considering the decision. She pointed her finger, wavering between the two cards in the other woman’s hand. It looked as if she had to pick one out of the two.\n\nWhen Han Sen saw them, he knew Bao’er and Falling Leaf were playing Old Man.\n\nOld Man was very simple to play. One of the Jokers was removed from a normal deck of playing cards, and then the deck was dealt to the players.\n\nEach player then removed all the pairs they could from their hand. Once their hands only contained the cards that couldn’t be paired, they took turns choosing cards from one another’s hands. If a player chose a card that they could pair with one of their own cards, the player could discard the pair. The winner was whoever got rid of the Joker, which could not be paired, and discarded all of their cards.\n\nThis was a game that Han Sen had played a lot with Bao’er in the past. Because Han Sen was very good at this sort of prediction game, Bao’er initially never won. But after they played for a while, he stopped winning so often. Before long, Han Sen felt as if he would never win another game. It took a lot of focus for him to play with Bao’er, especially when he was doing his best to avoid losing.\n\nEventually, he just stopped playing with Bao’er entirely, which meant Bao’er could never exact revenge on Han Sen for all the times he had beaten her. Bao’er had been angry about that for quite some time.\n\nBut Han Sen was very adamant about not playing with her. He never gave her the chance to exact revenge on him.\n\nIt was a game that was highly based on luck, judgment, observation, and mind tricks. The Han family prided themselves on their skill with the game, but Han Sen was no longer sure if he had what it took to beat Bao’er these days.\n\nSeeing Falling Leaf with a face full of paper, he could tell she had lost badly. Bao’er’s face was very clean, and there was not a single piece of paper on her.\n\nAs Bao’er’s hand moved slowly back and forth between the two cards, Falling Leaf’s face displayed no emotion. But her heart leaped in her chest with every movement of Bao’er’s hand.\n\nShe really did feel awful. In the beginning, she had only agreed to play the game with Bao’er to make the child happy. A game like this was too easy for a killer like her. She was excellent at reading people, and her prediction abilities were phenomenal, of course.\n\nBut in all the time since they had begun playing, she hadn’t won once. Falling Leaf was rapidly growing rather desperate, and she would have done anything to win at least once.\n\nFalling Leaf’s eyes stared at the two cards in her hands. Whenever Bao’er touched the Joker card, she felt good. When she pointed at the seven of hearts, she felt very worried.\n\n“Maybe I’ll pick this one?” Bao’er said. Her little hand reached for the Joker card. Falling Leaf’s pulse quickened as Bao’er’s fingers brushed the Joker card…\n\n“Take it! Take it!” Falling Leaf was shouting madly in her heart, but she didn’t allow her emotions to show on her face.\n\nSuddenly, Bao’er stopped. She turned and grabbed the seven of hearts, and she smiled. “I think I am going to take this one.”\n\nA muscle in Falling Leaf’s cheek twitched. Her fingers tightened on the two cards as Bao’er tried to pull the seven of hearts loose. Falling Leaf wouldn’t let it go.\n\nSeeing that the woman was refusing to let the card go, Bao’er didn’t know what to do. She let go of the seven of hearts and picked the Joker card. “In that case, I will take this one.”\n\nFalling Leaf was thrilled, and she released her clawlike grip on the cards. Bao’er grabbed the Joker card and quickly said, “It is my turn.”\n\nBao’er placed two cards in the deck and then brought out two cards of her own. Facing Falling Leaf, she said, “Okay, it is your turn to pick.”\n\nFalling Leaf gritted her teeth and stared at the two cards. She focused intently, as if she could read something from the back of the cards.\n\nAs the top killer in Spring Rain, Falling Leaf’s powers of observation and judgment were the best. She could easily pick up on even the smallest difference.\n\nShe had just taken the Joker card, so it was possible that some instinct deep within her would guide her to victory.\n\nBut God only knew what material was used to create those cards. They were thin as paper, but she couldn’t sense any trace that might identify the cards. She couldn’t tell what was on the cards.\n\nFalling Leaf’s eyes looked ready to pop out of her skull. She couldn’t tell which one was the Joker card.\n\n“Are you going to pick one or not?” Bao’er said with a yawn.\n\n“What’s the rush?” Falling Leaf reached out her hand to pick the card that was on the left. She looked at Bao’er, hoping to see some sort of clue in her eyes.\n\n“If that’s the one you want, then just take it,” Bao’er said, her face bored.\n\nFalling Leaf, hearing Bao’er say this, decided not to pick it. They had only been together for two hours, but in Falling Leaf’s eyes, Bao’er was no longer a small child.\n\n“Trying to fool me, huh? It’s not that easy.” Falling Leaf raised her hand to take the card on the right.\n\nWhen she turned it around, though, she looked like she had been struck by lightning. It was a Joker card.\n\n“Why do you not just believe people? You adults are all so complicated. I don’t understand you.” Bao’er looked sorrowful as she shook her head.\n\nFalling Leaf’s face twitched. She gnashed her teeth and said nothing. She placed the card down behind her and drew two more cards. She put them in front of Bao’er and coldly said, “Your turn.”\n\n“I pick this one.” Bao’er reached out her hand and picked up the seven of hearts from Falling Leaf’s hands.\n\n“Haha, I win again.” Bao’er threw down her pair of sevens. She grabbed a piece of paper and stuck it on Falling Leaf’s face.\n\n“We’re playing again!” Falling Leaf started to shuffle the deck.\n\n“I’m not playing. You are too weak for me.” Bao’er looked very bored.\n\n“Just one last time,” Falling Leaf said slowly, enunciating the words. Her eyes looked ready to burst into flames.\n\nHan Sen almost laughed. Playing that game with Bao’er was like a death wish.\n\nBao’er rolled her eyes, looking like she really had no interest in playing. She said, “We can play, but sticking paper on each other’s faces is boring. Let us raise the stakes.”\n\n“Sure. What would you like to bet?” Falling Leaf really wanted to win. She was Spring Rain’s top killer. She couldn’t allow herself to lose to a kid. She had to win.\n\n“The loser has to go to the door and shout ‘I am stupid,'” Bao’er said after a moment of thought.\n\n“That…” Falling Leaf hesitated. She wasn’t entirely sure she could defeat Bao’er, and many Spring Rain elites were nearby. It would be embarrassing if she was heard.\n\n“Never mind, then. This is lame, anyway.” Bao’er stood up and got ready to go.\n\n“Fine! We will do as you say!” Falling Leaf almost shouted as she touched Bao’er’s arm. She was desperate to defeat her.\n\nHan Sen couldn’t watch. The game had ended before it even began. Not even a deified being could beat Bao’er at this game. This was what the Han Sen family was best at.\n\n*Endnote: When a person loses a round, they place a sticker on their face. This makes it obvious at a glance who is winning and who is losing."
}