{
    "chapter": 2947,
    "title": "Holy Kirin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2947",
    "text": "“Old Vulture, what happened outside? Why has the darkness around the holy palace lessened considerably?” In the darkest corner of the palace, a beast, which looked completely red had an eye that resembled a purgatory abyss, looked at the dark sky.\n\nOn the roof, a giant beast, which had no eyes, asked, “Is your eye going funny? How can Sacred be bright?”\n\nA weird, pitch-black bird stared at the darkness and said, “Things really do look brighter.” It turned and spoke to a pretty woman. “You old horny woman, do you see what is out there?”\n\n“It is fine for you to call me a horny woman, but I will rip your head off if you call me old again.” After the pretty woman said that, she peered into the faraway darkness.\n\n“Weird, things do appear brighter. What is going on?” Auntie Mei was surprised.\n\n“It can’t be my eye going funny. The darkness around the holy hall is much weaker. Something must have happened in Sacred. It must be something huge.” The angry red beast started to move. It seemed as if he wanted to go outside to take a look at what might be going on.\n\n“Something big? So, what if it is big? Those God Spirits wouldn’t come here. What other creature could make changes to Sacred?” Auntie Mei had a look of disdain. She sighed and said, “Little Master has been gone for so long. Why has he yet to come back? Do you think something might have happened to him?”\n\n“You horny woman, don’t you worry,” the eyeless big beast said. “With Little Master’s power, no creature in the sanctuaries could do battle with even his littlest finger. They won’t be able to do anything to hurt him. Plus, Old Cat is following Little Master. Although that Old Cat is a bit lame and doesn’t do much, he is one of the four holy beasts. He used to watch over the sanctuaries. He won’t let anyone or anything bring harm to the Little Master.”\n\n“Hmph, who knows if Old Cat is reliable?” Auntie Mei coldly asked.\n\n“That is not right. Why is it going so bright over there? I think I can see a light.” The red beast with an eye was staring into the darkness.\n\nOld Vulture stared off into the distance too. Inside the darkness, there was a twinkle of light that was expanding. Although it was still unable to light up the holy palace and eradicate its dark, they could see the light.\n\nAuntie Mei looked toward the light and was shocked. “What happened? That light can shine the darkness around the holy palace. What happened outside?”\n\nOld Vulture had the best vision among them. While he was watching, he suddenly screamed. “The Holy Kirin… It is the Holy Kirin… That is the Holy Kirin’s spirit releasing power.”\n\n“How is that possible? The Holy Kirin’s spirit… Isn’t that inside the fate monument? Little Master did not go to the fate monument yet, so how could the Holy Kirin’s spirit appear?” The red, angry beast let out a strange scream.\n\n“Impossible… Aside from Little Master, no one else should be able to activate the Holy Kirin’s spirit.” Auntie Mei’s expression changed.\n\n“Why are we still sitting here talking crap? Let’s just get out of here. The Little Master’s Holy Kirin spirit cannot be stolen by someone else.” The red, murderous beast weirdly screamed and flew into the darkness.\n\nHis body touched the darkness, which made some same sounds mechanical and cogwheel-breaking sounds. The red flames of his body struck the darkness. Every step he took was like breaking the world.\n\n“Goddamn barren power…” The red murderous beast kept swearing as he went. No matter how much he swore, he could only travel through the dark.\n\nOld Vulture flapped his wings and soared into the dark. It looked like a sky full of dark clouds. After going into the dark, there were some thunderous noises. There were lots of sparks around him as he battled with the dark.\n\nAuntie Mei and the eyeless big beast rushed into the darkness too. They traveled slowly through the dark. They were in a rush, but they could not get out of the darkness to reach the shadow of the Holy Kirin.\n\nDeep Abyss Grandmaster and Sky Palace’s first seat looked at the Holy Kirin, which was a transparent light. It did not have a body.\n\nHan Sen also stared at the Holy Kirin. The more he looked at it, the more afraid he became.\n\nThe Holy Kirin was not a xenogeneic right now. The presence of its body was more like…\n\n“Beast soul!” Han Sen almost screamed. The Holy Kirin looked like a beast soul and not a xenogeneic.\n\nAs the Holy Kirin body’s light grew brighter, the fate monument’s light became weaker. It was like the power in the fate monument was going into the Holy Kirin. It made its body more solid. Although it was not solid yet, it did appear to become more tangible and alive.\n\n“What is going on? Isn’t the Holy Kirin dead? Its horn became a statue, and its meat was cooked. How can the beast’s soul still exist? If the beast soul is a spirit, can the body be gone but the spirit remain?” Han Sen had many questions flooding his mind.\n\nWala!\n\nThe fate monument lost all of its light. It shattered like a rotten hunk of wood. It turned into a sky full of dust. The Holy Kirin was looking very alive, but its body still looked like a beast soul. It did not become fully solid.\n\nThe light on the Holy Kirin started to become dim. The light, which had been so bright, turned dark. Only the two long, bright lanterns continued to glow with their limited range of light.\n\n“One of the four holy beasts, the Holy Kirin, is not dead!” An Extreme King deified elite was utterly flabbergasted.\n\n“No, the Holy Kirin’s situation does not seem to mean it is alive.” The Deep Abyss Grandmaster stared at the Holy Kirin and frowned.\n\nSky Palace’s first seat stared at the Holy Kirin too. He pulled his hands into his sleeves and flicked. He looked like he wanted to attack, but he didn’t. He seemed to be afraid.\n\nThe Holy Kirin’s eyes looked at Han Sen. It four legs were moving toward Han Sen. The holy light was on his body. The scene was exceptionally strange to witness.\n\nHan Sen thought, “What does it seek to do? Is it because I activated the fate monument? Does it now want to fight me? Does it want its Kirin horn back?”\n\nWhile Han Sen was guessing, the Holy Kirin came before him. It did not look as if it was doing anything.\n\nThe Holy Kirin stopped very close to Han Sen. It was so close that it made Han Sen wish to retreat, but the Holy Kirin suddenly and quietly moaned to Han Sen. It lowered its head and placed its head in front of Han Sen.\n\n“What does that mean?” Han Sen looked at the Holy Kirin, which was lowering its head. He had no idea what the Holy Kirin wanted.\n\nThe Holy Kirin saw that Han Sen was not doing anything, so it moaned again. It then put its head closer to Han Sen.\n\nHan Sen finally understood something. He reached out his hand and touched the Holy Kirin’s head."
}