{
    "chapter": 76,
    "title": "Holy Angel",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_76",
    "text": "Just by reading the descriptions, Han Sen was already feeling excited. Except for the ones that had high prerequisites and could only be practiced by those with evolver or higher status, Han Sen wanted every hyper geno art listed in there.\n\nUnfortunately, one license could only be used to purchase one hyper geno art. Han Sen wanted to choose one that laid the foundation for better fitness for his sister. With such a hyper geno art, Han Yan wouldn’t be inferior to those posh school students. She would even be better than them, because even posh schools didn’t offer such advanced hyper geno arts to students.\n\nFinally, Han Sen carefully selected and bought a hyper geno art named \"Holy Angel.\" According to its description, this hyper geno art would help improve all types of genes and had been tested for a long time. Its practice was smooth and didn’t involve much risk, so it’s excellent for laying the foundation. Many who had practiced it had seen great effects.\n\nThis hyper geno art fulfilled all the requirements of Han Sen. It was easy to practice and had low risk. There were many who had practiced it too. So even if people noticed that his mother and sister were practicing Holy Angel, they wouldn’t be surprised.\n\nHan Sen downloaded the tutorial of Holy Angel and checked it out. He was surprised to see that this S-Class hyper geno art was still not as good as his Jadeskin.\n\n\"Who was that Xue Longyan? How come he had such an outstanding hyper geno art?\" Han Sen felt glad that he didn’t let anyone see Jadeskin.\n\nHoly Angel and Jadeskin were similar, so that there was no need for Han Sen to practice Holy Angel as well. If someone asked him which hyper geno art he was practicing, he could just answer Holy Angel, which was another reason why he had bought it--it would very hard for one to tell Jadeskin from Holy Angel indeed.\n\nHan Sen put away the tutorial of Holy Angel and went to Saint Paul to pick Han Yan up. He wanted her to come home to practice Holy Angel, so she would have to stop living on campus for a while.\n\nHan Yan's teacher was a twenty-seven-year-old woman in a professional suit. Under her knee-length skirt the flesh-colored stockings really showed off her long legs.\n\nShe had her hair pulled back and was wearing a pair of wire-rimmed glasses. Although she looked demure and full of mature women's charm, Han Sen knew well that she was definitely already in Second God’s Sanctuary, which was the minimum standard for teachers at Saint Paul.\n\n\"You are Han Yan's brother?\" Qu Wange slightly frowned at Han Sen.\n\n\"Yes, Ms. Qu, I want you to give Yan a few days off,\" Han Sen said.\n\nQu Wange was displeased and said with some disgust, \"Where are your parents? Why haven’t they come?\"\n\n\"They are very busy. I have come of age and can be considered one of Yan’s guardians. You could tell me if you have something to say,\" Han Sen said.\n\nQu Wange said bluntly, \"What do your parents take education for? Do they think everything will simply work out if they spend the money and send their daughter to an expensive school? The school has started for quite a while now, yet your parents haven’t been here or asked about her study once. Do they know what Han Yan needs?\"\n\n\"I’m so sorry, Ms. Qu. We have a lot going on in the family. It’s our fault. Did anything happen to Yan?\" Han Sen asked worriedly.\n\nShaking her head, Qu Wange said with some bitterness, \"Han Yan is fine. She is a talented girl and would do so much better if she could use advanced nutrient solutions and care. Now, she’s only using an ordinary nutrient solution package and does not have a physician assigned to her, which has affected her grades. Since your parents have sent her to Saint Paul, are they going to allow this to happen just to save some money?\"\n\nThe families that could afford tuition of Saint Paul must have tens or hundreds of millions in their accounts. Qu Wange didn’t realize that Han Sen’s family might be short of money.\n\nHan Sen knew what she was saying. Nutrient solutions couldn’t improve one’s genes like the meat of creatures in God’s Sanctuary did, but it could offer all the nutrients needed by the human body. In this sense, it could also improve one’s fitness, though not as greatly as the meat would.\n\nThe more advanced the nutrient solution was, the more benefits it could bring to one’s study and body. Han Sen had used some when he was a kid, but as his family went down, he had to stop.\n\nA physician was someone responsible for conditioning a student’s body. If there was any accident in the process of studying, the physician would timely condition the student’s body and use scientific methods to keep the student always at his or her best.\n\nBoth purchasing nutrient solutions and hiring a physician would cost a lot of money. The several million Han Sen gave to Luo Sulan were just enough to send Han Yan to Saint Paul, so the nutrient solution package they bought for her was the cheapest type, which only cost a hundred thousand per month. Hence the result was not ideal. The physician and conditioning equipment Han Yan had been using were shared ones at school.\n\n\"Ms. Qu, you are right. We will buy Han Yan the premium nutrient solution package next months and please assign a good physician to her as well,\" Han Sen said.\n\nFairly satisfied with Han Sen’s reply, she nodded and said, \"That’s more like it. Although it costs more, Yan is an outstanding girl, so it would be a waste if you don’t cultivate her well. Now what she uses is worse than all her classmates, but she still has good grades, which goes to prove her talent.\"\n\nQu Wange paused and said, \"If possible, think of a way to buy her an advanced hyper geno art. The one provided here is too basic, so the result might not be limited.\"\n\n\"OK, Ms. Qu, I will think of a way.\" Han Sen now started to believe that Qu Wange did think Han Yan was special.\n\nEncouraging Yan to practice advanced hyper geno art wouldn’t do the teacher any good, while she could probably earn a referral fee from recommending nutrient solutions and physicians.\n\nThe most expensive nutrient solution package cost a million per month; a senior physician plus professional equipment would cost a few hundred thousand per month.\n\nHan Sen had no money before, but now he could earn a lot. Of course he would want the best for his sister.\n\nQu Wange put away her things and rose to feet, \"Let’s go. Yan should be out of class soon. Let’s pick her up and I’ll give you a ride home.\"\n\nHan Sen said no need, but Qu Wange clearly saw him as a teenager.\n\nHan Yan was ecstatic to see Han Sen, but she remembered to greet her teacher politely before she ran into her brother’s arms.\n\nHolding Han Yan in his arms, Han Sen followed Qu Wange out of the school. At the school gate, he saw two familiar persons waving at them."
}