{
    "chapter": 2371,
    "title": "Taking the Treasure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2371",
    "text": "Lan Haixin turned around and looked at the old Siren woman. Clearly, she had never seen the relic before either.\n\nThe old Siren woman quickly said, “You don’t have to worry, My Prince. This is the relic of our race, the Siren Bottle. The holy bottle comes from a barren era. It was crafted from the materials harvested from ancient deified xenogeneic creatures. It cannot be faked. Plus, only the Siren’s holy virgin blood can activate it. Check it out and you will see that it is real.”\n\nAfter a brief pause, the old Siren woman went on to say, “This is the last item left behind by the holy virgin. Why would she lie to her son?”\n\n“Why would I doubt that this thing is the relic?” Han Sen asked in a hard voice.\n\n“If you’ve never seen the relic before, how would you know?” Lan Haixin asked.\n\n“It doesn’t look right. If you think that is the relic, then go ahead and take it. I will go elsewhere and look around,” Han Sen said, then he moved to exit the hall.\n\nThe old Siren woman stopped him. “My Prince, the holy virgin is like you. Her blood isn’t pure. Activating the relic will require the two of you to work together. One of you cannot be missing.”\n\n“Let’s just have a look around first.” Han Sen commanded his blood kirin to advance forward. The blood kirin roared and headed toward one of the hall’s side doors.\n\nThe old Siren woman was half-deified, but attempting to stop the blood kirin and Han Sen was more than she dared. So, she retreated.\n\nLan Haixin looked at Han Sen as he left the hall. She nibbled her lips and stepped closer to the altar. “I’m not sure I can activate the holy bottle.”\n\nThe old Siren woman stopped her and said, “Do not be reckless, My Lady. The holy bottle is our race’s treasure, but the power it wields is unknown. Without pure virgin blood, it will be difficult to activate it. You might even get injured. That is why the last holy virgin didn’t give the holy bottle straight to the prince. You cannot risk doing this alone.”\n\nLan Haixin wasn’t an idiot. She was reasonable. She sighed and said, “Fine. Let us go and look around, then.”\n\nThey left the hall. The Crystal Palace had many pavilions, and there were many rooms and statues. It looked like a real city made of crystal. It was so beautiful that simply walking through it was relaxing.\n\nHan Sen made sure to move very carefully, but he didn’t notice anything dangerous. There were no barred doors to be found across the entire Crystal Palace. He could enter any building he wanted, despite there being nothing valuable within them.\n\nThe Crystal Palace was like a city that had been emptied of its people. It looked very pretty, yes, but it also looked very dead.\n\nLan Haixin followed behind Han Sen. As they walked around the Crystal Palace, she felt far safer.\n\nInside the Crystal Palace, there were no dangerous restrictions. That proved that the last holy virgin only wanted Bai Yi to have the holy bottle. There was nothing else of note.\n\nBut all of a sudden, Han Sen noticed a problem. He pointed to one corner of the Crystal Palace, and he said, “What is this?”\n\nLan Haixin and the others followed Han Sen’s pointing finger and saw a crystal wall. Unlike the other crystal walls, however, this one had some green moss growing on it.\n\n“Weird. Why is there moss here?” Lan Haixin felt baffled as she walked towards the crystal wall.\n\nThat moss had taken over the entire wall. It reached a long way up above the ground, and when Han Sen looked closer, there were obvious signs that something had been climbing across it recently. There wasn’t just a single set of tracks, either. It looked like something had passed through frequently.\n\nLan Haixin and the old Siren woman’s faces changed. “How is that possible? Has another creature taken residence in the Crystal Palace?”\n\nHan Sen observed the tracks, and all the while, his Purple-Eye Butterfly kept spinning. He soon learned that he was very familiar with those tracks. They had been left behind by the Crystal God Conch and Move Mountain Sea Conch.\n\n“This confirms that those two were related to the Crystal Palace, but how did they leave this place?” Han Sen looked at the crystal wall some more, and he soon noticed something else.\n\nThere was a very small, sand-grain-sized hole in the wall. Perhaps there was an imperfection in the building materials, or maybe it was a mistake in construction. Either way, a small hole had been left on the surface.\n\nThe hole was narrower than a needle. An ordinary creature couldn’t fit through it, but the conches had been adept at shrinking their bodies. They would have had little difficulty coming and going as they pleased.\n\nMoss was growing on the wall because they had tracked it in when they came through the hole.\n\nFortunately, they had already been killed by Han Sen and the little red bird. The group walked around the Crystal Palace some more, but they found no signs of other creatures living there.\n\n“My Prince, the last holy virgin wouldn’t seek to hurt you. Let’s just go and claim the holy bottle before something bad happens,” the old Siren woman said hurriedly.\n\nHan Sen hesitated, then he thought of something. He didn’t believe the danger was gone, but he had an idea.\n\nHe nodded. “Okay. We can give it a try, then.”\n\nJudging from what he had seen, the conches probably stumbled into the Crystal Palace by accident. They hadn’t originated from the Crystal Palace.\n\nBut Bai Yi had cleared out all of the high-class xenogeneics. It didn’t make sense that a deified and a King class xenogeneic would still be hiding there.\n\nBut if he considered how the two creatures had reached their ranks, that might explain it.\n\nMaybe the conches weren’t originally deified and King class. For some reason, they became deified and King class during their time inside the Crystal Palace. But from the barren nature of the place, it seemed that the only thing inside Crystal Palace capable of having such an effect was the Siren Bottle.\n\n“If the conches leveled up because of the Siren Bottle…” Han Sen thought about it, and his heart started to race. The bottle had made a xenogeneic deified. Every deified elite would want something like this.\n\nBecause of that, Han Sen changed his mind. He wanted to see if he could use the Siren Bottle for himself.\n\nWith a chance of securing such a massive windfall, it was worth taking a large risk. Plus, the little red bird was present. That should mitigate whatever risk there might be.\n\nSeeing that Han Sen was finally willing to return to the holy bottle, the old Siren woman hastily guided him back. Soon after, everyone gathered back in the hall.\n\nThe Siren Bottle still sat silently atop the altar. The old Siren woman reminded them, “Holy Virgin, you and the prince should ascend to the platform and bleed a drop of your blood into the holy bottle. If it is activated, the bottle will select its master.”\n\nAfter that, she looked at Han Sen and said, “My Prince, the blood power from both of you will melt into the holy bottle. The chance of ownership will be fifty-fifty. Regardless of who obtains the bottle, I hope we can all cooperate.”\n\n“Of course.” Han Sen nodded, and then he walked towards the altar alongside Lan Haixin.\n\nThe two of them moved cautiously, but nothing happened on their way. Han Sen and Lan Haixin reached the platform safely. They looked at each other. Lan Haixin gritted her teeth, extended a finger, and let a drop of blood fall into the Siren Bottle.\n\nHan Sen looked into the bottle and saw the familiar, blurry rainbow color. He couldn’t see anything else. After Lan Haixin’s droplet of blood fell in, the liquid disappeared into the rainbow as if nothing had happened.\n\nHan Sen hesitated. He cast his Original Water King Body, then put a drop of water into the bottle.\n\nHan Sen’s water fell straight into the Siren Bottle, and then the Siren Bottle started to shake like mad. The blurry rainbow swirled like a whirlpool, and it looked as if it would erupt at any second."
}