{
    "chapter": 959,
    "title": "Thorned History",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_959",
    "text": "\"Are you done staring?\" Han Sen asked.\n\nThorn Baron looked at Han Sen and mumbled, \"You are The King?\"\n\nThorn Baron could not believe it, and she thought the entire concept was ridiculous. She saw The King appear to save her and then run for her spirit stone. When she looked up at The King again, it was just the human Han Sen.\n\nAside from Han Sen being The King, there could be no other explanation. Her eyes could not have deceived her.\n\n\"Does it matter?\" Han Sen smiled.\n\n\"Yes, of course it matters!\" Thorn looked at Han Sen angrily.\n\n\"Then the answer is yes.\" Han Sen knew that she had already realized this and only wanted confirmation.\n\n\"How can The King be a human? How can he be you?\" Thorn Baron's tone of voice was low with sorrow, and she looked utterly disheartened.\n\n\"The bottom line is that I am your master now. So, what are you going to do?\" Han Sen said.\n\n\"I...\" Thorn trailed off.\n\nIf this any other ordinary human, she'd have preferred to self-destruct.\n\nBut this was The King that she had secretly admired for the longest time, which left her with a number of conflicted emotions.\n\n\"There is no rush for you to say anything, but I do have a few questions I'd like to ask you.\" Han Sen brought out the holy bottle and continued, \"Tell me, how do I use this thing?\"\n\nHan Sen had been unable to figure out how to use the holy bottle, so it was fortunate she was there. Hopefully, she could explain it to him.\n\n\"Why would I tell you that?\" Thorn Baron said.\n\n\"You will tell me so you can avoid being forced to do things for me, like some thrall.\" Han Sen smiled.\n\n\"If I tell you, will you free me from your service?\" Thorn Baron asked.\n\n\"No. You know my secret, so for the time being, you are stuck with me. Telling me what I wish to know, though, will give you some modicum of freedom. I won't force you to do anything you don't wish to do.\" Han Sen maintained his smile.\n\n\"It can only be used by a spirit. It is a Spirit Gear,\" Thorn Baron reluctantly explained.\n\nShe still wanted to confirm whether or not Han Sen was The King.\n\n\"Then, how do I use it?\" Han Sen asked, as he thought to himself, \"If only spirits can actually make use of the thing, no wonder I am unable to use it. It is fortunate that, for a brief amount of time, I can be a super king spirit.\"\n\n\"Spirits need to fill the bottle with their own energy. The holy water inside can purify and sanctify the spirits that use it,\" Thorn Baron went on to say.\n\n\"Purify?\" Han Sen looked at her with confusion.\n\n\"It's like a buff. You should try it,\" Thorn Baron said.\n\n\"Don't lie to me.\" Han Sen turned into a super king spirit and placed his white light inside the bottle.\n\nThorn Baron saw Han Sen transform into her much fantasized-about King. She could not help but stare at the attractive face, that indeed looked like the most handsome male spirit one could ever expect to see. She had never before felt so conflicted.\n\n\"Are you a human or a spirit?\" Thorn Baron asked.\n\nHan Sen did not answer because his time had run out. Water had manifested inside the bottle under the influence of his white light, but upon his return to a human figure, that water vanished.\n\n\"It really is only available for the use of a spirit. Creating water is too slow for the current duration of my super king spirit form,\" Han Sen thought to himself.\n\nHan Sen put the bottle away, placing it in his pocket for now.\n\n\"You are Flaming King's wife.\" Han Sen was surprised to hear that a king spirit had married a royal spirit.\n\nThorn Baron was pretty, but spirits were attracted to power more than anything. It was hard to imagine that any king spirit would fancy her.\n\n\"No,\" Thorn Baron said.\n\nAlthough she knew The King was actually a human, she still did not want him to misunderstand.\n\n\"If you are not his wife, then why would he give you this bottle?\" Han Sen asked.\n\nThorn Baron nibbled her lips and said, \"I'm actually his daughter.\"\n\n\"What?\" Han Sen was now looking at her in disbelief. After all, how could a king spirit give birth to a royal-class daughter?\n\n\"My mother was a royal spirit, so I was unable to receive his power and title. Flaming King gave me this bottle, but that was all. He would never allow me to be by his side, and he never once let me come close,\" Thorn Baron coldly explained.\n\n\"That's a sad story.\" Han Sen could relate to what she was saying, somewhat.\n\nSpirits adored the strong. It made sense why a king spirit would not accept a royal-class daughter. Had he accepted her, other spirits would consider him a joke.\n\n\"If you stick with me, faithfully, maybe I can help you become a king spirit someday,\" Han Sen said, then returned her to the Sea of Soul.\n\nShe knew his secret, so Han Sen wasn't willing to let her frolic about as she pleased, like Moment Queen.\n\nHan Sen grabbed the thunder hammer he had stolen from Thunder-Devil King. He swung it to unleash huge serrated zig-zags of lightning.\n\n\"This must be a sacred-blood class piece of equipment, for sure. With silver fox's power, this thing would be incredibly powerful.\" Han Sen then suddenly felt his body move.\n\nHan Sen touched his pocket and noticed that the bottle he had placed inside had disappeared. The gourd that was also inside that pocket was vibrating."
}