{
    "chapter": 2948,
    "title": "Holy Palace Guardian",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2948",
    "text": "At almost the exact same time the announcement played, Han Sen heard an angry shout saying, “Stop it!”\n\nHan Sen suddenly saw a murderous beast, which looked completely red, roar in the sky, which was very dark and burning red. It was heading toward Han Sen and looked murderous. It spat some red light out at him. The red light was not a flame. It was like a laser. It suddenly doused Han Sen in red light.\n\n“Red Ghost, you are still alive…” Nine Thousand King screamed with shock. In the next second, he flashed in front of Han Sen. The eyes on his green armor opened. He released a green light that fought against the red light. He kept fighting Red Ghost’s red light while screaming, “Red Ghost, do not hurt Mister Han!”\n\nRed Ghost looked at Nine Thousand King and coldly asked, “Who is this? Is it you, the servant Thousand Eye? Did you, servant, not die but found a new master?” His tone of voice was riddled with disdain.\n\n“Shut up! The master asked me to protect Mister Han. Do not dare try anything.” Nine Thousand King spoke angrily, but people could tell he was afraid of Red Ghost. He did not dare attack it.\n\nRed Ghost laughed dimly. “Thousand Eye, don’t do anything here. How old is he? When the master was here, his great-grandad’s grandad was not even born yet. Did you say the leader asked you to protect him? Pah. You are talking way too much crap.”\n\nNine Thousand King wanted to explain, but Red Ghost kept madly shouting. Some metallic sounds were heard that rumbled like thunder. The red light turned into darkness. The Red Ghost angrily looked at Han Sen and said, “Stop talking crap. I do not care if you have found a new master, you old servant. Have your master hand over the holy spirit. Otherwise, you and your new master can die together.”\n\nAfter that, a red light emerged from its mouth. It tried coming for Han Sen, but Nine Thousand King stood before it.\n\n“Red Ghost, do you really think I am going to be afraid of you?” Nine Thousand King gnashed his teeth and did not stand down. His body flickered with a green light. The angry ghost shadow appeared. He used One Second Is a Thousand Years.\n\nWhen he used One Second Is a Thousand Years, Nine Thousand King barely managed to block the red light.\n\n“One second is a thousand years, and one thousand years is a second,” Red Ghost said. “Are you willing to use that many years of your lifespan for this moment? Let’s see how long you can last.” Its mouth was still full of red light as it kept attacking Nine Thousand King.\n\nNine Thousand King’s body’s green light had the buffs imparted by One Second Is a Thousand Years. Through it, he managed to stop the red light’s attack. His face kept getting older, and his hair kept getting whiter.\n\nNine Thousand King kept blocking the red light as he shouted, “You should leave, Mister Han!”\n\nHan Sen was surprised. He did not expect Nine Thousand King would go to such lengths to protect him. It did not look like he was just pretending either.\n\nHe wanted to say something, but he saw something coming over from out of the dark clouds. It was circling them. It evilly asked, “Go? Go where? If you do not leave the holy spirit behind, you will all be killed.”\n\n“Fish Bird? You are still alive!” Nine Thousand King’s face looked even more horrid.\n\n“It is not us those who are alive.” A very cold female voice sounded from the black. A very attractive woman came forward out of the darkness.\n\nOn the other end, an eyeless beast crawled out. The four scary-looking creatures blocked the bright lanterns around. They blocked Ancient Abyss Grandmaster and the others, who were on the verge of leaving.\n\n“No Eye… Demon Girl… You guys are still here…” Nine Thousand King was shocked. He looked at the four creatures.\n\n“Yes, we are here, and we are in charge of maintaining the holy palace. The holy palace is still here. How can we die?” The demon girl rolled her eyes. She looked at Han Sen and said, “You are a servant, yet you are also still alive. It looks like you have a new master too. That is surprising.”\n\nNine Thousand King kept blocking Red Ghost’s red light while shouting, “I have not betrayed the master! The master asked me to protect Mister Han.”\n\nOld Vulture coldly asked from the air, “How can you still be so stubborn? I will kill you, the servant, first. Then, I will deal with the kid that dared to steal our holy spirit.” It quickly spat out some black smoke.\n\nThe black smoke was not very strong, but it was weird. It was like a black, toxic snake heading straight for Nine Thousand King.\n\nNine Thousand King tried his hardest to block Red Ghost’s attacks. He did not have spare power to fend off the black smoke too. He looked scared, but he still did his best to block it.\n\nSuddenly, Nine Thousand King felt as if his shoulders had been pulled back by a certain power. He dodged the black smoke and left the red light’s attacks.\n\nHe turned his head. Nine Thousand King saw that Han Sen was in front of him. The red light and black smoke were headed for Han Sen.\n\n“Careful, Mister!” Nine Thousand King was shocked. He wanted to go up and help Han Sen block it, but he felt as if space around had some weird changes. The red light and black smoke started to strangely slow down. They could not get close to Han Sen.\n\n“Time Ghost’s Time Area!” Red Ghost and Fish Bird sighed with shock. They put away their powers and stopped attacking.\n\n“Time Area is not that good,” Fish Bird coldly grunted. It wanted to flap its wings and go straight for Han Sen.\n\n“Old Vulture, stop it,” Auntie Mei, the demon girl, said. She stopped Old Vulture from proceeding.\n\nOld Vulture rolled its weird eyes and asked Auntie Mei, “What is it?”\n\n“Get rid of these others who are disturbing us, and then we will get rid of him,” Auntie Mei coldly said.\n\n“Okay.” Old Vulture rolled its weird eyes. It flapped his wings and spat out black smoke. It was going toward Ancient Abyss Grandmaster and the other three Extreme King deifieds.\n\nThe big eyeless beast on the other side was moving its giant body. It rolled toward Sky Palace’s first seat.\n\nAncient Abyss Grandmaster’s body rose like a cloud, but he was unable to block Old Vulture’s black smoke. He kept falling back while shouting, “Stop it! I have something to say!”\n\nThe three Extreme King deified elite were not as strong as Ancient Abyss Grandmaster. The power inside their bodies was shattered by the black smoke. It was like they had lost their souls as they dropped to the floor.\n\n“If you have something to say, say it in hell after you have died,” Old Vulture spookily said. It flapped its wings and flew toward Ancient Abyss.\n\nThe big eyeless beast was like a rolling knife going toward Sky Palace’s first seat. He saw Sky Palace’s first seat clap his hands. The direction in which the big eyeless beast was rolling changed. It turned 180 degrees and rolled into the dark.\n\n“My Name is Sky Palace’s First Seat Elder. We are not here to offend anyone. Can you please hear us out?” Sky Palace’s first seat was very strong but did not dare say something reckless there. He was being polite.\n\nNo one cared about him. The eyeless big beast emerged from the dark again. It was headed for Sky Palace’s first seat."
}