{
    "chapter": 1023,
    "title": "Attacking a Shelter",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1023",
    "text": "Silver lightning burst out of the silver fox and collided with the golden light.\n\nBoom!\n\nThe golden light was fractured, and in a second, the atmosphere exploded around them in a blinding flash. A one-mile wide hole formed in the ground, and aside from Han Sen and Bao’er, everyone was blown away.\n\nThe streaks of the silver fox’s lightning filled the exhibit of destruction, suppressing all the golden bug sought to do. Try as it might to break that oppressive power, the golden bug could not; all it could do was flail around helplessly.\n\nThe silver fox’s fur gleamed. A silver aura formed around him, and it became brighter and brighter. It culminated in a wretched bullet of silver lightning. His target—the insect aggressor—shrieked wildly in agony.\n\nLin He was frozen as he watched the scene unfold. Even Han Sen was shocked. The silver fox hadn’t been in the Third God’s Sanctuary for very long, but he had already amassed a terrifying amount of power. He had managed to alter the minds and desires of the super creatures of Ghost Mountain, and promptly came to Han Sen’s aid on the verdant expanse.\n\nOf course, this wealth of power wasn’t entirely down to the silver fox’s own prowess. ( )\n\nThe silver fox had opened nine of his gene locks, but he had done so through the help of other super creatures. It was through their aid that he managed to open so many gene locks so quickly, and it was how he had obtained such fierce powers already.\n\nThe reason silver fox had received such treatment was his rarity. He had become widely respected throughout the creature kingdom, and that was down to his healing abilities.\n\nMany injured creatures had kindly received the silver fox’s healing. He was proficient with this talent, and grievous injuries were healed in no time at all. It was that which earned him this great respect amongst creatures.\n\nOf course, only having nine gene locks open meant he could not even beat the white snake if it came down to a fight between the two.\n\nHan Sen had nine gene locks open, as well, and when bringing fitness into the equation, the two were well-balanced. Just like Han Sen, the silver fox’s fitness had not been able to keep up with the number of open gene locks. So, even in the Third God’s Shelter, they’d make for a remarkable duo.\n\nBoom!\n\nThe golden bug let out a shrill scream. It hastily dug back underground and disappeared, leaving behind stains of gold blood.\n\nThe silver fox looked like a simple fox again. It trotted over to Han Sen and started rubbing his head against Han Sen’s legs again, just like he used to.\n\nHan Sen picked the silver fox back up in his arms and said to him, “Well done.”\n\nBao’er was sucking her dummy extra hard, upon seeing this. She was most certainly not happy.\n\nNo one dared remain in the area. Quickly, Han Sen and his party moved on. They eyed the silver fox with slight wariness because of the power they had seen him wield. He was quite a scary thing.\n\nThey looked at Han Sen with such strangeness, too. Han Sen was bringing it along with them, as if it was a pet. It was difficult to imagine what might happen to a man, should they incite the ire of the fox.\n\nHan Sen had raised the silver fox since its birth, though, and there was no possible chance it would attack him. The only downside to the silver fox’s presence was its tendency to keep creatures at bay. While this trait had its benefits, it made trying to hunt a touch more difficult.\n\nBut, after the golden bug was chased off with its injuries, it did not show up again, thankfully.\n\nAfter another two weeks of travel, the group stumbled across humans. There were three of them, and they seemed to be collecting grass.\n\nAt the sight of them, the group was made extremely happy. If there were humans there, it might mean that there was a human shelter nearby.\n\nWhen the three people saw Han Sen, they too looked happy. And without delay, both groups met up for a chat.\n\n“This is not a human shelter.” Chen Hu was disappointed.\n\nThe eldest man amongst the three was a fellow called Zhao Xin. He told them, “There aren’t many humans here, but we belong to a royal spirit shelter. It’s called the Sword-Furnace Shelter.”\n\nLin He said, “Are there any other human shelters around?”\n\nZhao Xin regretfully informed them, “No, this area is under the control of spirits. It would be best if you return wherever you came from, lest the spirit become aware of your presence.”\n\nLin He and Lin Weiwei looked at each other. They were saddened, upon hearing they had still not reached a location where they might safely settle down.\n\nHan Sen asked, “Do you know of a place called Thorn Forest?”\n\nHan Sen needed to know where he was, in order to let Moment Queen move the shelter.\n\nThey all shook their heads, much to Han Sen’s disappointment.\n\nImmediately, he asked a follow-up question. “Do you know if there is a king class shelter nearby?”\n\nEveryone’s eyes lit up, upon hearing this question. If there was no king class shelter, there was a chance they could claim the royal shelter for themselves. They most certainly had enough power, between Han Sen and his silver fox.\n\nZhao Xin shook his head and informed them, “I only know this is a royal shelter, and it’s fairly remote. I don’t believe there are any other shelters in the immediate vicinity.”\n\n“Brother Han, let’s do this,” Chen Hu and a few others said.\n\nIt had been too long since any of them had gone to the Alliance, and they all wanted the opportunity to see their family and friends again.\n\n“Uncle San and Weiwei, what do you think?” Han Sen asked.\n\n“Go ahead. If this doesn’t work out in the long run, we can retreat to the Alliance forever,” Lin He spoke with hefty gravity.\n\n“If we let this opportunity pass us by, who knows when our next chance at a place of sanctuary will be?” Lin Weiwei said.\n\nZhao Xin looked at the party in shock, and he asked, “What are you guys talking about?”\n\n“We are talking about becoming the new owners of Sword-Furnace Shelter,” Han Sen answered.\n\n“No! Even if you do take down this shelter, it ultimately belongs to Sword-Palace Shelter. If they send reinforcements here…” Zhao Xin quickly told them.\n\n“Then I’ll deal with them and take Sword-Palace Shelter for myself, as well.” Han Sen spoke calmly, with perfect confidence."
}