{
    "chapter": 1929,
    "title": "The Moon After the Dark Clouds",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1929",
    "text": "Black-Moon King’s eyes soon came to rest on Han Sen. He smiled and said, “Han Sen is here to represent Knife. You will have to come take a proper look, so you can sing its praises to her and have her regret passing on the opportunity to come to the unveiling.”\n\nAfter that, Black-Moon King passed the Narrow Moon Knife over to Han Sen.\n\nHan Sen was delighted, and so he quickly accepted the knife. He switched on his Dongxuan Aura to scan and observe it as soon as it touched his hands. The knife had been activated by Moon Wheel King, and its activity was still vibrant. It was gleaming with that Moon Wheel power, and the lunar power was still humming.\n\n“Good knife! That is a good knife.” Han Sen deliberately touched the body of the blade, feigning admiration for it.\n\nThe Kings there could feel Han Sen’s power shroud the blade, though. People believed Han Sen was using some power to examine the knife. Everyone watched Han Sen closely; the Dukes, in particular. They were waiting for him to finish, so they might get their own turn at examining the blade.\n\nPeople like Rebecca looked on Han Sen with jealousy. They had seen King class weapons before, like the ones possessed by their elders. But Narrow Moon Knife was an entirely different thing. It was a sacrifice, given in honor of the Rebate at large. Aside from the most important priests, no one would be able to see it after it was given as a sacrifice. Holding it would be even more unlikely.\n\nEveryone was looking at Han Sen. Han Sen was holding it very carefully, and he kept saying over and over, “Good knife! Such a good knife.”\n\nHan Sen kept saying those few phrases repeatedly. While he might have liked to say something more, he could not muster the words to speak.\n\nAnd at any other time, he would have spoken fairer praises about the blade. But right now, he was focused on the knife itself. The fanciness of his compliments took a backseat to his keen examination of the knife.\n\nMany people were watching him, though. It’d be pretty bad if he was just to stand there without speaking.\n\nSo, Han Sen kept standing where he was, looking at the knife. He continued to repeat how good the knife was. His repetition of the phrases was into the dozens.\n\nThe Kings believed he wasn’t an educated person, and so his lexicon was limited. He had been there for ten minutes, saying such basic things over and over, after all. It made them feel rather disheartened, all in all.\n\nThe other Kings had only spent a minute each, observing the blade before handing it back over to Black-Moon King. None of them had taken longer than a minute.\n\nHan Sen had spoken two sentences and stared at the blade for ten minutes by now. The Kings’ were not reacting well to the time that Han Sen was taking.\n\nFortunately, Rebecca and the others were educated in decorum. No one was willing to speak out during circumstances like that. Ordinary Nobles of elsewhere would be yelling at Han Sen by now.\n\nHan Sen did not care what the others were thinking right now, though. So, he kept saying, “Good knife! That is a good knife,” for another few minutes.\n\nThe Dukes did look as if they were ready to murder someone, but their grimaces went uncared for by Han Sen. He kept looking at the blade, repeating his compliments.\n\nHalf an hour went by. The faces of the Kings had become livid. Black-Moon King eventually said, “Han Sen, why don’t you take a break. Black Steel has something he wishes to speak with you about.”\n\nHan Sen knew he could not delay things any longer. So, he acquiesced and gave the knife back to Black-Moon King. He didn’t want to let go of it, though. Black-Moon King had to pull it out of Han Sen’s tight grip. Sitting on his chair, Han Sen looked depressed. He was reviewing all that he had learned from the knife.\n\nThe knife had Moon Wheel King’s power and Moon power in it. After using the Dongxuan Sutra, he had been able to learn a lot.\n\n“It is no wonder Black-Moon King allowed Moon Wheel King to be the one that opened the knife. Moon Wheel King’s power is like that of a gentle moon. He was most suitable for its use,” Han Sen thought.\n\nHan Sen had heard Moon Wheel King’s story. Moon Wheel King was one of the Rebate that was half-deified, and he had not hailed from Moon Garden.\n\nThe story went that Moon Wheel King was not talented in his younger years, and that he came from a commoner family. When he generated a geno armor, he wasn’t even able to evolve a second time. But then, he came into possession of a treasure that accelerated his second evolution, and also turned him into a xenogeneic.\n\nMoon Wheel King was a xenogeneic and not a Noble. That was a rare status amongst the Rebate.\n\nBecause Moon Wheel King did not have much talent, the first geno art he practiced with was Moonlight. It was one of the most common geno arts the Rebate could learn.\n\nBut Moon Wheel King used Moonlight with a fusion of his own power, and he had become a King over time. Now, he was a half-deified legend.\n\nTo the entire Rebate society, Moon Wheel King was a mythical figure. He was practically an idol for everyone.\n\nHe was different from someone like Yisha, who was born with talent. The Nobles admired Moon Wheel King more.\n\nThey wished for themselves to be like Moon Wheel King, and because of this, his reputation was favored over Yisha’s.\n\nMoonlight had not changed over time, and he had used that geno art to reach the status of being half-deified. Even Han Sen thought Moon Wheel King was nothing short of awesome.\n\nMoonlight should have stopped getting any better when he reached Earl class, but after Moon Wheel King modified it, he had managed to create a higher tier for it. The Rebate showed him great respect, and so in honor of his abilities and reputation, the Rebate granted the higher tiers of Moonlight the title of Moon Wheel. Moonlight was still kept as the name for the common version.\n\nBasically, Moon Wheel was the use of a moon’s power. Moon Wheel King’s gentleness made people always wonder how he did what he did.\n\nFortunately, Han Sen had Dongxuan Aura to see Moon Wheel and the knife’s Moon power. It greatly enthralled him.\n\nMost people, when pushed far enough, would concede. But Moon Wheel King’s mind, while it was gentle, it was not soft. It was pure, but it wasn’t dumb. He was like a cloud going by without leaving a trace. Very few could do what he could.\n\nEveryone wanted a smooth life like Yisha’s, but normal people would find themselves rolling around in the mud. But very few could emerge from the pit with a pure heart intact.\n\nMoon Wheel King had done this, though. His life’s journey had led him through many different environments. His life could have forced him to compromise. His heart, however, was like the moon itself. It would never change.\n\nSeeing Narrow Moon’s feelings and Moon Wheel power, Han Sen saw a clear moon emerge. It was the moon coming out from behind the clouds."
}