{
    "chapter": 2248,
    "title": "Benefit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2248",
    "text": "Han Sen looked at the blood kirin, and his eyes shone as if he was looking at a giant, delicious piece of cake.\n\nNow he finally understood how the child of a mere Viscount had reached King class after being born amidst the bones.\n\nThe creature had learned to absorb the power that resided within flesh and bones. God only knew how many dead bodies had been thrown into this hellish place over the years; the creature was surrounded by mountains of food. The bones could fuel the creature’s growth, especially since some of the bones possessed massive amounts of power. In such a unique environment, the creature had more potential as a newborn than most elites from the higher races.\n\nThere were so many resources there, and the creature didn’t have to compete with anyone to obtain them. Becoming deified was only a matter of time.\n\nHan Sen wasn’t focused on the creature’s body, though. The blood kirin was a rare being whose essence was defined by blood. It was the same sort of power that underlaid Han Sen’s Blood-Pulse Sutra.\n\nIf he absorbed the blood kirin’s xenogeneic gene or ate its flesh, the ascension of his Blood-Pulse Sutra would accelerate dramatically.\n\nHe quickly realized that consuming the blood kirin would benefit him little in the grand scheme of things. If he was able to subjugate the blood kirin, however, he could study its bone and blood powers and practice his Blood-Pulse Sutra in a similar manner. Absorbing the collected strength of the White Bone Hell himself would be far more beneficial than simply slaying and consuming a King class xenogeneic.\n\nBut King class xenogeneics were very difficult to tame, and the blood kirin was obviously quite special. Growing up in the White Bone Hell had made it savage and ruthless. It was far stronger than the average King class elite. Han Sen might not even be capable of beating it. Taming it was another matter entirely.\n\nPlus, it looked like a murderous fiend. Its eyes were cruel and brutal, and Han Sen wondered if any power could make it obey. Even if it knew it was about to be beaten, it would rather die in battle than submit to the rule of another.\n\nHan Sen watched the blood kirin quietly, his brows furrowed in thought. He waited as it finished absorbing flesh and blood, then returned to the lotus peak where the blood river originated.\n\n“Now you know that I’m not lying. The beast’s cruelty and murderous nature frighten me, even though it isn’t as strong as me yet. But if it ever becomes deified, it will leave White Bone Hell and slay everyone it encounters. That includes you and me,” Fox Queen said.\n\nHan Sen no longer doubted Fox Queen’s claims. The blood kirin looked far crueler than an ordinary xenogeneic. Even if it was intelligent, it still wanted to kill; that was just what the beast was.\n\n“I’m just a Duke. How am I supposed to beat it? And how are you supposed to help me?” Han Sen asked, turning back to Fox Queen.\n\nAlthough Han Sen had a couple of ideas about how he might take the creature down, he still hoped to gain something from Fox Queen for his trouble.\n\nIf Fox Queen had asked Han Sen to kill the blood kirin for her, she must have prepared some pretty impressive bribes. Otherwise, there was no way a rationally-minded Duke would ever contemplate going up against a King class xenogeneic.\n\nHan Sen never ignored the prospect of free goodies.\n\nInstead of answering, Fox Queen sauntered back over to the hellish skeletal gate. “Let’s go back to the caves for now. You are just a Duke, so you are not yet prepared to kill it. I have waited many years for an opportunity like this to arise. I don’t know if someone like you will ever pass by me again, so don’t worry. I’m not fond of the possibility of you dying. You might be my last chance.”\n\nHan Sen followed Fox Queen back to the palace. She walked to the mound of treasure, collected a few items, and then tossed them to Han Sen.\n\nHan Sen caught the pieces of clothing and examined them. She had tossed him a white silk robe, black leather boots, and transparent gloves.\n\n“Wear these. They are King class items. Although you won’t be able to access their full strength, they are bound to be of some use,” Fox Queen said lackadaisically.\n\nHan Sen wasn’t too concerned with modesty or politeness, so he just donned the robe as quickly as he could. He pulled the gloves onto his hands and laced up the boots on his feet.\n\nWhen he put on the robe, he felt a channel of power supporting his entire body. He wasn’t exerting himself, but even so, he felt as if he could take-off in flight.\n\nThe leather boots made him feel as light as a feather. Wind seemed to gather beneath his feet, and it felt as if a single step could send him ninety-thousand miles.\n\nThe transparent gloves were invisible once they were on his hands. It was like they had merged into his very skin, and his hands thrummed with a strange power. Han Sen couldn’t figure out what the power was or what it did, though.\n\nHan Sen had just received three King class items, so he was quite pleased with that. But he kept his face stern and cold. He looked right at Fox Queen and said, “Fox Queen, you think a few King class items can level the playing field between a Duke and a King class xenogeneic like that monster?”\n\nFox Queen smiled. She squeezed Han Sen’s cheek and said, “Don’t worry, my darling. I will not allow you to die.”\n\n“Follow me.” Fox Queen walked out of the lesser palace and headed into the bigger palace.\n\nFox Queen didn’t stop there, though. She kept walking as they passed the second palace.\n\nHan Sen followed without hesitation. It didn’t matter whether or not he could kill the blood kirin right now. He just wanted the spoils.\n\nJudging from Fox Queen’s wealth, all of her gear would be top tier.\n\nAs they walked, Han Sen was already envisioning the treasures that Fox Queen might be about to offer him, but when he entered the next side hall, there was no treasure inside. The place was empty except for the rows of skulls that lined the stone walls.\n\nUpon closer inspection, he realized that the skulls were actually masks. There must have been a hundred of them, and each of them was unique. Some of them were very frightening, and some of them were actually smiling. Some looked utterly evil, whereas others actually looked quite pleasant. Seeing the various expressions side by side was a chilling sight.\n\nFox Queen was eyeing those creepy masks, and her face looked dark and twisted. When she looked back at Han Sen, she looked all charming again. She gave him another one of her smiles. “These masks belong to Ghost Bone, and they were created by the man himself. Every mask here was crafted from the skull of a half-deified creature. After all their refinements, they looked like this.”\n\nAfter a brief pause, Fox Queen went on to say, “There were a thousand of these Ghost Bone masks, and Ghost Bone used them to practice Ghost Bone Techniques. As he practiced, the masks were destroyed. At this point, only one hundred of them are left. These Ghost Bone masks possess Ghost Bone’s power. If you can overwrite them, you can receive Ghost Bone powers when you wear the mask yourself. They will allow you to achieve the power of a half-deified being. With these, killing that xenogeneic shouldn’t be difficult.”"
}