{
    "chapter": 2733,
    "title": "Dead Cycle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2733",
    "text": "Luckily, although Han Sen wasn’t deified yet, his body was already as strong as a deified. If he was an ordinary half-deified, his body would have been completely crushed by the four disrupted powers.\n\nAlthough Han Sen hadn’t been completely destroyed yet, the situation wasn’t good. When the four powers fell out of rhythm, they began to impact each other with explosive force. No matter how strong Han Sen’s body was, it couldn’t withstand that type of collision for long.\n\nHan Sen was doing his best to cast his geno arts. He needed to get the messed up powers back into their rightful places, but he quickly realized it would be almost impossible.\n\nWhen he cast the Blood-Pulse Sutra, it made the Blood-Pulse Sutra’s power so strong. The other three powers would gather and counter it. The constant surge of powers made it difficult for Han Sen to get back on track.\n\nCasting the other three geno arts led to a similar result. Han Sen could only cast one geno art at a time, too. He had no way of casting all four at the same time.\n\nHis geno arts were in chaos as they sought to balance themselves out. Han Sen was left unsure of what to do. Try as he might, he couldn’t find a way to make them all work together.\n\n“I have to take a risk.” Han Sen could feel his body growing more damaged with every passing second. If he didn’t find a way to bring his powers under control and get them back on track, he would probably end up dying at the hands of his own abilities.\n\nHan Sen didn’t have time to second-guess his decision. He split his mind into four, and he cast the four geno arts at the same time. He wanted to control the four geno arts simultaneously and put them back on track, so he would be able to maintain the balance of the four powers.\n\nHe had only managed to cast all four geno arts at the same time once before. Han Sen hoped to replicate that moment and enable his four geno arts to run together. That was his only hope for putting them back on a normal track.\n\nHan Sen quickly discovered that casting four geno arts at the same time was a difficult thing to do.\n\nBefore Han Sen’s body was injured, casting the four geno arts wouldn’t have been as difficult. But now, his pulse had been badly damaged. Plus, the four powers were messed up. Pulling the geno arts back into rhythm would be harder than casting them had been before.\n\nThe instant that Han Sen cast his four geno arts, he felt the conflict inside his body grow even more severe. Now the powers were tearing even deeper into his body.\n\nThe pain was like having his heart and lungs ripped loose. Han Sen couldn’t suppress a scream. It felt like his pulse, his vessels, and his organs were being torn to pieces by some wretched power.\n\nHe knew he couldn’t stop, though. He had to put those four powers back on the right track. If he didn’t, it would be a miserable ending that awaited him.\n\nHan Sen held strong against that pain, and he continued trying to cast the four geno arts. He wanted them to go back to normal. But every time he cast them a little, his body became more and more injured. Blood was pouring out of his wrecked flesh.\n\n“Immortal Dragon.” Han Sen’s heart leaped. The black crystal came out of his Sea of Soul, looking like the Immortal Dragon. It began using its immortal substance chains to fix up Han Sen’s body.\n\nHan Sen’s body was being torn apart, but the Immortal Dragon was fixing it just as fast. Han Sen held strong against his pain and focused his mind on forcing the four geno arts back into order.\n\nThe entire process was excruciating. Anyone with a poor will would have failed. Han Sen struggled to hold strong against the pain that felt like his heart was being torn apart and the flesh was being scraped off his bones. He was slowly guiding the four geno art powers back onto the right track.\n\nFortunately, the Immortal Dragon had strong healing power. Otherwise, even if Han Sen had been able to hold on against that pain, his body would simply have been ripped to pieces.\n\nAfter one hour of torture, Han Sen finally put the four geno arts back onto the right track.\n\nBut that wasn’t the end of the matter. Once the four geno arts were put onto the right track, they kept running at an insane speed. They began to generate their prototype substance chains again, and Han Sen started leveling up to deified once more.\n\nHan Sen realized that he had fallen into an endless cycle. His body had fulfilled the requirements for becoming deified. In any normal situation, he would already have ascended.\n\nBut the powers of his four geno arts were all trying to become deified at the same time. When they leveled up, they each needed his body to support their development. Each power tried to take over his body completely. That was why there was conflict, and that was why he had failed to level up the first time.\n\nFixing his body would lead him to leveling up, but attempting to level up would always end in failure. If this kept going, Han Sen would die eventually. Even his powerful will couldn’t sustain him forever.\n\nHan Sen tried to cast only one geno art so that it could become deified, but he couldn’t do it. That was because his body had reached 100% deified progress. It was forcing all four of Han Sen’s geno arts to activate. His body wanted him to level up completely. It wasn’t possible for him to suppress all but one geno art.\n\nIt was like a baby growing. It was impossible for the baby to only grow one arm or one leg. A child couldn’t let one limb develop but forbid another part to grow.\n\nNow, Han Sen’s situation was like that. He was leveling up completely. He couldn’t choose a particular part of himself to ascend. If he leveled up, everything about him would become deified.\n\n“If I can’t suppress three of my geno arts, I will have to let all four become deified…” After Han Sen thought about his situation, he realized that he had to take the risk and try. He wasn’t going to back out now.\n\nBut on the final step, as the four geno arts tried to use his body to become deified, the powers conflicted. Han Sen failed again. The powers of the geno arts were thrown into disarray, and the forming substance chains collapsed. Han Sen experienced a pain that almost broke his body.\n\n“No. If this continues, I will not succeed.” Han Sen held firm against the pain that wanted to tear his body to pieces. Many ideas flew through his head as he considered how he could let the four geno arts run and become deified.\n\nBased on what he knew of evolution, there was no possibility of Han Sen becoming deified now. That was because the four geno arts couldn’t become one, and neither could they evolve individually while using only a portion of Han Sen. They had to take over Han Sen’s body completely. That was a contradiction that couldn’t be solved.\n\n“Wait a second… According to the theory, Spell itself has a lifeforce… She has a complete body structure and cycle… Maybe that will really work!” Han Sen’s brain flashed with an idea.\n\nHe used the power of the Immortal Dragon again. Gritting his teeth through that unbearable pain, he shoved the four messed up geno art powers back on the right track. The pain he experienced was worse than death. It was like being sliced to the bone a billion times. Han Sen didn’t know if he could endure it if he had to do it a second time.\n\n“It must work…” Han Sen felt his teeth chattering. He sent up a desperate prayer and then summoned Spell."
}