{
    "chapter": 2191,
    "title": "In Front of Cold Palace",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2191",
    "text": "Night River King quickly recognized that shadow. He frowned and said, “What is Han Sen doing here?”\n\nHan Sen had journeyed over the range of mountains to arrive near Cold Palace. He looked at the time and found that he still had five minutes to go. This was perfect.\n\n“Han Sen, what are you doing? You are not the Cold Palace guardian anymore. Don’t you know that this place is restricted?” Night River King shouted at Han Sen.\n\nHan Sen smiled and said, “Night River King, are you too old to remember things correctly? Don’t you remember that I was given permission to access any location on Planet Blade? You allowed this yourself.”\n\nNight River King looked glum at first, but then he laughed. He looked up at Han Sen with disdain and said, “This is why you wanted access to Planet Blade? That’s fine. If you would like to watch me absorb moonlight, then feel free to watch. But don’t blame me for not saving you when you freeze to death because you don’t have access to the tablet and its protection.”\n\nNight River King believed Han Sen must have had a death wish. He was only a Marquise, after all. Not even Night River King would remain there without the tablet’s protection.\n\nIf the deified toad was some distance away from him, Night River King could fight back against the cold power it created with his own power. But he would absorb less moonlight in the process. Without the tablet, the deified toad wouldn’t allow him close. And if he made the toad mad, he’d likely lose his life.\n\nHan Sen wouldn’t be there for long. Han Sen wouldn’t stay if the deified toad emerged.\n\nNight River King believed that Han Sen was about to run off, but then, Han Sen approached. He was in front of the stone house now, standing on the other side of the door.\n\nHan Sen saw Night River King smile at him, and so he said, “Night River King, you are so weird. You could be a King, but instead, you have come to guard this door.”\n\nNight River King’s chuckle was brittle. “Yeah, well, one of us doesn’t even have permission to guard the door.”\n\nNight River King raised his head. “Don’t say I haven’t warned you. There is less than a minute to go until the jade toad comes out. If you don’t run off now, it will be too late for you by the time it emerges. And I will be unable to save you.”\n\nThank you very much for reminding me, but I’ll go when I feel like it,” Han Sen responded flatly.\n\nNight River King hummed to himself and did not speak. He thought Han Sen was there to play some sort of prank on him. Without the guardian tablet, though, it was only a matter of time before the annoying Marquise gave up and left.\n\nTime ticked by, and the jade toad was on the verge of coming out. But even so, Han Sen gave no sign of wanting to leave the area.\n\n“Whatever happens next, you had it coming. If you die, you die. If you honestly think I will make an effort to save you, you are gravely mistaken. When Knife was still around, I wouldn’t have allowed you to die in my proximity, but now that she’s gone…” Night River King’s smile was full of teeth.\n\nBoom!\n\nThe door of the stone house opened, and a gust of frosty air came out. It washed out like a tide, freezing the whole area around the house. It turned the basin of water into an iced-over lake.\n\nA green toad started to emerge from the stone cave. The waterfall and the river quickly froze as well.\n\n“This is definitely a deified creature. Even the power surrounding it is so strong. The icy power it commands is shocking to witness,” Night River King thought in awe.\n\nHe turned to look at Han Sen. There was no way Han Sen could repel the frosty air, so Night River King figured that he’d swiftly turn to ice.\n\nBut when he looked, he found Han Sen standing casually in his original position. His body was like jade, and he looked normal. It didn’t seem as if he was freezing, at all.\n\nNight River King stared, and he thought to himself, “What is this? Although the frosty air is a passive effect that the toad gives off, not even a Duke should be able to block it at this proximity. If I did not have the guardian tablet with me, even I would have to be careful at this range. Why is Han Sen not freezing?”\n\nAs Night River King wondered this, the deified toad emerged. Its green eyes looked at Night River King. Even when it saw the tablet in his hands, the beast ignored him. It turned its head to look at Han Sen.\n\nNight River King laughed. “I don’t know what you have done to keep your body from freezing, but the guardian tablet is an agreement between the jade toad and my race. Without the tablet, the jade toad won’t stand for you being here. He will eat you. You were too cocky to come here, and you will now pay for this by dying.”\n\nThe jade toad looked at Han Sen on the other side of the door, but it didn’t do anything to him. It merely meandered onwards to the pool.\n\nNight River King wondered, “Has the jade toad not killed in so long that it is no longer interested in meat?”\n\nWhen the jade toad made it to the pool, twenty or thirty small jade toads came out of the water. They all looked about the same size as a football. They shimmered like jade, too. They were all so beautiful.\n\nWhen the small jade toads climbed out, they saw Han Sen standing near the door. Some of them ran towards Han Sen. Seeing this, Night River King was made very happy.\n\n“Good! Good! Good! Although these small jade toads haven’t reached their adult strength, if they attack Han Sen and he resists, he will be killed by the deified jade toad.” Night River King grinned at the prospect.\n\nBut the scene that followed made Night River King freeze.\n\nThe small jade toads weren’t coming to attack Han Sen. When they clambered around him, he crouched and started to pat their heads. Then, he picked up two.\n\n“What the hell?” Night River King couldn’t think straight, and he was starting to look as cold as the ice itself.\n\nThe jade toad was thought to be very cruel. Because the Rebate had a deal with it, people with the guardian tablet were allowed near it. No one would dare come to where it lived without the tablet, though.\n\nThe fact that the jade toad hadn’t eaten Han Sen had surprised Night River King. But seeing Han Sen happily playing with the deified creature’s young was bizarre. Night River King was starting to think that some sort of glamor had been placed on him.\n\nThe small jade toads weren’t following. The deified jade toad stopped and looked at Han Sen.\n\n“He dares to touch the small jade toads? The deified jade toad will surely be angry about this,” Night River King thought desperately.\n\nBut the deified jade toad only made a noise. It turned around and kept going up towards the frozen lake.\n\nHan Sen was still holding one little jade toad, and he followed the crowd across the lake and up the waterfall.\n\n“How… The deified toad is allowing an outsider to sit next to it?” Night River King froze. His expression turned very foul."
}