{
    "chapter": 1918,
    "title": "Drinking Spring Water",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1918",
    "text": "Drinking Spring Water\n\nBefore they could do anything, Han Sen had already flown over towards the ball of light and grabbed it before it could explode. The red thing looked like a glob of jelly in Han Sen’s hand. Without a single mote of hesitation, Han Sen shoved it into his mouth and swallowed it.\n\nRebecca and the other Earls were infuriated, but another red orb was coming.\n\n“That is the third drop of springwater, so there must be much to earn here!” Rebecca and the other Earls wished to grab the coming ball.\n\nBut the same thing happened again, with Han Sen moving too quickly. Before the ball of light could even explode, Han Sen had grabbed it and gobbled it down.\n\nThe red, jelly-like liquid surged with power inside Han Sen’s belly, and such overbearing strength felt as if it could tear Han Sen apart. So, Han Sen quickly used his Yin Yang Change. He turned that power into energy he could use, and then he let The Story of Genes absorb it.\n\nTransforming that energy was difficult. The springwater’s incredible power was swelling inside his veins, and it coursed throughout his entire body with a ceaseless cycle. Every time it did, a certain amount of it would be converted into energy that was suitable for Han Sen.\n\nAs this occurred, Han Sen’s blood vessels endured stress that was akin to being repeatedly cut by knives. It was very painful.\n\nHan Sen kept quiet as he suffered the pain of this exchange, though. He looked at the spring’s eye, and he hoped to see more springwater coming out.\n\nThe springwater had been surprisingly quick in the beginning, and it was now coming at the speed of light. No one could react when the water first appeared. But whenever the waterdrops finally began to slow down, Han Sen was still the first to react. Han Sen was far faster than the Earls, and they had no hope of competing against him.\n\nPang!\n\nAnother red flash came out of the spring’s eye. Another red orb of springwater shot skyward out.\n\nRebecca shouted, “You guys go and stop Han Sen! I will take the springwater, and then split it up. Otherwise, with Han Sen’s speed, he’ll keep us from getting anything!”\n\nThose that had been chosen to come to the spring were not stupid. The other elites were Earls, and it was why they had been selected by the Kings. After hearing Rebecca, the Earls immediately moved to prevent Han Sen from obtaining any more of the water.\n\nSuddenly, a great deal of scary power turned to target Han Sen. The Earls summoned their strength, and although they did not expect to kill Han Sen outright, they at least thought they could stall him for a time.\n\nIn the meantime, Rebecca sprinted after the red ball. If another Earl had volunteered to go after the red ball, the others might not be so trusting, but Rebecca was Moon Wheel King’s eldest daughter. She wouldn’t break her promise to share the springwater, as that would cost not only her own reputation but her father’s as well.\n\nSuddenly, dragons roared. Scary lights, smokes, and shadows were pursuing Han Sen.\n\nHan Sen’s movement changed again, as if he was dancing. His body accelerated and flickered right past the attacks of the Earls. As he passed Rebecca, he snagged the drop of springwater that had almost been within Rebecca’s grasp.\n\n“His speed is like that of a Duke!” Rebecca and the other Earls were flabbergasted, in addition to being furious.\n\nHe was just a Baron, and even so, he had those scary shoes that granted him such unbelievable speed. Against it, the Earls did not stand a chance. It made them incredibly angry.\n\nIt was worse to know that as soon as Han Sen grabbed a droplet of water, he would swallow it whole without leaving behind even a single scrap.\n\nEven more confusing was the fact that when Han Sen swallowed the springwater, his body should have been impacted by the overwhelming power. It should have been ravaging his insides and making him feel like he was dying. Yet Han Sen had swallowed so many without showing any reaction. He wasn’t exhibiting any emotion, so it was like he wasn’t enduring any pain.\n\nOrdinary people, after swallowing one droplet, could become Barons. A Baron that swallowed a dozen could become a Viscount.\n\nHan Sen had swallowed four or five of the red orbs. Each of those contained seven or eight drops. He must have consumed at least thirty of the drops by now, and yet, nothing seemed to have changed.\n\nThey had no clue what was going on inside Han Sen’s body, though. Secretly, it really did feel as if he was getting cut up. But Han Sen had endured a lot of pain over the years, and he could handle and hide it far better than most people could. That was how he could refine the springwater and still fight Rebecca.\n\nRebecca and the others could not detect this, but the Kings could.\n\n“Knife Queen has a brilliant eye. He can endure so much pain, and yet he remains so calm. He hasn’t made a single mistake. I don’t think I could have performed so well when I was in my youth,” Black-Moon King said in admiration.\n\nNight River King, on the other hand, looked awful. He said, “So? There have been four or five of the red mist orbs. He must have claimed around thirty drops without leveling up. With that talent, do you honestly believe he can become a King?”\n\n“Who knows? It is hard to tell.” Black-Moon King smiled.\n\nFlower King and Moon Wheel King were watching the happenings of the valley, too. Flower King frowned. “This red mist spring offers a lot. It might even erupt a few more times! Han Sen’s shoes are too weird. They give him the speed of a Duke. Rebecca and the others aren’t able to collect any of the springwater.”\n\nMoon Wheel King smiled and said, “Maybe not.”\n\nFlower King looked at Moon Wheel King with shock. Moon Wheel King didn’t elaborate, but Flower King could guess what he was hinting at.\n\nPang!\n\nAnother red orb came out of the springwater. Han Sen fired his power to get over towards it. Seven or eight Earls roared together and unleashed their powers, but they still couldn’t match Han Sen’s speed. He moved directly in front of the orb.\n\nRebecca wore a complex expression. She was holding a spell card that was in the shape of a turtle. Light glowed from the symbols on the card. It looked as if she didn’t want to use it, but she gritted her teeth and threw it at Han Sen.\n\nIt traveled through the air and landed on Han Sen. Han Sen couldn’t dodge, and the spell card attached itself to his body.\n\nWhen the turtle spell card landed on Han Sen, he felt his body become heavy. He began to slow down, and gravity dragged so heavily on his body that he almost fell from the sky.\n\nHan Sen’s blood was boiling. So, he reached out a hand and grabbed the red mist glob before he fell."
}