{
    "chapter": 1012,
    "title": "Real Wolf King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1012",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe wolves and wolf kings stopped their flight. They stood where they were, trembling in fear of something else.\n\n“What’s wrong with them now?” Chen Hu wondered, with a look of confusion.\n\n“Oh, no! Run!” When Lin He discovered the unseen menace, he did not delay a single second.\n\n“It’s too late.” Han Sen shook his head and peered into the darkness of the forest.\n\n“What is too late?” Chen Hu asked.\n\n“It’s the wolf king,” Lin Weiwei said.\n\n“What about them? Wasn’t Han Sen just killing them?” Chen Hu’s mouth had always been a little faster than his brain, and he was content to remain that way. He had never been fond of thinking.\n\n“No, I’m talking about the real king. Have you ever seen a pack with five kings before?” Lin Weiwei said.\n\n“No. A wolf pack should only have one king; the alpha.” Upon finishing his sentence, Chen Hu’s face remained still in thought. A few seconds later, it dropped.\n\nIf those wolves weren’t the actual kings, then the real one had to be above sacred-blood class. It might be a super creature.\n\nHaving now realized what was going on, Chen Hu’s face looked glum.\n\nA giant wolf emerged from the shadows of the charred trees. It was purple and without lightning; it looked like any ordinary wolf.\n\nThe other wolves parted to make a path for it to approach. It was obviously all for show, a way for the wolves to display how the one nearing them was the big cheese.\n\nHan Sen looked at the purple wolf and saw the subdued gleam of purple lightning flickering in its eyes.\n\nHan Sen felt a renewed pressure, watching this wolf come closer.\n\nEveryone sweated in anticipation. If they had to fight again, they didn’t think they’d have the morale to go on.\n\nThey wished to run, but their legs wouldn’t follow their commands. That being said, they believed it was for the best. Attempting to outrun what was most likely a super creature was folly.\n\nEveryone was petrified, and even Lin He was shivering with fear.\n\nThe wolf was as strong as the spirit that had destroyed their shelter, and it sent a number of flashbacks coursing through Lin He’s mind, those of the atrocities that had led them to where they were standing now.\n\n“Oh, no. The real king is this powerful?” Lin He sighed in his heart.\n\nThe wolf walked up to Han Sen and stopped right in front of him.\n\nThey both looked at each other, as if they were squaring-off right before a fight.\n\n“It’s definitely a super creature. And that means I’ll definitely have to become a super king spirit if I’m to stand a chance.” Han Sen didn’t want to use it because it’d render him weak, but there was little else he could do.\n\nThis forest composed only one area of Ghost Mountain, and no one could promise they’d not encounter another, further along their journey. As such, Han Sen really didn’t want to use it.\n\nBut he was accompanying Lin Weiwei, and Lin He had proven himself to be a good man. He’d feel awful if he left them behind.\n\n“Daddy. Kitty.” Bao’er was behind Han Sen, pointing at the wolf while speaking.\n\n“It’s not a kitty; it’s a wolf.” Han Sen’s smile was wry, but he did think it was amusing how she thought every furry creature was a cat.\n\n“But Bao’er wants kitty.” Bao’er never listened, and she was determined to own everything she deemed cute.\n\nThe wolf king’s hair stood on its end, and purple lightning flared up to coat its fur. It seemed upset, learning the baby believed it to be a cat.\n\nThe group of travelers knew they were weaker, but they still valiantly held up their weapons for the fight that was about to ensue.\n\nHan Sen looked at the wolf king’s changing temper and prepared himself to cast his super king spirit mode.\n\nThe purple lightning grew brighter across the wolf’s body, and it looked powerful enough to destroy an entire planet.\n\nThe wolf seemed as if it was going to attack, and the lightning bubbled and boiled like the magma residing in a soon-to-erupt volcano. It made everyone take a step back.\n\nHowl!\n\nJust as Han Sen was preparing to cast his super king spirit mode, something howled in the distance.\n\nIt was as if all the wolves stopped breathing. And to the humans, the long howl stood out from all others they had been hearing so far.\n\nIt was similar to the howl of a wolf, but it was slightly different.\n\n( )\n\nStrangely, when the howling came to an end, the wolf king looked less aggressive. Its blinding light subsided, and then it turned around and left.\n\nAll the wolves turned away from them and left. They disappeared into the darkness, vanishing as if nothing had happened."
}