{
    "chapter": 2374,
    "title": "Holy Bottle Liquid",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2374",
    "text": "“Elder… why?” Lan Haixin looked at the old Siren woman with utter disbelief. Her voice trembled.\n\n“Why?” The old Siren woman’s face was twisted. She gritted her teeth and said, “I want to know why, too. I want to know why I am so talented, and yet, not a single Siren was able to appreciate my accomplishments. Is it because I don’t have the blood of the holy virgin? Is that why that b*tch became the holy virgin instead? If a traitor like that was able to become the holy virgin, why couldn’t I?”\n\n“I waited many years for that b*tch to die, but they let you—a girl who didn’t even have pure blood—become the holy virgin instead. I want to know why they never considered giving me the chance. I’m so smart. No one amongst the Siren could do the things that I’ve done. But just because I don’t have a drop of the holy virgin’s blood, I have to be considered a mere commoner? In this world, there’s no point in asking ‘why.’ Things only belong to you if you fight for them.” The old Siren woman gave a twisted laugh.\n\n“Now, I finally have this chance. If the Sirens aren’t willing to accept me, then I will destroy this entire race. I will offer my blood to the Siren Bottle and conjure a new race, one which will worship me as their alpha.”\n\n“Because of that, you are willing to kill off the last of our kind?” Lan Haixin looked very sad.\n\n“They are nothing. As long as I have the Siren Bottle, I can be deified. I can create a race of my own.” The old Siren woman sounded a little crazy.\n\n“You don’t have the holy virgin blood. You cannot control the Siren Bottle. All you have done is for nothing.” Lan Haixin looked unspeakably sad.\n\nThe old Siren woman laughed. “You will just have to thank that b*tch, then. She wanted her hybrid son to claim the holy bottle. She built this Crystal Palace and the blood altar here and made a deal with you. She did all of this for his benefit. She only used you for your blood. With this altar, the Siren blood, and the refinement of the holy bottle, I can control it. Even without the holy virgin’s blood.”\n\n“I suffered much humiliation when I was young, but I sided with that b*tch. I did everything I could to earn her trust. I almost died multiple times during my service to her. Even my son died for her. I sacrificed so much to gain her faith. Now, I’m the only one who can wield this technique. That b*tch would’ve never imagined I was scheming to betray her. She never knew I was the one that killed her. She couldn’t even tell her secret to her hybrid son. Now, everything belongs to me. I will be the next race’s alpha.” After saying this, the old Siren woman laughed like mad. She seemed utterly self-assured.\n\n“You seem to have forgotten I’m still here.” Han Sen looked at that old Siren woman with pride.\n\nThe old Siren woman’s smile vanished as she looked at Han Sen. “You aren’t bad. You must be as devious as that b*tch to have hidden things for so long. Your own plan was decent, but you are still too young, and you ended up killing all the Siren. What a shame. Now, the blood altar’s process has begun, and the holy bottle is in the midst of being refined. Although it cannot be fully used yet, I only need to borrow a little of its power to kill both you and the blood kirin.”\n\n“I don’t believe that you are completely without holy virgin blood. How can you use the holly bottle’s power without it?” Han Sen asked.\n\nHan Sen had guessed the old Siren woman’s plan a while ago, but he hadn’t killed her yet because he wanted the Siren Bottle, as well.\n\nHe had the same problem as the old Siren woman. He had the Original Water King Body, but he didn’t have the holy virgin blood. The holy bottle wouldn’t accept him as its master.\n\nAnd this wasn’t just because Han Sen had replaced Bai Yi, either. Even Bai Yi’s mother didn’t believe the young prince would be able to make use of the bottle. So, she set up the blood altar. She needed a blood sacrifice so that Bai Yi could control the Siren Bottle, but that should still be impossible for Han Sen.\n\nHan Sen wanted to know the old Siren woman’s plan. She must have some method for controlling the Siren Bottle. So, he didn’t yet strike her down.\n\n“It is okay. Soon, you will believe. I’m going to use both of you hybrids as a sacrifice. Then, I will be able to control the Siren Bottle and create a race of my own. I will be the alpha and leader of it!” the old Siren woman said. She walked towards the altar and picked up the Siren Bottle. Obsession was etched deep into the lines of her face.\n\nLan Haixin used her area power in a bid to stop the old woman, but as soon as Lan Haixin moved onto the altar, the altar’s rainbow light bounced her back. She was unable to access that zone.\n\nThe old Siren woman lifted the bottle and laughed. “That cheap b*tch wasn’t at my level, but she was still better than the two of you. You two hybrids will die today.”\n\nHan Sen looked at the old Siren woman with interest and said, “You’re going to kill me? Aren’t you afraid that the Extreme King will hunt you down?”\n\nThe old Siren woman grinned and looked at him with disdain. “I watched Bai Yi grow up. Aside from that b*tch, no one else understood him more than I. You are not Bai Yi. I don’t know how you did what you did… Perhaps it was a similar skill to Consume? But regardless, your ability to open the Crystal Palace door proves that you refined the hybrid Bai Yi’s blood. I get your blood and give you to King Bai. He will appreciate that, I think. I can get the Siren Bottle and receive King Bai’s reward. I must say, God seems to be on my side… Haha!”\n\nLan Haixin looked at Han Sen with proper shock. She had never realized the Bai Yi in front of her was a fake.\n\nBut she never thought someone would be brave enough to disguise themselves as a prince of the Extreme King, either.\n\nInstead of denying the accusation, Han Sen admitted it. He stood silently and watched the old Siren woman. Her hands were glowing. Power was coming out of her hands and flowing into the Siren Bottle.\n\nThe Siren Bottle’s wings were like the faces of Siren women. They looked alive. Their eyes shone with light, and blue waves rippled across them. They made sad sniffling noises like an instrument was playing.\n\nNot long after, a waterdrop arose inside the bottle.\n\nThe old Siren woman happily grabbed the drop and put it into her mouth. Her body began to glow and change.\n\nRainbow-color light rinsed over her, and the old Siren woman’s tree bark-like face changed. Her age and wrinkles disappeared, and she became an eighteen-year-old girl with skin that was smooth and white.\n\nHer fish scales looked transparent and crystal, and they glowed with rainbow light. Her entire body had been completely renewed, and her presence changed along with it."
}