{
    "chapter": 2385,
    "title": "Proud Bone Sword Air",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2385",
    "text": "A swordmind was oozing from Han Sen’s body, but that wasn’t strange. Everyone on top of the mountain was studying the Proud Bone Swordmind, so all the royal children were leaking the power of their swordminds to some degree.\n\nBut Han Sen’s swordmind was different. He wasn’t learning a swordmind; instead, he had copied the Proud Bone Swordmind directly and unleashed it on himself.\n\nThat swordmind swept out of him, brushing across everything on the top of the mountain. It settled over the other royal children like a blanket, suppressing their swordminds. Even the swordminds of the deified Prince Four and Princess Two began to buckle under the incredible pressure exerted by Han Sen’s swordmind.\n\nOut of all the swordminds currently active on the top of Rot Bone Mountain, only Han Sen’s was connected with the five words, “Pride and bones are made.” Han Sen’s mind and the power of the words clashed against each other like two ancient swords engaged in a battle, and the other swordminds on the mountaintop faded into the background by comparison.\n\n“How…” The faces of the royal children grew pale. Even Prince Four and Princess Two seemed stunned by what they were witnessing. They turned to look behind them at Han Sen in utter disbelief.\n\nBai Ling Shuang opened her eyes wide as if she had just seen a ghost.\n\nBai Wei nibbled her lips and did not say a word. Emotions flickered rapidly across her features.\n\nThe swordmind coming out of Han Sen’s body could go up against the powerful words engraved in the knoll. Not even deified elites could pull off a feat like this.\n\nBecause Han Sen’s swordmind had exploded with power, the swordmind of the five words rose pridefully against it. It whirled with power like a hurricane, storming through everything there was.\n\nHan Sen’s swordmind had been copied from the words, “Pride and bones are made.” Because the two powers were the same, they activated fully in one another’s presence, like two magnets of the same polarity pushing against one another.\n\nIt was like Han Sen was fighting his own mirror image. Luckily, in this case, the fight was mostly contained within the swordminds that were present. It wasn’t really destructive, but even so, the group of royal children was involved. Their swordminds were severely suppressed by those two raging swordminds. The weaker ones had to shield their swordminds to keep them from being wholly destroyed.\n\nBlood began to trickle from the mouths and noses of the weaker royal children. Eventually, they had no choice but to abandon the mountain. They didn’t want to get involved with that scary swordmind battle.\n\nThe swordmind wouldn’t really harm their bodies, but it could destroy their wills. If their wills were broken, then it would cause a great deal of harm to their future practices.\n\nTwo swordminds dominated the whole peak of Rot Bone Mountain. Han Sen was in the thick of the chaos, and he had earned some rewards.\n\nNo matter how incompatible this swordmind was with his own, his body was making use of the Proud Bone Swordmind. As he continued to fight the Proud Bone Swordmind, he learned.\n\n“I wonder if the water fairy can copy a living creature’s mind. If she can, I can learn any geno art I want. All I need to do is learn the basic skill and find an elite that has mastered the geno art. Then I can ask the water fairy to copy their minds, then send their teachings into my body so I can practice. If that works, it should be exactly what I’ve wanted. No… it should be a dozen times more than what I’ve wanted!” Happiness spread through Han Sen as he considered the prospect.\n\nBut as Han Sen was thinking about the possibilities for the future, he suddenly heard a katcha noise. Perhaps the fight between swordminds had grown too intense, because the small knoll had suddenly cracked.\n\nThe crack slowly spread down the sides of the knoll, and it looked as if the little knoll had been struck by lightning. The crack grew until the whole structure was split in half. It cut through the five words, “Pride and bones are made.”\n\nThe knoll split open, and both the five words and the swordmind they provided vanished. After all, the swordmind had been there since the words were first carved into the knoll. When the words disappeared, so too would the swordmind.\n\nBoom!\n\nWhen the knoll cracked open, a sword light emerged. It broke through the distorted dimensions of Rot Bone Mountain and ascended into the sky like a blade splitting through paper.\n\n“A Proud Bone sword air!” The royal children atop the peak stared into the sky, their jaws hanging slack.\n\nAll of the Extreme King were looking at Rot Bone Mountain. They were waiting for the royal children to descend the mountain again, but before the royal children could return, a sword light shot up from the peak and headed into the sky. They were stunned by the sight, and they weren’t too sure what was happening.\n\n“The Proud Bone sword air!” King Bai’s face changed. He waved his hand, and an overwhelming power poured out of him and shaped itself into an unimaginably large hand. It was almost big enough to shield the entire system, and it swooped toward that sword light.\n\nBecause the sword light had broken through Rot Bone Mountain’s distorted dimension, those inside could now see out and vice versa. Han Sen saw a big hand coming down toward them. The planets were no more than specks of dust when compared to that hand. It was like that hand could grab and crush the stars themselves.\n\nThe sword light was still rising, heading for that enormous hand. It didn’t deviate from its course, and it showed no sign of backing down.\n\nWhen the sword light struck the hand, and the hand curled its fingers around the attack, grasping it firmly. The hand’s power was terrifying, awe-inspiring to behold. The sword light tried to force its way forward, but it could no longer move.\n\nPang!\n\nThe big hand tightened, and the sword light exploded in a shower of fireworks. The shattered light became a meteor shower that swept across the skies of King’s Kingdom.\n\nIt rained across all the planets of King’s Kingdom. The rain wasn’t water, though. Each drop was made of glowing sword light.\n\nHan Sen watched the sword light rain come down, and he noticed that it was everywhere. When those sword lights hit the ground, they weren’t destructive. The sword lights shattered whenever anything touched them. It was such a dreamy spectacle.\n\nThe sword lights broke apart when they touched peoples’ bodies, too. Han Sen reached out a hand to try to grab a sword light, but it shattered like dust when he touched it, leaving nothing behind.\n\nKing Bai lowered his hand, retrieved his power, and frowned. He looked at the sword light rain, his emotions hidden beneath a calm mask.\n\nThe sword light rain continued across King’s Kingdom for a whole seven days. Han Sen and the others, after they returned to the bottom of the mountain, were asked what happened.\n\nThe royal princes and princesses explained what had happened, and Han Sen did, too. But he said he only understood some of the Proud Bone Swordmind. He didn’t want to explain that he had gotten into a fight with the five words on the knoll. He said that the knoll suddenly exploded, and that was it. He didn’t mention anything about the jade gourd or the water fairy, either.\n\nDespite what had happened, some people didn’t believe Han Sen could practice a swordmind to the level they had witnessed.\n\nWhen asked, Han Sen activated the Proud Bone Swordmind. Even King Bai was shocked to see it.\n\nHan Sen didn’t understand what the sword light was, but King Bai didn’t explain it to him. He just told Han Sen that he could return home.\n\nBai Yi was now very famous. He had managed to learn the Proud Bone Swordmind to such an extreme level in a very short amount of time. Everyone in King’s Kingdom knew the name Bai Yi, and they knew that he was a genius.\n\nBut Han Sen was annoyed by the fact that he had only borrowed the power of the jade gourd. He could only use a swordmind like that when the water fairy possessed him. If the water fairy wasn’t there, his swordmind would return to its ordinary level.\n\nStill, it wasn’t that bad. Drowning in that powerful swordmind could further Han Sen’s personal development.\n\nThe sword light rain continued, so the exams were paused for a bit. Because of this, Han Sen took the opportunity to gather Bao’er and the others so that they could all return to Planet Water Zone."
}