{
    "chapter": 2752,
    "title": "No Dragon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2752",
    "text": "His super god spirit body made him invincible. That was its defining feature, and it could rid him of any negative energies that were impacting his body. But if he was being affected by energy that was coming from within him instead of invading from outside his body, then his super god spirit body wouldn’t make any changes to it.\n\n“Does this mean the freckles indicate that my body is changing on its own?” Han Sen considered the possibility, but it didn’t seem to hold water. “Unless I was affected by an outside force, I shouldn’t be growing freckles in the first place. Why will my super god spirit not purge the freckles like it does everything else?”\n\nIf growing freckles wasn’t harmful to him, then his super god spirit body wasn’t going to do anything. Even though Han Sen suspected the freckles might be the harbinger of something beneficial, he didn’t fancy the prospect of turning into a freckle-covered monster.\n\nHan Sen thought of many ways to get rid of the freckles, but none of his attempts were successful, and the freckles were spreading more and more. Some of the freckles were already clumping together to take the shape of snake scales.\n\nHan Sen thought that the growing scales might be an effect of the blood coral, so he lobbed it back into the sea.\n\nBut a short time later, Han Sen noticed that the blood coral had somehow returned to him. It was like a small, black dragon quietly waiting for him.\n\n“This is terrible.” Han Sen tried throwing the coral away a few more times, but nothing seemed to work. His scales continued to grow. It made him want to cry.\n\nFor now, the scales weren’t having any negative influence on him. They actually increased the defenses of his body.\n\nThe scales also boosted his elemental resistances dramatically. When an attack landed on his scales, they would take away 80% of the damage incurred. If the scales expanded to cover his entire body, Han Sen’s physical defense would be very scary.\n\nEven so, Han Sen didn’t want to become some freak who was covered in scales.\n\nYou couldn’t hide a fire with paper. When Exquisite returned, she saw that Han Sen’s body was covered in scales. It confused her quite a bit.\n\nHan Sen made no effort to hide anything from her. He told her everything, even the stuff concerning the blood coral and the dead dragon’s body. He didn’t want to turn into a monster, even if the process made him stronger. He couldn’t get rid of the scales himself, so he had no choice but to ask for help.\n\nThere were many elites among the Very High, and they all had a lot of knowledge. They had studied geno arts from all across the universe. Perhaps one of them would know some technique that could get rid of the scales.\n\nExquisite was more and more shocked as Han Sen told his story. Her eyes opened wide. She stared at the blood coral Han Sen was holding—the one that looked like a dragon.\n\n“That true god evil dragon, what sort of power did it have? Why would it make my body grow scales? Is there a way to remove them?” Han Sen asked, his words almost tripping over each other in his haste. He really despised the freckle-like scales. He imagined that when he returned home, his daughter Little Ling might not even recognize her father.\n\nExquisite was frozen in place. She didn’t immediately answer Han Sen’s question, but her face was warped in thought.\n\n“What is going on? Can you please say something?” Han Sen begged, sensing that something very grave had happened.\n\nExquisite moved her lips silently for a moment, and then she said the last thing that Han Sen had expected.\n\n“The Buried Dragon Sea doesn’t contain a true god evil dragon. That is just a legend…” Exquisite looked at Han Sen weirdly.\n\n“It doesn’t?” Han Sen asked, dumbfounded. Then he said, “How can that be? What about the blood coral forest and the dragon corpse I found, then?”\n\n“I don’t know where the blood coral forest or the dragon carcass came from, but I can tell you for sure that the Buried Dragon Sea doesn’t contain an evil dragon. Or at least, there isn’t a true god class xenogeneic. It is called the Buried Dragon Sea because a deified elite called Dragon died there. That is where it got its name. People started telling stories about the place, and eventually, the myth of an evil dragon dying there was created,” Exquisite said.\n\n“Even if the legend was fake, that doesn’t mean that the Buried Dragon Sea doesn’t contain the body of a true god evil dragon.” Han Sen wasn’t eager to give up on his find.\n\n“It won’t be what you think it is,” Exquisite answered staunchly. She could feel Han Sen’s questions, and she went on to say, “A long time ago, the Buried Dragon Sea didn’t exist. There was an elite called Dragon that went there to fight. The battle devastated the landscape, creating the crater that you now know as the Buried Dragon Sea. There were no high-class xenogeneics there. And because of the intense battle that happened there, even the resources of the local area were destroyed. No high-level xenogeneics go there of their own volition. The Space Electric Eel you killed was something that one of our elders threw into the sea to grow. Most of the xenogeneics in the sea are brought there by similar methods. Our elders take xenogeneics there periodically because they’re trying to repopulate the Buried Dragon Sea. If a true god being had once fallen in the Buried Dragon Sea, the Very High wouldn’t have to go to such trouble.”\n\nAfter Han Sen heard what she had to say, he conceded. She was probably right; if what she said was true, it was doubtful that the sea held a true god xenogeneic corpse.\n\n“If it is impossible to find such a body there, then what kind of body did I stumble across? And what was that blood coral forest?” Han Sen wondered in confusion.\n\nExquisite could sense Han Sen’s questions. “I’m not sure. According to what I know of the Buried Dragon Sea, there shouldn’t be any such powerful creatures there…”\n\nHan Sen thought for a minute, and then he asked, “Why did the elite called Dragon die in the Buried Dragon Sea? Who was he? Are the blood coral forest and the corpse somehow related to him?”\n\nExquisite had a wry smile as she shook her head and answered, “I don’t know too much about the story. After all, it was a long time ago. All I know is that an elite named Dragon died there, and he hailed from Sacred.”\n\n“The Sacred of yore?” Han Sen was shocked, and he made sure to rein in his thoughts. Otherwise, Exquisite might pick up on the fact that he had something to do with Sacred.\n\n“How about this? I will take you to my Ninth Uncle. He was the person in charge of putting xenogeneics inside the Buried Dragon Sea. Perhaps he will know a thing or two about this conundrum. He might not be able to answer your questions, but if there is anyone who can do something to fix your body, it will be Uncle Nine,” Exquisite said after a moment of thought.\n\nHan Sen wasn’t going to object to such a suggestion. He and Exquisite hurried out to visit the Ninth Uncle of the Very High.\n\nAlthough Han Sen really wanted to learn more about the person called Dragon, he didn’t dare ask. He was afraid he might not be able to control his mind when it came to thinking about Sacred. If that happened, she might learn that his son was with Sacred right at that moment.\n\nExquisite brought Han Sen to her Ninth Uncle. The man quite liked Han Sen, so he was happy about his visit. Uncle Nine seemed like a pleasant man, but when he heard Han Sen’s story, his face went totally grim."
}