{
    "chapter": 2597,
    "title": "Lone Bamboo’s Persistence",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2597",
    "text": "Han Sen didn’t have many ideas on how to resolve the matter. If two armies were fighting and Lone Bamboo was in danger, he would gladly join the fight. But right now, Lone Bamboo was incarcerated by the powers presiding over Sky Palace. Furthermore, they weren’t at war with the Very High. Therefore, Han Sen had no way of helping.\n\n“This is a hard situation to deal with. The Very High didn’t want Lone Bamboo to join them permanently. It was supposed to be a temporary thing. Plus, they would have given Lone Bamboo a lot of resources. Others would beg for the benefits he would have been given for free. I don’t know why Lone Bamboo would so firmly decide against going,” Thousand Feather Crane said with a sigh.\n\nHan Sen thought that he understood what Lone Bamboo was thinking, but he hadn’t spoken to the man in person yet. Therefore, he didn’t know if his guesses were accurate.\n\nThe next day, Han Sen went to ask the Tenth Elder, Yun Changkong, about being allowed to see Lone Bamboo.\n\nYun Changkong was Yun Suyi and Yun Sushang’s father, and he was Thousand Feather Crane’s teacher. He had a good relationship with Han Sen, and he didn’t deny his request.\n\n“Maybe you can convince Lone Bamboo that joining the Very High isn’t so bad,” Yun Changkong said to Han Sen.\n\nHan Sen agreed. Then, Yun Changkong asked people to take Han Sen to the prison.\n\nHan Sen thought Sky Palace was just putting on a show. But when he went to the prison, he learned things weren’t as simple as he initially believed.\n\nTwelve Suppress Demon Locks were pierced through Lone Bamboo’s body. They pinned him to a Suppress Demon Stone. He was covered in blood. Even his collar bones had been punctured. Han Sen was shocked.\n\n“You are here.” Lone Bamboo’s limbs were locked painfully against the Suppress Demon Stone, and while he was in bad shape, he was still able to smile.\n\nIt would have been impossible for anyone to look good under the circumstances, though. Those Twelve Suppress Demon Locks had twelve different powers. There was water, fire, thunder, lightning, and eight other powers that attacked his body continually. Even deified elites might not last very long under these conditions.\n\nIt wasn’t like it would kill him, but being tortured like this—day and night—was a fate that was worse than death. “Is treating you this poorly really necessary?” Han Sen demanded, growing a little angry as he looked at Lone Bamboo.\n\nLone Bamboo was a student of the leader of the Sky Palace. He had the blood of Sky Palace’s people, and yet, he was treated in this manner. There wasn’t an ounce of sympathy being shown for him, and so the sight would give anyone a nasty chill.\n\n“Don’t be mad at them. This is all my own doing.” Lone Bamboo chuckled bitterly.\n\nHan Sen brought out a bottle he had smuggled in. He gave Lone Bamboo a few sips of the beverage. After swallowing some himself, he asked, “Why do you refuse to join the Very High?”\n\nLone Bamboo licked the wine on his lips and said, “Joining the Very High would be very good for me. If I don’t go, it might take me a decade or two to become deified. If I go to the Very High, I could become deified in only three years.”\n\n“If you understand that, then why don’t you go?” Han Sen asked, looking at Lone Bamboo. He knew that the man must have his reasons.\n\nLone Bamboo looked at Han Sen and didn’t answer his question. He asked, “You like running naked?” “I, um… I guess I don’t…” Han Sen didn’t know what Lone Bamboo meant, and so his answer was uncertain.\n\nLone Bamboo smiled and said, “I don’t like it, either. So, no matter how many benefits the Very High offer me or how much punishment I must endure, I’m not going to the Very High.”\n\n“What do you mean? Are you saying the Very High like to run naked? You must take off all your clothes while you’re there?” Han Sen imagined Exquisite and Li Keer frolicking naked. It was an image that made him smile.\n\nOf course, Han Sen was just joking. He knew the Very High wouldn’t be that creepy.\n\n“The Very High’s Very High Sense can sense anything in the world. If you are chosen by them, you become a medium for them to feel the world. They can feel everything you do. If you eat, they can taste the saltiness, sweetness, sourness, or spiciness of your food. When you shower, they will know if it is hot or cold. Your emotions, your hobbies, or even your feelings when you sleep with a woman; the Very High will get to experience everything. If you were in my position, would you go?” Lone Bamboo asked, looking at Han Sen.\n\n“Um… are the Very High that sick?” Han Sen’s eyes were wide.\n\n“This is merely my perspective. Of course, they might not be interested in which woman you sleep with, but regardless, you have no way of shutting off their power to feel whatever you do. Once you are plugged into their ability, there is no cancellation. They will always have their hooks in you, and I doubt they would ever willingly sever such a connection,” Lone Bamboo said.\n\n“Are you sure that’s how this works?” Han Sen asked seriously.\n\nLone Bamboo smiled and said, “If there is a race in this universe that can understand the Very High the most, it would be us—the Sky. Although there is no real evidence, many generations of the Sky have worked for the Very High. This is a ninety percent accurate hypothesis.”\n\n“If things are like that, then I wouldn’t go no matter what,” Han Sen said with a nod.\n\nHan Sen held the bottle of wine up for Lone Bamboo to have a few more sips. He asked, “But if you continue to refuse, will the Very High let you go?”\n\n“I don’t know,” Lone Bamboo admitted with a shake of his head.\n\nHan Sen didn’t ask anything further. He chatted with Lone Bamboo for a bit longer, and after he finished his wine, he left the prison.\n\nHan Sen was walking away, and as he did, he thought to himself, “Why would the Very High want Lone Bamboo so badly? There must be a way I can help him.” He left the restricted area and saw a man sitting on a white crane. The man was smiling at Han Sen.\n\n“Uncle Yu.” Han Sen raised his eyebrows at the sight of Yu Shanxin.\n\nYu Shanxin had gone to the lands occupied by the Dragons to save Han Sen once before. So, Han Sen was very polite whenever he saw the man.\n\nYu Shanxin smiled and said, “We should walk together, assuming that is okay with you.”“Are you coming for Lone Bamboo?” Han Sen asked Yu Shanxin as he followed him.\n\n“No, I’m here for you,” Yu Shanxin answered. That surprised Han Sen.\n\nBefore Han Sen said anything, Yu Shanxin went on to say, “Sky Palace made a deal with the Very High. So, whoever the Very High selects must go. If Lone Bamboo doesn’t go, then we must find a worthy replacement.\n\n“That person you are suggesting can’t be me, can it?” Han Sen smiled wryly.\n\n“Aside from Lone Bamboo, the only other one of this generation that can impress the Very High is you,” Yu Shanxin said with a smile.\n\n“I can’t do it, either,” Han Sen said with a vigorous shake of his head. He didn’t like running around naked any more than Lone Bamboo.\n\nYu Shanxin had expected Han Sen to react this way, and so he coldly said, “I’m sure Lone Bamboo filled you in on what the Very High are like. I waited until now to see you so that I wouldn’t have to waste my breath.”\n\n“Uncle Yu, you don’t need to try to convince me. My thoughts on the matter are the same as Lone Bamboo’s. I would rather go to prison than go to the Very High,” Han Sen said with a shake of his head."
}