{
    "chapter": 1705,
    "title": "Same Tattoo",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1705",
    "text": "When Han Sen first saw the Nine-Life Cat symbol on Zero, he thought it was just a sign associating her with Blood Legion in some way. Now that Han Sen was thinking about it, he realized the symbol was just like the tattoo on his back.\n\nZero could enter the sanctuaries without issue, unlike others who were subject to limitations and restrictions. She never had to go through a formal ascension process, either.\n\nNow Han Sen was thinking that if Zero had a Nine-Life Cat symbol like his, the mystery was practically resolved.\n\nOld Cat had said that having Nine-Life Cat blood meant you could come and go in any sanctuary as you pleased. It was a fine explanation for why Zero was able to enter any of the sanctuaries, without ascending the proper way.\n\nAnd Zero teleported to Han Sen whenever or wherever he ended up. That was something else that went against the pre- established system of the sanctuaries. That was similar to what had happened to Han Sen when he ended up next to Old Cat.\n\nIf Zero’s tattoo was the same as his, that meant they shared a weird connection of some kind. They might have been one- and-the-same, and that was why Zero would always spawn next to him.\n\nHan Sen thought this was very possible. He’d only ever had one brief look at her Nine-Life Cat tattoo, though, so he couldn’t quite remember the details. He didn’t know if it was exactly the same one that was on his back.\n\nSeeing Zero, who was currently treating his wounds, he thought to himself, “She’s a grown woman. I can’t ask her to take her clothes off so I can inspect her.”\n\nHan Sen thought about this conundrum for a while, but he couldn’t come up with an excuse that would permit him to get a look at her tattoos.\n\n“Zero, you haven’t bought any new clothes in a long time. How about we go and get you some later?” Han Sen looked at Zero’s clothes. He only had to make her wear something that revealed her back, and he would see the tattoo.\n\n“No, I have enough,” Zero said calmly.\n\n“But I need to. You are a beautiful girl and you need to dress up pretty. If you don’t, people will find out I’ve been cheap on you. I will handle this for you, okay?” Han Sen said that all at once, not giving her another chance to respond.\n\nZero did not say anything, either. Once she had dealt with Han Sen’s wounds, she left.\n\nHan Sen was on the sofa browsing Skynet. He bought a few different garments for Zero.\n\nHe bought a number of different clothes to hide the ones he truly wanted her to wear~the ones that would display her back.\n\nOf course, he wasn’t dumb enough to buy a lot of different clothing that all showed her back. That would be too obvious, and it’d be like he was making a statement. By buying a bunch of different styles, she’d be none the wiser.\n\nTwo days later, the clothes were delivered by a drone. Han Sen called Zero over and convinced her to try them on, one by one.\n\nAnd when Zero wore the clothes that revealed her back, Han Sen was delivered quite the surprise.\n\nZero’s appearance hadn’t changed much, but she had grown up a lot. She was a woman now. She looked very beautiful in the dress he got her, and Han Sen couldn’t stop admiring her looks.\n\nZero walked around, with Han Sen staring keenly at her back. He also took a photo, for future investigation.\n\nBut when he saw her back, he really could see that the Nine-Life Cat tattoo was the same as the one he had. It wasn’t just the shape that was a carbon copy, either; he could sense it was the same via its color and feel.\n\n“I was right! If Zero’s back tattoo is the same as the Nine-Life Cat pendant, it explains everything. But why would Zero have it and the pendant? Blood Legion had two of those relics? Where did Zero come from? Is she a human or a shura? Or is she something else entirely?” After Han Sen discovered this, his mind found more questions than answers.\n\nHan Sen believed Zero might be a human that had used a geno fluid at the shura grave. It was certainly a possibility, but the tattoo posed other problems.\n\nWhen Han Sen became a god, he had absorbed the Nine-Life Cat. When had Zero combined with the necklace? And how had she done it so soon when she wasn’t strong?\n\n“Dear, what do you want for dinner tonight? Because you are injured, I will cook.” Ji Yanran pushed the door open and walked right in. She was shocked by the scene she was witnessing.\n\nHan Sen was lounging on the sofa, staring at a loosely clothed Zero. The dress she wore left her whole back on display.\n\nHan Sen wished to give her an answer, but he immediately noticed a dangerous look take over her face. He quickly told her, “Zero bought a number of different pieces of clothing, and she wished to ask me which looked the best!”\n\n“Zero, you bought these clothes?” Ji Yanran nibbled her lips and asked Zero directly.\n\n“Han Sen bought them. Told me to wear them.” Zero wasn’t a liar and her EQ was low. She wasn’t really sure what was going on, so she simply answered with honesty.\n\nJi Yanran squinted her eyes and looked down at Han Sen with a look that was more frightening than hell’s most rotten demon. She slowly approached him.\n\n“Let me explain! It isn’t what you think. This is all a misunderstanding!” Han Sen wished to explain.\n\nJi Yanran walked in front of Han Sen and then smiled a smile that was creepier than the officer’s.\n\n“You love to watch girls change their clothes? I will show you how it’s done right when we go home.” The smile remained fixed on Ji Yanran’s face, and it gave Han Sen a horrible chill.\n\n“Let’s go to the mall and buy the most expensive garment. Then, you can dress yourself up in it and show me!” Han Sen quickly said.\n\n“Shut up and get in here!” Ji Yanran grabbed Han Sen by the ear and pulled him into the next room. Many screams were heard after that.\n\nA while later, Han Sen managed to explain everything clearly. He desperately wanted to escape the wrath of her finger.\n\nAfter dinner was done, Han Sen saw Stay Up Late up in the observation tower. He walked over and started to chat with him. “This matter concerns our lives. Is there something you need to tell me?”\n\nStay Up Late was more injured than Han Sen was. He was reclining on a sofa with a hot cup of tea. He stared up at the sky as he replied. “That was the Third Division Special Forces officer. He trained all its members, myself included.”\n\nStay Up Late sounded okay, just a little cold. Still, it was a soothing voice to listen to. But what he said next shocked Han Sen."
}