{
    "chapter": 2346,
    "title": "Identity Exposed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2346",
    "text": "Han Sen didn’t believe what Miss Mirror told him. He had inspected that ring many times, and he had never seen any semblance of a soul inside it.\n\nWhen Han Sen heard what she said, he raised his hand. He tilted the ring’s green, eye-shaped gem toward his own face. He examined the gem’s reflective surface carefully, and said, “I do see my own reflection, but any gem would show me that.”\n\nMiss Mirror laughed. She lifted her left hand.\n\nMiss Mirror’s hand was white, and her fingers were long and thin. There was a ring on her ring finger.\n\nSeeing that ring, Han Sen’s heart leaped. That ring looked exactly the same as his, aside from the fact that it was a little bit smaller.\n\nMiss Mirror lightly touched the green gem with her finger, and the eye-like stone started to glow.\n\nThe ring on Han Sen’s finger trembled slightly. They both lit up in the same way.\n\nAt that moment, Han Sen felt the gem on the ring come alive. It was like a real eye looking at him.\n\nIn that eye, he could see his own reflection. But the gem wasn’t reflecting Han Sen as he was now; instead, it showed Han Sen as a naked baby.\n\nHan Sen felt a pang of panic roll through him. He hadn’t expected the ring to reveal anything incriminating, and it was too late for him to take it off.\n\n“Auntie Princess, what is that geno art you used? It is quite interesting. But stop joking around with me,” Han Sen said. He kept his composure strong and unwavering.\n\nMiss Mirror lowered her left hand, and the light of the rings went dim. She looked like she was smiling, but she wasn’t. “You have a silver tongue, but it won’t do you any good. If I hand you over to the king, how long do you think it will take for you to die? It might take tens of thousands of years. I’m afraid death wouldn’t be granted to you for a long, long time.”\n\nHan Sen had a wry smile on his face. He had planned to talk Miss Mirror into believing that he was truly Bai Yi, so he could buy himself some time to formulate a plan for escaping the Extreme King.\n\nBut this was the first time they had met, and already, his identity had been exposed. All his plans of escape had now been reduced to nothing more than a ridiculous joke.\n\n“If you have something you want to say, then get on with it and spit it out.” Han Sen sighed.\n\n“There is nothing to tell you. You will be sentenced to death. I will take you to the palace and let the king decide,” Miss Mirror said flatly.\n\n“If that was what you really intended, then there was no point in confronting me here,” Han Sen said, as he looked at Miss Mirror.\n\nMiss Mirror didn’t respond. She just looked at Han Sen with interest as the car traveled onward.\n\nHan Sen quickly realized that the car wasn’t headed for the palace. They went to the biggest starport that could be found in King’s Kingdom.\n\n“Where are we going?” Han Sen asked, following Miss Mirror out of the car and onto a battleship. The battleship soon took off, heading out of King’s Kingdom. He was shocked.\n\nInstead of answering his question, Miss Mirror sent for someone to take him to another room.\n\nHan Sen didn’t know what Miss Mirror intended to do. She was Bai Wei’s aunt and a trusted adviser of King Bai. If she noticed Han Sen was a fake, she should have grabbed him by the collar and marched him before King Bai.\n\nInstead, they were leaving King’s Kingdom. She hadn’t decided to incarcerate him, either. She just had him and the blood kirin taken to an ordinary room. The blood kirin wasn’t locked up, either.\n\n“What does this Miss Mirror want?” Han Sen wondered, but try as he might, he couldn’t guess what the woman was planning.\n\nHan Sen touched the Mirror Spirit Eye. He wanted to take it off, but ever since the ring had been activated by Miss Mirror, it was as if the piece of jewelry had melded into his hand. He was now unable to remove it.\n\n“What the hell is this ring?” Han Sen wondered, frustrated by the fact that he couldn’t activate the Mirror Spirit Eye ring.\n\n“I’ll have to take whatever opportunities come my way. It looks as if I’m not talented enough to be a spy. I was exposed very easily,” Han Sen thought to himself. “But if Miss Mirror hasn’t brought me to King Bai, and I’m no longer in the confines of King’s Kingdom, there is a chance that I can escape. The only bad thing is that Bao’er is still in Lan Haixin’s place. How am I supposed to get her out of there?”\n\nThe ship made a series of hyperspeed jumps that took them through multiple systems after they left King’s Kingdom. Han Sen had no idea where Miss Mirror was taking him.\n\nWhen the battleship finally came to a stop, Han Sen realized he was now in a system he had never seen before. The planet was very cold, and it was still in a very primitive stage of development. There were no creatures of high intelligence about, and there were no xenogeneics. There were only low level creatures around.\n\nBut for such a primitive planet, it was surrounded by a surprising number of battleships and airships from a variety of different races. Han Sen followed Miss Mirror down onto the surface of the planet, and he saw many races that were familiar to him. There was the Dragon, Demon, Buddha, Destroyed, and all sorts of others were represented.\n\nHan Sen noticed something rather odd, though. Everyone who had been sent to the planet’s surface, no matter which race they were from, possessed water powers.\n\nEven if they didn’t come from a water-aligned species, they were at least proficient in water-based techniques. They were all King class, too. It was rare to find a Duke in their ranks.\n\n“What is this place?” Han Sen couldn’t help but ask Miss Mirror.\n\n“This is a nameless system of no notability,” she replied.\n\n“What are we doing here?” Han Sen asked with a frown.\n\n“We are attending a funeral,” Miss Mirror answered simply.\n\n“A funeral? Whose funeral?” Han Sen was confused. Instead of handing Han Sen over to King Bai, Miss Mirror had dragged him all this way to attend a funeral. This was weird.\n\n“Time is almost up. Let’s find a seat.” Miss Mirror looked around and walked to a peak.\n\nIf Miss Mirror didn’t want to answer Han Sen, then he had no choice but to follow along behind her.\n\nHan Sen didn’t plan on running. First, he might not have to flee, and even if he could, this was not the time. Bao’er was still in the Extreme King, so there was no use in him running off all alone.\n\nPlus, a woman like Miss Mirror would probably have contingencies in place for any escapes Han Sen might attempt.\n\nHan Sen and Miss Mirror reached the top of the peak, and a guard brought her a chair and an umbrella. It was as if she was on vacation.\n\nHan Sen didn’t receive the same lovely treatment. He just stood next to the blood kirin, trying to see what Miss Mirror was inspecting. The only thing in front of them was a large sea. It was very quiet, and no creatures were visible within its depths. There was nothing special to see."
}