{
    "chapter": 610,
    "title": "Blood Crystal Lotus Seeds",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_610",
    "text": "The creatures on the island were no longer intent on fighting each other. They each exerted all the strength they had in running up the hill to grab the seeds before the others could. The peacock was the closest, and with its boon of flight, spared no time in soaring there.\n\nAlthough Han Sen really wanted to grab the lotus, he was slowed down by his need to prevent the silver fox from going out on its own. He missed his chance and was too late.\n\nAs the peacock was about to peck and gobble the lotus plant, one blood crystal lotus seed appeared to crack open.\n\nMore accurately, it looked as if the blood crystals were beginning to sprout two translucent wings, as thin as a cicada's. The wings started to flap, and they began flying away from the lotus cup.\n\nThe flying lotus seeds suddenly smacked into the peacock's face, making the giant beast fall back, screaming in pain. After the slight hit, giant red blisters scorched its face. It continued to retreat, crying in agony as it did. Then it took off into the skies, flew away, and did not return.\n\nThe lobster seemed to ignore what had happened to the peacock, and instead vied to take its place and eat the lotus.\n\nBut in the next second, blood crystals went airborne once again. They rushed into the lobster's shell.\n\nThe lobster roared deafeningly. After sustaining the hit, even the lobster decided to retreat. In an instant, it raced off, skittering back to the sea.\n\nHan Sen was frozen in place, seeing that the red crystal-looking things were not actually lotus seeds. They were red wasps, shaped like little ruby gemstones. The end of each wasp had a lethal stinger.\n\nHan Sen saw the wasps pierce the lobster's shell and peacock's feathers as if it were nothing. The massive blister that had emerged upon the peacock's face indicated how poisonous it was.\n\nTo see super creatures like the peacock and lobster run off in fright sent a chill coursing down Han Sen's spine. Now, he was glad he hadn't been able to get there before the other creatures. If he had been struck by one of those wasps, he'd have been in far worse shape.\n\nMany blood crystal wasps were now flying out from the lotus. Han Sen wasn't sure if the plant itself that birthed the blood-crystals, or if a mother wasp had recently planted the eggs. But no matter their origin, it was clearly a vicious trap, and it would yield him no benefit.\n\nEighteen wasps now shot out of the lotus, carried by their delicate wings. The toxicity of their venom was as dangerous to an ordinary creature as it was to a super creature. The consequences of being stung were horrid. At first, a giant blister would form. Then, bones would turn to liquid. And finally, the body itself would inflate, growing larger and larger until it burst like a reservoir of pus and blood.\n\nWhen creatures were splashed with excess venom, although the effect it had on them was not as lethal as a straight-up sting, their bodies and faces were still left scorched with massive blisters.\n\n\"Run!\" Han Sen grabbed the silver fox and ran off down to the beach. The blood crystal wasps were frighteningly quick, and Han Sen had no idea whether or not his body could withstand their sting.\n\nWithout the light of the peacock, the silver fox and Queen were both able to open their eyes. The previously pleasant fragrance had grown lighter, and it seemed to snap all the creatures out of their prior daze. In fear, everything now fled the vile trap of the wasps.\n\nWith so many creatures strewn about dead and bloodied, the island looked like a snippet of hell itself. The creature death toll must have been immeasurable on this day.\n\nTwo people and a fox ran towards the ocean. No creatures fought amidst themselves, or even thought about targeting the humans. Escape was the only goal on everything's mind at that moment.\n\n\"I thought I could reap some benefits from that lotus thingy; little did I know how big of a mistake I was about to make!\" Han Sen felt like a fool. When he turned around to take a look at what was going on behind him, his jaw hit the ground.\n\nOne of the wasps was headed in their direction. Like a red, blazing meteor, it was coming their way at a terrifying speed.\n\n\"When people are unlucky, they tend to choke when they drink water. With so many other creatures that are free for you to take, why the hell have you come for us?!\" Han Sen's heart was now stripped of all hope.\n\nHan Sen's body steeled itself, blazing with all the power and might he had. His heart thumped like rhythmic thunder. As his seventh sense kicked itself onto a whole new level, his blood began to boil.\n\nQueen noticed Han Sen was not any slower than she was, which surprised her. If Han Sen hadn't unlocked his gene lock, there was no way he would have been able to keep up with her.\n\nBut now was not the time to stop and question him over his deception. So she gritted her teeth and kept running as fast as she could.\n\nAs they continued to run, she noticed Han Sen was actually gaining speed. Soon, he had overtaken her. After a while, he was far ahead; she couldn't keep up with him.\n\nHan Sen was also just noticing that his speed must have grown exponentially since he opened the gene lock.\n\nAlthough Jadeskin did not grant him the power to manipulate and wield ice, the amount of power he had gained seemed greater than what most people received after opening their gene lock.\n\nBut his joy drained as he noticed the red wasp drawing nearer and nearer.\n\nHan Sen was positive that its target was the three of them. If they weren't its target, it wouldn't have followed them as much as it did.\n\nBut Han Sen was not entirely sure which of the trio was its primary target. Was it him? Was it the silver fox? Or was it Queen?\n\n\"We should split up!\" Han Sen yelled at Queen before going off in another direction.\n\nAs he suspected, the wasp turned just as he did. Its target was indeed Han Sen.\n\n\"Fudge! It really is coming for me and the silver fox.\" Despite having expected it, Han Sen couldn't but feel compelled to swear.\n\nThe wasps were way too fast. Despite his breakneck speed, the wasp had now caught up to Han Sen.\n\nThe wasp made its first attack. With all his power, Han Sen dodged it while still maintaining his speed.\n\nThe blood crystal wasp was so small, it was difficult to keep track of it at the speed they were both going. If it wasn't for Han Sen's incredible seventh sense, he'd have been an oversized blister already.\n\nAlthough he was having difficulty following the wasp with his eyes, he cast the Dongxuan Sutra and used his feelings to determine when and where the wasp would strike next. He successfully dodged each attempted sting.\n\nThe silver fox, who was still nestled in Han Sen's chest, was quite alert. Thunder sparked in the wells of its eyes, but try as it might, the wasp was too quick for it to thunder shock.\n\nHan Sen was not sure how much longer he could go on. All he could do was keep dodging on his way to the beach. He had to get into the sea, no matter what. If other wasps decided to join the chase, it would all be over. It wouldn't matter how proficient he was at sensing their locations, dodging any more would prove too difficult.\n\nOne more was all it would take to tip the scales.\n\nDealing with this single wasp, Han Sen was already exhausting his unusual talents of intuition and judgment. He couldn't use his seventh sense to lock down the wasp now, either.\n\nQueen had already reached the oceanside when she saw Han Sen in the distance, having trouble with the wasp. Gritting her teeth, she summoned a throwing knife and threw it in his direction.\n\nBut being unable to track the dizzyingly quick wasp, it was impossible to hit it."
}