{
    "chapter": 2704,
    "title": "God Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2704",
    "text": "Horizontal Evil was suffering constant torture, but he still managed to laugh. “Even if everyone abandons me, neither the living nor the dead will accept the Breakskies. So, what does it matter? Do you guys want Super Gene? Well, I’m not giving it to anyone.”\n\nHan Sen caught his breath when he heard that. Finally, another mention of the elusive Super Gene.\n\nKing Jun’s face didn’t change. He looked at Horizontal Evil calmly and said, “You are sacrificing yourself and your people for Sacred Leader’s most treasured secret. Is it truly worth the cost? You are being tortured here. Did you not notice? All of your fellow Breakskies are going to die here with you. Where is Sacred Leader now? Did he ever express any desire to save you? Has he ever done anything for the Breakskies?”\n\n“You don’t have to keep talking. No one will extract any of Super Gene’s secrets from me. Sky Armor failed before, and you, King Jun? You will fail, as well. Try harder,” Horizontal said mockingly to his oppressor.\n\nKing Jun laughed at Horizontal Evil. He didn’t lose his cool as a result of Horizontal Evil’s taunting. With his holier-than-thou attitude firmly in place, he said, “I have all the time in the world. You should take your own time and think about it some more. However, I have come to visit you because there is something I wish to tell you. I’m going away for a while. When I come back, I will give you a small gift. It will surprise you, and I think you should look forward to it.”\n\n“What is that supposed to mean?” Horizontal Evil asked with a frown.\n\n“You will know it when you see it. And I assure you, you will be very surprised.” A weird smirk crossed King Jun’s face. He then turned around, flew toward that sun that looked like a clock, and disappeared.\n\nAfter a while, Horizontal Evil spoke to Han Sen in a gravelly voice. “You can come out now.”\n\nHan Sen rose out of Horizontal Evil’s hair, feeling relieved. Fortunately, King Jun had remained unaware of Han Sen’s presence through the entire conversation. God only knew what might have happened if his presence had been disclosed.\n\nAfter King Jun left, the black crystal armor returned to its dormant state, as well. The alarms he was receiving from his senses and nerves gradually went quiet.\n\n“You are only King class. How did you get here?” Horizontal Evil asked Han Sen. To him, half-deifieds and Kings were the same. There was no distinction between them.\n\nHan Sen told him about the Four Sheep Cube, and after Horizontal Evil heard Han Sen’s explanation, he frowned. “That means the Four Sheep Cube is a treasure that comes from the anti-material world. That is certainly quite strange. Perhaps that is the reason it sent you here.”\n\n“What kind of place is this? And who was that man?” Han Sen asked.\n\nHorizontal Evil didn’t answer Han Sen. Instead, he asked a question of his own. “Tell me about what is going on in the universe right now.”\n\nRemaining patient, Han Sen began to describe the state of the universe these days. Horizontal Evil listened to every word and asked a lot of questions. His face grew more and more concerned as the discussion went on.\n\nHorizontal Evil eventually looked up at the sun in the sky and gestured for Han Sen to stop talking. “My time is almost up. You should come back tomorrow.”\n\nHan Sen was going to continue, but he then heard the bells chime. He raised his head and noticed that twelve whole hours had gone by.\n\nThe metal pillar stopped spinning, and its lights faded away. It returned to looking like a simple metal pole. Horizontal Evil’s eyes slowly closed, and he looked as if he had slipped into a deep sleep. No matter how Han Sen tried to wake him, there was no response.\n\nNot long after, Han Sen heard the Breakskies headed toward him. They didn’t see Han Sen, and they got back to digging that mountain.\n\nWhen Han Sen saw this again, he felt a sharp pang of sympathy in his heart. It was upsetting to see what they were forced to do, now that he had learned more.\n\n“These Breakskies try to dig into the mountain every day. They are trying to save their alpha, but it is a task that they will never fully accomplish. Whoever set this up is unimaginably evil. Killing them would have been simple, but he wanted them to suffer this painful existence for the rest of their lives. It is quite scary to think about.” Han Sen sighed. He didn’t stay there any longer. He flew back to the Four Sheep Cube.\n\nWhen he returned to Underworld Lake, he found Bao’er and the 16 piggies waiting there. They were all looking at Han Sen when he came back.\n\n“Exquisite and Li Keer didn’t show up while I was absent?” Han Sen asked, picking up Bao’er.\n\n“No.” Bao’er shook her head.\n\nHan Sen nodded. That was one less thing to worry about. He tried putting the Four Sheep Cube inside Destiny’s Tower, and he was able to slide it inside without difficulty. He let out a sigh of relief.\n\n“If I have another chance in the future, I will go and visit that Horizontal Evil. Maybe I can get some secrets out of him. Going by what King Jun had to say, it seems Horizontal Evil has a fairly firm connection to Sacred Leader,” Han Sen thought to himself. He then proceeded to think about how he might pry some more secrets from Horizontal Evil.\n\nThat wouldn’t be an easy task. Horizontal Evil had been there for years, and he hadn’t divulged his secrets to his tormentor, who was practically a god. Han Sen, on the other hand, was just a mere stranger. Building any semblance of trust between the two of them would be very difficult. It would be hard to extract secrets from the powerful Breaksky.\n\nHan Sen practiced on the shores of the lake for half a day. He was going to wait twelve hours before traveling to that mysterious world and visiting Horizontal Evil again, but before his time to go had arrived, he saw someone flying toward him.\n\n“Uncle Yu,” Han Sen said, raising an eyebrow when he saw the shape of the man. Yu Shanxin was riding a crane toward him.\n\nYu Shanxin dismounted the crane. He stepped up to Han Sen with a smile and asked, “The thing that the leader wanted you to do, how has it been going so far?”\n\n“What do you mean? Sky Palace Leader didn’t ask me to do anything,” Han Sen said, pretending to be surprised.\n\nYu Shanxin nodded and said, “You are being very careful. That is how you should be, but you need to find that woman. Quickly.”\n\nWhen he heard that, Han Sen believed Yu Shanxin really was aware of what Sky Palace Leader had asked him to do. He raised a hand in surrender and said, “After coming to Outer Sky, I haven’t had the chance to meet many of the Very High. How am I supposed to locate my target?”\n\nPrivately, Han Sen was thinking, “And even if I had met many of the Very High, I can’t just strip them down to reveal whether or not they have a birthmark near their heart.”\n\n“This is a very tricky situation, but I believe you have what it takes,” Yu Shanxin said with a smile.\n\n“What do you mean by that? And why can’t you do it?” Han Sen frowned.\n\n“This is your task, not mine. I have other things to do.” Yu Shanxin smiled and went on to say, “Right. If there is nothing more, in a few days, Exquisite and Li Keer will take you to the god area. You better behave yourself.”\n\n“The god area? I am just a half-deified. How will I go to the god area?” Han Sen asked in consternation.\n\nHe had heard of the god area before. It was a very special xenogeneic space, rather like the core area. While only Kings could go to the core area, the god area was a xenogeneic space reserved for deifieds."
}