{
    "chapter": 1290,
    "title": "Holy Baby Fruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1290",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Well, well, well. Look who it is! Empty Witch? Why are you here? And if my eyes really aren’t playing tricks on me, please tell me there’s a good reason for your presence here. Last I recall, you weren’t the fondest of company one could keep.” Han Sen was surprised, seeing the mini lady.\n\nBack in the Second God’s Sanctuary, the Empty Witch had used the Empty Vine to access the Third God’s Sanctuary. That was the first and last time Han Sen had met her, and it followed hot on the heels of a grueling adventure. The circumstances of their first encounter were not very pleasant, that was for sure.\n\nEmpty Witch stuttered to say, “Well, can I just be the first to congratulate you on your accomplishments? I can’t believe you’ve managed to take down as many emperor shelters as the tales tell.”\n\n“Well, you’re not the first. And for all you know, I just got a little lucky. I caught one emperor when he was napping,” Han Sen said.\n\nEmpty Witch proceeded to tell him, “If you think these attempts at a jest are charming, I can only admit that you are gravely mistaken!”\n\nHan Sen merely smiled and said, “Jokes aside then, come on; tell me why you’re here.”\n\n“The Holy Baby Fruit is going to ripen soon. Miss Lotus wants every emperor to try it. You may not be a spirit, but you’re an emperor all the same. Because of this, she has extended you a very special invitation,” Empty Witch explained. Then, after a brief pause, she jumped to ask, “Where is the Holy Spirit?”\n\n“She’s not here,” Han Sen plainly stated.\n\nJi Yanran had joined an aircraft expedition, along with Bao’er.\n\nEmpty Witch looked disappointed, but she moved forward to ask, “Can you bring her here? I would very much like to see her.”\n\n“Bao’er is too busy to come right now. Anyway, keep explaining,” Han Sen said.\n\n“That’s disappointing. Ugh, I don’t know why I came all this way.” Empty Witch rolled her eyes.\n\nHan Sen said, “Why is the Lotus Empress being so kind as to invite us all to eat this fruit?”\n\n“Holy Baby Fruit is an emperor-class geno plant. Only she can grow these, and every ten thousand years, she invites emperors from all across the sanctuary to taste them. It’s your lucky day, it would seem,” Empty Witch finished saying.\n\nHan Sen did not say anything in response. It was a very strange proposition, one Han Sen thought to be a little fishy.\n\nPlus, if he went, he’d be a sole human venturing into all-spirit territory. It could have been a trap. Even if he was to consider going, he knew he’d have to take many precautions.\n\nEmpty Witch could see the expression of doubt lurking behind Han Sen’s cold facade, and she tried to bring him ease by saying, “Don’t worry; there are many people there who despise each other. In the shadows of Evil Lotus Shelter, though, none would dare cause a scene. You’ll be safe.”\n\n“Roger that, but… I think I’ll pass,” Han Sen said.\n\nHan Sen wasn’t going to willingly place his life in the hands of others and take someone like her at her word. Normal geno fruit no longer worked on Han Sen, and if Lotus Empress was willing to issue it out as a gift, he didn’t think it could be anything all that special.\n\n“I suspected you might look upon such an event with suspicion, and I’d wager that is because you don’t know really know what this whole thing is. But don’t worry, I have a sneaking suspicion of my own. A suspicion that suggests you will change your mind.” Empty Witch then threw something to Han Sen.\n\nHan Sen examined the item and noticed it to be a lotus flower.\n\n“This is her invitation. I suggest you ask your spirit buddies what Holy Baby Fruit is; I’m sure you are more inclined to believe them than me. And once you change your mind, this is your ticket.” Empty Witch paused, and then with bright and glittering eyes, jumped to say, “Bring the Holy Spirit, too. I still want to meet her.”\n\n“I’m off now to go visit another emperor and hand him his invitation. He’s a grumpy fellow, but thankfully, they don’t shoot the messengers. Anyway, Mister Han Sen, I implore that you take the time to ask around and think about it.” Empty Witch then swiftly flew away.\n\nHan Sen frowned. Empty Witch was able to sneak inside the shelter without being detected—she was good.\n\nBecoming this strong in such a short time meant Lotus Empress must have been quite something. Empty Witch didn’t seem particularly special, yet her empress had trained her extremely well.\n\nHan Sen asked his companions about Holy Baby Fruit and whether or not Lotus Empress could be trusted.\n\nThis event had been going on for a long time, and it was confirmed to be safe. No deaths or dangers had ever been reported as occurring there before, either. Every Holy Baby Fruit bestowed upon someone gave them one self geno point. And emperors had actually received two at the last event.\n\nAnd one Holy Baby Fruit, out of all the ones to be given out, possessed a Holy Baby inside. If you were lucky enough to receive that one, you could open a gene lock.\n\nIf you had already opened ten gene locks, you could open the door and become a demi-god. Forty-thousand years ago, an emperor ate the Holy Baby and immediately became a demi-god.\n\nThere were three thousand fruits up for grabs, though. Getting the right one was sheer luck.\n\n“Why doesn’t she eat the fruit herself, then?” Han Sen found it too good to be true.\n\nHan Sen thought only a crazy fool would hand-out such wondrous gifts willy-nilly.\n\nDry Bone King, the source of Han Sen’s information, explained, “The legends say it is because she is unable to eat them. Instead of letting them go to waste, though, she charitably hands them out. Pretty much every emperor has tasted her fruit, and it kind of means they owe her one in return. It’s a way for her to earn respect more than anything. If spirits want more fruit, they must maintain their pleasantness with her.”\n\n“That’s interesting,” Han Sen thought.\n\nBaby Ghost told Han Sen, “Some berserk super creatures receive invitations, too. And while you hold that invitation of hers, you won’t be provoked when you’re out and about. Unless you go looking for a fight and start one, of course.”"
}