{
    "chapter": 2270,
    "title": "Silver Sycee",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2270",
    "text": "The steel twig was unexpectedly tough. It took Han Sen a long while to cut through it so he could claim the silver fruit for himself.\n\nWhen he finally sawed through the twig, the silver fruit dropped from the tree. Han Sen reached out his hand to grab it. But the moment the silver sycee touched his hand, Han Sen’s eyes widened.\n\nHis face twisted, and his muscles trembled and shook. His blood surged through his veins like lightning, and his entire body turned to ice jade. He roared. He struggled to raise the hand that was holding the silver sycee, his other hand clutching his waist as if he was about to have a hernia.\n\nHan Sen summoned all the power he could. His hair flew around like mad, and green veins bulged across his head.\n\nPatong!\n\nThe silver sycee continued to fall to the ground, taking Han Sen’s hand with it. Han Sen had to half-kneel on the ground.\n\n“What kind of fruit is this? It is so heavy! If I swallowed this, it would tear straight through my stomach!” Han Sen stared at the fruit in disbelief. He wanted to get his hand out from under it, but it was pinning his hand down. He pulled away with all his might, but the fruit wouldn’t budge.\n\nHan Sen took out his knife and hacked away at the silver fruit. The loud shrieking noise of metal on metal assaulted his ears, but the sycee remained completely undamaged. The fruit was harder than the tree it had come from.\n\nAfter a moment of thought, Han Sen decided to dig into the ground instead. The floor of the palace was also incredibly hard, though. Han Sen’s cuts only left light scrape marks behind.\n\nThe blood kirin used its own claws to help dig through the stone near Han Sen’s hand. The creature actually managed to leave a few proper scratch marks, but whenever it pulled its claws away, the scratch marks would disappear.\n\nThe blood kirin kept digging, but the floor continued to miraculously recover. Han Sen’s hand remained motionless under the silver sycee.\n\n“Grab that fruit and lift it away!” Han Sen barked to the blood kirin when he realized that digging into the floor was a futile endeavor.\n\nThe blood kirin, upon hearing Han Sen, locked its jaws around the silver sycee. It yanked upward with all of its might, but the silver sycee remained still.\n\n“What… what is this thing…” Han Sen was frozen. It was just a fruit, but not even a half-deified being could move it. The sycee didn’t even twitch.\n\nEven more strangely, Han Sen’s hand hadn’t been crushed. The sycee was keeping him pinned in place, but if the fruit was really as heavy as it seemed, his hand should have been crushed and broken.\n\nIn truth, his hand was only suffering a bit of pressure. It definitely hadn’t been injured.\n\nJust as Han Sen was about to use Purple-Eye Butterfly to take a look at the fruit, the teleporter rippled with movement. Someone was coming.\n\nHan Sen looked over as Mister White and Crime emerged. Their presence made him frown.\n\nAlthough Crime was King class instead of half-deified, Han Sen had witnessed his talents in battle. He was no worse than the half-deified Edward, by Han Sen’s estimation.\n\n“Han Sen, what are you doing?” Mister White looked at Han Sen with interest.\n\nThe blood kirin interrupted his question with a roar. Then, it leaped towards Mister White and Crime. Its claws wielded a blood air as they slashed as Mister White like blades.\n\nMister White stepped forward like he was teleporting. He appeared right beside the blood kirin and pressed a hand against the creature’s head.\n\nMister White’s hand flashed with a strange symbol. That symbol sank into the scaled forehead of the blood kirin like a brand.\n\nBoom!\n\nThe blood kirin’s body suddenly became heavier, and the increased weight almost took the creature to its knees.\n\nThe symbol glowed gently from the creature’s forehead, and the blood kirin seemed to struggle against the encumbrance.\n\nThe blood kirin roared and jumped towards Mister White again, but this time, it was far slower. Mister White moved with eerie grace, and every step looked like he was teleporting. His power was similar to Huangfu Jing’s. He was far stronger than her, of course.\n\nThe blood kirin continued to chase Mister White, all the while roaring in rage. It was angry at being tricked, and even more furious that it was unable to bring harm to Mister White. Mister White had played it for a fool.\n\n“The blood kirin’s intelligence really is quite low.” Han Sen sighed. The beast had plenty of brawn, but it was severely lacking in the brains department.\n\nMister White lured the blood kirin to a side hall, and Han Sen could do nothing to stop him. Meanwhile, Crime headed for the pinned-down Han Sen. He looked at Han Sen and said, “We have no grudge with you. Give me the stone plate, and we will leave. We will pretend we did not see you.”\n\n“Come and get it, if you have what it takes,” Han Sen replied flatly.\n\n“You are strong, but regrettably, the fruit seems to be holding you in place quite easily. You can’t escape as you are right now. How do you expect to fight me?” Crime drew his knife.\n\nThey had paid the price of underestimating Han Sen before, but now, Crime considered him to be an equal opponent. Crime and Mister White were not going to underestimate him anymore because he was a Duke. Even though Han Sen’s hand was held firmly in place, which left him unable to run, Crime was still going to use all his power when he attacked.\n\nCrime’s knife was very creepy, although it was only one foot long. It was made of black metal, and the blade was shorter than the handle. It looked like the blade had been broken.\n\nA ring protruded from the base of the handle, and a chain was attached firmly to the ring. The other end of the chain connected to Crime’s strong arm.\n\nAs Crime slashed toward him, Han Sen didn’t speak. He simply tapped the bird’s nest on his head, and it widened to shield Han Sen’s entire body.\n\nThe bird’s nest caught Crime’s strike and reflected it in complete silence. No sound was heard, and the nest remained perfectly intact.\n\nCrime was surprised. He gathered up all his power and slashed a few more times. Nothing he tried seemed to work, though.\n\nHan Sen wasn’t worried that Crime would break the bird’s nest. Even Fox Queen hadn’t been able to damage that thing. There was no way Crime could do what she could not.\n\nIt was a shame the bird’s nest couldn’t be used offensively. However, he was currently more frustrated by his inability to get the fruit off of his hand.\n\nHan Sen tried a few different powers, but nothing seemed to work. Aside from using his super god spirit body, he didn’t seem to have many options.\n\nSuddenly, Mister White’s voice came from the side hall. “Han Sen, if things continue like this, none of us will benefit. Why don’t we try to cooperate?”\n\n“What do you suggest?” Han Sen asked after a moment.\n\n“Make this blood kirin stop, firstly. At least then we might be able to talk,” Mister White said.\n\n“Okay.” Han Sen called the blood kirin back to his side. Mister White also removed the mark he had placed upon the creature’s forehead.\n\n“How about this: I’ll help you escape, and in return, you’ll give me the stone plate,” Mister White said while looking at Han Sen."
}