{
    "chapter": 2383,
    "title": "Leading Bai Ling Shuang",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2383",
    "text": "When Bai Ling Shuang heard Han Sen claim that the road had been difficult for him, she rolled her eyes. She had seen Han Sen running casually up the mountain, making the ascent without breaking the smallest sweat. He wasn’t gasping or red in the face. It looked as if the trek hadn’t even been much of a bother.\n\nStill, Bai Ling Shuang didn’t say a word. Han Sen was carrying her up the mountain. From her perspective, it looked like Han Sen was actually leaving the staircase, walking away from the mountain and out into the open air.\n\nIn reality, they were still going up the staircase. Bai Ling Shuang only thought they were walking over open air because of the distortions within the dimension.\n\nAs he walked, Han Sen noticed Bai Wei. She was stumbling forward like the other royal children, making no progress.\n\nBecause she had gotten there quite late, the repressive power hadn’t acted on her nearly as strongly as it had the others. The fact that she could walk faster than the other children wasn’t helping, though, because she couldn’t find the path. Continuing to walk forward would be pointless.\n\n“This girl isn’t bad, and she did try to save Bao’er. Her heart is in the right place.” Han Sen sighed. He secretly cast his Dongxuan Aura and fired some power in her direction.\n\nBai Wei was struggling to walk forward, but no matter how hard she tried, she couldn’t escape that seemingly-infinite staircase. She had gotten really flustered.\n\nSuddenly, Bai Wei felt a wave of power roll across the stairs. It spread gently around her.\n\n“This is…” A strange feeling passed through Bai Wei’s heart.\n\nThe dimensional twists of the translucent trail hid the royal children from each other. Even if two people walked right beside each other, they wouldn’t see one another. Even if they were touching each other, it wouldn’t make a difference.\n\nNow, a trickle of power was flowing tantalizingly down the stairs before Bai Wei.\n\nBai Wei’s heart jumped, and she followed that strange power. The power was disappearing quickly as she chased after it. She pushed against the distortions in the dimension, trying to keep her eyes on that guiding trickle of energy.\n\nAs she walked, Bai Wei noticed that the stairs were about to vanish beneath her. The power led away from the staircase entirely and out into the sky.\n\nShe had to move quickly to keep up with her guide, so Bai Wei gritted her teeth and walked out without hesitation. Her body floated away from the mountain into open air. She didn’t fall, though. Her feet met with something, and she kept walking forward.\n\nBai Wei grinned. There had been no other path to follow, so she had chased that power. If she stepped in the wrong place, she would fall all the way back down the mountain.\n\nOn Rot Bone Mountain, even deified elites couldn’t fly well. Bai Wei was just a Duke.\n\nBai Wei had to keep up with the guiding power in order to stay on the correct path. She kept chasing that power, running as she went.\n\nHan Sen carried Bai Ling Shuang all the way to the top. Once there, he found that a mixture of princes and princesses had also made it to the peak.\n\nBai Qing Xia was there, too. He was surprised to see Han Sen come up alongside Bai Ling Shuang.\n\nHan Sen had already let go of Bai Ling Shuang, though. Aside from Prince Four and Princess Two, no one knew that Han Sen had carried Bai Ling Shuang up to the peak.\n\n“It looks like I win,” Bai Qing Xia said, as he stared at Han Sen. He thought Han Sen had just reached the top.\n\nThe other princes and princesses thought so, too. After all, the translucent trail couldn’t be ascended through pure speed. It wasn’t strange to think that Han Sen had only just arrived.\n\nBai Ling Shuang was sweating, but when she saw the five words inscribed in the knoll, she suddenly felt wide awake. A rush of joy poured through her.\n\nShe didn’t possess the Kingese Ao or Gu, so making her way up the translucent trail would have been too difficult for her. Bai Qing Xia had the word Ao, though, so it was much easier for him to reach the top. Physical strength didn’t matter much in this contest.\n\n“Is this the Proud Bone Swordmind from Mad Sword?” Bai Ling Shuang looked at the five words, “Pride and bones are made.” She looked so happy as she mumbled to herself.\n\nHan Sen was confused. He had never heard of a king called Mad Sword. There were some God Swords and even Holy Swords, but a title like Mad Sword didn’t seem worthy of a king.\n\nBai Qing Xia picked up where Bai Ling Shuang had left off. “Mad Sword was born crippled. He didn’t have a king body, and so he was bullied severely. But in the end, he used his sword to become deified. He might not have had a king body, but he prevailed over many in the Extreme King. Even deified elites with powerful king bodies lost to his sword. He wasn’t a ruler of our people, but he could be considered a king without a crown amongst the Extreme King. Our race has had many swordsmen in its time, but none are as worthy of respect as Mad Sword.”\n\nHan Sen receded into thought. “I didn’t know the Extreme King had someone that strong amongst them. How come I have never heard of it until now?”\n\nBai Qing Xia had only just finished when a princess, who wasn’t too far away, looked over at him with disdain. “Mad Sword’s power matters little. No glorification can rinse away the dirt. He is not worthy of admiration.”\n\nBai Qing Xia and Bai Ling Shuang frowned at the princess. After seeing their faces, she turned away. They avoided all contact with her.\n\nHan Sen wasn’t interested in that princess, either. He wanted to know Mad Sword’s story. Clearly, Mad Sword must have been very different from the majority of the Extreme King. Even his title sounded rather taboo amongst them.\n\nIf Han Sen had actually been Bai Yi, he would have known about Mad Sword. He wasn’t Bai Yi, though, and so he couldn’t simply ask.\n\nWhile they were talking, someone else approached. It was Bai Wei. She was dripping with sweat after finally reaching the top. Her body was shivering, and she could barely stand. She was obviously fighting to hold herself together.\n\nAlthough Han Sen had sent power to guide her, she was too weak. Even if she knew the way, reaching the peak as a Duke was monumentally difficult.\n\nMany of the royal children looked stunned when they saw Bai Wei at the top. In the long history of the Extreme King, only a few Dukes had ever made it this far.\n\nBai Wei looked at the princes and princesses. She wanted to know who left behind the power that guided her up, but she was unable to learn anything. No one there was using that power.\n\nWhen she looked at Han Sen, though, her mood turned to foul anger. She snarled slightly as she stared at him.\n\nShe was still bitter about Bai Yi’s consumption of Han Sen. She didn’t think that power belonged to him.\n\nBai Wei looked around, but she still couldn’t tell which of them had left the power for her. She was really grateful, though. And she went to the knoll to have a look at the five words inscribed there.\n\nBai Ling Shuang and the others were all in similar shape. Hiking was a test. Mad Sword’s Proud Bone Swordmind was very beneficial. Even if they weren’t fans of the man himself, they still slavered over his swordmind.\n\nHan Sen found a seat. He wanted to watch the swordmind from the most comfortable position, but there was little for him to do other than that.\n\nIt wasn’t that Han Sen lacked talent or hadn’t practiced enough; the swordmind simply conflicted with Han Sen’s own swordmind. The two were polar opposites. There was nothing similar or compatible between them. The stronger Han Sen’s will was, the harder it would be for him to understand the Proud Bone Swordmind."
}