{
    "chapter": 1128,
    "title": "Uncle Bug",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1128",
    "text": "The man tried his hardest to kill himself, repeatedly. But each and every time, the shadow stopped him. Uncle Bug was crying again, with a face that was full of regret and pain.\n\nThe man had been savagely injured, but he couldn’t be free and allow himself to die.\n\n“Little Yan, stop this!” Uncle Bug guiltily pleaded.\n\n“What did you expect? Is this what you wanted me to become?” the man angrily responded.\n\nIn continued tears, Uncle Bug exclaimed, “I didn’t want to, but you were sick! It said it would fix you. I didn’t expect…”\n\nUncle Bug’s tears did not relent.\n\n“He fixed me, and I am not dead…” The man was laughing, but it was a laughter of hysteria. This was worse than him crying.\n\n“I am sorry,” Uncle Bug said.\n\nThe man, who was laughing like a madman, responded, “You are not! You made me suffer something that was worse than being killed.”\n\nUncle Bug grabbed his own hair, all the while crying. “If I knew this was going to happen, I wouldn’t have…”\n\nUncle Bug’s dialogue disintegrated into incoherent mumbling and babbling.\n\nThe man looked at Uncle Bug, saying, “This is my life.”\n\nHis words were coaxed with desperation and sadness. After a while, the sun began to rise. And as it did, the man said, “If you continue to believe I am your son, find someone to kill me. I would rather be dead.”\n\n“Little Yan!” Uncle Bug looked at the man in profound sadness, but as he did, the man fell to the ground.\n\nHan Sen was surprised at the sudden turn of events. He was still alive, just unconscious.\n\nUncle Bug used a bag to pick the man up, and then turned to leave the area.\n\nIf Han Sen described what had happened to someone who hadn’t seen it with their own eyes, they’d think he was off his rocker.\n\nHan Sen quickly followed after Uncle Bug to see where he was off to.\n\nHan Sen thought it might have something to do with the god that Sunset had mentioned. Perhaps by following, he could learn more and uncover the mystery at long last.\n\nUncle Bug took the man back through the forest to Nest Shelter, though. Then, he took the man to his room.\n\nHan Sen waited outside the room. It wasn’t until the next day that Uncle Bug emerged, acting as if nothing had occurred. He issued commands and went back to his usual duties, telling others to hunt and so on.\n\n“Uncle Bug, there is something I need to ask you. Privately, if I may,” Han Sen asked Uncle Bug.\n\n“There is no need for privacy. Just tell me here, and I’ll help you out.” Uncle Bug smiled, acting his usual self.\n\nBut Han Sen then implored, “I really must speak to you alone about this.”\n\nUncle Bug sighed and took Han Sen to a place outside the shelter.\n\n“Little Han, tell me what’s the matter. If it is within my capacity to help, I will,” Uncle Bug said as he lit up a cigarette.\n\n“Do you know anything about the Secret Service’s Seventh Team?” Han Sen asked.\n\nUncle Bug casually shook his head, asking, “What is that?”\n\n“Do you know Han Jinzhi?” Han Sen then asked.\n\nUncle Bug responded, “Your great-grandfather is Han Jinzhi. He must be a great man if you keep mentioning him.”\n\nHan Sen then said, “Then you must know Sunset.”\n\nUncle Bug looked at Han Sen strangely, clearly not expecting such a response. He told him, “I must be getting too old. I don’t remember a person called Sunset.”\n\n“Then you must know Little Yan,” Han Sen said.\n\nUncle Bug’s body shivered. He stiffened himself up, telling Han Sen, “I haven’t heard of anyone going by these names.”\n\n“You forgot what you wished for?” Han Sen said mockingly.\n\nAfter that, Uncle Bug’s composure changed. He suddenly looked like an angry lion, and he exclaimed, “Who are you?!”\n\nHan Sen could feel Uncle Bug’s lifeforce, and he could tell the man was the greatest and most powerful surpasser he had ever known.\n\nSurpassers these days never came close to the heights of Uncle Bug.\n\nAt his age, it was a surprise to see him have such a high fitness. Humans did not max out their genes back when Uncle Bug had been in his prime, so it was quite the surprise to see how powerful the old man had become.\n\n“Do you really not know who I am? I told you the name of my great-grandfather.” Han Sen looked at Uncle Bug.\n\n“That is impossible. He cannot have had an heir,” Uncle Bug said.\n\n“Why not? Everyone can make babies,” Han Sen casually responded.\n\n“But he…” Uncle Bug suddenly stopped. His rage returned before he spoke again, and he blurted out, “How dare you try and trick me. I asked you a question first. Who are you?! If you don’t tell me, you’ll have to excuse my ruthless actions.”"
}