{
    "chapter": 2687,
    "title": "Apollo Set",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2687",
    "text": "Not even an elite like Shale could block knife lights that appeared to have been generated by everything in the universe. The demonic lion surged toward Han Sen, determined to push through the tide of knife lights. He was breaking through the rush of attacks like a dam against a flood.\n\n“Impossible… Shale cannot lose a fight like this… No, no, no!” Liyu Zhen and Li Xue Cheng’s jaws were clenched and their nostrils flared. And then, their mouths fell open. They were too stunned by the sight before them to even make a noise. In their hearts, however, torrential tears of sadness were coming down.\n\nBut their inner cries wouldn’t be able to save Shale. As the knife lights flooded into Shale, appearing relentlessly from the sky and ground, the demonic lion began to break. Shale’s body couldn’t take it anymore. The moment the demonic lion broke, the substance chains across Shale’s body were shattered by the flood. The knife lights began to slash directly across his body, and his deified form was dealt a river of wounds.\n\nThe knife lights were only half-deified in level. One slash, ten slashes, even a hundred slashes, wouldn’t have been enough to damage the deified Shale.\n\nBut these knife lights were beyond counting. Their numbers appeared infinite, and as they attacked in ceaseless succession, not even Shale’s deified form was able to withstand the stream.\n\nOf course, this was all because of Shale’s deified body wasn’t strong enough. If he had achieved true invincibility, it wouldn’t have mattered how many knife lights were thrown at him. Regrettably, his body wasn’t that strong yet.\n\nSeeing Shale’s body inside that flood of attacks, with blood flying everywhere, Liyu Zhen and Li Xue Cheng almost collapsed to the floor. Open Sky Elder and the others, however, were in sheer euphoria.\n\nExquisite and Li Keer were immeasurably happy, too. They could feel Han Sen’s knifemind with Under the Sky in operation. By watching this fight, they had been able to learn Under the Sky knife skills.\n\nUltimately, that scary flood of knife lights hadn’t come directly from the sky or the ground. Not even a little. It was all a knife light Han Sen had already cast. After it broke, it melted into the sky, the earth, everything there was. He used the powers of the sky and the earth to reconstitute that energy into knife lights.\n\nThis was similar to knife silks but even better. The sky and the ground themselves had become carriers for the knife lights. After the knife lights were generated, they appeared in every element imaginable. They had become far scarier than the pure knife silks that Han Sen had used for so long.\n\nThe knife lights that broke and entered water, after they regenerated to become knife lights again, would carry the water element with them. When the knife lights melted into the soil of the mountains, after they generated again, they would carry the elements of the mountains.\n\nBut Under the Sky still relied on Han Sen’s own powers. It had taken a long time for Han Sen to accumulate enough power in his surroundings to pull off this attack. The more Han Sen used knife lights during a fight, the stronger the knife light flood would be when he finally activated it.\n\nThat meant this skill required a lot of time to prepare. Otherwise, he wouldn’t have been able to unleash such a vast amount of power.\n\n“Under the Sky is decent. With this skill, Han Sen can fight others of the same level or a higher level. If he can repeat this whenever he wishes, he will be an unbreakable combatant. If he can last a long time, then when Under the Sky explodes, others of the same level would never be able to block this knife light torrent that is absolutely everywhere. It was unfortunate Shale ended up going against Han Sen,” Li Keer concluded with a sigh, looking at Shale. His body was out of his control. The endless flood of knife lights were tossing his body away like flotsam on the ocean.\n\n“To beat Han Sen, he would have had to defeat him quickly. Han Sen’s enemies will have to defeat or suppress him in a short amount of time, lest they end up losing,” Exquisite said.\n\n“His use of Under the Sky is excellent. It allowed him to completely dominate Shale, right at the end. It looks like I will have to focus on training Shale against this power. When they fight again, Han Sen will not be able to use Under the Sky knife anymore,” Li Chun Qiu coldly said. He didn’t get emotional about Shale’s failure. Instead, he analyzed precisely why Shale was losing, and how he could further perfect Shale as a warrior.\n\nHan Sen slashed and then stopped. He didn’t allow the flood of knife lights to rip Shale entirely to shreds. He raised his hands, and the knife lights everywhere shattered. They rose and disappeared. The valley was returned to the sound of silence.\n\n“You win.” Shale stood up. He could still fight, but he was now willing to concede to Han Sen. After standing up, he teleported to someplace beyond the seal.\n\nHe knew Han Sen had dismissed the attack halfway instead of using its full power. If Shale had taken the full force of those knife lights, he would have been torn to pieces. So, continuing to struggle was pointless.\n\nLi Xue Cheng and Liyu Zhen were kneeling on the ground. Their eyes were frozen, and they could scarcely believe the result. They couldn’t accept it.\n\n“What do we do? We have to pay back a huge debt, and the Open Sky jewelry…” The minds of the pair were struggling to work.\n\n“Just one knife skill was enough to mimic Sky and Men Combined Together. This Han Sen is fantastic material. It is a shame he is just a silkworm and not a genuine heir of the Very High.” Open Sky Elder was delighted that he had won the bet, but he couldn’t help but feel that Han Sen’s low status was a terrible shame.\n\nAfter the fight with Shale, no other silkworm dared challenge Han Sen. They fought each other and eventually departed the valley. In the end, only Han Sen remained inside the seal. When all the others had left, the seal was lifted.\n\nAt the same time, a square, bronze chest appeared. It descended from the sky, carried by warm light, to land beside Han Sen.\n\nHan Sen grabbed the bronze chest and opened it. Inside were the seven pieces that comprised the Apollo Set.\n\nHan Sen didn’t bother pretending to be humble about all this. He put on the Apollo Set immediately. There was a helmet, an upper chest piece, a lower torso piece, a pair of gauntlets, and a pair of battle boots. Seven deified treasures now clad his body. The chrome of the armor made Han Sen look like a mirror man.\n\nWhen Han Sen put on the last piece of the armor, a giant, silver pair of wings appeared on Han Sen’s back. They really did make him look like Apollo, shining in the sky.\n\nMany of the silkworms looked at Han Sen with great envy, but Han Sen actually had the audacity to complain. “What kind of crap is this Apollo Set? It’s like I’m wearing a light bulb. This makes me stick out like a sore thumb. I’ll be brighter than the sun itself. The enemy will see me coming from tens of thousands of miles away. It’s not like I’ll be able to hide in the bushes when I’m wearing this thing. It’s like a giant, bright, neon target.”\n\nAlthough Han Sen was complaining, the Apollo Set did exude a powerful aura. That made Han Sen very happy.\n\nHis half-deified power wasn’t enough to activate the full might of the Apollo Set just yet, but it would still complement his current standing. It could already generate a few minor substance chains. And that was especially true of the Apollo Wings that had appeared behind him. They gave Han Sen a speed that could rival a primitive deified. He might have even been a bit faster than Shale.\n\nHan Sen spread the Apollo Wings, then teleported next to Li Keer and Exquisite. His speed was far greater than it had been before.\n\n“This is similar to the power I gain when I use the peacock soul robe. The Apollo Wings don’t give me as much speed as the peacock soul robe, but the power of the Apollo Set isn’t fully activated yet. Once it is used to its full potential, I might be able to fight larva deifieds like Meng Lie.” Han Sen admired his Apollo Set. He really loved it."
}