{
    "chapter": 1887,
    "title": "Give You a Chance",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1887",
    "text": "“Did you really just say that? Are you sick?” Guna asked, lifting her lips in a sneer.\n\nGuya looked at Han Sen and slowly said, “Han Sen, you are special. That is why I have given you this opportunity. You have the chance to be friends with the Gana. This is Purgatory Heaven; unless a deified elite appears, no one can challenge my will. Buddha King is a good example for you to follow. Or do you not want to end up like him?”\n\nHan Sen nodded and said, “And I thought you were smart. I’m the one giving you a chance here. You and Guna can become my secretaries and nothing more. Don’t misunderstand that.”\n\n“This *sshole has lost his marbles. Let’s lock him up,” Guna told the others.\n\nGuya used her gem to control the clouds again. But it didn’t seem like the clouds could be used to capture people unless they jumped off the platform. Guya had erased Han Sen’s cloud, since she expected him to kill the Kings. In order for her to gain control of him, he would have to go to the cloud first.\n\nA few Gana Viscounts rushed towards Han Sen, hoping to capture him quickly.\n\nThe Kings that had been locked up now watched Han Sen. They wondered what he was planning.\n\nIn this place, not even the Kings could fight against the Gana. Unless they had a deified elite using deified items, the Gana were practically invincible. The Kings could not fight them, and Han Sen was a Baron.\n\nIcebird Duke could not fathom what sort of trick Han Sen was looking to play. Killing the Kings would have guaranteed Han Sen’s survival. But he hadn’t taken the offer, and now things were uncertain.\n\nWhile Han Sen had pulled off unbelievable performances in battle elsewhere, Purgatory Heaven was different. Not even Icebird Duke thought he could fight back here. Still, she hoped he’d pull something off. If there was one thing Icebird Duke did know about Han Sen, it was that he wasn’t crazy.\n\nSeeing a few Viscounts rapidly approaching, Han Sen had yet to move a muscle. Eventually, he drew out his Knife Blank.\n\nThe Gana Viscounts weren’t very concerned about that, though. Thus far, only the Gana had been able to use items of power there.\n\nBoom!\n\nA scary presence exploded out of Han Sen, as if it was breaking the earth. He was like a beast, laying eyes on heaven. Teeth Knife Knifemind!” Gold Jade King and Icebird Duke both squealed.\n\nThe Teeth Knife of the Rebate was quite famous. And even so, not many people were able to practice it. Even fewer could make proper use of it out in the field.\n\nHan Sen was an outsider. It was absolutely shocking that he could use Teeth powers, almost unbelievable.\n\nBut right now, that was not the primary concern. It wasn’t just that he was using Teeth Knife Knifemind; it was amazing that he had been able to summon power at all, while else was suppressed by the deified rules that governed the place.\n\nGold Jade King and the others had very strong wills, but in Purgatory Heaven, they were unable to release it. Han Sen’s Knifemind could be used to its full extent, without suffering from the hampering and suppression of Purgatory Heaven. But this was because Han Sen’s Knifemind had reached the level of Purgatory Heaven. That was the reason it was not suppressed.\n\nBut Han Sen was just a Baron. How was it possible for him to have such an experienced Knifemind?\n\nAll the Nobles were in shock. It made some people jump to the conclusion that Han Sen himself was a deified elite in disguise. Aside from deified elites, who could reveal such a formidable Knifemind, here of all places?\n\n“What is this? How long has he been practicing Teeth Knife? How is it possible for him to have learned the Teeth Knife Knifemind? This mind, if I am not mistaken, is greater than the queen’s own.” Icebird Duke could scarcely believe the current spectacle.\n\nBut there it was, Han Sen and his Knifemind. He was nothing short of a monster. The Gana Viscounts suddenly started to fall back, looking extremely pale.\n\nA deified Knifemind was a very cruel thing, and it could break a person’s will simply with the weight of its presence.\n\nBut a Knifemind was just a Knifemind, and Han Sen did not have a deified body. If an elder of the Rebate was present, the Knifemind could have been used to kill all the Gana a long time ago.\n\nGuna and Guya looked at Han Sen in shock. The Knifemind they were witnessing was rendering them speechless.\n\n“Is he deified?” Guna was extremely shocked.\n\n“Impossible! I haven’t a clue why he has this Knifemind, but he is not deified. Why are you all still standing there? Go and get him! This heaven belongs to the Gana. It is a sanctuary built specifically for us. We’re safe here!” Guya was actually quite frightened by what was going on. Still, she managed to keep herself under control and issue commands, telling her people to snatch Han Sen.\n\nIn Heaven, unless the Gana were killed, their wounds would seal up and heal at a tremendously fast pace. They were pretty much almost immortal, in many regards.\n\nSeeing the Gana Nobles continue to advance, Han Sen said, “I don’t want to hurt any of you, so why are you pushing me to do just that?”\n\nHan Sen was depressed. He had planned to use his powerful Knifemind to bluff his enemies. But evidently, Guya was too smart for that. Han Sen’s plans had fallen apart.\n\nA Knifemind was just a Knifemind, after all. Using it with knife skills was very powerful, but a Knifemind on its own did nothing. Aside from the Knife Blank and the deified Knifemind, Han Sen’s power was under a big strain.\n\nGuya did not show any sign of relenting, and she continued to command her Gana troops to apprehend Han Sen.\n\n“In that case, I must resort to Plan B.” Han Sen’s eyes began to shine, and soon after, the light quickly spread to the rest of his body.\n\nHan Sen’s Plan B was always the same: he would assume the identity of Dollar. He activated his super king spirit.\n\nHis black hair became sparklingly white. It grew quickly, becoming a long white stream of hair. His body glowed with holy light.\n\nAs the light shone from him, his body did not look real. Instead, he looked like a burned plate of steel. He was like a half-transparent god. Incredible power surged out of him. Everyone was in shock. They watched the god-like body approach.\n\n“He really can use his powers in Heaven!” Guna looked stunned. She took a few steps back.\n\nA few Viscounts were directly before Han Sen right now. They swung their swords and arms towards him. They were afraid. They had originally planned to take him alive, but now they were keen to wave their swords instead.\n\nWhen the swordlights came against Han Sen, it was like they were hitting nothing. They didn’t hurt Han Sen at all."
}