{
    "chapter": 157,
    "title": "Kill Them All",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_157",
    "text": "The gorgeous killing feast had just begun.\n\nSilver Killer was moving quickly with the powerful Destroyer behind it. The crazy killing made one warframe after another explode. People were almost trembling watching the fragments of warframes sent in the air by gunfire.\n\nScattered attacks were aiming at Silver Killer, which seemed to be able to predict and avoid all the trajectory of the gunfire. It not only avoided all the attacks, but was also rapidly approaching the warframe crowd.\n\n\"Fire! Do not let him approach.\"\n\n\"Damn! Do not fire. Are you all stupid?\"\n\n\"Everyone, follow my command.\"\n\n\"Kill that bastard.\"\n\n\"Didn’t you hear me say ‘follow my command’?\"\n\n...\n\nUsing the fairy queen, Han Sen could see all the warframes and the movements of their guns. With the strong horsepower of Silver Killer and Han Sen’s excellent operation, he managed to avoid all the attacks.\n\nNo. Rather, Han Sen was deliberately leading the opponents to attack where he wanted.\n\nIf the opponents was a real army and there was a real commander, Han Sen and Silver Killer would have been killed a million times.\n\nBut luckily, they were but a group of students who had no real experience at war. In addition, they did not come from the same society and many never even worked together before.\n\nBang!\n\nDestroyer was finally finished off. Wang Mengmeng's level of operation was really bad. All she could do was to stand the Destroyer still and use its automatic firing system.\n\nBut that was enough for Han Sen. When the Destroyer was wrecked, Han Sen was already less than 30 feet away from his opponents.\n\nBang!\n\nThe particle submachine gun ejected bullets, which penetrated and disabled a warframe. Then Silver Killer waltzed away from the intense gunfire and accelerated into the crowd.\n\nThe real killing officially started.\n\nSilver Killer was like an excellent hunter in the forest, hunting the other warframes as it wished.\n\nBang!\n\nWith each of the gun shot, one warframe would be disabled or hit in the engine.\n\nLike a devil, Silver Killer was harvesting the lives of the warframes.\n\n\"Do not let him run!\"\n\n\"Damn, who hit me? Do not shoot if you don’t know how.\"\n\n\"Are you all idiots? Mover over.\"\n\n\"You are the idiot. Are you blind?\"\n\n\"I asked you to follow my command!\"\n\n\"Those bastards are unreliable. Let’s go near him and get it over with.\"\n\n\"Yes. Go!\"\n\n...\n\nSilver Killer’s killed like Satin and moved like a ghost. The other warframes were moving in a clumsy way like heavy warframes in comparison.\n\nPeople who were watching the game were dumbfounded. The stadium was quiet, as they were shocked how incredible Silver Killer was acting.\n\nIt was a killing machine in its true sense. Each of its bullets could hit the vital part with unbelievable accuracy. It was breathtaking to see someone capable of destroying one warframe with each shot while backing off and avoiding all the gunfire.\n\nThe Skynet viewers were also silent. There were few comments. Only Fang Mingquan’s voice was non-stop.\n\n\"Silver Killer... again...\"\n\n\"Beautiful shooting... beautiful movement...\"\n\n\"Impeccable... impeccable operation and tactics... This is the star in the Alliance... I don’t have words for his gorgeous operation...\"\n\n\"Well-done...beautiful...\"\n\n\"This is a wonderful performance... Han Sen and his Silver Killer showed us how a warframe can be operated...\"\n\n\"In the next few years, Blackhawk will occupy an important position in the Military Academy League Game, just because there is this one person. With him, Blackhawk will be the undisputed champion!\"\n\nBoom!\n\nA warframe finally approached Silver Killer, which suddenly threw the submachine gun in the air and drew a laser sword from its back, cutting the offending warframe in half. The it still had time to put the sword back and catch the gun, shooting another approaching warframe in the energy tank.\n\n\"My God, this guy must be an alien,\" Fang Mingquan roared excitedly, using all his enthusiasm and strength. This was his job, his favorite job.\n\n\"F*#king A!\"\n\n\"Who said Silver Killer was the only reason for his victory. He is a master himself.\"\n\n\"Ha-ha, what a victory! Starry Group will be humiliated. They tried to set him up and still failed.\"\n\n\"A star in the Military Academy League Game!\"\n\n\"Wow! Is it a warframe veteran playing actually?\"\n\n\"No way! The players are all sitting inside the holographic simulation machine.\"\n\n\"Really cool! I want to see the sponsors’ expressions.\"\n\n\"Silver Killer is a very high-end warframe. Ordinary warframes could not go like that. Their power and flexibility could not reach this level.\"\n\n\"I also want to know where to buy Silver Killer.\"\n\nThe Skynet was exploding. Fang Mingquan’s live was being watched by more than 30 million people. Many people who were watching other divisions’ games also switched to this show after hearing about this match.\n\n\"Wow, you are sure this is not an official commercial of that warframe?\"\n\n\"So hot!\"\n\n\"That is the Silver Killer! Awesome.\"\n\nAt this time, in the monitoring room, Zhao Nengtiam was sizzling with anger. His fingers were squeezing his tea cup so hard that they became pale.\n\n\"Bastard! Useless crap!\" Zhao Nengtian smashed the cup in wrath, his body shaking."
}