{
    "chapter": 1832,
    "title": "Evil Knife",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1832",
    "text": "The scimitar was activated. It didn’t roar like Dragon’s Back did. There was not even a wheeze. There was no light shining into the sky; all that could be seen was a dark purple aura.\n\nBuzz!\n\nEveryone’s knives leaped out of their scabbards at about half-length, and they all rattled and shook.\n\nIt didn’t feel as if the knives were responding to Han Sen out of respect; it was as if the knives were all alarmed. They were like dogs, jerking to their feet to scan the area out of fear of something dangerous. It was instinct.\n\nBuzz!\n\nThe knife on Black-Moon King’s belt was halfway out of its sheath, and then, it suddenly made a cruel noise. It was the sound a beast might make when encountering another that was encroaching on its turf.\n\nSoon after, Black-Moon King’s knife was not doing that solo. The knives of the other Kings started to appear hostile, too, as they all looked at Han Sen’s new blade.\n\nThe blades didn’t appear afraid; instead, they just looked very hostile.\n\nMany Nobles were shocked by this. They looked at Black-Moon King, because he knew more of the knives than any other Rebate. Black-Moon King fondled his knife, and eventually it calmed down and retreated into its scabbard. Then, he told Han Sen, “It’s okay. But put your knife away now.”\n\nHan Sen pulled back the power he had put into the knife to activate it. He was still holding his knife, though, because he had no scabbard for it.\n\nBlack-Moon King looked at the scimitar and slowly said, “This is a King class weapon, but it is too brutal. I am afraid bad things might occur if you were to use it Be careful in your handling of this.”\n\nWhen people heard that this was a King class weapon, they were shocked. Two people had found a King class weapon this time.\n\nThe other Barons that had left Knife Grave earlier looked at them jealously. The luckiest amongst those was a Marquis. No one else had managed to even get a Duke class knife. Han Sen and Black Steel had drawn out two King class weapons, and the others were pretty sore about it.\n\n“My King, why would you regard this as unlucky?” Han Sen asked. He believed in these sorts of superstitions.\n\nHan Sen hadn’t believed in this sort of thing originally, but after meeting Wang Yuhang and Cheap Sheep, his opinions had certainly changed.\n\nBlack-Moon King quietly said, “This knife is a murder weapon. It has a murderous presence. If it was an ordinary knife, it all depends on how the master uses it. But this knife has too much of an evil aura of its own. If someone tries to use it, and fails to command that evil spirit, they will be infected and consumed by its nature. The wielder might be drawn to doing unusual things.”\n\n“By the way, what will you name the blade?” Black-Moon King asked.\n\n“Its name is Ghost Teeth.” When Han Sen activated the knife, a mind or presence came from the blade, telling him its name.\n\nBlack-Moon King nodded and said, “If you can activate its power and learn its name, that means you have been approved. Perhaps its evil will have less of an effect on you.”\n\nYisha and Moon-Wheel King were both looking at Han Sen’s Ghost Teeth knife.\n\nMoon-Wheel King frowned and spoke to himself. “That is an evil knife. I’m not sure if it’ll be a good or bad thing for us, in the long run.”\n\nYisha frowned, as well. She had studied Teeth Knife, and she could feel that Ghost Teeth had a connection or matching with Teeth Knife. If Han Sen used Ghost Teeth with Teeth Knife, the power would be stronger than if he was to use another knife. It should have been a good thing, for Han Sen to have this knife.\n\nBut that knife itself certainly felt too evil. Han Sen’s level was too low for it, and she was afraid that Han Sen might not be able to handle the evil power.\n\nThere was something else that was worrying her, too. She had taught Han Sen Teeth Knight, but Teeth Knife was a private skill of the Rebate. It was created by a Rebate elder, after all. It was perfect for the body of a Rebate, but even so, not many of the Rebate were able to practice it well-enough to command its true power.\n\nHan Sen was an outsider, and while it wasn’t hard to learn an ordinary skill, operating Teeth powers should have been close to impossible for him.\n\nWithout Teeth power to suppress that knife, the evilness would undoubtedly grow stronger. It was difficult to say how it might ultimately affect Han Sen.\n\nHan Sen heard Moon-Wheel King speak, and he looked at the Ghost Teeth knife and noticed nothing evil about it himself.\n\n“Why do you have a knife on your back?” Black-Moon King saw the Knife Blank on Han Sen’s back. He could only see a part of it, but he assumed it was a knife.\n\nWhen Black-Moon King said that, everyone was shocked. Everyone knew you could only bring one knife out. If you tried to bring two, you wouldn’t be allowed out of the tunnel. But there Han Sen was, with two.\n\nAt the same time, everyone craned their necks to get a glimpse of the Knife Blank on his back.\n\n“It’s not a knife. It’s a Knife Blank,” Han Sen said, pulling it out and holding it in his hands.\n\nEveryone was shocked. It was a Knife Blank shaped like a steel rod. It was not a knife, and they had never heard of something like this before.\n\nPeople usually brought out simple knives when coming out of Knife Grave. They hadn’t seen a Knife Blank before.\n\n“It doesn’t count as a knife? Is that why it was able to exit, as well?”\n\n“What is that thing for? Planet Knife Grave’s knives have a life of their own… You can’t reforge that.”\n\n“The Black family used to repair broken weaponry, but they didn’t work successfully. And knives that had a life, would lose it by the time their work was finished. They would end up like normal knives.”\n\n“If it is a Knife Blank, it can become a knife, right?”\n\nA duke that was a friend of Black-Moon King said, “My King, do you think this thing can be forged into a knife?”\n\nBlack-Moon King looked at the knife and did not answer him. He looked glum and spoke to Han Sen. “Let me take a look at this Knife Blank.”\n\nHan Sen passed it to him without hesitation. Black-Moon King looked serious as he took the knife. He inspected every inch of it, looking very concerned.\n\nOther Nobles could see this was strange. They all held their breaths, seeing Black-Moon keenly inspect the Knife Blank. They wondered what he could see in it."
}