{
    "chapter": 2588,
    "title": "The Purple Copper Jian That Cannot Be Gotten Rid of",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2588",
    "text": "1\n\n\n\n“This must be happening because of the jian.” Han Sen gritted his teeth, but no matter how long he spent trying to find out what the precise problem was, he couldn’t figure it out. That made Han Sen feel very unsettled.\n\nMost of Han Sen’s discomfort was because of what had happened to Ning Yue. The man had been ruined by the green sword that he found. What happened to him was scary, and Han Sen was now worried that the purple copper jian would ruin him as well.\n\nNing Yue’s personality and body had been wholly changed. He now seemed almost entirely like a woman. Han Sen was afraid he would end up transformed into a purple fox or something. He wasn’t going to let that happen.\n\nHan Sen suddenly thought of the white tiger’s face and why it looked so familiar. He realized that he had recognized the expression; the white tiger looked at him in the same way he looked at Ning Yue.\n\n“That d*mn tiger knew something like this was going to happen.” Han Sen felt so angry.\n\nHan Sen couldn’t figure out a solution to this dilemma, though. Han Sen then used his super god spirit body. He wanted to use the invincible powers of the super god spirit body to rid himself of any debilitating effects.\n\nAfter Han Sen used his super god spirit body, the fox ears and tail suddenly burned away. It made Han Sen let out a big sigh of relief.\n\n“It is lucky I have a super god spirit body. I won’t end up like Ning Yue with this,” Han Sen said, pounding his chest.\n\nWhen Ji Yanran and Ling’er saw that Han Sen’s fox tail and ears were gone, they looked disappointed. It was like they had lost their favorite toy.\n\nHan Sen didn’t care about their disappointment, though. He didn’t like looking weird. After deactivating the super god spirit body, he stroked his head and touched his behind. Everything was okay now. He felt much safer.\n\nBut Han Sen’s joy was short-lived. When he went for a walk with Ling’er later that day, the people in the streets started pointing at him. One girl giggled hysterically. A worried sensation began to gnaw at Han Sen’s stomach.\n\nHe touched his head, and he realized that the fox ears had suddenly grown back. The tail was back as well, lifting his clothes awkwardly.\n\nHan Sen’s face changed. Ling’er, on the other hand, was happy. She sat on Han Sen’s shoulder, playing with the ears with one in each hand. She kept rubbing them, looking delighted.\n\nHan Sen quickly flew to a place with no one around. And then, he teleported home. He used his super god spirit body to rid himself of the queer physical attributes.\n\nWithout hesitation, Han Sen immediately teleported back to the geno universe. He threw the purple copper jian into the black sea. Once he made sure that the purple copper jian had sunk below the waves, he returned to the sanctuaries.\n\nNot long after, Han Sen noticed that the purple copper jian was attached to the belt on his waist.\n\n“How is that possible?” Han Sen was shocked.\n\nHe was now in the sanctuaries, and yet the purple copper jian had somehow reappeared next to him. It was unbelievable.\n\nThe purple copper jian had only been with him for a matter of seconds, and already his ears and tail were growing again.\n\nHan Sen tried to get rid of the jian many times. However, even if he placed the weapon on a planet inside the core area, he wouldn’t be rid of it for long. In a short amount of time, it would reappear next to him.\n\nNow Han Sen knew he had suffered a misfortune that was similar to Ning Yue’s. A weird weapon was stuck with him, and there was nothing he could do to get rid of it.\n\nNow Han Sen regretted his recent choices. He shouldn’t have taken the purple copper jian. If he had known this was going to happen, he would have allowed Gu Qingcheng or Elysian Moon to take and wield it. It was more acceptable for a woman to have fox ears and a tail.\n\nIt was too late to think of that now, though. When they saw Han Sen, Gu Qingcheng and Elysian Moon tried their best not to laugh. They pretended there was nothing amiss, but Han Sen could sense that they were laughing incredibly hard on the inside.\n\n“Can anyone tell me what this is?” Han Sen asked, throwing the purple copper jian in front of the white tiger.\n\n“Meow,” the white tiger said. It smiled with its moon-like eyes.\n\nHan Sen didn’t speak the language of beasts, but he could tell it was laughing.\n\n“F*ck you. Tell me now, what is this? Tell me how to get rid of it. If you don’t, I’ll skin you alive,” Han Sen threatened the white tiger, grabbing it angrily.\n\nThe white tiger mewed a little, but Han Sen didn’t understand what it was trying to tell him. When Han Sen let the creature go, it hurriedly disappeared amidst the rocks.\n\nHan Sen couldn’t do anything. He made many attempts to separate himself from the weapon, but he couldn’t be free of it.\n\nBut fortunately, the situation didn’t become any worse. Aside from the fox ears on his head and the fox tail on his butt, there was nothing else wrong with him.\n\nThe only silver lining in all this was that the head-mushrooms were no longer an issue for Han Sen. When the fox tail and ears grew, the mushroom on his head didn’t.\n\n“The mushrooms are gone, but now I have the ears to contend with. What do these things think my brain is? A hotel?” Han Sen was very angry, but he had no way of resolving the matter.\n\n“Dad, you look good like this.” Bao’er tilted her head to look at Han Sen.\n\n“I look good, my *ss.” Han Sen grumbled, but he had no choice but to accept it. He couldn’t keep on using his super god spirit body every five minutes.\n\n“You’ll get used to it. That is what happened to me,” Ning Yue said quietly.\n\nHan Sen looked over at Ning Yue’s girly appearance. He felt a chill as he thought, “No way. I must get rid of this crap! I can’t end up like Ning Yue.”\n\nDespite Han Sen’s determination, reality seemed set on disappointing him. The real world was cruel. Han Sen used many methods to try to free himself from the fox ears and tail, but nothing seemed to work.\n\nThat day, Han Sen ransacked his mind for ideas on how to get rid of his fox-like features. Suddenly, he saw a strong shift in the fabric of space. A scary purple knife air broke through the mist and cut through the air around him.\n\n“Teeth power… is that…” Seeing that knife air, Han Sen was shocked. Only one other person could use Teeth power in such a frightening way.\n\nA second after the display of knife air, Han Sen saw someone drop through the air to land on the island. That person was clad in purple armor. It was Yisha, and as she landed in a crouch, she looked like a bad*ss.\n\n“Teacher!” Han Sen was so happy. He never expected to see Yisha there.\n\n“There is no time. Follow me!” Yisha said coldly. Her face didn’t show much in the way of emotion.\n\nBut Han Sen knew that it must have taken a lot of effort for Yisha to come all the way to get him. Han Sen could even see that Yisha’s armor was riddled with many cuts and dents. He was so touched.\n\nYisha was his teacher, but not many teachers would be willing to break into the Black Hole Spider’s belly to save their students.\n\nHan Sen quickly gathered his people to board the white whale, then he followed Yisha through the mist.\n\nYisha’s expression remained impassive. Her knife unleashed Teeth powers that spread through the endless mist. Yisha was bringing Han Sen and the others with her. They followed the crack in space that Teeth Knife created."
}