{
    "chapter": 3016,
    "title": "Shadow God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3016",
    "text": "“Sacred’s remnants, come out and die!” A godly voice echoed throughout space. The ice walls of the ice bunker’s laboratory exploded. The tools were breaking and falling apart.\n\nHan Yufei’s eyes suddenly looked cold. She was holding a scalpel. She ran out of the ice bunker’s laboratory and exited the ice bunker. She pulled a metal orb out of her pocket and threw it.\n\nThat metal orb fired out some light. The lights crossed each other to become a bai sema. It protected the ice bunker from further harm and filtered out the godly voice. The lab stopped breaking.\n\nHan Sen and Dragon Lady ran out of the ice bunker’s laboratory. The space around them turned dark. It was like the whole cold plant was disconnected from the world.\n\nIn the darkness, there was a black shadow floating in the air. It coldly looked at them. The scary god sounds came out from that shadow.\n\nBecause that shadow and darkness were combined, they were not able to see what it looked like. They only saw a pair of red, gleaming eyes. They were like two blood marks in the air.\n\nHan Sen clearly felt that the two eyes were looking at him. Besides, what the guy had said earlier was not hard to decipher. This unknown being was coming after him.\n\n“What is your name, and why have you come here?” Han Sen loudly asked.\n\n“Shadow God. I am here to scrub up the last remains of Sacred.” The powerful god voice returned. The red eyes in space looked even angrier.\n\n“It’s the Annihilation class Shadow God that has descended. It looks like the God Spirits are really afraid of Sacred Leader’s blood. They could not wait to destroy all who possessed blue blood.” Han Sen’s stern face did not change. He looked at Shadow God and coldly asked, “To clear the remnants of Sacred, shouldn’t you go after the guy who gave me blue blood instead? Are you not going to kill the one who caused this? Did you really come for me, who is a victim of the blue blood? It seems like God Spirits are just wimps that only dare to bully the weak.”\n\n“Hmph! As long as you are a remnant of Sacred, you should die,” Shadow God said. His eyes were glowing with a red light. They turned into two red beams that went straight for Han Sen. Han Sen readied himself for a fight, but Han Yufei’s body moved first. She was in front of Han Sen holding a controller. Han Yufei’s finger touched the controller twice. Suddenly, a light screen came out from the controller. The screen looked like a mirror.\n\nShadow God’s red light beam hit the screen and ricocheted back. It made Shadow God have to fire another two red lights to extinguish it.\n\n“Shadow God, I don’t care about who you want to kill,” Han Yufei coldly said. “If you dare to try and destroy my lab, you must pay the ultimate price.”\n\n“Han Yufei, this is none of your business. If you do not want to be trapped for another billion years, you should leave now.” Shadow God coldly grunted. “I want to know how you might attempt to trap me for a billion years,” Han Yufei coldly said.\n\n“If you have a death wish, I will grant it for you right now.” Shadow God’s voice coldly boomed. He glowed with a red light. This time, it did not manifest as a laser and leave him. It was like two red suns were glowing weirdly in the dark of space.\n\nHan Sen’s and Dragon Lady’s expressions changed. They had already mustered all the power they could to defend the place, but they felt as if they were losing control of their bodies. They were like wooden dolls just standing where they were.\n\nIt was not just that either. Han Sen’s body suddenly lost all control and moved. The ancient spirit seed was still on his arm, but the arm moved. His hands moved to grab his own head. He tried to twist it like he was attempting to twist his own head off. Dragon Lady was the same. She held her own head. Her neck had already been turned 90 degrees, and it was still twisting. The neck bones started to creak and groan. It was like her head was going to be ripped off at any moment. It made Dragon Lady’s mouth and nose start to bleed. Han Sen was not doing well either. He felt as if his neck was going to break soon. His jaw was almost touching his back. His face was all puffed out. He was going to explode.\n\n“I am ripping my own head off. That is a new way to die.” Han Sen mocked himself. He knew that he and Dragon Lady were being controlled by Shadow God’s power, but he just did not know what sort of power it was. How could he lose control of his body without knowing it?\n\nHan Sen was trapped by the blue blood power, so he was unable to fight back unless he used his Super God Spirit more or Blood-Pulse Sutra to activate the blue blood power. Aside from that, there was nothing he could do.\n\nPang!\n\nWhile Han Sen wondered about which power he should use, he suddenly saw Han Yufei’s hands control the controller to bounce back a beam of light. That beam of light went three feet and spread. It turned into a light umbrella.\n\nHan Yufei pressed the button on the controller that had become an umbrella. The light umbrella suddenly turned black. She placed it over their heads and blocked Shadow God’s red light influence.\n\nHan Sen and Dragon Lady let out a long sigh. They had regained control of their bodies.\n\nHan Sen was still moving his neck, which was in pain, as he asked. “What is that red light power?”\n\n“The red light was just his help. His real power is that.” Han Yufei pointed at the floor.\n\nHan Sen looked and saw nothing on the floor. They were standing atop the ice bunker. There was snow on it.\n\nHan Sen suddenly understood. Han Yufei was talking about the shadow. When the red light shone, Han Yufei’s black umbrella created a black shadow. It covered Han Sen in its shadow.\n\n“Do you think this can block my Shadow God power?” Shadow God coldly asked. His eyes were glowing with red light. It made the shadow around become clearer.\n\nHan Sen quickly discovered that the umbrella in Han Yufei’s hands was shaking. It looked as if it was going to get blown away any second. Han Yufei slightly frowned. She wanted to do something, but she heard a “ding-dong” sound come out from the dark of space. It was like many bells were tolling. Han Sen and the others immediately saw a purple light emerge from the dark of space. Ten of those lights were like a real dragon pulling a copper carriage. It was like the sky and earth had a line of light.\n\n“This is… Purple Fight’s bronze carriage.” Han Sen looked at it. He noticed where the car was from. He had been inside Purple Fight’s eye once upon a time, sitting inside that bronze car.\n\nThe cloud dragons were pulling the car to a point above the ice bunker laboratory. The entire ice bunker laboratory was covered by the shadows of the car and cloud dragons.\n\nThere was a sudden “tzi-ah” noise. The bronze car’s car door opened. Purple Fight walked out. He looked at Shadow God, who was in the dark."
}