{
    "chapter": 1174,
    "title": "Passing the Test",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1174",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“How is that possible?” Dry Bone King appeared to be suffering rigor mortis. He was unable to move, frozen through sheer disbelief.\n\nWhen he had struck the wooden fish the ninth time, Han Sen looked damaged and under much duress. But when he was subjected to the tenth and final, most brutal pounding of all, he looked fine. He was unbroken, as Dry Bone King had not expected him to be.\n\nFrom the audience seats, Qiu Ping felt happiness in a way he hadn’t for a long time. The woman, on the other hand, was at a loss for words.\n\nHan Sen looked at Dry Bone King happily. He had managed to control the pumping of his heart, making it move in rhythm with the beat. With the power that flowed through Han Sen’s body, his blood roared through his veins with the freedom and ferocity of a grand waterfall. His blood vessels had almost been unable to take it.\n\nHe came very close to failing. With Curse of Immortality reinforcing his heart and blood vessels, he was able to inch his way over the threshold for withstanding Dry Bone King’s wretched musical attack.\n\nHan Sen knew he couldn’t listen to it anymore, since further duress could make his heart fail. He had to stand up and take advantage of everyone’s shock to attack. He did this, though, thinking that the following strikes would continue to increase in power. He didn’t know Dry Bone King had capped out on the tenth.\n\nHan Sen redeployed his phoenix techniques and took off into the sky, speeding around Dry Bone King like a spitfire in the heat of battle.\n\nDry Bone King frowned. He evaded Han Sen’s attack and beat the heartbone once more.\n\nDong!\n\nHan Sen’s heart was like a fully-inflated balloon, but much to his surprise and delight, the power released by Dry Bone King was no stronger than what he had previously endured.\n\nDry Bone King pounded the heartbone again. If it was any other person going up against Dry Bone King, their hearts wouldn’t be able to deal with the cruel sound of the wooden fish. They’d be unable to fight, and perhaps even die on the spot with a hole where the heart used to be.\n\nEven the elites who could endure his attacks be unable to retaliate. They would still end up losing.\n\nBut Han Sen’s heartbeat was in sync with Dry Bone King’s malevolent tune now, and it could not affect him. Determining who the victor in this fight was going to be seemed an impossible task.\n\n“Weird. Why did Dry Bone King’s most powerful skill not work on that guy?” Baby Ghost was speaking to himself, in intense observation of the battle.\n\nHan Sen was not afraid of the heartbone, but his fitness was low and he did not have Phoenix Sword and Taia with him. Dry Bone King’s body was sturdy, and whenever Han Sen punched the spirit’s creepy skeleton, it was like throwing his fist into a pillar of steel.\n\nDry Bone King did not have any organs to take advantage of, either. Because of this, Yin Yang Blast was useless.\n\nAs Han Sen wondered what he might do next, he suddenly heard the drumbeat of the heartbone move to a rhythm. It was a proper melody, as if playing in tandem with a phantom song.\n\nHan Sen’s heartbeat was disturbed once more, and it made him unable to successfully dodge Dry Bone King’s next attack. He suffered a blow to his arm.\n\nAs a result, he was sent flying a few hundred meters. He barrel-rolled through the air to try to reduce the impact, but it still hurt. And as this occurred, Dry Bone King returned to playing his drum-driven requiem. The melody was able to disturb Han Sen’s heartbeat without trouble.\n\nHan Sen used his phoenix techniques to fight again, wishing he had the xun Xiang Yin had given him. If he had that, he could possibly fight back.\n\nBut as Han Sen was still in thought, Dry Bone King leaped out of the arena and spoke. “Time is up; you have passed the test.”\n\nHan Sen planned to keep fighting, not expecting Dry Bone King to keep his promise. He did, after all, seem extremely intent on killing Han Sen.\n\nThe woman’s face turned green as she stood up and ran off.\n\nQiu Ping felt great relief wash over him, like some cleansing tide. The thoughts that had gone through his mind in the past half hour were wretched, all dealing with what would occur following Han Sen’s death. He was extremely glad Han Sen had actually managed to triumph and pass the test.\n\nEntering the fifth floor meant Han Sen was a supervisor of the shelter. The woman would be unable to bully him so easily now, as he had to be treated as an equal.\n\nEveryone who was standing outside the stadium, having been chased away by the frightening heartbone, heard the sounds come to an end. They eagerly wanted to know the result.\n\nWhen they re-entered, they saw Han Sen talking with Dry Bone King. It took their breath away, acknowledging a human had been able to survive such manic brutality.\n\nDry Bone King brought Han Sen up to the fifth floor. He introduced him to everyone, saying, “We are one and the same now. If there is something more you would like to know, come and find me.”\n\nDry Bone King had gone into the test expecting an easy fight. He believed Han Sen was like vermin he could chase-off or crush underfoot without hassle. But he had great respect for the human now, and he wished to be friends with Han Sen.\n\nHan Sen took advantage of the offer immediately, and asked, “Brother Bone, do you know who signed Qiu Ping’s contract?”\n\nDry Bone King knew it was only a matter of time before this was asked, and so he answered, “It was Qing Jun. When Mister Immortal is away, she is in charge. The super creatures only obey her. If you think of going after her now, it won’t take much for her to get rid of you. Wait a bit and I will help you soon.”\n\n“Thank you, Brother Bone.” Han Sen understood what he meant.\n\nDry Bone King had subliminally informed Han Sen that Qing Jun was an enemy of his, as well.\n\n“Go and rest; you’ve earned it. Two days from now, we can receive Sky Fruit.” Dry Bone King was leading Han Sen to a palace.\n\n“Sky Fruit?” Han Sen did not understand.\n\nDry Bone King smiled and explained, “Our mission is to collect the nuts from the Sky Fruit. The rest of the fruit can still benefit you too, of course. Whoever gets it first is allowed to keep it. I’ll explain more later, though.”\n\nHan Sen left the shelter after that, afraid staying there any longer would damage his body.\n\nBack in the underground shelter, he returned to his normal size. He focused on absorbing and refining his Life Geno Essences, and he was delighted to find that he now made progress much faster."
}