{
    "chapter": 2400,
    "title": "Stone Destiny’s Tower",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2400",
    "text": "Blood continued to fountain out of the insect’s mouth, spilling all over the place. It looked as if something was fighting its way out.\n\n“Dollar?” Dragon One and Dragon Eight asked together, squinting at the figure that emerged. They could barely believe their eyes. They wanted to scream, but their question came out as a whisper.\n\nHe had been eaten by a deified creature, and yet he hadn’t been killed. It was a miracle.\n\nHan Sen finished pulling himself free and climbed to his feet. He didn’t have any blood on him. He didn’t even look injured. Dragon One stared at him in disbelief.\n\nThe weird insect shrieked and thrashed a little. It looked to be in a great deal of pain. Instead of pursuing Han Sen, it just drilled back into the earth and disappeared.\n\nThe green area power that had covered the sky suddenly disappeared. Dragon Eight stared at the hole it left behind in bewilderment.\n\n“Dollar, what did you do?” Dragon Eight asked slowly, his voice a little shaken.\n\n“Nothing. I just thought I’d hurt it a little.” Han Sen paused for a moment, then said, “Let’s go. Once it heals, I doubt we’ll be able to escape again.”\n\nPutting action to words, Han Sen left the ground and headed out of Planet Dark Zone’s atmosphere.\n\nHe had wanted to kill the weird insect, but the creature was way too strong. It had taken all of Han Sen’s strength to keep using super spank on the weird insect’s core. Despite exhausting all of his energy and approaching the time limit of his super god spirit body, he was only able to leave a single crack across the core. He hadn’t been able to actually break it.\n\nLuckily, although the weird insect was strong, it wasn’t smart. The crack in the creature’s core was small and not terribly threatening, but the bug had chosen to run away even so. If it had continued going after Han Sen, his super god spirit would have given out eventually. He could have died.\n\nDragon One, Dragon Eight, Dia Robber, and the newly reassembled Barr didn’t hesitate. They followed Han Sen away from Planet Dark Zone.\n\nThe five of them didn’t speak, and they flew as fast as they could until they were well beyond Planet Dark Zone. The weird insect didn’t follow, which all of them were incredibly grateful for.\n\n“It looks like we’re all injured, and I need to go take a rest. Let’s split up here,” Han Sen said, preparing to use his self-universe cogwheel to leave the universal core area.\n\nHe had an idea about how to deal with the weird insect, but he was too weak to do anything about it now. He would have to wait until he was stronger.\n\nDragon One said, “Dollar, if you still want to work together, we should set up a time and place to meet.”\n\n“It will be hard to fit you into my schedule, but we can discuss this when I find the time.” Han Sen didn’t want to set up a meeting time because he was currently in the Extreme King. He wouldn’t always be able to come here on a schedule.\n\n“Should we have a way of contacting each other?” Dragon Eight said.\n\nIn the geno universe, the stronger ones always earned respect. Everyone wanted friends who were stronger than them.\n\nEspecially friends like Han Sen. He was a first-tier King capable of fighting against a deified xenogeneic. Plus, he had proven his ability to hurt many scary people. It almost seemed like he was deified already. If someone could make friends with him, they would. After all, it would be better to have him as an ally than an enemy.\n\nDragon One and Dragon Eight wanted to maintain a good relationship with him. Even if they couldn’t be friends, they wanted Han Sen to think positively about them. Finding yourself at odds with someone like him was never a good plan.\n\n“So you are Dollar. You are even stronger than the stories say. When would you like to fight me?” Barr asked, looking at Han Sen.\n\nDia Robber laughed and said, “Barr, stop messing around. Today, Dollar was the sole reason that we survived. If you don’t mind, Dollar, please leave us a contact number. We would like to pay the debt we now owe you.”\n\n“It’s okay. I was just trying to save myself. You don’t need to contact me again. We’ll meet again whenever luck decides,” Han Sen said, then used his self-universe cogwheel. After a while, a giant metal cogwheel door appeared, and Han Sen walked through it and left.\n\nNow that his self-universe cogwheel had been activated, it would continue running on its own. Using it didn’t require any additional energy.\n\nOpening the door to the universal core hall did have some requirements, though. Once Han Sen began the process of summoning the door using his self-universe cogwheel, he couldn’t move it. If he moved away from the door, he would destroy the connection. At that point, he’d have to start the process all over.\n\nIn addition, summoning the door took a while. It would be impossible to summon during combat, so the door couldn’t be used as an escape route if Han Sen got into trouble.\n\nPlus, when he returned to the core area, he would end up exactly where he had left the previous time. He wouldn’t just randomly teleport to some other location in the core area.\n\n“Brother Dragon One, who is this Dollar? Can you tell me?” Dia Robber looked at Dragon One.\n\nDragon One shook his head. “We met him by chance, and we worked together twice. We don’t know much about him. No more than you guys do.”\n\n“I have never heard of a race called ‘human’ before. How could they have produced an elite like that? It is confusing.” Dia Robber asked, his expression mystified.\n\n“I am afraid that because of Dollar, humans might become famous across the universe. We don’t know if there are any other strong humans. If he’s the only one with such strength, like Kong Fei was, he would still be alone. He cannot change the world, in that case,” Dragon One answered.\n\nThe four of them lost themselves in deep thought. None of them said anything. And eventually, they all used their self-universe cogwheels to leave the universal core hall.\n\nAfter Dia Robber returned to the Destroyed, he went looking for other Destroyed Kings. He asked the ones he could find to stay in the vicinity of Planet Dark Zone. They were to wait inside the core area, and if Dollar re-appeared, they would contact Dia Robber at once.\n\nCoincidentally, when Dragon One returned to the Dragon, he did exactly the same thing. Clearly, they were waiting for Han Sen to return to the core area, too.\n\nHan Sen came out of the universal core hall back in Underwater Town. Bao’er was lying on his bed, and she rubbed her eyes when she heard movement. Seeing that it was Han Sen, she leaped into his arms.\n\n“Dad? Where were you? Why didn’t you take me?” Bao’er lifted her lips.\n\n“I reached King class a few days ago. I got pulled into the core area.” Han Sen looked at Bao’er and asked, “Can you and the little bird enter the core area?”\n\n“Core area? What is that?” Bao’er asked in confusion.\n\nIf Bao’er did not know, then she probably couldn’t join him. And the little red bird was deified, so it couldn’t go in with him, either. Otherwise, Han Sen could use the little red bird to kill the weird insect.\n\nHan Sen had used his super god spirit mode for too long, and his body was exhausted. He felt very powerless and sore. Han Sen didn’t plan on returning to the core area anytime soon. He rested for a few days and ate some of the core xenogeneic genes each day. His number of King genes kept increasing.\n\nHis body had almost recovered when the day came for him to enter Destiny’s Tower. He didn’t want to be late, and so he arrived at the site an hour early.\n\nThe Extreme King were quite effective. They had four elites on standby to open the door of Destiny’s Tower for Han Sen and let him in."
}