{
    "chapter": 2517,
    "title": "Surround and Kill the Xenogeneic",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2517",
    "text": "“It finally begins.” Bai Wan Jie looked at the people fighting in space. His eyes gleamed with excitement.\n\nThe moment Dragon One and the Gold Armor General appeared, the Gold Armor General’s saw sword was buzzing. The swordlight flashed toward them.\n\nPang!\n\nThe swordlight flew right past them, cutting their bodies in half. The people who were spectating the battle felt their hearts run cold.\n\nThe next second, they realized that the fighters themselves hadn’t been slashed in half; the swordlight had only cut through the shadows that they left behind. Dragon One’s real body had already moved. He and the others were now standing behind the Gold Armor General.\n\nAlmost at the same time this happened, Dragon One and Dia Robber used their areas. A dozen areas combined to shield them from the strong Gold Armor General. It was like they had encased themselves in dozens of layers of crystal.\n\nThe Gold Armor General’s eyes flashed. It moved forward as it swung its gold greatsword, and the dozen hastily-combined areas broke like shattered glass. Their protection couldn’t stop the attacks of the Gold Armor General.\n\nBut because Dragon One and the others instantly separated, the Gold Armor General’s attack was unable to hurt everybody. The strike swept toward a few of the Kings in the front.\n\nAt the same time, the Kings and half-deifieds in the back gathered up power. All their beams of light struck the body of the Gold Armor General. The Gold Armor General obviously didn’t intend to dodge. It allowed those beams of light to strike its armor, and not even a scorch mark was left in their wake.\n\nThe Kings in front had no chance to dodge the creature’s counterattack. They were struck by the swordlight, but again, their bodies became shadows. They were teleported away by a half-deified who was neither one of the Destroyed nor one of the Dragon.\n\nThis all seemed to happen slowly, but from start to finish, it took less than a second. There was a half-deified there that was well-versed in teleportation techniques, and a half-deified who was skilled in cloning. They were cooperating together, and they managed to save the Kings from the Gold Armor General’s attack.\n\nDragon One and the others surrounded and attacked the Gold Armor General, but the monster’s gold armor seemed impervious to their weapons. They were unable to break through its defense, which rendered their attacks useless.\n\nBut as Han Sen watched the fight from a distance, he saw that there was a strange symbol of light on the Gold Armor General’s back. Dragon One’s attacks were useless against the Gold Armor General, but every time he hit the Gold Armor General, that spell became brighter.\n\nHan Sen looked closer, and he realized what that spell was for. It was a skill similar to Dollar’s Saving Money. The symbol of light on the creature’s back would absorb whatever power was used to attack it. Then, it would transform that power into something it could use itself.\n\nA dozen elites were continuing to attack the Gold Armor General, and their efforts were making the spell grow brighter and brighter. But Han Sen couldn’t see if it was affecting the Gold Armor General or not.\n\nThe Gold Armor General swung its sword, but its attackers stayed ahead of it with their teleportation and shadows. Dragon One and the others had yet to be killed.\n\nAfter a few slashes, the Gold Armor General seemed to be growing impatient. It stopped swinging its sword. It spun the handle of its weapon and raised it upward. The creature lifted the sword above its head.\n\nThe gold greatsword’s cogwheels spun, but the saw teeth on the outer edge of the sword stopped spinning. All of a sudden, countless raging swordlights were unleashed.\n\nThe swordlights came out like a net of lasers, blanketing the entire sky. Everything below was sliced into pieces.\n\nCountless asteroids were reduced to rubble, and even a small planet had the misfortune of being caught in the swordlights. Dragon One and the others found themselves within the radius of that sword net, too.\n\nDragon One’s team wasn’t afraid, though. It appeared as if they knew the Gold Armor General would perform a move like this.\n\nOne of the half-deified Dragons moved at the same time the Gold Armor General did. It used an area to encompass Dragon One and the others.\n\nThe scary substance chains that formed the sword net landed on Dragon One’s team, but their bodies had become like shadows again. The sword net slid right through their bodies, and it was unable to hurt them.\n\nJust as the sword net passed by them, their bodies started to become solid once more. The half-deified who had just used that area looked pale, though. A trickle of blood snaked down from his lips. It appeared as if using an area like that brought harm upon him.\n\nDragon One and the others tried to buy time, and so they attacked Gold Armor General again. The light on the back of the Gold Armor General was incredibly bright. It was like a small sun.\n\nThe yellow-clothed woman had been watching all the while, and she nodded thoughtfully. “I’m surprised they found people with Group Galaxy Teleport, Mirror Doppelganger, and Ghost Shadow. As long as those three powers are used in concert, they can guarantee that Dragon One’s people won’t be killed by the Gold Armor General. They really did come prepared. But these three powers cost a lot of energy, so they won’t last forever. The Gold Armor General doesn’t look too angry yet. I think they can last ten minutes, all in all. I don’t know if they will survive any longer than that.”\n\nLittle Butterfly didn’t understand, and so she asked, “Even if they survive for a short time, won’t this all be rather pointless if they can’t kill the Gold Armor General?”\n\nThe yellow-clothed woman pointed at the Gold Armor General’s back. The glowing symbol now looked like a little sun. “This is a skill of the Dragon. It’s an Evilbreaker spell. When the strength accumulates to a level, even a deified elite will be affected by it. It will make them pause for a brief while. And in regards to how long the Gold General Armor will be stopped, it all depends on how much power they can gather up in the time they have. I don’t think its effects will last any longer than one or two seconds.”\n\n“What is the point in doing all of this to stop Gold Armor General for a measly two seconds? Their attacks won’t be able to break Gold Armor General’s armor. It will be pointless if they only buy themselves two seconds. Even if they had two hours or two days, it would still be useless.” Little Butterfly still didn’t understand.\n\nThe yellow-clothed woman looked at Han Sen on the battlefield. “Dragon One must have placed his hopes on Dollar. When Gold Armor General stops, Dollar will perform the deadly strike. If I am correct, the item on his waist is a deified treasure of the Dragon. It is called the Dragon Tattoo Tooth Dagger. If it was used by a deified, it could easily break through that armor.”\n\nAfter pausing, the yellow-clothed woman went on to say, “But if it is used by a King class, it is unlikely that it will puncture the armor. I bet it can only be used to pierce the Gold Armor General’s eyes. The eyes must be their target. I cannot be sure if Dollar can succeed here, though. Even if he can, piercing the eyes won’t kill the Gold Armor General. Dragon One must have another ace up his sleeve.”\n\nAs she said this, Dragon One and the others reached the end of their ability to hold on. The two who used Galaxy Teleport and Mirror Doppelganger were pale, and their bodies were shaking. They had used these skills ten times, and the radius of the areas they cast was huge. They were tired, and they could no longer go on.\n\nThe half-deified using Ghost Shadow was even worse off. After he made Dragon One and the others ghosts, he didn’t have enough power to totally erase the substance chains. The effects would land on him, and after using three Ghost Shadows, he was bleeding out of all seven of his holes."
}