{
    "chapter": 2671,
    "title": "Silkworm Bouts Begin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2671",
    "text": "Li Keer and Han Sen reached the valley right before the silkworm fights were going to begin. When Exquisite saw them both heading toward her, she sighed in relief.\n\nShe expected Han Sen to lose at least one of his fights, but if he didn’t participate in the contest at all, the Very High would hate him even more.\n\nThe time of rest was over. When the eleven silkworms entered the valley, Exquisite didn’t ask anything of Han Sen. She allowed him to proceed into the basin of combat.\n\nThe moment Han Sen set foot in the valley, the entire valley was sealed by a huge barrier. The bai sema would keep the destructive power of the combatants contained within the valley, but it wouldn’t stop teleportation or the bodies of the contestants. If the silkworms teleported outside the seal, they would immediately lose the fight.\n\nWhen the silkworm fights began, few Very High had come to watch the fights. Only the masters of the twelve silkworms actually showed up in person.\n\nThe Very High that practiced the Very High Sense had zero interest in such a contest, and the other members of their society had other means of spectating. There was no need for them to go all the way to the valley.\n\nOnly the masters of the silkworms had to watch the fights unfold up-close. They needed that proximity to gain the battle experience and knowledge of those they were watching.\n\n“It finally begins. Now, if the other eleven silkworms meet Han Sen, they will do their best to fight him.” As Li Xue Cheng watched the stream of the fight preparations, he cackled wildly.\n\n“Of course. We made Han Sen, who is only a ninth-tier King, into a powerful contender who is only second to Shale. The half-deified silkworms won’t be happy about this. Even if we were nice people, this still would have put them in a competitive mood, right?” Liyu Zhen squinted his eyes.\n\n“Han Sen might drop out before he even gets to Shale,” Li Xue Cheng agreed and nodded.\n\nAfter Han Sen entered the valley, he wasn’t in a rush to bump into another silkworm. He flew around a nearby mountain that rolled up and down. The valley was as big as a planet, but for half-deifieds or deifieds, that sort of area wasn’t too big. It wouldn’t be difficult for the silkworms to locate each other.\n\nSuddenly, Han Sen felt an impressive surge of power up ahead. Someone was already fighting.\n\n“This power… Is that Yu Shanxin?” As soon as Han Sen felt that power, he noticed how familiar it felt. And so, he quickly headed toward where that fight was taking place.\n\nThe area of combat wasn’t too far away from him, and so Han Sen quickly reached the outskirts of their battlefield. There, he found Yu Shanxin and a half-deified of the Extreme King standing on a mountain. They were watching each other. They were both utterly still. The only movement Han Sen could see came from their powers, which were spilling out and shaking the mountains all around them.\n\nHan Sen recognized Yu Shanxin’s opponent. According to the information he had received, the Extreme King fellow was called Gru. Although he wasn’t of the same bloodline as King Bai, his king body was very strong, certainly no weaker than any of the royal children’s. He had a nine armor talent, and he was a very experienced fighter. He was quite a skilled swordsman, as well.\n\nAt the moment, Gru was really quiet. And he was holding a steel greatsword. His body was fizzing with a powerful swordmind, and before his weapon even moved, his swordmind came for Yu Shanxin. It rushed forward so fast that it pushed aside the clouds in its path.\n\nHan Sen frowned. Gru’s swordmind was no weaker than his own. The man had reached deified class with it, for sure. He might have only been half-deified, but his swordmind was remarkably developed. Gru was definitely a very powerful half-deified. It was no wonder the Very High had selected him as a silkworm.\n\nYu Shanxin’s presence was harder to anticipate. Sometimes it raged like fire, and other times it was soft like water. It made it very difficult for those watching to determine what sort of power he had.\n\n“It is fortunate I’m getting to watch this fight. It means I can observe Yu Shanxin and see what Extreme Evil Path can do.” Han Sen maintained a careful distance from the battlefield so he could observe without getting caught up in the fight.\n\n“Yu Shanxin, I have heard you being called the strongest non-deified in the universe. I, Gru, am going to see what is so special about your Extreme Evil Path.” Gru looked at Yu Shanxin coldly as he spoke.\n\nGru didn’t like Yu Shanxin for one simple reason; the Extreme King were supposed to be one of the top three races of the universe, but they didn’t have any half-deifieds that were as strong as Yu Shanxin from Sky Palace. Now, the silkworm bouts had given him a chance to fight Yu Shanxin. In truth, he wanted to take this opportunity to kill Yu Shanxin.\n\n“People who say such things are too kind. I assure you that those comments are not true. Compared to the illustrious Extreme King, I’m nothing noteworthy.” Yu Shanxin smiled coldly.\n\n“Huh. Let’s fight and see.” Gru didn’t plan on letting Yu Shanxin go that easily. His swordmind rose as he gripped his steel greatsword, and a swordlight spread across the sky as it headed for Yu Shanxin.\n\nThe silkworm fights didn’t permit the use of treasures, so the steel greatsword must have been Gru’s gene weapon. As the sword moved through the air, even Han Sen was surprised by its power. The Extreme King’s sword skills and swordmind were no worse than his own.\n\nBut Han Sen didn’t think a strike like this would be enough to defeat Yu Shanxin. He stared at Yu Shanxin, wanting to see how he might deal with such an attack.\n\nYu Shanxin’s body remained motionless. When the swordlight came down, Yu Shanxin reached out both hands as if he wanted to catch the swordlight.\n\nThe swordlight stopped when it encountered Yu Shanxin’s hands, but the power of the strike was too great. While Yu Shanxin’s hands had succeeded in stopping the attack, the raw force of the blow still knocked his body back.\n\nPang!\n\nYu Shanxin was pushed back through the barrier of the valley. He lost the silkworm fight.\n\nThe silkworm bout had few rules, but there was one rule that all the contestants knew: whoever left the valley first would be put in last place. Yu Shanxin had been the first to get knocked out of the valley, and so he was going to be number twelve.\n\nHan Sen was befuddled. “What the hell is wrong with Yu Shanxin? Gru is very strong, but there is no way Yu Shanxin is that much weaker than him. How did he get blown away by that attack? He must have done that deliberately. I cannot believe this. Even if he couldn’t have reached first place, there were many rewards that he could have earned by reaching the top five. Why would he just throw everything away and give up?”\n\nGru didn’t believe Yu Shanxin was that weak, either. The man had been launched beyond the seal by a single attack.\n\nBut Yu Shanxin was already out of the valley, and Gru could no longer chase after him. So, the Extreme King turned his head to look at Han Sen.\n\n“If Yu Shanxin was too much of a chicken to fight me properly, then you can fight me. You’re also from Sky Palace, after all; it will be good to test the mettle of your people.” Gru looked at Han Sen’s body.\n\nHan Sen hadn’t expected the situation to change so quickly. Before he even realized what had happened, he had become Gru’s opponent.\n\nBut Han Sen made no effort to run away. He could still fall back as long as he didn’t leave the valley, but Han Sen remained within range of Gru. He drew Spell’s two pistols."
}