{
    "chapter": 1217,
    "title": "Bone Scroll",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1217",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen first thought it was Bao’er that had been tugging his hair, but he was holding her against his chest. Realizing this, he knew it couldn’t have been her.\n\nWhen he saw Snowball’s frightened face, he knew something was wrong. It was at this moment instinct kicked in, and he threw a punch backwards to see what may have lurked behind him.\n\nBut when he lashed out, nothing met with his fist. And when he looked at what might have been behind him, there was nothing.\n\nHan Sen lifted Bao’er up and said, “Bao’er is there anything behind me?”\n\nHan Sen thought that whatever was behind him might have clung to his back and turned around with him.\n\nBao’er climbed around to inspect his back and simply said, “Nope.”\n\n“No?” Han Sen went over and kicked Snowball. Then, he boorishly asked him, “Did you see something?”\n\nSnowball was still shivering in fear. The furry cretin pointed at the ancient tower and then suddenly leaped upon Han Sen’s shoulder to hide. Han Sen looked over to that mysterious building, but he couldn’t spot anything amiss with it.\n\nThat being said, he could only see one side of the tower from where he was standing. So, he decided to walk around it. Han Sen was only half way in his walk towards the tower when the small rotten door suddenly flung itself open.\n\nInside, a human skeleton was sitting on a decrepit chair. Han Sen now thought the small size of the door made sense. It seemed perfectly sized for the skeleton inside. The height was snug enough for the skeleton to sit down just beyond the door frame.\n\n“I doubt it was this bonehead being playful, pulling my hair.” Han Sen’s skin still flared with goosebumps at the spooky sight.\n\nHan Sen wasn’t afraid of the possibility of a ghost, but what was really starting to unnerve him was the fact he hadn’t noticed or sensed anything approach him.\n\nBut suddenly, the skeleton began to move. At this point, Snowball tucked itself behind Bao’er in absolute fear.\n\nA few loose rags were all that clothed the skeleton, and even those shreds were ripped further when the skeleton began to move. The skeleton stood up and walked outside the tower, as its sockets flickering with a light before burning hot with a green flame.\n\nHan Sen was not afraid of the skeleton. In fact, he looked forward to its coming, as it held something in its hands.\n\nIt was a scroll. Han Sen could not tell what it was exactly, but it was most certainly a scroll of sorts. The cloth had yellowed over the passage of time. The skeleton walked outside, lifted its hands, and opened the scroll.\n\nHan Sen could only see the back of it, and while it looked very old, it did look to be in remarkable condition. Han Sen could not see what was written on the front just yet, but he could hear the skeleton speak. Strangely, its mumbling was not silenced, like everything else had been.\n\nKa-Ka-Ka!\n\nAfter perking his ears to discern some words, Han Sen realized he had been mistaken. The skeleton wasn’t speaking, its jaw just had a loose hinge that was rattling in the mountain breeze.\n\nBut even that didn’t seem right. Immediately after that noise was made, the scroll began to shine with a purple color. Han Sen felt a horrible power flow from the scroll, so he didn’t fancy hanging around any longer than he had to. He decided to flee the area.\n\nIf it was a berserk super creature, things would go awry for sure.\n\nThere were a lot of creatures at the bottom of the mountain, and if Han Sen battled the skeleton and won, it might allay the fears of the other creatures. He’d be doing them a favor.\n\nOf course, Han Sen wouldn’t stand for that. So he decided to run towards the two creatures that were still battling each other and flee that way. Perhaps they could slow the skeleton down if it continued coming for him.\n\nPang!\n\nHan Sen was ready to jump off the peak and descend, but he had run directly into an invisible wall. He was going as fast as he could and whacked against it solidly, which caused his flattened nose to start bleeding.\n\nHan Sen then noticed a purple line had been drawn on the ground. It was almost like a crack in the earth, and it was starting to emit a purple mist. Slowly, the plumes of this phantom mist began to envelop the entire peak.\n\nHan Sen looked back towards the tower and saw that the skeleton had not moved much, and it was still reading the scroll which had become even brighter by this point.\n\nReady for a fight, Han Sen summoned Little Angel and Disloyal Knight. Then, he drew his Phoenix Sword and Taia to slash the invisible wall and see if he could break it.\n\nHe struck the purple wall many times with his swords, and he seemed to make some progress. But just when Han Sen thought he could escape, the wall recovered its strength and rebuilt, trapping the Phoenix Sword inside.\n\nFortunately, the Phoenix Sword was very sharp, and Han Sen was able to wiggle and cut its way free and retrieve it.\n\nHan Sen wasn’t going to be reckless and risk getting himself stuck in the wall, though, so he shelved the idea of hacking through it for now.\n\nIf he couldn’t get out of the established barrier, he’d have Little Angel deal with the skeleton. As he thought about the different ways he could deal with the predicament at hand, a purple light appeared beneath his foot.\n\nThen, a purple light began to beam across the entire peak, transforming the entire area into what looked like a purple crystal. The only thing that had not been bathed in a purple light was the creepy tower."
}