{
    "chapter": 2546,
    "title": "Demon Doll",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2546",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nElysian Moon and Gu Qingcheng frowned. They were sensitive enough that they noticed the glance that the man directed toward them.\n\nAlthough Han Sen saw it, he said nothing. Considering the beauty of the two women, it would be weird if men didn’t have any reaction towards them.\n\nThe Demon and humans looked alike. Their definitions of pretty were similar, so it wasn’t strange that a Demon man would be drawn to the appearance of a human woman.\n\nAttraction was one thing, but it would be a different matter if the Demons tried to make a move. If Ji Yang Sheng didn’t do anything stupid, Han Sen wouldn’t begin a conflict himself.\n\nJi Yang Sheng turned away from Gu Qingcheng and Elysian Moon, then said to Han Sen, “Teacher Han, Mister Moldo might have spoken to you before about how he hoped that you could bless me. Do you have time now?”\n\n“Ah yes, Moldo mentioned that.” Han Sen went quiet for a moment, then he told Ji Yang Sheng, “I told Mr. Moldo before that my blessings can affect others, but I cannot make people deified. Becoming deified is all about the potential of one’s genes.”\n\n“I understand, but I would be very grateful if you were willing to try to help me. Whether we succeed or not, it is the thought and effort that counts.” Ji Yang Sheng was maintaining his politeness quite well.\n\nHan Sen laughed. “There is no need to say that. We are merely trading. I will still charge you.”\n\n“That is okay. Tell me if there is something you want. If I can pay it, I won’t disappoint you,” Ji Yang Sheng responded quickly.\n\nHan Sen shook his head. “We can talk about the price later. I haven’t yet fully recovered from the blessing I gave Lando. It will take another four months for me to recover enough that I can bless someone else. We can talk about it then.”\n\nIn truth, Han Sen could use his Blood-Pulse Sutra power whenever. That didn’t mean he wanted to keep using it, though. If he did, its value would drop off substantially.\n\nUp until now, Han Sen had only used it on Lando, Gu Qingcheng, and Elysian Moon. He wanted to use it on Little Silver, too. Han Sen wouldn’t use it on Bao’er or Ling’er, because they were so talented themselves. They had so many possibilities, and the use of the Blood-Pulse Sutra could limit their development.\n\nLittle Silver’s talents were a bit on the weak side. The Blood-Pulse Sutra could only do good for him.\n\n“Okay. If you don’t mind, though, I can protect you. I won’t let anyone disturb whatever you are doing in the meantime,” Ji Yang Sheng said with a look of sincerity.\n\n“Thank you, but no thank you. We are only here to hunt xenogeneics. It wouldn’t be appropriate for us to be together.” Han Sen didn’t want a bunch of people following him.\n\n“In that case, I will contact you at a later date. This is my contact information. If you need anything, all you have to do is ask,” Ji Yang Sheng said, before taking his people with him to depart. He didn’t say anything about wanting to loot xenogeneics.\n\nAfter Ji Yang Sheng left, Elysian Moon coldly grunted and said, “That guy doesn’t seem very likable.”\n\n“You will probably end up meeting a lot of other people you hate,” Han Sen said, with a shrug of his shoulders. Their own beauty might have been their biggest challenge.\n\nIn that universe, many races looked just like humans, including the Rebate, the Demons, the Sky, and the Extreme King, to name a few. Their definition of beauty was quite similar, and so the two girls were undoubtedly quite eye-catching to those of such races.\n\n“From what we have seen, we should learn from Dollar and wear armor,” Gu Qingcheng said, glancing at Han Sen.\n\n“I’m afraid wearing armor won’t help. Your bodies are quite distinctive, and even if others cannot see your faces, your curves are sure to attract men. Your appearance makes quite an impact.” Han Sen laughed.\n\n“If we are that sexy, why aren’t you affected by us?” Elysian Moon asked, quirking her lips into a half-smile.\n\n“I’m different. People like me are so faithful and loyal. I’m just a good man, so a few looks here and there keep me happy. I’m afraid you’ll never meet another man like me in the universe,” Han Sen joked.\n\nGu Qingcheng smiled but said nothing. Elysian Moon looked at him with disdain, and she said, “You’re just a creep who has no balls. You call yourself a good man? Pff.”\n\nAfter that, she ignored Han Sen and resumed her flight.\n\n“What’s wrong with her? Since when did I become a creep?” Han Sen looked at Gu Qingcheng.\n\nGu Qingcheng laughed and raised an eyebrow at him. Not saying another word, she flew after Elysian Moon.\n\n“Hey, what is wrong with you both?” Han Sen was so depressed. Although Gu Qingcheng said nothing, he felt as if he had been bullied.\n\nJi Yang Sheng and his Demon allies didn’t venture far. When Han Sen and the others departed, Ji Yang Sheng spoke to a King in his entourage and said, “You go home and bring me my Demon Doll. If my father asks, tell him I need it.”\n\nThe Demon King was shocked, and so he said, “Are you going to attack Han Sen?”\n\n“I can’t believe that I encountered him here. This is a very rare opportunity. We were unable to find him in the systems of chaos, but now we have a second chance to snare him,” Ji Yang Sheng said in a hard voice.\n\n“Please think about this, sir! The Extreme King sent deifieds after him, and even they were unable to capture him. Only half-deifieds can come to the core area. I don’t think you have what it takes to catch Han Sen. If he knows that we have tried to snare him, I do not think he will ever spare the time to bless you,” the Demon said.\n\n“That’s why I’m going to use the Demon Doll; it is deified. Attacking Han Sen will be a guaranteed success. And even if it fails, Han Sen will have no clue it was us who used it,” Ji Yang Sheng stated flatly.\n\n“But the Demon Doll is the Demon’s…” The Demon King wished to say something, but Ji Yang Sheng cut him off.\n\n“Just bring me the doll and stop your protesting,” Ji Yang Sheng snapped.\n\n“Yes.” The Demon King didn’t dare disobey a direct command. He opened his core area hall and returned to the Demon Realm.\n\nAn hour later, the core area hall’s door opened again. The Demon had returned, but with someone else in tow.\n\nIf anyone else had seen this, they would have been very surprised. Kings could only use their power to open a personal door to the core area. No other creature should have been able to enter through that same door. That Demon King brought a creature through the door with him. Even the Extreme King wouldn’t have been able to believe their eyes if they had seen this."
}