{
    "chapter": 1265,
    "title": "Blueblood Team",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1265",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was surprised. Emperors in the Third God’s Sanctuary were of a tier far above the rest that occupied the realm, and they knew it. Yet strangely, this empress had come to ask the man—a human—for assistance politely.\n\n“Is he really a human?” Han Sen thought it was a bit far-fetched, for an emperor-class spirit to behave in such a way before a human.\n\nThe man raised his head to the night sky and said, “It has been a long time since my eyes were last able to lay sight on the moon.”\n\nThe empress frowned, clearly more concerned with receiving the answer to her question.\n\nAfter a while, the man turned his gaze to the empress. He asked, “Where is that which I want?”\n\nThe empress responded, saying, “The Aqua Fruit is on the precipice of maturing. Do you know what that means?”\n\n“Where is it?” the man asked again.\n\nThe empress said, “This is your last chance, so answer me.”\n\nThe man laughed and balked. “You’re wrong! This is your last chance.”\n\n“You do not fear death, do you? I find that an amusing surprise, given your kind can only live once.” The empress frowned.\n\nHan Sen’s face changed, now confirming that the man truly was a human. There was no more doubt about that.\n\nThe man replied, saying, “Oh, I fear death. But I also know you won’t let me die.”\n\nThe empress’s ire was incited by what the man had just said, and anger flushed to her face in immediacy. The serpents beneath the seat were poised, ready to strike the madman.\n\nHe did not care, though. He stood where he was, looking right at the empress, as if inviting their strikes. The serpents glided forward, hissing. But then, the empress raised her hand and gestured for them to leave him be.\n\n“Fine. You can have it. But it will be in exchange for the Aqua Fruit,” the empress said.\n\n“Okay.” The man did not seem surprised.\n\nThe empress waved her hand, and then a copper key manifested in the air and flew towards each lock on the man’s shackles. One by one, they fell down and released him from their cold, cruel clasp.\n\nThe man did not seem excited about his freeing from incarceration. He merely walked calmly towards the lake.\n\n“I can lock you up once more, as easily as I have just freed you. You know what it is you must do,” the empress said.\n\nThe man kept walking, telling her, “Do not worry, I’m from the Blueblood Special Forces. The Aqua Fruit will be yours, have no fear.”\n\nThe serpents beneath the throne began to move, as she followed him towards the lake.\n\nHan Sen was in shock after what he had just heard, and he thought to himself, “He’s from the Blueblood Special Forces!? If he was trapped in there for one hundred years, perhaps there is a chance he knew about Han Jinzhi.”\n\nThe Blueblood Special Forces was a military unit of the Alliance. If he was who he claimed to be, though, it didn’t make sense why the empress had behaved that way before him.\n\nThe empress was asking the man to take the fruit for her, as if he was tremendously capable and accomplished for such a task. This was crazy.\n\nAs the man walked, he removed the scraps of aged garments that still hopelessly clung to his body.\n\nHan Sen was surprised that the man didn’t look quite as disheveled when he was unclothed. The man was ripped, with hulking muscles that Han Sen couldn’t help but admire. The man looked strong enough to kill anything.\n\nBut what was quite strange was that the blood vessels between his muscles were blue rather than green.\n\nThe man walked into the lake and washed himself. With his hands and fingernails, he gave himself a haircut, too. Now, Han Sen could see what his face looked like.\n\nThe man’s face was strong and proud. His features had been chiseled in a way that exuded manliness. If he was seen strolling the streets, Han Sen believed women would get wet just seeing him.\n\nThe empress was sitting on her throne as he walked out of the lake, naked and on full display. Han Sen watched his manhood swing wildly from left to right with each footstep.\n\nThe empress frowned and threw down geno armor in front of him.\n\nThe man put it on and then sat down. He looked out over the lake and said, “The only way this could get any better is if there was a drink we could both share.”\n\n“Ugh.” The empress groaned.\n\nThey merely sat, watching the view from the lakeside together.\n\nA period of time elapsed with neither of them doing anything. They must have been waiting for the fish to arrive.\n\nWith the odds stacked against him, and the empress now having this other, mystic human on her side, Han Sen wasn’t fancying his chances of emerging victorious.\n\nHan Sen wanted to go downstream and see if he could stop the fish king from coming.\n\nEven if the fish king did not come, though, it wouldn’t mean much. The empress would still most likely nab the fruit she had come for. Trying to save the fish king’s life and fighting alongside it seemed the best chance of prevailing Han Sen had.\n\nAs Han Sen reviewed his options, he began to hear movement stem from downstream.\n\nHe saw a golden light, and ahead of it, Yaksha. He was running back, and a peculiar look crossed his face when he noticed the human sitting beside the empress.\n\nYaksha bowed and said, “The flying fish king is here.”"
}