{
    "chapter": 1198,
    "title": "Old Alloy Box",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1198",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAfter Han Sen took the couple to the Panic Terminal, the shura ship started firing once more. This time, however, there were more misses than hits, and it gave them the uneasy feeling they were being issued a warning.\n\nIf the shura had been attacking for real, the Universe wouldn’t have lasted more than a second.\n\n“Little Lian, are you okay?”\n\nAfter entering the Panic Terminal, an old man grabbed the girl in worry.\n\n“Grandpa, I’m fine. Han Sen saved me and Ling Yuan both,” the girl told him.\n\nThe old man thanked Han Sen profusely, but Han Sen had more on his mind right now, and he didn’t have the time to hang around and indulge any further social niceties. Understanding the situation better than anyone, he wanted to ask the captain what the ship was transporting in the cargo docks.\n\nBefore Han Sen left, a person approached with a few more stragglers. This person was dressed in the uniform of a captain, and he said, “Old Xu, the shura have us surrounded. I don’t think the Panic Terminal was built to withstand the pounding of an armada’s fire and take us to our proposed destination. We must proceed to the next step; asset denial. We will destroy the information.”\n\nIt was then that Han Sen noticed the old man was clutching an alloy box. It was fairly modern in its design, but it looked weathered and worn, as if it was a few decades old.\n\nHan Sen felt as if he had seen a similar box elsewhere.\n\n“No! This is irreplaceable,” the old man pleaded, as his grip on the box tightened.\n\n“Old Xu, we cannot be saved. Hope is lost. All we can do now is make the most of our predicament by preventing the shura from obtaining this item. I apologize, but this is how it must be.” The captain gestured with his hand, prompting soldiers to come forward and try to seize the box.\n\n“I remember!” Han Sen remembered where he had seen this box before.\n\nIt was an old box, one whose trace could not even be found on Skynet. He had seen it in the sanctuary.\n\nWhen Han Sen first met Zero in the cave, he saw an identical box there, except it was broken. Looking at this box before him, Han Sen knew they had to be the same model. Han Sen also remembered he found a geno solution and some information inside it.\n\nHan Sen never figured out what that information dictated, so he had it hidden.\n\nIt was all coming back to him, now that he was seeing that box.\n\nIf there was a connection between the two, Han Sen could not tell just yet. After all, the box itself wasn’t particularly remarkable.\n\nTwo of the soldiers were now directly in front of the old man, who had yet to flinch. His grip on the box only tightened.\n\n“Old Xu, I am sorry. You know I wouldn’t let it come to this if there was another way.” Another round of explosions echoed around the ship, prompting him to gesture for the soldiers to hurry.\n\nThey both grabbed the old man and removed the box from his grasp. The old man looked very upset, but he didn’t resist too much. A soldier tried to open the box but found out he was unable to.\n\n“Old Xu!” the captain shouted.\n\nThe old man then sighed, providing the soldier a keycard to open it. The soldier used it, and the box opened successfully. Han Sen looked at the now-open box and was delivered quite the shock.\n\nInside, there was a bottle. A bottle and information. The bottle was the same one Han Sen had found.\n\n“The box is the same. The bottle is the same. No way the solution inside can be the same… can it?” Han Sen thought to himself.\n\nThe soldier opened the box and brought a punch down on the bottle with a fire-wreathed fist.\n\nHan Sen watched the events intensely.\n\nThe soldier was a surpasser, and with a fire element attack, the box was sure to be destroyed.\n\nIf Han Sen hadn’t seen that bottle, he wouldn’t have cared too much. But he wanted to learn more, so he ran before the soldier, blocked his fist, and grabbed the box himself.\n\nPang!\n\nThe hot flames came down on Han Sen’s hand like a meteor that spewed lava, but he was undamaged. Everyone was shocked, and the rest of the ship’s personnel all aimed their weapons at Han Sen, thinking he was a threat.\n\n“You are a traitor! You are working for the shura?” the captain asked, with half a rhetorical tone.\n\n“I am Han Sen and my wife is Ji Yanran. Ji Ruozhen is my father-in-law,” Han Sen quickly stated, raising his hands in innocence.\n\nHan Sen didn’t think the laser guns could hurt him too much, but he didn’t want to risk having to fight humans. Being a relative of President Ji had its perks. When he said this, everyone stopped and lowered their guns. Then, they all pointed at Han Sen.\n\n“You are Han Sen?” the captain asked.\n\n“Yes,” Han Sen answered.\n\n“Yes, he is Han Sen! And he just saved our lives,” Xu Lan proclaimed.\n\n“Regardless of who you are, you cannot interfere with our task. It is imperative we stop this box and its contents from falling into enemy hands. We must destroy it!” the captain exclaimed.\n\nSeeing the way the captain held himself, it didn’t seem likely he’d care too much, even if Han Sen was the president’s father. It was his task to destroy the box and its items, and he wasn’t going to let anything get in the way of that.\n\nBoom!\n\nAnother explosion sounded, as a wide hole was punched through the hull of the Panic Terminal. The shura were going to board."
}