{
    "chapter": 1122,
    "title": "Meeting the Creature From the Nest Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1122",
    "text": "Han Sen returned to the Alliance and used what little information he had to figure out where he was in the grander scale of the Third God’s Sanctuary.\n\nHan Sen stayed at the shelter for a while, and when he figured out where he was, he asked Moment Queen to move the shelter close to them. Unfortunately, the underground shelter could only move a certain distance with each teleportation. It would take a month for it to reach Han Sen.\n\nThe shelter they were at was called Nest. There were around forty people living there, with the population spread across a vast manner of different ages. The eldest among the people were over one hundred years old.\n\nThe area around it was rather safe, and any surpasser that came to be there was guaranteed a good life. The people at the shelter said only five people had died there in over a hundred years.\n\nTwo of them died while venturing into a creature’s nest, whereas the others died while trying to brave either Thorn Forest or the waters.\n\nHan Sen was surprised to learn there was a nest there, and Uncle Bug told him this nest was in the very center of the forest. No one dared to go there, and on the few occasions that they had snuck in, the eggs inside the nest had proven too sturdy for them to break.\n\nUncle Bug was the leader of the shelter. He was the oldest there, and he was the founder of the shelter; as such, he had the authority of leadership.\n\nHe didn’t focus too much on himself, and he was always more concerned with helping others. Whenever someone new arrived, he’d make sure to provide them with beast souls to begin or aid them in their time in the Third God’s Sanctuary. Having a leg-up, and having the proper equipment to deal with creatures of that realm right from the start, was an invaluable and much-appreciated boon.\n\nHe was titled “uncle” out of respect. His age meant nothing to the people of the shelter. He was a good man.\n\nThe reason he had the name “bug” was because of the beast souls he usually gave out. He loved handing out beast souls, but they were always some sort of bug. And on a day-to-day basis, he had a dozen bug beast souls all around him, too.\n\nAs for what Uncle Bug’s real name was, none knew.\n\nThe new people who came to the shelter would always receive a bug pet beast soul as a welcome. They weren’t powerful, but they were a worthy aid for newbies when fighting ordinary creatures.\n\nWhen Han Sen and Uncle Bug saw each other for the first time, Uncle Bug looked at him strangely. He was sensitive enough to tell that Han Sen studied both the Dongxuan Sutra and Jadeskin.\n\nHan Sen initially believed Uncle Bug’s peculiar reaction at their meeting was because the man had recognized him. When considering Han Sen’s past-glories, it wasn’t too far-fetched to believe he was a recognizable face, after all. He was once a household name of the Alliance.\n\nPeople still believed he was sick, though, so it would catch anyone off-guard to see him frolicking about the forests of the Third God’s Sanctuary.\n\nUncle Bug was very nice. He took Han Sen and Queen on a tour of the area around the shelter, informing them both about the forest. When he was done, he provided them both bugs.\n\nWhen Queen learned of Han Sen’s intention to remain there, she decided to go out on a hunt.\n\nHan Sen, in the meantime, decided to visit the center of The Forest of a Thousand Insects. For most surpassers, such a place was deadly; for Han Sen, it was a trove of goodies he could easily plunder.\n\nIf the eggs inside there were super creatures, it was sure to be a wonder.\n\nWhat Han Sen currently needed most were super genes. He wasn’t particularly interested in anything else, so he just flew straight for the center.\n\nWhile traveling through the air, Han Sen caught sight of a mountain peak in the distance. It was like a blooming lotus flower, the top of which looked like an entrance. He guessed it was the entry to the nest.\n\nHan Sen flew there and saw an abundance of bugs, all possessing gold shells. Like beetles, they all had shiny gold horns. Their claws were like saws, too. There had to be at least a hundred of the critters.\n\nAt the most, they looked to be mutant creatures. Therefore, Han Sen was too lazy to kill them. Traveling to the center of the mountain, he found a cave. It was the entrance to the nest.\n\nHan Sen looked inside and noticed the surprising absence of creatures. He put on his super mantis armor and summoned Disloyal Knight.\n\nDisloyal Knight entered first, but the path was clear of creatures for its entire length.\n\nThey approached a crystal wall, and they found it already broken. Someone had been there before them.\n\nHan Sen looked around and saw no creatures or living things in the area around them.\n\nUnder the green light of the shattered crystals, Han Sen noticed the presence of many broken bug shells. They weren’t in the best condition, and they looked as if they had been ripped and torn off the creatures they may have once belonged to.\n\nSome were bigger than train cars, others were as small as one’s fist. They were everywhere in that cave.\n\n“This is a strange place. Has someone come here and killed all the creatures?” Han Sen thought to himself.\n\nPeople said two had come to this place before. One died inside, while the other escaped but eventually died, anyway.\n\nHan Sen did not expect a duo such as that would have what it took to kill so many creatures, large and small. Perhaps someone else had come to this place before Han Sen had.\n\nHan Sen was disappointed. He feared the eggs further inside would already be broken. If they had, this entire venture would have been a waste of time.\n\nSince he was there already, though, he kept exploring. And he wouldn’t turn back unless he could confirm the condition of the eggs that were said to reside there. He continued on.\n\nThe bug shells were everywhere, and Han Sen couldn’t help but frown when seeing them."
}