{
    "chapter": 1303,
    "title": "No Dirt Fruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1303",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAfter opening ten gene locks, Han Sen wanted to take down Cup Demon Shelter, but Lotus Empress needed his help before he could do that.\n\nShe told Han Sen what she wanted to do.\n\nFor an ordinary king spirit, nine open gene locks was the max they could achieve. Obtaining ten was a supremely rare thing. For an emperor, opening ten was only the beginning. Once the figure of ten had been achieved, they had to work on what was necessary for them to climb The Ten Steps of the Holy Door.\n\nWalking the ten steps was a great gamble, and beings that braved the door had to be certain they were strong enough to survive. If they couldn’t withstand the purifying flames of the stairs, they would die. Even beings like Xiang Yin were almost unable to complete the ascension process and endure the fire.\n\nLotus Empress was confident she had what it took to brave the steps.\n\nAlthough she was the master of the Holy Baby Fruit, she had no idea which one was the real one, same as all the others.\n\nSo, to find out, she had to find another way. She had come to learn about the existence of a plant that was quite similar to Holy Baby Fruit, and did what it said on the tin. There was no random selection process.\n\nBut harvesting the fruit was difficult, to say the least. That was why she held these events; they were all for selecting individuals who would help her in this task.\n\nShe wanted to collect a fruit called No Dirt Fruit, which was an emperor fruit. It wasn’t aggressive, it was just difficult to pick. No Dirt Fruit required a being with no element to collect it. If it was collected by someone else, the fruit would be polluted and would become toxic.\n\nThose who wanted to collect the fruit were required to use their hands, as well. Tools were not permitted in its collection.\n\nSo, she requested that Han Sen be the one to fetch the fruit for her.\n\n“I found six super creatures and spirits to help me over the years, but they each ruined the fruit they tried to take. Now, there is only one left,” Lotus explained.\n\n“Sister Lotus, I can take the fruit as you ask. But I cannot promise you I am pure enough to collect it without issue, and please don’t take it out on me if I fail.” Han Sen agreed, but he didn’t want to set her up for a disappointment.\n\nHan Sen was proficient with many different elements all at once, and the nature of his body was quite complex. He wasn’t sure if that suited the criteria for being pure.\n\n“If this doesn’t work, I won’t curse your name. I’ll just attribute it to my bad luck,” Lotus kindly replied.\n\nSo, after that, Han Sen decided to follow her to where they needed to go. He himself was rather interested in seeing whether or not he’d be able to collect the fruit without making it toxic.\n\nThe No Dirt Fruit grew on an island situated someplace on the Endless Sea. Even with their teleportation-like speed, it was a far-off place to get to, and it’d take a while.\n\nFurther, she could not use her skills forever to get them there. So, Han Sen asked Flying Fish King to take them to the Endless Sea. The fish king was one speedy boy, and it carried them there at a pace that far exceeded their own teleportation capabilities.\n\nJi Yanran had brought Bao’er back as Han Sen was preparing to leave, so when she heard he was going off with the fish king, she raced over to go with him.\n\nHan Sen asked Empty Witch why Bao’er was what she called a Holy Spirit, and the answer he received was that Bao’er was a pure being. Ordinary people couldn’t sense this, and she herself only found out when the Empty Vine itself was maturing.\n\nEmpty Witch had thought Bao’er was some powerful Third God’s Sanctuary seed during their initial encounter. But when she came to the Third God’s Sanctuary, it was only then that she realized Bao’er was far stronger and far greater than she had imagined.\n\nThe genes of the Holy Baby Fruit were not as strong as Bao’er, and the Holy Baby Fruit tree was already the best in the Third God’s Sanctuary, so who or what Bao’er was perplexed her and Han Sen both.\n\nAnd now that she could see Bao’er once again, she was unable to sense her genes.\n\nHan Sen knew Bao’er was more than just the lifespawn of some geno plant. There were many plants that could bear creatures, but none were able to exit the sanctuaries and visit the Alliance like Bao’er could.\n\nThe sea they ventured across was called the Endless Sea was because no one had yet sailed to the end and returned to tell their tale.\n\nEven stranger, the sea was in the sky.\n\nIt was a ceiling to the ground below, where gravity did not operate correctly. When you entered the area, you had to remain close to the ground. If you didn’t, you’d be sucked into the sea and fall into it as if it were the sky above.\n\nAcross the years, few had returned following being sucked into that sea.\n\nTo step away from the ground, you had to first reach the island.\n\nThe reason Han Sen brought the fish king was because it was the only creature that could survive the waters of that sea without issue. If they accidentally left the ground, they would not immediately lose their lives."
}