{
    "chapter": 2891,
    "title": "Crystallizer High Race",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2891",
    "text": "The faces of the Buddha looked pale. The marks on their foreheads disappeared. It made their bodies violently shake like they had been hurt. Their bodies were in pain as they shook. Their life forces decreased.\n\nBlergh!\n\nBurning Lamp Alpha spat out some blood. He went from butterfly to larva class. All of the Buddha’s levels were decreased by one as well. The boons provided to them by the buffs that came from being one of the higher races were gone. The race lantern, which had no light, was flying into the drop Han Sen’s drop of blood. The blood went into the lantern. It turned into a fire that relit the race lantern.\n\nThe fire grew brighter. The lantern was crystal clear like icy jade. People were unable to feel the heat from it. It actually made them feel cold.\n\nWhen the race lantern lit up again, the lantern shone brightly. The Buddha sign on the lantern disintegrated into dust.\n\nThe race lantern was in front of Han Sen. Han Sen moved his finger. He used the blood to write “Crystallizer” on the lantern and said, “The crystallizers are now a high race. From now on, no matter your association with the crystallizer bloodline, pure or not and no matter how much blood you carry, you are a crystallizer. You are a part of us, and you will be protected.”\n\nWhen Han Sen’s voice boomed, the race lantern’s words were shining like a sun. It shone on the entire universe.\n\nIn that light that shone so bright, Stay Up Late and the other crystallizers had a race mark appear on their foreheads. The shape was like the letters that composed crystallizer, which was the word Han Sen had just written.\n\nBoom!\n\nStay Up Late had already reached King class. He was at the max level. When the crystallizer mark formed, his body quickly changed. He was suddenly made into a deified.\n\nIn every corner of the universe, the leftover crystallizer bloodline that had been exiled were all changing. They all leveled up once. By being one of the high races now, their talents also increased. Their genes were modified by a weird power. They were all enhanced.\n\nIn Space Garden, Tang Zhenliu, Wang Yuhang, Huangfu Jing, and the other humans had a mark appear on their foreheads. Even the foreheads of Bao’er, Ling’er, and Hang Meng’er had the mark appear.\n\nKatcha!\n\nHuangfu Jing’s body changed. She became a transmutation class. Other people ended up the same way. All of them started to evolve thanks to the race mark.\n\nOnly Xie Qing King, Moment Queen, Little Silver, Little Star, xenogeneics, and spirits did not get the crystallizer race marks. Clearly, their bloodline did not have a connection to the genes of the crystallizers.\n\nIn a hidden space in a red dwarf, God’s Retribution and the other Blood Legion member’s foreheads had a mark appear. Clearly, their blood had a crystallizer gene. There wasn’t much, but it was there.\n\nWhichever creature in the whole universe had genes of the crystallizers in them—no matter how pure or not, or how much or little they had—as long they had some, they would have the buff that was now applied to the crystallizer race.\n\nOne shameful thing about it, though, was that the Buddha rank was quite far behind. The effects of their buff were nothing exceptional. Their genes did not improve by much or very fast.\n\nIf they were able to get to the top 10, the gene modification level would be increased. It would make the talent of the whole race increase by a lot.\n\nHan Sen’s lantern was different from Kong Fei’s because Kong Fei was a Feather and had been abandoned by the Feather. He was exacting revenge on the Feather, so he chose to be a separate race. He refused the lantern’s power that would provide him a buff.\n\nHan Sen chose to buff his entire bloodline. No matter how much crystallizer blood one had, even if it was only just a little, one could get the crystallizer bloodline’s buff.\n\nEven if that person had another high race’s blood, as long as the body had some crystallizer genes, they could get the crystallizer bloodline’s buff. They could also have the buff that applied to another bloodline. That was what most high races did.\n\nHan Sen chose this because the blood of humans was not pure. If he only selected a pureblood buff, he did not think there would be many humans that could enjoy the crystallizer race lantern’s buffs.\n\nThe crystallizer race lantern was shining brightly. The geno hall’s lantern was bright. It was like celebrating the birth of a high race. It looked like it was fighting to be the brightest. It shone across the whole universe.\n\nAfter the crystallizer lantern flew into the geno hall, the gates of the geno hall closed. The universe returned to normal. The new marking on the many crystallizer creatures started to fade. It was not blatantly visible anymore.\n\nThe buffs that modified their bodies remained.\n\n“Us, crystallizers… We finally become a high race” Stay Up Late, who was always quiet, roared to the sky. He looked as if he was going to unleash all the sadness and anger he used to have.\n\n“Crystallizers… We are a high race…” Many of the crystallizers were shaking. They looked at their bodies. They could not believe that this was true.\n\nAll the races in the universe looked at Han Sen, who was in space, with a conflicted feeling. Han Sen went over to look at Burning Lamp and the rest of the Buddha.\n\nThey felt Han Sen’s vision. Burning Lamp was shaking. He looked terrible.\n\nHe thought having the causal karma knife would make it the ideal time for the Buddha to shine, but this was how things had ended up.\n\n“This really is because of karma. If I had not stolen this knife blank, the Buddha would not have ended up like this.” Burning Lamp felt lifeless. He put the causal karma knife, god doll, and break soul bone in front of Han Sen. He bowed and said, “This was all my fault. It is not the fault of the Buddha at large. The Buddha are not worthy of these items. I can give them to you, and you can also take my life. But please try and be nice for god. Let the Buddha live. Even if I go to hell, I would be grateful.”\n\nHan Sen waved his hand. He placed the causal karma knife, god doll, and break soul bone in his hands. He looked at Burning Lamp and said, “I will not kill you, nor will I destroy the Buddha. You stole my knife blank and turned me into an ant. I am here giving you what you deserve.”\n\nAfter that, Han Sen waved his hands. The weird God Light on Burning Lamp flickered. Burning Lamp’s body devolved. He suddenly went from deified class to King class. From King class, he was reduced to a Duke. Suddenly, the geno god list elite became an average creature of the universe that was not even a Baron.\n\nBurning Lamp, who once looked so powerful in the god fights, now looked like a completely old man. He looked like dried wood. No more power was emitted from his body. His lifeforce was almost gone. It allowed many of the elites to feel a chill, especially Northern Light Alpha and the others who were watching the fight at a close distance. Their heads felt numb. They did not push their luck. They didn’t dare stay, so they swiftly abandoned the area.\n\nSeeing Northern Light Alpha and the other true gods depart, Han Sen squinted. His eyes. He immediately turned around and left.\n\nBurning Lamp, with a very weak lifeforce, spoke the Buddha catchphrase. “Amitabha! Thank you for not destroying the whole of the Buddha.”\n\nHan Sen ignored Burning Lamp. He turned around and planned to leave. Burning Lamp’s life was running out of oil. Even if Han Sen did not kill him, he was not going to live much longer. Han Sen was merely too lazy to take his life. Regarding killing off an entire race, Han Sen could not do that. In fact, he was just like Kong Fei. He did not want to kill people. Kong Fei hated the Feather a lot, but he did not want to destroy every Feather in existence. He had even taken in many Feather orphans.\n\nHan Sen could not do what Kong Fei did. He would not take care of the Buddha, but he did not want to slay them all.\n\nThe fight to light up a lantern was over, but what Han Sen had stirred up wasn’t. This fight had a major effect that influenced the entire shape of the universe."
}