{
    "chapter": 1900,
    "title": "Summoned Buddha",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1900",
    "text": "“Qing Li, what are you talking about?” Du Lishe asked from her seat next to Qing Li.\n\n“I think Han Sen wrote better than No Flower did,” Qing Li answered.\n\nWhen other members of Moon Garden heard this, they thought she meant something about his handwriting being prettier. One of the members scoffed, “Qing Li, No Flower’s Touching Flower Finger is something that ascends mere prettiness. There’s a meaning inside it that is far more important. The shape of the characters is secondary.”\n\nQing Li answered this by saying, “I was referring to the meaning. I think the meaning of the Buddha’s text was lacking compared to Han Sen’s.”\n\nThey all heard what she said, but no one believed her. That was, aside from Black Steel. Black Steel was the only one there who knew Han Sen possessed such a frightening knifemind.\n\nRebecca looked at Qing Li and said, “Qing Li, when did you see Han Sen write? And what did his words mean?”\n\n“It was a few days ago. The words he wrote meant Teeth Knife’s Knife Mind,” Qing Li said.\n\nRebecca shook her head. “I don’t think so. How long has he been practicing Teeth Knife? He is just a Baron. He cannot generate any sort of significant knifemind. Even if he was able to, it couldn’t be half as good as No Flower’s Touching Flower Finger. That is something only one of the King class can generate. And Han Sen is no Buddha, either. How can you believe a Baron has a knifemind like that?”\n\n“Your thought process is right, but I’m telling you; Han Sen’s writing abilities are better than No Flower’s.” Qing Li was weak. She could only feel it instinctually, but she was still sure it was true.\n\nHan Sen and Gu Qincheng were observing No Flower’s writing, at the time. Gu Qingcheng was shocked, and she said, “That monk is not bad.”\n\nGu Qingcheng actually meant exactly what she said; rather than being amazing, No Flower’s talent was simply not bad.\n\nThe creatures in the sanctuary were far weaker than those in the geno universe, but that was just a factor of base strength. When it came to the actual workings of combat, and the finesse of it all, those that had made it through the sanctuary were far superior to those in the geno universe.\n\nGu Qingcheng’s sword skills were the best to be found in the sanctuary. Her swordmind was among the greatest there, too. Despite that, her raw power was weak in comparison to others found in the geno universe. That being said, her knowledge of sword skills and swordminds exceeded what a King class in the geno universe would know.\n\nMost beings from the sanctuary were this way, too. There were a few exceptions to that rule, like Wang Yuhang, though. He didn’t really have all that much knowledge when it came to fighting, but even so, he was better than most Viscounts and Earls.\n\n“Not bad? You sure sound cocky. If No Flower is only not bad, then do you care to enlighten us as to what can be defined as good?” said the cow-headed man next to them.\n\nGu Qingcheng did not want to talk to a cow, so she ignored him.\n\nHan Sen saw No Flower and was shocked.\n\nWhen he had looked at Unlimited Sutra, he felt the Buddha’s geno art was quite strange. Since he had seen the raw text, he could understand why this was so weird.\n\nBuddha King and No Flower’s powers were not the same, but Han Sen felt they were similar. It reminded him of a scary guy.\n\nHan Sen poked his head into his Sea of Soul. There was a tower in there, and it still had the word destiny scrawled across it. He put his will inside Destiny’s Tower, and there, Han Sen saw Armored Man and Ancient Devil. They were still both incarcerated there.\n\nSince Ancient Devil had been locked up, Armored Man had been fixated on the concept of skinning him alive. But with them both locked up, he couldn’t lay a finger on Ancient Devil. So, all he had done was shout at the spirit, all day, every day.\n\nAncient Devil had been locked up for a long time, but he didn’t pay too much attention to his cellmate. He meditated all day like a monk, not caring for the constant shouting in his ears.\n\nIn the beginning, Han Sen had frequently watched Ancient Devil, but that man meditated like he had been frozen. He never moved an inch, and so Han Sen lost interest.\n\nNow that he could see No Flower’s performance, he knew why it felt so strange to him. It was because the Buddha gave Han Sen the same feeling he got when he observed Ancient Devil.\n\n“Does Ancient Devil have Buddha genes?” Han Sen guessed.\n\nAncient Devil seemed to sense something, as well. He opened his eyes and looked right at Han Sen. After being imprisoned for so many years, his eyes were still sparkling with clarity. They hadn’t gotten dusty.\n\nIf you stared at him for a while, you’d feel as if his eyes were bottomless wells. Looking him in the eyes was like peering into an abyss.\n\n“What would you like to know?” Ancient Devil suddenly asked.\n\nHan Sen was shocked, and thought to himself, “This guy has been locked in Destiny’s Tower, and he could sense I was watching him. What a scary man!”\n\nHan Sen did not plan on avoiding the question. He used his will to echo answers throughout the chambers of the tower. He said, “Ancient Devil, do you know about the Buddha?”\n\n“Yes,” Ancient Devil answered.\n\nHan Sen felt even weirder now, and that was because Ancient Devil had just leveled up to the Alliance when he was trapped inside the tower. There was no way he had ventured to the geno universe before then and learned about the Buddha that way.\n\n“What do you know about the Buddha?” Han Sen asked.\n\nAncient Devil smiled and said, “I once summoned a god. And the god said he was a Buddha.”\n\nThis shocked Han Sen. If Ancient Devil had summoned a Buddha, that also meant that Asura had been the one to kill a Buddha.\n\nBut Buddhas were in the geno universe, and it couldn’t have been possible for it to be summoned to the sanctuaries. It made no sense. The Buddha could most certainly not enter a sanctuary. Especially since it was summoned to a sanctuary below the Alliance level.\n\n“I am talking about the race, not the religion,” Han Sen said, hoping he’d get a confirmation.\n\n“Bald with nine moles? Like scars? This is what you mean?” Ancient Devil said simply.\n\nNow, Han Sen knew that Ancient Devil did indeed know of the existence of the Buddhas. Whether they were real or fake, Ancient Devil knew about them.\n\n“How did you summon that god to the Fourth God’s Sanctuary?” Han Sen asked.\n\n“You want to know? Give me back my freedom and I’ll tell you everything.” Ancient Devil seemed his usual self. He didn’t exhibit any personality changes.\n\n“You don’t have what it takes to bargain with me,” Han Sen coldly said.\n\n“There is no need for this discussion to continue, if my freedom is not up for debate.” Ancient Devil closed his eyes and returned to that frozen state.\n\nHan Sen felt pretty bad. He had used death threats and torture techniques in the past, but using them on Ancient Devil was pointless. Even when the spirit was tortured, he would simply continue meditating.\n\nAncient Devil must have had the strongest will there was. Not even Kings of the geno universe could compare to him."
}