{
    "chapter": 2788,
    "title": "Big Fire Burns the Flowers",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2788",
    "text": "They were still wildly powerful. As they went, their bodies kept changing. They had become extremely strong. When Bai Wanjie unleashed his power against a Flower God, he could only send them flying. The Flower Gods were never slow in catching up.\n\nBai Wanjie, who was a deified elite, was the only one who could do that. The others from the Extreme King were doing even worse. There weren’t many of the Extreme King following Bai Wanjie. Most of them looked to be riddled with injuries. It appeared as if many had been killed.\n\nThe girl Han Sen had spoken to before made strange movements. She was able to move perfectly when the Flower Gods chased her, and she was able to avoid taking damage from the fiends.\n\nSince they were not able to kill the Flower Gods, Bai Wanjie and the others could only flee. They did not have time to fight them face-to-face.\n\nHan Sen did not have much reason to be interested in their struggle. Plus, they were people from the Extreme King. Han Sen and the Extreme King had a deep-seated grudge with each other. Han Sen considered himself nice enough for not making things worse for them. Either way, he was certainly not going to make an effort to rescue the Extreme King’s crown prince.\n\nWhen Bai Wanjie and the others walked past them, a few of the Flower Gods noticed Han Sen and Xie Qing King, then went to them.\n\nBai Wanjie and the girl saw Xie Qing King and Han Sen, but they did not bring the Flower Gods to them on purpose.\n\nBai Wanjie did not believe people could kill those Flower Gods, so he did not expect Han Sen would be able to do much of anything. They didn’t draw the Flower Gods to them on purpose. When the few Flower Gods noticed Han Sen and Xie Qing King, they went after them.\n\nThe girl shouted in Han Sen’s direction. “Why are you frozen there? Hurry up and run!”\n\nShe had just finished shouting when she saw Han Sen throw a punch toward one of the Flower Gods. She could not help but shout, “Is this guy crazy? If he is trapped here and has a burden, he cannot even hope to escape!”\n\nPang!\n\nWhile the girl was thinking, Han Sen’s fist powered into the face of one of the Flower Gods. The strong power blasted the Flower God a few hundred feet away. It broke through many trees before collapsing to the ground.\n\n“That power is unbelievable!” The girl was shocked. Han Sen’s punch was far stronger than what Bai Wanjie was able to do, which surprised her a great deal.\n\n“Even if he is strong, it is futile. The Flower Gods can never die… Never…” The girl was frozen. Her eyes were opened wide in sheer disbelief.\n\nThe Flower God that had been punched away by Han Sen was burning with a white flame.\n\nThe Flower Gods had been fighting against them for a while. They knew the bodies of the Flower Gods were obscenely strong. Even if they were hurt, they quickly recovered. They did not seem to know the meaning of pain.\n\nBai Wanjie had used many different geno arts to punch them away. He had done this several times. All the different powers used hadn’t been effective on them. He had not been able to make a single one scream.\n\nNow, the Flower God was screaming and rolling around on fire. It squealed like a pig getting slaughtered.\n\nHan Sen and the other Flower Gods were not content to sit still. Han Sen’s body was like a swimming dragon. He punched each of the Flower Gods once. Within the blink of an eye, they all fell on the floor.\n\nIt was different from the Flower Gods Bai Wanjie had knocked to the ground. The Flower Gods Han Sen punched down were unable to get back up. They were all writhing around on the floor, burning due to the pain inflicted by the fire. It made Bai Wanjie and the others feel very weird.\n\nThe scorching white flame was burning them, but the bodies of the Flower Gods did not look to be incinerated. Either way, the flowers atop their heads were rendered little more than ash. When the flowers were gone, so too was the fire. The few Flower Gods fell to the ground without any energy. They stopped screaming. They refused to get up and continue their assault.\n\nBai Wanjie and the others sensed that the presence of those bodies had been weakened. They were not deified anymore. They were only King class at best.\n\n“What is that fire?” the girl asked with surprise. Clearly, Han Sen’s power was the right remedy for sorting out those Flower Gods.\n\n“Thank you for helping me out.” Bai Wanjie brought his people over to see Han Sen. He drew the final few leftover Flower Gods over, too.\n\nHan Sen quickly dropped all of the Flower Gods onto the ground. Again, they writhed around in pain due to the fire.\n\nUpon seeing that, the Extreme King people were shocked. They had been chased by the Flower Gods for a long time and run out of options. They thought they would for sure bite it in the end. After all, many people already had.\n\nThe monsters, which had once been thought invulnerable, were killed by Han Sen with ease. They could scarcely believe it.\n\nThat was especially true for the Extreme King girl. She looked at Han Sen weirdly, as if they did not know each other.\n\n“You are welcome, My Crown Prince,” Xie Qing King said with a smile. “We are all trapped here, and so it is only right that we help each other out.”\n\nBai Wanjie thanked Xie Qing King again. He looked at Han Sen and said, “I wonder what your name is.”\n\n“San Mu,” Han Sen coldly answered, but he did not look at Bai Wanjie.\n\nBai Wanjie had no idea who he was. It seemed as if he really wanted to ally with Han Sen as he went on to profusely compliment him. Han Sen just ignored him completely. He didn’t say a word back.\n\n“San Mu is always like this. Please, do not mind him, Mister Crown Prince.” Xie Qing King looked down at the Flower Gods without their flowers. They were not dead. They eventually staggered up to their feet.\n\nBai Wanjie and the others from the Extreme King were going to kill them, but the Flower Gods walked in front of Han Sen and kneeled. They said, “Thank you for saving us! Please show us mercy and save the rest of our people.”\n\nHan Sen did not speak. He looked at Xie Qing King nearby.\n\nXie Qing King cleared his throat and replied, “We can save you, but what can you reward us with?”\n\n“If you two are willing to save our endangered people, we are willing to share the Space Garden,” an old Flower God said.\n\nXie Qing King smiled and said, “I don’t like sharing things.”\n\nThe faces of the Flower Gods changed. They understood what Xie Qing King meant.\n\n“If you guys can save my people, the whole of the Flower God race will be willing to serve you.” It was still the old Flower God doing the talking.\n\n“Do you stay true to your word?” Xie Qing King looked the old man up and down.\n\n“Yes, I am the leader of the Flower Gods,” the old man said with a sigh.\n\nHan Sen and Xie Qing King looked at each other. They sensed how happy they both were. They had broken their shoes, unable to find what they were looking for. Now, they had achieved it all with ease.\n\nBai Wanjie wanted the Flower Gods, but he did not know who Han Sen was, and he was surprised by Han Sen’s strange power. He did not dare fight him. He just watched Xie Qing King claiming the Flower Gods."
}