{
    "chapter": 2336,
    "title": "Sick Beauty",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2336",
    "text": "If a prince didn’t even have the blessing from the Kingese on the king tree, people would believe him to be very unfortunate. They would think the prince was plagued by bad luck. Such a person could never lead the Extreme King and rule the known world.\n\nAlthough the protection of the Kingese didn’t accurately represent the luck of a prince, it still affected the way they were perceived by others. Thus, the royal children wouldn’t seek the protection of the Kingese on a random whim.\n\nIn the era of King Bao’s reign, there was a much-loved prince. He was very intelligent and a sublime fighter. King Bao was extremely fond of him, and many nobles believed that the prince would be the one to take the throne and succeed King Bao.\n\nEven the prince himself believed he would be the one. He thought he was a man that was blessed with great fortune and luck. So, he went to King’s Cover to test the mettle of his beliefs. But he did not get the Kingese. After that transpired, King Bao’s love turned sour. He didn’t allow the prince to succeed him, and instead passed the mantle onto the man now known as King Bai.\n\nThe prince didn’t lose the throne solely due to the lack of Kingese protection, but it was one of the primary factors involved.\n\nSimilar things transpired in every era of the Extreme King, just to varying degrees.\n\nThe royal children that wanted to take the throne wouldn’t dare risk being rejected by the King’s Cover; it was the royal children that were not ambitious that were more willing to try. A rejection wouldn’t affect them as much.\n\nA royal child who got the blessing of five Kingese would be deemed a lucky person. Getting the blessing of nine Kingese meant a person was super lucky. Getting more than nine was something most kingly, and it was also absurdly rare.\n\nBut even getting the protection of more than nine Kingese didn’t guarantee a chance at the throne. So, the Kingese’s protection didn’t mean everything.\n\nLuckily, the Kingese itself was useful. It was good to have, so the more the better.\n\nBai Qing Xia moved like a cloud, coming for Han Sen.\n\nHan Sen grunted in annoyance. After he used the Extreme King’s Shocking Sky Punch to counter Bai Qing Xia’s palm, the fight continued.\n\nBecause they were too close to the king tree, the last thing they wanted to do was hurt it, so they held their powers and fought with raw strength.\n\n“Huh? Prince Qing Xia has great palm skills. That must be King Seventh’s Hatred Times Ten.” A Prince blurted as he looked at Bai Qing Xia.\n\n“It really is Hatred Times Ten. Times One is one area, while Times Ten is half-deified. I cannot believe Bai Qing Xia learned this. He just became King class, did he not? He only has Times One area power. His Hatred Times Ten is only at its first tier,” another prince commented.\n\n“But Bai Qing Xia is weak. It is surprising that he is able to learn such a powerful geno art at all,” another prince remarked.\n\nBai Ling Shuang watched Bai Qing Xia and frowned. “Bai Qing Xia hid his abilities this well? It looks as if he has come here to seek out the protection of King’s Cover. That is an unusual choice. We have clearly been underestimating him. His heart must be far more complicated than most of the princes that can harness strong power.”\n\nMiss Mirror saw Bai Qing Xia’s Hatred Times Ten and looked on with interest. She said, “This pretty prince has practiced Hatred Times Ten. And on top of that, it isn’t just at the first tier. This is really interesting.”\n\nAfter pausing, Miss Mirror laughed and said, “Good! Let’s see how he does against Han Sen.”\n\nHan Sen used his Extreme King Shocking Sky Punch to fight against Bai Qing Xia. Han Sen was surprised as they fought. That pretty man’s fighting power far exceeded his expectations.\n\nThe man’s hands moved fluidly, and they didn’t look very strong. But even so, they gave off a palpable sensation of evil. Han Sen could feel this very clearly, and if he was careless, taking just half of one hit could deplete him of half of his life.\n\n“Weird. Why does Old Sixteen only use the Shocking Sky Punch? Does he only know this one skill?” Prince Nineteen looked on and frowned.\n\nPrince Nineteen stood beside Prince Fourteen Bai Canglang. Bai Canglang laughed darkly and said, “Old Sixteen is deliberately insulting Seventeen. He wants to use Shocking Sky Punch to beat Hatred Times Ten. His arrogant personality clearly hasn’t changed a bit. Luckily, Seventeen has the first tier of King area. If he didn’t, he would have been killed by now.”\n\n“I don’t know how a guy like him was able to claim the alpha statue,” Prince Nineteen said with a lift of his lips.\n\n“Everyone is bound to have some good luck at some point.” Bai Canglang looked at Han Sen with scorn.\n\nBai Qing Xia noticed that no matter how much he altered his palm skills, Han Sen was still only using Shocking Sky Punch. He concluded that Han Sen was insulting him on purpose, and his pretty face reddened with anger.\n\nSuddenly, Bai Qing Xia changed his palm skills. The weak-looking palm skills became a laser that could pierce through the universe. And now, one of those strikes was headed for Han Sen.\n\nThe blow was too fast, and no one should have been able to react to it.\n\n“Love too much and you become hateful… That is the second tier of Hatred Times Ten! How is that possible? Bai Qing Xia is just a first-tier King! How could he now have Hatred Times Two?” Prince Nineteen looked shocked.\n\nBai Canglang’s face changed, as well. He looked to be just as stunned.\n\nMany other princes and princesses stared mutely at the fight. Bai Ling Shuang frowned. “I suppose we must say goodbye to the old Qing Xia. He has used his first-tier body to hold Hatred Times Two. It must have taken incredible cunning to hide away all this power within a body that we all thought was sickened and weak.”\n\nHan Sen didn’t move. He threw another Shocking Sky Punch, and his fist came against the sharp, opposing light.\n\nPang!\n\nThe scary presence exploded. That laser light was crushed by Han Sen’s fist and rendered harmless.\n\n“That was a perfect Shocking Sky Punch. No wonder Brother Sixteen claimed the alpha statue,” Bai Qing Xia thought, maintaining his calm. He flipped his hand, and this time, it went from fast to slow. It was like he was slowly pushing a mountain towards Han Sen.\n\n“One palm to sunder the day and night cycle… It is Hatred Times Three!” A prince was shocked.\n\nBai Qing Xia had been known as the Sick Beauty. Everyone had believed, for years and years, that he was weak. But suddenly, he was exploding with so much power and talent.\n\nHatred Times Ten was super hard to practice, and it required a massive amount of talent. Not many royal children could practice it, so it was a very stunning revelation that Bai Qing Xia had learned the skill. Now, his first-tier body could make Hatred Times Three’s palm split the day and night cycle. How could people not be surprised by this?\n\n“Scary talent. Very deep mind.” All the royal children’s eyes changed as they looked at Bai Qing Xia. They once looked at him with pity and disgust, but no longer."
}