{
    "chapter": 121,
    "title": "Wipeout",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_121",
    "text": "A few seconds later, Shi Zhikang’s face collapsed. Eyes wide and hands shaking, Shi exclaimed, \"Sen, you asshole, are you the reincarnation of Taka Kato?\"\n\nSeeing Han Sen's hand quickly moving as if he was having spasms, Shi Zhikang was more and more shocked and panicked, as he had not touched many spots near him.\n\n\"Shi, you are yelling like a pig being slaughtered. Stop being so dramatic,\" Lu Meng, who was in the middle of a game, protested.\n\nShi Zhikang had completely given up. Watching Hen Sen's hand dancing, he lost all desire to play.\n\nShi Zhikang rolled his eyes and told Lu Meng, \"Sen’s skills are strong. I believe in our room, no one is his match except for the leader.\"\n\nLu Meng replied, \"Shi, your loss is on you. Don’t bring other people into it.\"\n\n\"Lu, you are not even as good as me. If you play against Sen, you would lose all the same,\" Shi Zhikang deliberately raised his voice and said.\n\n\"I'll show you who the real master is, but if I win, this month you need to do the cleaning,\" said Lu Meng.\n\nShi Zhikang’s face suddenly showed a trace of joy, but he then immediately suppressed it. He looked hesitant and said after a long while, \"Alright. But if you lose, you need to do the same.\"\n\n\"OK, no problem. Let me finish this round first.\" Lu Meng believed in himself. He had passed unevolved-9 in Hand of God, which was quite good among all freshmen. Maybe he was not the best player, but he could easily join Hand of God Society.\n\nIn addition, they were all in the Department of Archery, which had no high demand for speed, so normally archery students were weaker at this game in general. Except for Han Sen, Lu Meng did not think any of his roommates could beat him.\n\nShi Zhikang had lost to Han Sen because he had poor skills. Anyone could beat Shi as he was too slow. Therefore, Lu did not believe what Shi had claimed about Han Sen’s strength.\n\nLu Meng finished his game and flashed the score in front of Shi, \"See? This is what a landslide victory looks like—63 to 45. I’m a genius.\"\n\n\"Now that is useless. You have to beat Han Sen.\" Shi Zhikang smiled at Han Sen and said, \"Sen, you don’t want to do cleaning either right? If you beat him, we don’t have to do anything for a month.\"\n\nHan Sen smiled and said, \"I know what to do.\"\n\nLu Meng invited Han Sen to his game room and said casually, \"Sen, your ID is going to cause trouble. If you don’t believe me, try looking for a match on Battlenet. the boys will line up to kick your ass.\"\n\n\"I'm used to it,\" Han Sen smiled.\n\n\"Failure is good. It helps you make progress.\" Lu Meng began the game, slowly drinking from a bottle of water at the same time.\n\nWhile drinking, he provoked Shi Zhikang, \"Shi, check out how I beat Sen singlehandedly. Don’t deny it when you lose.\"\n\n\"Awesome. Lu, you are just awesome.\" Shi Zhikang curled his lips with his arms folded, waiting to enjoy the show. He thought, \"Everyone is only allowed to use one hand in the versus mode anyway. Boast all you want now, you will cry later.\"\n\n\"So I am,\" Lu Meng answered proudly, unaware of Shi's sinister intention.\n\nAt the end of the countdown, the spots popped out and Lu Meng did not plan to put aside the water bottle. Reaching out to touch the spots while drinking, he paid no attention to Han Sen's hand.\n\nHe felt as long as he played normally, he could certainly beat Han Sen.\n\nOnly a few spots down, he caught a glimpse of the other hand and felt its speed was abnormal, so he looked up.\n\nOne look and Lu Meng was suddenly stunned, forgetting even to reach for the spots. The water bottle froze on the edge of his lips. He maintained that position and did not move for a long time.\n\nHan Sen's palm was shaking at a dazzling speed as if it had a secret engine installed. All the spots were gone.\n\nLu Meng had picked unevolved-10 for this round and he could not even clear the spots on his own side, while Han Sen had cleared them up for him, while looking quite relaxed.\n\n\"Lu, what happened to beating Sen singlehandedly? How about you try with both hands now?\" Shi Zhikang saw Lu Meng stunned and laughed.\n\n\"Try your ass. Sen, you must have passed unevolved-10?\" Lu Meng cried.\n\n\"That’s about right,\" said Han Sen casually. In fact, he had already passed evolver-4, which was much higher than unevolved-10.\n\n\"S*#t!\"Lu Meng cursed and cried, \"Shi, you are so devious. There is no way our leader could beat Han Sen. You were setting me up deliberately.\"\n\n\"You are the one who suggested cleaning, not me.\" Shi Zhikang grinned and spread out his hands to show his innocence.\n\n\"Unevolved-10? Sen, let’s have a go.\" Zhang Yang overheard their conversation and flames were burning in his eyes.\n\nHan Sen went into Zhang’s game room and beat Zhang easily. Zhang’s level was about the same as Lu Meng, or maybe slightly better. They should both be around unevolved-9.\n\n\"Play again.\" Zhang Yang was not discouraged.\n\nOnce again he was defeated.\n\n\"Play again.\" Zhang Yang wanted to play even more.\n\nDefeated again,\n\n\"Again.\" Zhang Yang was almost burning.\n\n\"Brother, let’s stop here. You can even consider me the loser.\" Han Sen was really afraid of Zhang, a masochist who took pleasure in losing.\n\n\"I finally found my destined opponent. Sen, happy fighting!\" Zhang exclaimed excitedly and dragged Han Sen into his game room one more time.\n\nLu Meng and Shi Zhikang chuckled when seeing this. Such a person as Han Sen could only be contained by someone like Zhang Yang.\n\nHan Sen was scared of Zhang. Ever since they played that time, he would drag Han Sen to play Hand of God whenever he had time. He was happy but Han Sen was hysterical.\n\n\"This is not the way to go. I must curb his desire to fight me.\" Han Sen’s eyes were sparkling."
}