{
    "chapter": 1934,
    "title": "Adoption",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1934",
    "text": "The Magic that turned into Yisha knew what Han Sen was thinking, and so it said, “Our lives are weak, and our lifespan is only one hundred Magic Days. That accounts for one cosmic year, in the geno universe. If we get adopted, our lifespan increases to that of our hosts. We live as long as they do. So, upon birth, most of us opt for adoption.”\n\nHan Sen now understood. While it was technically adoption, it was similar to a parasitic relationship. He didn’t know if they’d actually benefit the host, and if they did, what benefit they would give.\n\nThe Magic anticipated this worry. Seeing Han Sen’s facial expression, it proceeded to explain, “An adopted Magic won’t affect the life of its host. They only take a small part of the host’s energy. And even so, it is down to the host to decide how much we absorb. If you just wanted to keep us alive how we are, a bottle of C4 geno fluid will keep us going for a whole cosmic year. If you want us to evolve, you have to provide more energy than that. And providing and accepting energy is the cornerstone of our relationships; we’d never take anything without permission.”\n\n“A C4 geno fluid is just a meal. It isn’t much, at all,” Han Sen said, as he looked at Yisha.\n\nYisha smiled and said, “The Magic are a peaceful race. If you didn’t give want to give them energy, and they were deprived of nutrition, they would die. But even so, they wouldn’t try to steal the resources from you. But overall, they are low maintenance and only require a small amount of energy. If you want a high class one, though, then of course they require greater amounts of energy. And they are harder to level up than the average Noble.”\n\n“In that case, why don’t I adopt a few?” Han Sen thought the Magic were cute. They were not annoying, and Han Sen didn’t want them all to die.\n\nHan Sen could also take a few home to Bao’er to be her companions. And he had plenty of energy to spare.\n\n“Dear Customer, we are sorry. Only one Magic per person is the custom. It’s a precaution,” the Magic said.\n\n“Okay, then I’ll adopt one,” Han Sen said.\n\nThank you. Please come this way.” The Magic led the way. Han Sen and Yisha followed it away from the port.\n\nWhile their port might have looked modem, the other portions of the planet all looked rather primitive. You could see big, grassy fields occupied by globs of jelly that were all hopping around. It was like something out of a fairytale.\n\nOn one of the grassy fields, the Magic that looked like Yisha pointed at Han Sen and shouted. “Kids! These customers would like to adopt one of you. Who would like to go with them?”\n\nQuickly, many smaller globs of jelly came hopping over. They were all jumping and bopping around Han Sen, saying, “Pick me! Pick me!”\n\nHow do I decide?” Han Sen, seeing this group of Magic, did not know what to do.\n\n“There is not much difference between them. How they grow is down to the host and the energy they receive. You should just pick whichever you like,” Yisha said.\n\n“Pick me! Pick me!” The Magic had their eyes wide open, as they hopped around Han Sen. They earnestly wished to be the one selected.\n\nHan Sen chose a small one. It was a yellow blob of jelly, around the size of a fist. He laid it out in the palm of his hand and said, “I’ll choose this one.”\n\nThe other Magic looked disappointed and left. They returned to playing around on the fields, waiting for the next chance of adoption.\n\n“Please drip a droplet of blood onto its head. Then you can live with it,” the Magic said.\n\nHan Sen touched a drop of blood onto the yellow jelly ball. He watched as the blood was absorbed, then disappeared entirely. When it was absorbed, Han Sen felt a sudden connection form between him and the Magic. It was like he could read the glob’s mind.\n\nThe Magic was very happy, jumping around Han Sen’s hand.\n\n“What is its name?” Han Sen asked.\n\n“They don’t have names. You can provide it a name, if you so choose,” said the Magic that looked like Yisha.\n\n“I will call it Bubble,” Han Sen said. He wasn’t very good at naming things, and he went for whatever rolled off the tongue comfortably.\n\nAfter he adopted Bubble, Yisha took Han Sen away from Planet Magic. They continued on their way, headed for the biggest xenogeneic space of the Buddha. On the way, Yisha told Han Sen that having a Magic would help him pass through the heaven there. That was why they stopped there on their way.\n\nHan Sen wanted to ask how the Magic would be helpful, but Yisha seemed to be lost in thought and not very talkative.\n\nThe Buddha were richer than the Rebate, and they owned many systems. The biggest base they had, however, was Buddha Kingdom.\n\nIt was a xenogeneic space that was akin to Narrow Moon, but not many planets were there. There was just a chunk of land in the sky. That land could still be bigger than a system, though. Its size was almost unimaginable.\n\nHan Sen and Yisha didn’t have to announce themselves. They entered the xenogeneic space without being challenged. The Buddha Kingdom was very open, and there were many different races occupying the city. There weren’t even that many of the Buddha there, actually.\n\nHan Sen was surprised to see that many of the Buddha and others had their own Magic. It seemed to be a surprisingly common thing.\n\nYisha said, “I have to do something before we listen to the speech. You should walk around this Buddha place for a bit, so you might learn a thing or two. I’ll catch up with you later.”\n\nAfter that, Yisha was gone. She disappeared, leaving Han Sen alone on the streets.\n\nHan Sen did not know what to do, so he just decided to mosey around. That place was entirely new to him. There were many things there he had never seen before, so it was quite interesting.\n\nOn the corner of a city block, there was a man clad in strange garb. He was sitting behind a broken table and holding up a sign that no one there understood. He was smoking, and each puff was done with squinted eyes.\n\nNot long after, an old Buddha walked past the broken table looking sad. For some reason, the sign the man was holding fell onto the Buddha’s bald head.\n\n“What is wrong with you?” The old Buddha man rubbed his bald head and stared at the man. He didn’t say anything more, and he started to walk away.\n\n“Fellow Buddha, your eyes lack emotion and your forehead is black. You have some black smoke coming out of your head. Something bad must have happened to you recently.” The man moved to grab the old man and spoke seriously."
}