{
    "chapter": 1269,
    "title": "Accidental Reward",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1269",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“It is no wonder why the empress wasn’t willing to take them herself. Both the fish king and Yaksha were destroyed in their attempts to obtain it.” Han Sen was relieved he had not tried to take the fruit before the others did.\n\nBut if the empress and berserk super creatures could not take the fruit, why would she believe a human was capable?\n\nHan Sen hid himself in the woods and started to watch the man intently. He was climbing at a very slow pace, and Han Sen wasn’t sure if the man was simply a poor climber, or if he was deliberately going slow in fear of what awaited him up top.\n\nThe empress was still fighting the fish king. Now she could be seen rising up into the air, still seated firmly upon her throne. Despite fighting in the water for all that time, her clothes did not appear wet. And she was so still, it was as if she was inanimate.\n\nThe fish king leapt out of the lake in pursuit of her. Its mouth spat out torrents of water in her direction.\n\nThe entire throne was bathed in a strange light, as the serpents bobbed and weaved to block and deflect every rocket of water that targeted their mistress.\n\nHan Sen was in awe of how the empress fought, and he was severely impressed by how adequate and capable the throne was in combat.\n\nHan Sen had yet to see what the empress herself was capable of, though, as the throne wasn’t actually a part of her. They were two halves, clearly, but they were also separate entities.\n\n“Does this mean the empress and the throne are… two emperor-class beings?” Han Sen wondered to himself.\n\nFor now, though, the victor of that fight had a long way to go before being determined. No one had the upper hand, and despite the crazy fish king that was after her, the empress seemed far more concerned with the man who was climbing. More often than not, her attention and eyes were locked on him.\n\nHan Sen, when not observing the events of that battle, watched the man go, too. He was very slow.\n\nThe man was clearly not in a rush, and if he continued at that agonizing pace, it’d take another half an hour for him to reach the top.\n\nTidal waves were starting to drown the encompassing lands of the lake now, too. Han Sen found himself hugging a tree to remain upright, as the water was up to his waist. There wouldn’t be a forest for much longer, that was for sure.\n\nSomething then began to float up from beneath the chaotic waves of the water.\n\nIt was the pinecone Han Sen had removed from the fish king’s head. It was bobbing along with the tumultuous waves, but strangely, it was coming for Han Sen. He thought it might have been looking for another forehead to call home.\n\nHan Sen was shocked when he thought about this. He knew he’d have to be careful, as there’d be no one around to help remove it from his forehead if it truly did plant itself there.\n\nHan Sen swam away from it, but the pinecone was in hot pursuit. It seemed eager for his head.\n\n“Something is wrong with it.” Han Sen clutched Taia tightly. If the pinecone got any closer, he’d activate super king spirit mode and give it a firm strike.\n\nThe pinecone did not relent in drifting towards Han Sen, though.\n\nSo, Han Sen did what he proposed to. He gave it a hit and watched it skip across the surface of the water a few meters. Han Sen did not want to alert the empress, however, so he made sure to do it gently.\n\nThe pinecone came back, though. And whenever it came in range of Han Sen, he’d make sure to whack it away. This happened a few times, as if he was playing tennis against an invisible opponent.\n\n“Has it been losing its powers ever since I dug it out?” Han Sen hypothesized.\n\nNothing much actually happened when he touched the pinecone with Taia. It was a very dull object, despite its desire to come after Han Sen. Eventually, Han Sen tried to touch it with his hand.\n\nThe pinecone now proved to be little more than a lambent, emerald jewel of sorts. The white stuff that had wreathed the pinecone was gone now, and its parasitic look had vanished too. It really did look like a gem now.\n\nSo, Han Sen used his Dongxuan Aura to give it a scan. He was able to detect the presence of a lifeforce within it.\n\nHan Sen then thought, “Is this a seed belonging to the vine? If it is, does that mean I can grow my own Aqua Vine? The fruit it bears must be quite the treat, considering the effort that the empress and Yaksha put into trying to get some.”\n\nHan Sen then recalled Yaksha’s sudden descent. A pinecone had planted itself in him, too, so he thought he might as well go and grab that one.\n\nYaksha was like a dead man now, one that had been flushed down the drain and left to float and bob on the water that had flooded the forest.\n\nHan Sen saw the pinecone had embedded itself in the back of Yaksha’s head. But a new conundrum was now posed to Han Sen.\n\nYaksha was being controlled by the pinecone, and thus, he could not return to his spirit stone. If Han Sen removed the pinecone, that meant he would be saving Yaksha.\n\nSaving Yaksha was the last thing Han Sen wanted, so he came up with an idea. Yaksha was unconscious, so Han Sen was able to put him inside the Cruel Bottle without issue.\n\nAll Han Sen would have to do was take the pinecone and keep Yaksha trapped inside the Cruel Bottle. If he did that, Yaksha would still be robbed of his ability to return to his spirit stone, and thus, he would be trapped and unable to roam the Third God’s Sanctuary causing everyone grief.\n\nHan Sen would like to find out what might happen if he died inside the bottle, as well.\n\nThinking of that, Han Sen immediately put him inside the bottle.\n\n“Where did you get the Aqua Fruit from?!” Moment Queen squealed, when she saw Yaksha.\n\n“Wait, this is the Aqua Fruit?” Han Sen was surprised by the sudden twist.\n\nHan Sen thought the bell-shaped fruit was the Aqua Fruit, but now that she had said this, he realized it was the pinecone itself that was the treasure he had come for. Still, this was Moment Queen, and he could never be sure if she was telling him the truth.\n\n“It is the Aqua Fruit, but… it isn’t at the same time,” Moment Queen said.\n\nThat made no sense to Han Sen."
}