{
    "chapter": 2587,
    "title": "Weird Changes",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2587",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe big monster died, and afterward, the hordes of snakes departed like a receding tide. They all slithered back into the black sea, retreating far more quickly than they had attacked. In moments, they had completely disappeared.\n\n“What were those things?” Han Sen’s heart was confused. He looked at the purple copper jian. The jian was so weird. It only seemed to be capable of effecting the monster he had defeated. There must have been some sort of problem with it.\n\nWhen Han Sen first saw the big monster surrounded by the smaller snakes, he had theorized that they were essentially the same being. If that was true, then the purple copper jian should have been able to damage the snakes as well as the larger monsters.\n\nBut Han Sen had tried to strike the snakes many times, and they completely ignored the purple light. Something strange was going on.\n\nHan Sen looked at the white tiger. It was likely that only the tiger knew the secrets of the purple copper jian. But the white tiger had no interest in talking with Han Sen, in addition to the fact that it couldn’t talk, anyway.\n\nAs this was going on, the white tiger began to chase the remaining snakes off of the island. And as it moved, it released a mushroom rain. When the mushroom spores landed on the snakes, mushrooms would grow on their bodies, sucking the moisture out of the snakes and leaving them as desiccated husks.\n\nAlthough he didn’t completely understand what had happened, Han Sen knew that killing the big monster had been a good thing for them. Plus, he had gotten the weird purple copper jian out of the deal.\n\nOnce they were rid of the snakes, Han Sen tried talking to the white tiger on numerous occasions. He wanted to know if there was a way out, but he also wanted to learn more about the purple copper jian. The white tiger would only ever meow twice and shake its head in response. Han Sen couldn’t speak the tiger’s language, but he understood that the tiger wasn’t going to help.\n\n“Does he not know, or does he just not want to spill the beans?” Han Sen looked at the white tiger and frowned.\n\nAfter that, though, the white tiger was never hostile toward them. It had no intention of harming them now. It would sometimes draw near and listen to whatever they were talking about.\n\nHan Sen noticed that the white tiger seemed to be spying on him in particular. It wasn’t hostile, but the way its eyes followed him around was quite weird. Han Sen couldn’t guess what the white tiger wanted, though.\n\nThe creature’s gaze was neither hostile nor friendly. The way the tiger looked at Han Sen was familiar, but he couldn’t tell what was familiar about it.\n\n“Whatever. As long as he doesn’t provoke me…” Han Sen put the white tiger out of his mind, and after everything that had happened, he was exhausted. So, he teleported back home. Holding Ji Yanran in his arms, he slept until morning.\n\n“Argh!” Before Han Sen woke up, he heard a scream. It shocked him out of his slumber. He looked at Ji Yanran and nervously said, “Darling, what happened? Is there an enemy?”\n\n“You… you… you…” Ji Yanran stammered, standing on the bed and pointing at Han Sen with her eyes wide. She said “you” three times, but she couldn’t say anything more.\n\n“What happened?” Han Sen was shocked, so he quickly looked down at his body.\n\nHan Sen was wearing shorts, and he was topless. His muscles were like wet steel. His body was perfect.\n\n“What’s the problem with perfection? My body is still super fit. Did the fact that I’ve become even more handsome scare you?” Han Sen posed before her, flexing cockily.\n\n“Your… your… head…” Ji Yanran pointed at Han Sen’s head with her eyes wide open.\n\n“I told you before, when we were in Black Hole Spider’s belly, mushrooms grew on our heads. I removed it before I came back. Has it come back already?” Han Sen asked, and then he touched his head. He froze, his hand still on his head.\n\n“What… what is this…” Han Sen felt something very soft under his fingers.\n\nHan Sen thought of something bad. He teleported in front of Ji Yanran’s dressing table and looked at himself.\n\nHan Sen stared at his reflection, thunderstruck. There was no mushroom on his head, but instead, he was sporting purple fox ears.\n\n“What the hell are these?” Han Sen asked aloud with shock. Han Sen quickly tried to pull the ears off, but pain lanced through his head as he tugged at them. The purple ears seemed to be a part of him.\n\n“Argh! Your… your… your back…” Ji Yanran screamed. Her eyes were now focused lower on Han Sen’s body.\n\nHan Sen was given another fright, and so he looked behind himself. There, he saw a hairy purple tail. It looked very soft.\n\n“What the hell is happening?” Han Sen used his Dongxuan Area to check out his body. There was nothing wrong with him, as far as he could tell. It was like his ears and tail were now a part of his body.\n\nJi Yanran’s eyes opened wide, and she approached Han Sen. She looked frozen as she stared at him.\n\n“Don’t be afraid, my darling. This is just a small problem. Don’t worry, I’ll sort it out right now,” Han Sen comforted Ji Yanran.\n\n“It’s so cute!” Ji Yanran screamed happily. She hugged him and fondled his fox ears.\n\nLing’er heard the commotion, and she rubbed her eyes and sat up. When she saw Han Sen, she looked so happy. She jumped atop Han Sen’s back and grabbed one of his fox ears while she said, “Daddy, it’s so cute!”\n\n“Cute, my *ss.” Han Sen felt humiliated. He put Ling’er in Ji Yanran’s arms and turned his attention back to finding out what was going on. He had only just gone to sleep, and he had woken up this way.\n\nHan Sen used all sorts of powers to try to learn more about this issue, but no matter what method he tried, the fox ears and tail weren’t a part of his body. There was no way to remove them.\n\nWith his fitness and recovery powers, even if he tore them off by force, they would grow back.\n\n“Honey, if you can’t get rid of them, it’s okay to keep them,” Ji Yanran said with a smile.\n\n“Yes, yes! You can!” Ling’er agreed fervently, holding her bottle as she looked at Han Sen. She kept nodding as she sipped from her bottle.\n\n“Honey, you shouldn’t hurt your body. Just keep it like this,” Ji Yanran said.\n\n“Yes, yes! Keep them!” Ling’er followed with a nod.\n\n“Your parents gave you this body, so you should cherish it.”\n\n“Yes, yes! Don’t do anything stupid.”\n\n“No matter what you become, we will both love you. You should stop touching them.”\n\n“Yes, yes. We love you.”\n\nThe two of them kept smiling as they tried to convince Han Sen, who was currently feeling as if he was in a very dire situation.\n\n“The jian… it must be the purple copper jian. I was fine before, and this only happened when I retrieved this thing.” Han Sen pulled the purple copper jian from Destiny’s Tower.\n\nThere was nothing weird about it, though. The weapon rested quietly in Han Sen’s hands. The symbols didn’t react in any way.\n\nBut Han Sen noticed something unusual. His fox ears and tail were the same purple color as the jian."
}