{
    "chapter": 1065,
    "title": "Black Unicorn Beetle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1065",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nApproaching the ruin, Han Sen spotted a well inside. Upon going closer for a look, he noticed it was filled to the brim with water.\n\nAside from that well, which was in fairly good condition, everything else inside the house was a mess. The place had been in decay for a long time, it appeared.\n\nAfter putting the ding down, Han Sen watched the beetles gather to pick it back up to carry it themselves. Interested in what they sought to do with the ding, he stood back to observe them.\n\nSplash!\n\nThe beetles, after lifting up the ding, chucked it into the well.\n\nHan Sen was not sure what their goal was. Had they gone to all this effort, just so they could throw a ding into a well?\n\nAfter they did this, though, the beetles formed another path for Han Sen. This time, it led all the way back to the temple. It seemed as if they wanted Han Sen to collect the other two dings.\n\nThey were obviously capable of carrying the dings themselves, so it was likely that they were scared of the temple for some reason. And because they were scared, they needed Han Sen to go inside and fetch the dings on their behalf.\n\nHan Sen went into the temple and brought both dings out with him.\n\nThe beetles picked them up and led Han Sen back to the house. When they arrived, they lobbed those dings into the well, as well. After that, they all circled the well and kowtowed before it. Han Sen thought it was rather amusing.\n\nNot long after, a noise emerged from the well. The water inside it began to bubble and boil, as steam started to rise.\n\nHan Sen took a step back, surprised by the sight. He used his Dongxuan Aura, but could not discern any lifeforce.\n\nThe water of the well suddenly quelled, and silence returned. But then, just as Han Sen thought it was over, something emerged from the water with a big splash.\n\nSomething that looked like a black crystal zipped out of the water into flight.\n\nIt turned out to be another unicorn beetle, but it was black and not green. It was also larger than the others, and they seemed to worship it. There were symbols etched across its plating, and images of gears. It was actually very similar to the one Han Sen had.\n\nWhen the black beetle shot out of the water, Han Sen was taken aback. He immediately readied himself for a fight.\n\nBut the black unicorn beetle didn’t seem to be aggressive. It slowed down and merely hovered in front of Han Sen.\n\nHan Sen then felt a pain surge from his hand. He noticed the symbol of a green unicorn beetle was etched into his hand, which was rapidly starting to crystallize.\n\n“Maybe it wasn’t missing, after all? Did the beetle combine and merge with my hand?” Han Sen was shocked, to say the least.\n\nAs his hand lit up, the gears on the inside of the black beetle began to spin.\n\nSuddenly, it transformed. Previously, the bug had only been the size of a fist in front of him, but now, it was the size of a truck.\n\nHan Sen was dazed by the spectacle, and all of a sudden, the green light of his hand began to pulsate brightly like a beacon. The black beetle approached slowly and put out its tongue.\n\nHan Sen then noticed its tongue was like a cockpit.\n\n“Is this supposed to be some sort of control room?” Han Sen was rather shocked. The green light flashed continuously.\n\nHan Sen was very curious right now, so he approached the control platform that had emerged from the creature’s mouth.\n\nThere was a seat there, and when he sat down, the tongue-platform was pulled back inside the beetle. Near his hand, Han Sen noticed a handle of sorts. He pulled it with his hand, and then everything lit up.\n\nHe suddenly felt as if the black beetle was becoming a part of his body.\n\nHan Sen wanted to move forward, and when he thought of this, the beetle’s legs started to move.\n\nWhen Han Sen thought of flying, the beetle did just that. It spread its buzzing wings and became airborne.\n\n“Mind control? Nifty.” Han Sen was delighted.\n\nMankind had spent much time trying to develop purely mind-controlled devices, but the technology was still a long way off. Machinery still had to be guided mostly by hand.\n\nBut this beetle responded to the directions of his mind. The technology on display here far exceeded the capabilities of humanity.\n\n“This must be an aircraft belonging to the crystallizers. Do they have sensors and weapons, I wonder?” And as Han Sen thought of this, a holographic map was displayed right before his eyes.\n\n“Ah, now this beats radar!” To say Han Sen was pleased would be an understatement. This technology was far more advanced than what humans had. Even the sensor alone was a technological marvel, as he could zoom in on any part of the local geography with incredible precision—all with the power of his mind.\n\nHan Sen scanned the nearby vicinity, and he discovered the presence of another lifeform, a few thousand miles away. It was Bai Yishan.\n\nHe was alone, though. With Ji Yanran still missing, he was quite worried.\n\nHan Sen looked elsewhere and found a band of humans and shura together. Further away, he found Ji Yanran. Unfortunately, she was being chased by a few robots.\n\n“I have to get there quick!” Han Sen thought to himself.\n\nBoom!\n\nThe black beetle’s bum started to spit lasers, and without hesitation, took off flying at an insane speed. It was heading for Ji Yanran.\n\nHan Sen’s socks almost left his feet at the blistering speed he was going. The machine was far quicker than any warframe or aircraft mankind had developed."
}