{
    "chapter": 2682,
    "title": "Demonic Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2682",
    "text": "The fist leapt forward, and the shadow that trailed behind it looked like a raging lion. Han Sen didn’t even have enough time to dodge. The scary lion shadow had already washed over him.\n\nHan Sen looked stable, though. Spell turned into armor to protect his body, and he used God’s Wander to quickly flash away. He was attempting to evade the crazy shadow of Shale’s punch.\n\nBzzt!\n\nSuddenly, Han Sen felt as if the physical space around had been sealed. He couldn’t rip space and teleport away as he wished to. He could only see the crazy lion shadow punch coming down on him.\n\nHan Sen frowned. He gathered up power in his fist to throw a punch back at the lion shadow punch.\n\nBut Han Sen’s punch went through the lion shadow punch. It was like the lion shadow punch really was just a shadow.\n\nWhen the lion shadow punch actually landed on Han Sen, it wasn’t as hard as he expected it to be. The punch went into Han Sen’s body and vanished.\n\nBoom!\n\nHan Sen’s presence turned black, and his image warped until he started to look like Shale. His entire body was consumed by a black fire, and he looked identical to his opponent.\n\nHan Sen frowned. He realized that he hadn’t been hurt, and his power had become the same element as Shale’s. Aside from that, there had been no negative effect. No damage had been dealt to him, either.\n\nBut as the black fire finished spreading over Han Sen, Shale said, “My demon lion power isn’t destructive, but it will transform your body’s element. I guess it is a demonic power.”\n\n“If you cannot hurt your opponent, then what is the point of your demonic power?” Han Sen asked.\n\n“Millions of different powers exist throughout creation. I cannot break down every single one, but no matter what power my opponent might have, I transform their element into my own. Since I am familiar with this sort of power, none will be able to beat me,” Shale said.\n\nWhen Han Sen considered the ramifications of that, he realized how scary Shale’s power truly was. At his current rank, Han Sen’s power simply wasn’t as great as Shale’s. If Han Sen was able to depend on his various elements and his special skills, he still had a chance to defeat Shale.\n\nBut now that his power had been converted into an element that Shale was already extremely proficient in wielding, Han Sen could no longer compete. Even if he was incredibly compatible with this new element, there was no way he would be as dexterous as Shale with its use. He wasn’t going to be able to defeat Shale with the man’s own power.\n\n“Bring your enemy into the same harmony as your own, and then wipe your foe out with a symphony of destruction. Why does Shale’s power suddenly seem to remind me of something?” Han Sen thought to himself.\n\nBut Shale wasn’t going to give Han Sen much time to think things over. He swung another punch at him.\n\nWith a sinking feeling, Han Sen began to understand just how debilitating the conversion of his power had been. He wasn’t physically damaged, and with time, he could have gained enough understanding of this new element to use it in combat. However, a high-level opponent like Shale wouldn’t give him enough time to adapt.\n\nTeleport. Keep teleporting.\n\nHan Sen began to depend solely on God’s Wander to keep himself out of Shale’s reach. He was unable to rally his defenses and fight back. Turning the tide of this battle was going to be difficult.\n\nHan Sen wasn’t familiar with his new power, at all. He had no idea what the power inside him could even do. He didn’t know what its features were. No matter which geno art Han Sen tried to use, he could only cast power in Shale’s strange element.\n\n“Han Sen is going to lose, it seems,” Li Xue Cheng said. His eyebrows painted him as a very happy man.\n\nEveryone now knew that Han Sen didn’t have a chance. He was beneath Shale’s level, and he was both weaker and slower than Shale. Now that his power element was the same as Shale’s, under such extreme circumstances, how could anyone expect Han Sen to come out of this fight victorious?\n\nThis would have been true of any person of Han Sen’s level who found themselves confronted by a monster like Shale. Even if another deified creature went up against Shale, they wouldn’t be able to defeat him if they were forced to use his element.\n\nShale’s demonic power was quite mysterious. Copying the powers of an opponent wasn’t exactly rare, but his power was able to force his opponent to copy him. It was a little unfair, truth be told.\n\nOpen Sky Elder had a wry smile.\n\nQiyu Elder shook his head. “There is a reason for Shale’s fame. This is why he is called ‘the best against those of the same level.’ Every power has an element it is weak to. No matter how unique an elite’s power is, there is always some other power that will suppress it. But Shale’s demonic lion power ignores that universal truth. His ability is scarier than anyone can imagine.”\n\nHan Sen focused his entire mental power on developing familiarity with the power Shale wielded. But time was too short. He could have used this new power in basic combat applications, but fighting someone like Shale was next to impossible.\n\nPang!\n\nHan Sen was too late teleporting away this time. Shale’s punch struck his arm, and Spell turned into armor to protect him. But even so, Shale’s strike still almost shattered the bones in his arm.\n\nHan Sen could use God’s Wander, but so could Shale. And Shale was quite skilled with the technique. Han Sen kept teleporting away, but he couldn’t shake the opponent on his tail. As the fight progressed, he was incurring more and more wounds.\n\nPang!\n\nHan Sen took a punch straight to the chest. His body shot away like a cannonball and slammed into the seal. The power that bound the arena trembled for a moment.\n\nHan Sen’s body hit the ground, and he couldn’t help but cough up a mouthful or two of blood. His chest felt like a cinderblock had fallen on it. Han Sen knew the heat was likely just the blood inside his lungs.\n\nIn fact, his lungs weren’t the only part of him that was suffering. Han Sen’s entire body was covered in injuries. Many parts of his Spell armor had been cracked. The worst place just so happened to be his chest. The right side of his chest had been dented inwards.\n\nThe Spell armor was practically broken, and Han Sen’s body was not doing well. One of his arms was just hanging loosely beside his body. It felt as if all the bones inside him were broken. He couldn’t even move.\n\nOne of his legs had been shattered, too. Han Sen could only kneel on the spot.\n\nHan Sen couldn’t remember the last time he had been in such poor condition. Even when he was sucked dry by the Shield of the Medusa’s Gaze, he hadn’t been so grievously injured.\n\nBut even so, Han Sen didn’t feel like giving up. He was more excited than ever, actually.\n\nThat excitement came from the Spell armor. Although his armor appeared to be on the verge of falling to pieces, it suddenly seemed as if it was going to breakthrough.\n\nThe Story of Genes was the hardest geno art to develop, out of all the arts he was proficient with. Under Shale’s powerful suppression, it seemed as if it was going to combine all nine tiers into one. He was going to become half-deified.\n\n“Almost there… I only need a little bit more…” Han Sen reviewed the sensations running through him in detail. He seemed to be on the cusp of breaking through, but it still felt as if he was missing something. It was like he was trying to scratch his feet through his socks, but he couldn’t quite satisfy the itch.\n\n“Let us end it here.” Shale wasn’t interested in continuing this fight any further than he had to. Even though he had admitted that Han Sen was a worthy opponent, Han Sen was just a ninth-tier King. Han Sen didn’t have what it took to fight him. He was hoping for another fight when Han Sen became deified.\n\nShale swung his fist again. The terrifying power of the blow was like a dark, roaring, demonic lion, which was headed straight for Han Sen. And Han Sen was still half-kneeling on the ground."
}