{
    "chapter": 2500,
    "title": "Big Universe Extreme Dead God Light",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2500",
    "text": "“The fact that you studied on Extreme Mountain is none of my business,” Han Sen thought. “If you want a risky fight, there are xenogeneics everywhere. Why pick on me? I killed that worthless Bai Yi, and now the Extreme King want me dead. But if I had killed this much-loved boy Bai Wuchang, King Bai would likely come after me himself. Why am I considered the one who started all this?”\n\nBut Bai Wuchang wasn’t going to give him the chance to stop fighting. The prince was raging more and more. The ghost-like body became solid, but something about it still seemed incorporeal. Looking at it was like looking at an illusion.\n\nHan Sen frowned. Bai Wuchang’s blue knife darkened to black. It felt as if some black substance chains were writhing just under the surface.\n\n“What kind of knife skills are these? They’re going to produce substance chains just like the black tiger I met previously. Although the substance chains haven’t fully formed yet, if he can manage to do this, Bai Wuchang has a ninety percent chance of becoming deified,” Han Sen thought as he observed Bai Wuchang.\n\nBai Wuchang’s eyes were on fire. His gaze was invasive as it crept over Han Sen. “The road up Extreme Mountain is arduous. There is a ninety percent chance of dying, and there is only a ten percent chance of surviving. The gambit’s rewards, however, are very big. I earned Extreme Mountain’s prestigious skill called Big Universe Extreme Dead God Light. One hit can destroy everything, so you better watch it!”\n\n“Can I not, please?” Han Sen asked, looking frustrated.\n\n“No.” When Bai Wuchang answered, he was already attacking.\n\nThe black knife’s light came at Han Sen. There was no stopping it. It was like the knife had never even moved. The moment the knife light appeared was the moment it was inside Han Sen’s body.\n\n“It is the same as the Blood-Pulse Sutra’s self-cogwheel. It is a power that can affect the self-cogwheels of other creatures.” Han Sen was shocked. Because it was used directly on his self-cogwheel, the strike was almost impossible to dodge. It was a devastating attack.\n\nBut it was different from the Blood-Pulse Sutra. The Blood-Pulse Sutra pushed the self-cogwheels of others. Bai Wuchang’s knife light destroyed the self-cogwheels of others.\n\nIf the self-cogwheel was broken, that meant the person would be almost dead, and their lifeforce would be gone.\n\nDodging that blow wouldn’t be difficult if he was farther away from Bai Wuchang; as the distance between them increased, the effect on Han Sen’s self-cogwheel would be weakened. That meant the strike would be weaker.\n\nBut Han Sen hadn’t known Bai Wuchang could unleash a strike such as this. He was too close to Bai Wuchang. It was too late to dodge now, so he had no choice but to accept that hit.\n\nA power inside Han Sen’s body moved. A self-cogwheel was spinning. That cogwheel was flashing with a weird symbol. It was The Story of Genes’ self-cogwheel.\n\nBai Wuchang’s black knife light went into him and struck his self-cogwheel, but it was unable to move Han Sen’s self-cogwheel. The black knife hit the self-cogwheel and broke. It shattered into chunks of a black substance, then dissolved.\n\n“It looks like your skill is nothing substantial,” Han Sen said to Bai Wuchang, who looked frozen.\n\n“No… impossible…” Bai Wuchang stared at Han Sen in disbelief. Han Sen was at the perfect distance for him to use his Big Universe Extreme Dead God Light.\n\nAt this distance, Bai Wuchang believed that he could eliminate any being in the universe that was beneath the deified level. Even killing a half-deified would die as easy as chopping the head off a chicken. Both would die in one hit.\n\nBut Han Sen had been hit by the strongest unleashing of his Big Universe Extreme Dead God Light, and nothing had happened. Bai Wuchang could scarcely believe it.\n\nAlthough Bai Wuchang couldn’t see self-cogwheels, he knew that the Big Universe Extreme Dead God Light was a very mysterious and scary power. It ignored all types of defenses to kill the lifeforce directly.\n\nHan Sen simply wasn’t affected by the Big Universe Extreme Dead God Light.\n\nAs Bai Wuchang stared at Han Sen’s motionless form, he stopped swinging. He just gripped his knife, unsure of what to do.\n\n“Do you want to keep going?” Han Sen asked, looking at Bai Wuchang.\n\n“I lose, but next time…” Before Bai Wuchang could finish, Han Sen interrupted violently.\n\n“Next time, my f*cking *ss!” Han Sen jumped forward. He leaped in front of Bai Wuchang and punched him square in the face. A scary power caved-in Bai Wuchang’s entire skull. Blood squelched from the mashed-in face and around Han Sen’s fist. Bai Wuchang was sent flying.\n\nHan Sen followed after the soaring victim. His fists and legs were like a storm, raining down blows on Bai Wuchang.\n\nHan Sen was enraged, and there was no stopping him now. Bai Wuchang’s flesh tore and his bones shattered under the assault. He couldn’t even fight back as Han Sen beat his body to a pulp.\n\n“You’re a crazy madman! You think you’re so strong, don’t you? You think you can do anything you want just because you’re King Bai’s son!” Han Sen kept speaking as he punched. His fists kept landing on Bai Wuchang’s face, utterly annihilating his skull. The man’s eyeballs were squashed, and his nose was reversed into what was left of his face.\n\nHan Sen was still so angry. He kept punching like mad, breaking all of the other man’s bones. Bai Wuchang screamed until he could scream no longer.\n\nFang Qing Yu and the pirates were all frozen. That was King Bai’s favorite son. Han Sen had killed Bai Yi, which led to a universal APB being put on him. If he killed Bai Wuchang, King Bai would come after him personally.\n\nBai Wuchang’s Ghost King Body, his Ghost Knife skills, and his Big Universe Extreme Dead God Light were so strong. But he was too focused on power. His techniques, his strength, and his timing with areas were shoddy.\n\nHe was able to destroy enemies that couldn’t defeat his powers. But if he met someone as strong as him, he would end up getting crushed.\n\nHan Sen grabbed Bai Wuchang and lifted him like a sack of wet mud. He carried the man back to the white whale. Han Sen tossed him down, and blood sprayed everywhere when the Extreme King prince hit the floor in a boneless heap.\n\nFang Qing Yu and the pirates stared at Bai Wuchang on the floor. He didn’t look human anymore. If not for his Ghost King Body, he would have been killed.\n\nAll of the pirates were thinking, “He could have offended anyone but this guy. I can’t believe he even beat up King Bai’s favorite son so badly. There’s no one he wouldn’t dare to punch.”\n\n“Lock him up. Take him as a hostage. If the Extreme King people still dare come for us, I will cut his head off.” Han Sen’s face was as hard a granite.\n\nRage still boiled through Han Sen. He had met many fighting maniacs in his time, like Lone Bamboo. But even Lone Bamboo had his limits. This Bai Wuchang, however, was all about killing. He didn’t have a reason, and he didn’t need one. It was all about killing for him.\n\nFortunately, Han Sen’s self-cogwheel was as hard as it was. And he had the Eternity solidifying powers. The self-cogwheels of ordinary creatures would have been destroyed by Bai Wuchang’s strike. If a person’s self-cogwheel broke, then they were essentially dead. The state they were left in was worse than being a vegetable."
}