{
    "chapter": 1892,
    "title": "Guardian of the Door",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1892",
    "text": "Han Sen had seen many bald people, but very few women. And he definitely hadn’t seen a bald woman that pretty before. Her delicate face, and the grace she exuded, made it easy to ignore the fact that she had no hair.\n\nShe was different from Budda King. This Buddha woman did not possess a scar, and she only had that red dot on her forehead.\n\nBehind the Buddha woman, a Buddha man came forward. And then a few of the Rebate did, too.\n\n“My Lady, Planet Eclipse is so poor. There is nothing to see here, and I can assure you that this is not a place you will enjoy visiting,” a Rebate man said to the woman.\n\nThe Buddha Lady, called Speechless, smiled and said, “No Flower and I want to see Knife Queen’s student. We are here for the sole purpose of visiting this planet.”\n\nNo Flower Buddha quietly said, “The crystallizer that is called Han Sen; he brought out a King class knife from Knife Grave, did he not? And he managed to practice Teeth Knife techniques, yes? Are these claims true?”\n\nYes, but he is a mere Baron. Because he is so weak, Knife Queen has squandered a great many resources on him. He is not even a Viscount yet! I am afraid there is no point in you guys visiting,” Sad Night said.\n\n“That’s okay. We are merely sating our curiosity. We just want to observe what sort of creature he is.” Speechless smiled.\n\n“This way, then.” Sad Night led the way for them.\n\nWhen they stood before the entrance of the base, Sad Night said to the guards, “Tell your master Han Sen that Sad Night, Black Cliff, Speechless Buddha Lady, and No Flower Buddha are here to visit.”\n\nAfter that, Sad Night performed a welcoming gesture to them. Then, he said, “This way.”\n\nAfter walking a few steps, a guard stopped him and said, “This is our base. You cannot enter here.”\n\n“Move.” Sad Night looked at the guard coldly, then tried to force his way inside.\n\nThe guard did not say a word, and instead pulled out a giant cleaver. The guard swung it at Sad Night.\n\n“How dare you attack me! You are a mere servant.” Sad Night was enraged by this, and so he threw a slap towards the cleaver to eliminate the guard.\n\nThe Night family did not have much respect for Han Sen. In the Moon Festival, Han Sen had stolen the thunder away from the Night family. It made Sad Night very angry with him, and that was only fuel to the fire of his current rudeness.\n\nSad Night could tell that the guard was just a Baron, though. Sad Night was a Viscount, so killing the guard should have been an easy feat.\n\nBut when the cleaver was about to come into contact with his hand, the giant cleaver moved like a fish. It slid to the side of his wrist and cut it. It was a small cut, but it was enough to make Sad Night extremely angry. Being injured by a Baron was quite humiliating for him.\n\nHe was the son of Night River King, and he had been dealt a speck of damage by a weakling guard. This was just too embarrassing for him.\n\nHe started to glow with a godlight, preparing to use all his power to kill the guard.\n\nUnfortunately for him, he had found the wrong person. A normal Baron might have been killed by three of his punches. But this guard was Lady Chef.\n\nLady Chef was just a Baron, but she had lived a very long life. Her fighting talents were like those of a grandmaster. The guy in front of her was nothing, by comparison.\n\nA light shot out of Sad Night’s palm, but Lady Chefs movements were like magic. He was unable to do anything to her.\n\nSpeechless and No Flower were shocked. For a Baron guard to fend off such an enemy with such ease was a big surprise.\n\n“Amazing blade skills, for sure! It looks like she has something of a knifemind. It is rare for a Baron to possess something like that.” No Flower thought this was very shocking.\n\nSad Night’s face was swollen with rage. He was trying to kill a Baron, and he had yet to have any success. He looked useless in front of the Buddha.\n\n“What are you guys up to?” A voice came from a short distance away.\n\nEveryone turned around to see three men, one woman, and one creature approaching. Han Sen was amongst them.\n\nSad Night coldly spoke to Han Sen, “Han Sen, how much disobedience do you teach your slaves! They have stopped a few Kings and Buddha. What’s more, they are fighting me! I will teach them how to behave properly, if you want.”\n\nHan Sen recognized him. They last met in the Moon God’s Festival.\n\n“Dragon Lady, what’s all this about?” Han Sen walked over to Dragon Lady.\n\n“They tried to force their way inside. I stopped them,” Dragon Lady answered.\n\n“Good job!” Han Sen patted her on the shoulder, then walked inside the base alongside Gu Qingcheng.\n\nSad Night was frozen, unsure of what to think about this. He shouted, “Han Sen, did you hear me! I brought Speechless Buddha Lady and No Flower Buddha to see you. Do you not possess any manners whatsoever?!”\n\nHan Sen turned around, looked at him, and said, “This is Planet Eclipse, not the palace of Night River King. Who gave you permission to come down here? I should ask Night River King if this is how his family has been taught to behave.”\n\n“Go back. I’ll give you half an hour to leave. And you are only given that out of respect to Night River King. If you guys are still here when the time is up, I’ll punish you all with my special sort of discipline.” When Han Sen finished speaking those cold words, he vanished into his base.\n\nEveryone was so mad, and they didn’t expect Han Sen to be so disrespectful.\n\n“Sure. We only wanted to see the sort of rules you enforce. What do you think, Black Cliff?” Sad Night’s face was green as he asked the black-eared man.\n\nBlack Cliff nodded, agreeing with what he said.\n\nSad Night was not stupid, though. Speechless and No Flower were with them, and the Rebate that had come along were all Nobles. Black Cliff was Black-Moon King’s son. Han Sen couldn’t do anything.\n\nSad Night knew there were no elites there, though. At the very most, they could only expect to find Viscounts inside. Black Cliff could get rid of everyone inside if he chose to.\n\nUnfortunately, the law in Narrow Moon was strict. And Knife Queen made fights breaking out between the planets difficult.\n\nIf Han Sen struck first, it wouldn’t be their fault. They couldn’t kill Han Sen in return, but they could sure teach him a lesson.\n\n“If Mister Han wall not welcome us, we should go back,” Speechless Lady said. She looked quite surprised.\n\nThe student of Knife Queen was far more unique than she had expected. She was actually all the more curious about him now.\n\n“Don’t worry. Black Cliff and I will take care of this. We will wait here and keep an eye on what Han Sen is up to.” Sad Night coldly laughed.\n\nHearing that, Speechless and No Flower looked at each other. They didn’t say anything. They were curious about what Han Sen was planning to do, though."
}