{
    "chapter": 1938,
    "title": "Virtual Table",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1938",
    "text": "Seeing how shocked Han Sen looked, Hai’er took his reaction for a confirmation. She then murmured, “We shouldn’t talk here. We should find someplace else to chat.”\n\n“I think you have the wrong guy; I have no clue about what you’re talking about.” Han Sen acted through his shock.\n\nHai’er lifted her lips in a little smile and said, “There is no use in pretending. I am a thief, and nothing escapes my senses. I will tell this to a Buddha King; you know what will happen to you and Speechless if I do, right?”\n\nBefore Han Sen could put another word in, Hai’er continued. “Oh, but just so you know, I am not being hostile. Actually, I would like to strike a trade with you.”\n\nAfter saying that, Hai’er pulled Han Sen away from Buddha’s Path. They walked out of the city and went to the banks of a nearby river.\n\nHan Sen wished to hear what she wanted to say, so he didn’t resist following her out.\n\n“Okay, let’s talk here.” Hai’er let Han Sen go, then sat down atop a rock. She smiled and said, “Given your relationship with Speechless Buddha Lady, I can only assume you know the secrets to heaven.”\n\n“What secrets?” Han Sen asked Hai’er.\n\n“Stop pretending! Heaven has opened many times, and many races have been here. Only ten of them can reach the end, each and every time. I believe there is a secret to this somewhere.” Hai’er was peering right at Han Sen when she continued. “With Speechless’ reputation, she must assuredly know how to reach the other side. I don’t want anything from you. All I want is for you to take me with you and help me reach the end. If you do, I’ll keep the relationship between you two a secret. I promise.”\n\n“I think you have misunderstood us. I know Speechless, but we are not in a relationship with each other. In fact, we have only ever met twice,” Han Sen said.\n\nHai’er looked annoyed by the denial. Her face filled up with frost and she said, “This is bad. I am going to tell Buddha King about it right now.”\n\n“So what if he knows?” Han Sen laughed at Hai’er.\n\nHai’er looked back at Han Sen with disdain. “Still pretending? You can’t hide anything from a Pirate. ^ every trick in the book to get others to join their creed. Marriage is one such method. Many creatures in this universe have been tethered to the Buddha in this way. Like Happy Buddha King; he was the best in the entire universe. Yet even he was suckered into one of those arrangements. Speechless is famous, and she will have a marriage with someone powerful. It’s a must for her. If Buddha King leams about you two, do you think he will let you go lightly? You should know about this.”\n\nHan Sen didn’t know the Buddha had such a culture, and he found it rather interesting.\n\nWhen Han Sen didn’t respond, Hai’er went on to say, “Others don’t know the Buddha are this way, but we do. They are not much smarter than the Pirate, you know. I don’t really like them, and more than that, I don’t want to expose your story. If you help me, it is a win-win situation for all of us.”\n\nYou know who I am?” Han Sen asked Hai’er.\n\nHai’er was surprised and said, “How am I supposed to know who you are? You’re just a lowly Viscount Even if you are famous, the Buddha won’t let you be with her.”\n\nHan Sen smiled and said, “I am the student of the Rebate called Knife Queen. This is my first time here, and it marks my third encounter with Speechless. Nothing else is going on, okay? You are wholeheartedly mistaken.”\n\nHai’er frowned at Han Sen. She looked right at him. Seeing him turn to leave, she tugged at him and said, “Even if the two of you aren’t together, how about we co-operate anyway? Let’s walk through heaven together!”\n\n“What benefit is there for us to co-operate?” Han Sen asked Hai’er.\n\n“There is a lot. I am the number one genius of the Pirate. Everyone knows the name Hai’er. She is a rare and very talented person. I will be deified, one day.” Hai’er kept complimenting herself, showing utterly no embarrassment.\n\n“If you and I co-operate, it would be easier to traverse heaven.” Hai’er patted Han Sen on his shoulder.\n\n“If you’re as good as you say, why do you need Speechless to guide you?” Han Sen laughed at her.\n\nHai’er’s face did not change, and she said, “I am certain I can get through it, but this is a once-in-a-lifetime affair. It’s good to take extra precautionary measures, don’t you think?”\n\nHan Sen turned around and left, ignoring her.\n\nHai’er followed and pleaded, “Let’s talk about it! State your conditions.”\n\n“I don’t know anything about what to expect in heaven, so following me is pointless.” Han Sen knew Hai’er was suspicious about the prospect of his relationship with Speechless, so he kept walking resolutely.\n\nHai’er gritted her teeth and pulled out something. “You must know this. If you co-operate with me, then this is yours.”\n\nHan Sen looked at Hai’er’s hands and saw a tablet. It was palm-sized. There were many words, smaller than grains of rice, etched into it. There was nothing particularly special about it, though.\n\n“What is it?” Han Sen looked at Hai’er’s tablet dubiously.\n\nHai’er looked shocked. She stared at Han Sen, and said, “Really? You don’t know about the Virtual Tablet?’\n\n“What is a Virtual Tablet?” Han Sen looked at it and asked.\n\nHai’er saw that Han Sen was honestly confused, so she shook it in front of him and said, “The Virtual Tablet is a powerful treasure left behind by a mysterious, higher race. It has that mysterious race’s geno art. When the Buddha received the Virtual Tablet, they absorbed the talents to become as they are. Many geno arts have come from this Virtual Tablet. This is one of many. The Pirate unearthed it from some old ruins, and no one else knows about this. But it can be yours for the price of a co-operative partnership.”\n\n“How do I know if this is real or not?” Han Sen was curious.\n\n“Aren’t you Knife Queen’s student? If you let her take a look, she’ll know the truth. She won’t lie, either,” Hai’er said.\n\n“Okay. If this is real, I will cross heaven with you.” Han Sen took the tablet. Hai’er had no relationship with Speechless, and she was practically giving him something for free. He wasn’t going to reject that."
}