{
    "chapter": 1103,
    "title": "Fighting Ancient Jade",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1103",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen’s next opponent was another king spirit.\n\nThe king spirit’s title was Ancient Jade. It was a name that exuded a sort of grace or elegance, but in all truth, the name betrayed the fighter’s true self. He was an eight-meter-tall spirit of mighty power and stone.\n\nWith each step he took, a crude imprint was left behind in his wake. And with each thumping footstep, the earth quaked.\n\nThe humans that watched were in shock. Whenever a royal spirit’s weapon collided with the ground, not a scratch was made. But here, all it took was the spirit’s footsteps to ruin the floor and leave holes.\n\n“He seems pretty strong. Is Dollar going to be okay facing that thing?” someone wondered.\n\nSu Xiaoqiao responded, saying, “When has Dollar ever lost? If he can kill Fei Yu King so effortlessly, he can most certainly kill this thing.”\n\n“You are right. How can he lose? It was silly of me to doubt.” A bright hopefulness returned to the person’s face.\n\nHumans had been bullied in the Third God’s Sanctuary for far too long, so they were all eager to see a human stand in the face of their adversity and show that it was possible to fight back.\n\nDollar’s performance so far had shocked a great number of humans. What had occurred was a miracle they had long wanted to see; they didn’t want it snuffed out anytime soon.\n\nHan Sen had no idea what discussions were being held about his performance. He was oblivious to it all. Before the fight, though, he returned to the Alliance so he could relax and regenerate lost strength by bathing in a recovery pool. He wanted to be able to use super king spirit mode longer if he needed to.\n\nHan Sen’s communicator rang while he was there, and when he picked it up, he saw that it was Queen giving him a call.\n\n“Did you go to the shelter yet?” Queen asked.\n\n“No, I’m currently bathing. Can’t you see that?” Han Sen waved his phone around to give her a look at where he was.\n\nQueen said, “Well, hurry back. Dollar has joined Divinity’s Bout. He killed a king spirit, and not only that, the following three opponents bowed and threw the match in fear of him. Three royal spirits! It’s insane. He’s fighting another king spirit later.”\n\n“Really? You’re going to the Martial Hall?” If Queen was already in the shelter, waiting in the Martial Hall, it meant she would see him entering the battlegrounds. That would mean only one thing; Dollar’s identity would be revealed!\n\nBut Queen said, “I will. But I’m in another empty shelter, so I can’t return to yours just yet.”\n\n“I thought you weren’t interested in watching that thing.” Han Sen felt relief.\n\nQueen, so far, had shown an insatiable lust for leveling up. It was all she had concerned herself with since he encountered her in the Third God’s Shelter. It was almost as if she had to stay in a state of constant motion.\n\n“I wasn’t. But previously, there was no hope. And I would have rather spent the time improving myself. But Dollar killed a king spirit; a feat thought to be unachievable by one man. He deserves to be watched.”\n\nQueen went on to implore Han Sen, “You must come and watch, too.”\n\n“Why?” Han Sen asked.\n\nQueen told him, “Because I’ll fix you. Maybe one day you’ll be as strong as Dollar, fighting in Divinity’s Bout.”\n\nQueen quickly hung up after that and went to the shelter.\n\nHan Sen gave a wry smile. His time for relaxation was practically over, and it was time for battle. He exited the pool, put his armor on, and teleported back.\n\nAncient Jade continued standing in his spot as a spirit conceded before him. It wasn’t a royal spirit, though. He lacked the charms to make royal spirits concede.\n\nHan Sen had worked hard to reach his status and prestige as The King. The fact others were willing to obey or concede to him was due to his incredible performance throughout the spirit bases, where he was believed to be invincible. He was an attractive idol to a great number of spirits.\n\nWhen Han Sen arrived in the Martial Hall, Ancient Jade King was on the battleground already. He was waiting.\n\nThere was still some time left, though. And Han Sen spent this time observing his next opponent.\n\nIt was going to be quite difficult to kill a nine gene lock king spirit in a mere thirty minutes.\n\nAfter what happened with Fei Yu King, Han Sen guessed future king spirits would treat The King like an actual threat. He didn’t think he could one-hit-kill Fei Yu King so easily.\n\nFurthermore, Taia and Phoenix Sword could not be used. Gold Raven, Disloyal Knight, and Golden Growler couldn’t be used, either.\n\nAll he could use was Devil Pill. With the time to join almost up, he turned into a super king spirit and walked out onto the stage to face his next opponent.\n\nSpirits and humans alike were shouting and chanting, all in Han Sen’s support.\n\nSeeing Han Sen walk out, Ancient Jade King flashed with a light of varying colors. A stone wall manifested out of the earth, shielding him in a barricade of rock.\n\n“Your coins are useless against me,” Ancient Jade King called out from within his shelter of stone.\n\n“Really?” Han Sen clicked his fingers. From out of thin air, coins began to descend from the sky in a torrent like rain.\n\nAncient Jade King bolstered the strength of his walls and raised them higher to prevent the coins from touching him. When too many coins built up on the rock, it shattered.\n\nThis was something the spirit had prepared for, though. When the wall was just about to buckle and crumble entirely, another wall was ready to swap with its position. No coin seemed able to touch Ancient Jade King.\n\n“Is that all you’ve got?” Ancient Jade King coldly laughed as he taunted Han Sen, figuring he had overcome Han Sen’s signature move.\n\nHan Sen did not say anything in response, though. In his hand, he wielded a black sword.\n\nThe sword was wreathed in a holy light, and with a thrust, it came barreling towards Ancient Jade King."
}