{
    "chapter": 2769,
    "title": "Two Ape Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2769",
    "text": "Mystical engravings covered the surface of the giant bell, visible even from a great distance because of the size of the bell. The engravings looked rather strange. They seemed to depict a bird that was flying through a complex series of loops and twirls. Han Sen and the others were unsure what it meant.\n\nBut on the front of the bell, there was an engraving of a true god bird. There was no doubt about this picture; it represented a true god phoenix.\n\nMany creatures stood across the bridge, looking up at the black-steel bell. But for some reason, none of them were fighting over it. They simply stared up at the object, enthralled.\n\nHan Sen noticed Barr and Elder Nader among the creatures standing on the bridge. They were staring up at the bell with the same expression on their faces as they creatures around them. They weren’t trying to claim the item as their own, and neither were they leaving. They were transfixed. It was a strange thing for Han Sen to see.\n\nDragon One called to Barr, but Barr paid him no heed. The Destroyed’s eyes remained firmly locked on the bell.\n\n“Something is wrong,” Dragon One said quietly. He looked in the direction of the black-steel bell and frowned.\n\nThere was no need for him to say it, though; Han Sen and Bao Lian had already noticed that something was off. Barr and the others seemed to have been trapped by some unseen force. Why else would they be ignoring people who were calling their names?\n\nHan Sen secretly cast his Dongxuan Sutra. He focused his attention on the two mountains, the wood that bridged them, and the black-steel bell, hoping to discern a clue or two from them.\n\nAs he stared at them, he did notice something.\n\nThe bridge between the two mountains and the big steel bell had some sort of natural connection. They were subtly releasing some sort of power. It was rather weird.\n\nThe big mountains, the bridge, the big steel bell; they were composed of three different materials. In ordinary circumstances, they shouldn’t have been exuding the same type of power, and yet they were. The energy that radiated from them was all of the same wavelength.\n\n“Weird. This is so weird,” Bao Lian mumbled as he kept looking.\n\n“What have you found, Mr. Bao?” Dragon One asked.\n\nBao Lian pointed at the two big mountains and said, “Don’t you think these two mountains look rather unique?”\n\n“Unique? What kind of unique are you talking about?” Dragon One looked over the two mountains again and didn’t seem to espy anything too special about them.\n\n“It’s their shape. Don’t you think those two mountains look like two giant apes?” Bao Lian asked in a strained voice, pointing at the two big mountains.\n\nHan Sen had been looking at the two mountains for some time, but he hadn’t noticed that. Now that Bao Lian had pointed it out, Han Sen noticed that the two big mountains really did look like two apes holding up a bridge of wood. They supported the weight of the black-steel bell, which looked as if it was going to fall any second.\n\nHan Sen had many questions about what they were seeing. He was curious about the design, but he didn’t come to any conclusions. Dragon One looked at it for a while, and before long, his eyes widened. “Two apes holding up a bridge of wood. Does that mean we’re actually looking at the legendary Two Ape Mountain? No way! Two Ape Mountain belonged to Sacred, and it was destroyed long ago. Why is it here?”\n\n“This might not be the genuine Two Ape Mountain. For all we know, it just looks similar,” Bao Lian said. But he couldn’t seem to tear his eyes away from the Two Ape Mountain. It was hard to tell what he was thinking.\n\n“What is the Two Ape Mountain?” Han Sen had never heard the term before. He looked at Bao Lian and Dragon One.\n\n“In the legends regarding Sacred, tales tell of a very famous mountain,” Dragon One explained. “Originally, Two Ape Mountain was just a pair of ordinary mountains. They were nothing special. But later on, Sacred Leader and his trusted partner played chess for seven days and seven nights. Eventually, the game ended in a tie. So, the Sacred leader decided to build a bridge between those two mountains and construct a pavilion at the center of the bridge to play chess. That way, he could continue playing chess with that forever-trusted partner. The two big mountains looked like old apes, and after the bridge and the pavilion were built, it looked like the two old apes were carrying a carriage. Therefore, Two Ape Mountain is occasionally called Two Apes Holding Up a Carriage Mountain.”\n\nBai Lian carried on with the story, saying, “In the legends, that pavilion was used for many chess matches between Sacred Leader and his trusted partner. It is a heavenly topic for those who love chess. But in the legends, when Sacred was destroyed, Two Ape Mountain was also destroyed. The bridge and the pavilion went missing. What we’re looking at here might appear similar, but it isn’t actually Two Ape Mountain.”\n\nDragon One went on to say, “Although moving mountains isn’t difficult for deified elites, the most important part of Two Ape Mountain was the chess records located inside the pavilion. Since the pavilion containing those records is missing, who would have gone to the effort of relocating Two Ape Mountain all the way out here? The pavilion has been replaced with a big steel bell. I highly doubt that this is the Two Ape Mountain that came from Sacred.”\n\nHan Sen didn’t really know anything about this, so he had nothing to add to the conversation. He merely listened to them explain the history.\n\n“A person who could play chess with Sacred Leader? I bet Sacred’s partner was very famous. What was his name, and what race did he hail from?” Han Sen enquired.\n\nDragon One shrugged and said, “That’s all I know. It is documented in the history books of our race, but I’ve never actually read them myself. And the books never did state who Sacred’s chess partner was.”\n\n“Back then, Sacred Leader ruled almost the entire universe. He had many strong subordinates. He had four holy beasts and ten generals. All of them were amazingly powerful elites. It would be hard to find out which of them played chess with him,” Bao Lian said.\n\nHan Sen started to ask something, but he suddenly heard a loud ringing noise. Although the air around them was still and devoid of wind, the black-steel bell started to chime. Every time it moved, it unleashed a loud bell-chime.\n\nThe sound that the bell produced seemed entirely ordinary. There was nothing special about the acoustics. It didn’t seem to possess any special kind of power.\n\nBut the next second, Han Sen, Bao Lian, and Dragon One froze. As the bell rang, the charcoal appearance of the trees and the mountains suddenly faded away. Color began to seep back into the black and white world.\n\nThe charred appearance of the trees vanished, and healthy shades of green and brown swept over them. New leaves sprang into existence as Han Sen and the others watched. The vegetation around them was coming back to life with startling speed.\n\nAcross the two ape-like mountains, small shrubs and grass rose around and between the rocks.\n\nWhat Han Sen saw was very weird. It was like a dead man coming back to life.\n\nA second later, the world around them was full of greenery. Life was spreading to cover every surface, flourishing in unchecked glory. The two mountains started to look green, as well. Everything in sight seemed to be radiating a lifeforce. The landscape looked completely different than it had looked before.\n\nThe only thing that hadn’t changed was the black-steel bell. It looked exactly as it had before it began to chime. The noise of the bell died down, and it remained where it was, very still."
}