{
    "chapter": 2632,
    "title": "The Power to Conquer a King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2632",
    "text": "“I am the greatest in my league.” Exquisite lay on the ground. She stared at Han Sen and didn’t try to move. She thought about what Han Sen had told her, and complex emotions washed over her.\n\n“Brother Han is… He’s too strong…”\n\n“Even Exquisite is trash before Father Han. What kind of Very High is she?”\n\n“So scary. The siblings of the Han family are monsters.”\n\n“This is too cruel. He even bullied the crap out of a Very High student.”\n\n“Those punches were way too awesome. I never liked the Very High, and they wanted to take Brother Han and Brother Lone Bamboo to be their slaves. And see? They don’t even have what it takes!”\n\nThe blood of the Sky Palace students was boiling. The Very High always acted as if the Sky were inferior to them. Right now, as they watched Han Sen destroy Exquisite, they were filled with glee. They all wished they could batter the Very High in the same way Han Sen could.\n\n“Can this fight end now?” Han Sen turned back to Exquisite, who was still sitting on the ground at the edge of the arena. She was staring right at him.\n\nExquisite seemed to have been startled from a deep slumber. As she stared at Han Sen, resolve settled into her eyes.\n\n“No, it isn’t over yet. The universe is still on my side. I won’t lose, especially not to you.” Exquisite slowly stood up. Her hair rose and waved in the air, despite the absence of wind. Her tai chi eyes spun dangerously, and the black and white colors glowed. Her aura began to spread ominously, forming black and white airs out of her body. They began to spin together, forming the structure of a substance chain.\n\n“She’s forcing her nine tiers to become one. She is becoming half-deified right now!” The realization rolled through the arena like a thunderclap.\n\nBzzt!\n\nAs everyone reeled from the shock, Exquisite’s black and white air exploded. Black geno armor appeared and encased her whole body. Her face was shielded, too. Only her Very High Eye could be seen. As this happened, her Very High Eye turned pure white. It was like a small nuclear reactor, and a scary power was emerging.\n\nAt this same moment, Exquisite’s presence was being pushed to a level that others couldn’t imagine. She was like a scary monster queen, and she used her third eye to look icily at Han Sen.\n\nExquisite turned to Han Sen and raised her hand. She made a pulling motion. She didn’t seem to release any power, but the whole of space shifted. It was as if the space between the two fighters had been severely reduced. Instantly, Han Sen’s body was pulled directly in front of Exquisite’s hands. Exquisite grabbed him by the neck.\n\n“No one can beat me in my universe!” Exquisite used the white flame in her third eye to look at Han Sen while she spoke.\n\nAfter that, Exquisite grabbed Han Sen by the neck. Her body began to generate a frightening black and white power. It felt as if all the power in the universe was draining into her hands. If she even twitched, she would surely break Han Sen’s neck.\n\n“Now I will give you the chance to concede,” Exquisitely said to Han Sen as she looked at him. Her face looked like it had been carved from marble. Her voice was a dead monotone, like the grinding of a machine. It was as if she would be happy to turn Han Sen’s body to dust if he failed to agree.\n\n“I still prefer it when you smile. This look doesn’t suit you,” Han Sen said, frowning slightly at Exquisite.\n\n“I’m telling you to concede!” Exquisite thundered. Her black and white air rose madly like two ravenous demons. It was like they were going to ravage Han Sen’s body and consume him. Not even a single bone would be left behind.\n\n“No one can force me to do something I don’t think is right,” Han Sen replied.\n\nExquisite looked at Han Sen and didn’t speak. Her face remained entirely expressionless. The black and white powers in the air became stronger. It looked as if they were on the verge of exploding any second.\n\nThe Sky Palace students looked at Han Sen with worry. Yun Suyi fidgeted nervously with the hem of her dress. Her nails almost shredded her garments, and she was starting to sweat.\n\n“Should we…” The woman looked at Sky Palace Leader.\n\nSky Palace Leader shook his head. “Wait a bit longer.”\n\nAs he watched Exquisite rage, Han Sen wasn’t mad. He just felt sorry for her.\n\nShe had given up her emotions so she could become one with the universe. To put it nicely, it was like the Sky and humans had combined. To be frank, though, it was more like she had become a pawn of the universe. She had thrown away her identity to become a high-class creature.\n\nHan Sen had seen people experience similar changes before in Sky Palace, but that had been very different from what he was seeing now. When the Sky became one with the sky, they focused a lot more on their emotions. It wasn’t like the Very High, who only cared about being one with the universe.\n\n“If the Very High ever became 100% united with the universe, would they still count as individual people?” Han Sen shook his head. There were many things he was unsure of, but he knew for certain that he never wanted that future. He couldn’t take this path.\n\nExquisite stood in front of him, and her power raged higher and higher. Han Sen laid his hand against the fist that Exquisite was using to squeeze his neck. She lost her grip on Han Sen’s throat.\n\nThe white light in Exquisite’s eyes spilled over. Her black and white airs erupted like a volcano. Her other hand flew toward Han Sen like a bullet.\n\nHer black and white air was generating a substance chain on that fist. That fist was so strong that every face in Sky Palace changed. Yun Suyi was so nervous that it felt like her heart was going to leap out of her chest at any moment.\n\nThe two fighters were at very close range, and the power that Exquisite wielded was frightening. If Han Sen got punched, his body would be destroyed.\n\nThe next second, however, the crowd noticed that Han Sen’s hands were moving as well. He grabbed Exquisite’s fist, and then, both of her hands fell under Han Sen’s control.\n\nThat scary black and white air began to shred Han Sen’s hands. Deep grooves were torn into Han Sen’s Spell armor. Blood came gushing out from the lacerations.\n\nThe scary black and white air stormed through the arena. Han Sen was at the center of the storm, with his armor taking the brunt of it. Wounds kept appearing across his body.\n\n“Didn’t I tell you? Against another of the same level, I am king. The only things that can fall to a king are smiles and a woman’s beauty. Using force against me just won’t do,” Han Sen said. Then, he tightened his fists with new strength. He threw Exquisite’s black and white air-surrounded body away.\n\nHan Sen moved with the arc of her toss. He swung his fists like a hurricane.\n\nBeneath the force of Han Sen’s blows, the black and white air was waning. Han Sen’s punches pummeled Exquisite’s black armor.\n\nPang! Pang!\n\nThe collision of fists against armor produced sharp, striking noises. They were so fast, there was hardly a break between each sound."
}