{
    "chapter": 2636,
    "title": "Wood Spirit Rhino",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2636",
    "text": "Han Sen was very conflicted. He wanted the Constellation Sea. If there was ever a safe place for him to develop humanity, it would be there. With enough resources and cultivation, he could make them a force to be reckoned with in the universe. That way, they would no longer have to live in small pockets scattered across the universe. He could gather them up there and truly grow their numbers.\n\nBut before any of that could happen, Han Sen needed his own system. The safest places in the universe were already split up by the more powerful races. Even if Han Sen wanted a slice of good real estate, there was nowhere he could find a piece of that pie. Even the smaller and weaker races had ties with Sky Palace and other big races. It wasn’t a matter of simply taking what he wanted and being done with it. Taking a developed system wasn’t an option, and a wild system would be too dangerous. Such places weren’t suitable for low-level creatures and people to live in.\n\nSky Palace was offering him a xenogeneic space. For Han Sen, that would be a perfect place to develop humanity’s presence within the geno universe.\n\n“Think over my offer. You don’t have to rush in giving me your answer. Just tell me when you have decided,” Sky Palace Leader said.\n\nHan Sen nodded. He needed to think about this seriously. He couldn’t make a decision on a whim. Especially one so big.\n\nAs Han Sen turned to leave, another matter came to mind. “Palace Leader, Uncle Yu Kun has asked me to kill a deified xenogeneic with him. Do you think I should go?” “Brother Yu Kun?” Sky Palace Leader fell silent for a moment, then said, “I know what happened to him. If you think you can do it, then you should go and help him. Brother Yu Kun has endured a difficult life.”\n\nNow that he had received Sky Palace Leader’s approval, Han Sen was more than okay with going to meet with Yu Kun. And so, that was what he did. He wanted to see what sort of deified the man wanted to kill first, though. Then, he could decide if he could truly help.\n\nIf he did decide to help, he would try his best, but there were still multiple factors to consider before he accepted.\n\nAfter Han Sen left Sky Palace, he contacted Yu Jing. He told Yu Jing what he planned to do, and Yu Jing was happy to quickly arrange for him to meet with Yu Kun and discuss the proposal. “Should I go or not?” Going to the Very High was a very difficult decision for Han Sen to make, but it wasn’t something he could allow others to determine for him.\n\nHan Sen laid out the pros and cons of this idea many, many times. And he ultimately decided that yes, he should go to the Very High. He wanted the Constellation Sea for himself. If he missed out on this chance, God only knew how many more years he would have to wait for an opportunity to get a xenogeneic space that was as prestigious as the Constellation Sea. Plus, if he fought for another xenogeneic space, it wouldn’t be as safe as the Constellation Sea. And some xenogeneic spaces were actually overdeveloped; they might not allow Han Sen to procure as many resources as he wanted. “It looks like I need to go to the Very High, then. Luckily, I have found a way to counter their spying techniques. If Sky Palace Leader’s way doesn’t work, then I have my own method. And if that method doesn’t work, either, I will have to be like Ning Yue and rely solely on my own will to support myself.” Han Sen gritted his teeth. The odds against him seemed daunting, but if Ning Yue could do it, he believed he would be able to as well.\n\nBut Han Sen didn’t immediately answer Sky Palace Leader. He wanted to sort out matters with Uncle Yu Kun first, so he could have time to think it over a bit more. There was no need to rush a decision as big as this one.\n\nYu Jing hurriedly established a time for Han Sen and Yu Kun to meet. When Han Sen saw Yu Kun, it was hard to believe Yu Kun was of the same generation as Sky Palace Leader.\n\nThat was because Yu Kun looked considerably older than Sky Palace Leader. Han Sen didn’t know how old Sky Palace Leader was, but he appeared to be in his forties. His seemed very gentle, but there was something perverse about him. He enjoyed messing with people. But Yu Kun looked like a very old man, by comparison. His hair was grey, and his face was wrought with wrinkles. Most importantly, his expression looked old and tired, too. He was very dull-looking. He barely looked like a living being. Yu Kun was calm. He told Han Sen about the deified xenogeneic he planned on killing, but he didn’t look very confident that Han Sen could help him.\n\nAfter hearing what the man said, Han Sen fell silent. And then, he honestly told Yu Kun, “Uncle Yu Kun, a trade needs to be fair and equalized. I can help you fight this deified xenogeneic. If I fail, I won’t take anything, but if we successfully slay this deified xenogeneic, what will you give me in return?”\n\nYu Kun seemed to think about that question a bit. After hearing Han Sen’s speech, he pulled something out of his pocket. He set it on the table in front of Han Sen and calmly said, “Try your best. Whether or not you succeed, this is yours.”\n\nHan Sen eyed the thing that Yu Kun placed on the table. It was a small wooden statue carved into the shape of a beast. It looked like a rhino. It was the size of a man’s hand, and the wood seemed to have yellowed with age. It looked ancient.Han Sen didn’t understand what it was. It looked like a decorative trinket that someone might put on a shelf in their house. It didn’t release any power, so it didn’t seem like a powerful xenogeneic treasure, either.\n\nYu Jing was standing to the side, and when he saw that wooden rhino, he looked like he was about to scream. “Isn’t that the Wood Spirit Rhino? Uncle Kun, are you really willing to let it go?”\n\nHan Sen looked at Yu Jing, and Yu Jing went on to say, “A long, long time ago, our race found a butterfly-class plant inside the systems of chaos. Many of our people worked together, but they were only able to retrieve a piece of wood that was one foot long. And then, a deified carved the wood into wood spirits. Three small statues were created in the shapes of an elephant, a rhino, and a horse. This Wood Spirit Rhino is one of them.”\n\nAfter pausing, Yu Jing went on to say, “Although the Wood Spirit Rhino wasn’t refined into a treasure, carrying it can aid a warrior’s body. It can fill your body with health and make you livelier. It is especially beneficial for people who have been injured. Carrying the Wood Spirit Rhino can heal someone’s self-body. Of course, that isn’t what is most important about the Wood Spirit Rhino. The most important thing is that the deified who made them also created three geno arts and left them inside the three wood spirits. If someone gains possession of the statues, they can obtain the geno arts inside.” “The geno arts of the Wood Spirit Elephant and the Wood Spirit Horse have already been learned by others. They were the Giant Spirit Statue Punch and Sky River Swallowing Day skills, respectively. They were the first two geno arts. They are famous secret geno arts in Sky Palace.”\n\nHan Sen jerked in surprise when he heard the name of these two geno arts. He had heard of them before. They were the most popular secret geno arts in Sky Palace right now. Even the heirs of many Sky that wanted to practice the geno arts had to go through a lot of trouble to be granted permission to learn them. Furthermore, students below King class couldn’t even begin to learn them.\n\nBut just because a skill was restricted didn’t mean it was attractive to Han Sen.\n\nBut what Yu Jing said next totally changed Han Sen’s mind.\n\n“When the first two people learned the geno arts of the Wood Spirit Elephant and the Wood Spirit Horse, they received powerful wood spirits. It accelerated their practice. One went from King class straight to half-deified. The other went from half-deified to deified.”"
}