{
    "chapter": 3064,
    "title": "Jian Bu Gu",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3064",
    "text": "Although Han Sen’s simplified assumption of them being slaves was correct, this was simply how the seven kingdoms of the universe worked. It wasn’t as if saving a few slaves would ever solve the problem.\n\nSeeing these slaves, he noticed there were many children in their midst. They were all wearing AI bracelets and AI handcuffs. They were like cats and dogs being chased. Han Sen shook his head.\n\nMister Yang watched Han Sen shake his head and sighed. “People did not have high or lower tiers before. With God Spirits and Blood-Pulses, there is now that distinction.”\n\nWhile they were talking, they suddenly heard a little girl cry, “Mother… Mother…”\n\nHan Sen and the others turned around to look. A young mother had collapsed to the ground, blocking the advance of the slaves that were bound to her. The guard holding the whip went over to strike her with it.\n\nThe young mother seemed to have something wrong with her body. She was unable to get up. She tried her best to hold the little girl who was crying and let the whip only fall on her.\n\nSuddenly, a hand grabbed the whip. After looking, it was a middle-aged man who had been nearby. Judging from the way he appeared, he also had a necklace and bracelet. He was obviously one of the other slaves being sold.\n\n“You should be more forgiving. Killing them earns you nothing, and you are only going to impact the profits of the sale.” The middle-aged salve let the whip go as he spoke to the guard.\n\nThe guard was always bullying the slaves. Now, one of the slaves was standing up to him. He felt humiliated. He looked furious. He cracked the whip at that slave and madly yelled, “I am happy to whip you guys all to your deaths!”\n\nThe middle-aged man accepted a few of those whip strikes. It led to the development of bloody streaks on his body. Even so, he did not allow the whip to fall on the mother and child. He stood firm where he was.\n\nAs this kept on going, the guard was growing angrier. He swore and hit even harder, saying, “F*ck! If you want to die, that is fine by me.”\n\nHis wrist was suddenly grabbed by another hand. He was no longer able to whip.\n\n“What are you doing?” The guard saw that the person holding him back was not a slave. It was someone who had just come off the same ship. He was not going to be as horrible to him as he was to the slaves.\n\n“How much are these three people? I am taking them.” Han Sen let go of the whip and pointed at the middle-aged man, mother, and\n\ngirl.\n\n“You want to buy three slaves?” A manager-looking man walked over and checked Han Sen out.\n\n“Manager Wen!” The guard quickly bowed to the man. He behaved really politely.\n\n“Yes,” Han Sen said with a nod.\n\nManager Wen stared at Han Sen for a bit and smiled. “These slaves are meant for the Seven Hearts Department. Normally, we cannot just sell prebooked ones.”\n\n“Then, just give me a price that is higher than what they paid,” Han Sen said with a smile.\n\nManager Wen was happy. He knew he had met a rich guy on this day. He thought, “Fat pigs that deliver themselves… I must scam them a lot!”\n\nManager Wen told the truth. The slaves were meant for the Seven Hearts Department, and transporting slaves always resulted in a death or two. When the slaves were delivered, they would always send more than needed. Those people were slotted in the replacement reserve.\n\nThis time, there were many in the backlog of reserves. If someone was fine paying a higher price, he did not mind selling three.\n\n“Mister, you are causing me trouble here.” Manager Wen decided to scam money from Han Sen. He tried acting as if this was a difficult thing.\n\nHan Sen looked at Manager Wen and asked, “What kind of price would not trouble you?”\n\nManager Wen finally smiled and said, “If you take them this quickly, Mister, then I will just sell them to you for a low price. I will go ahead and find a way to explain this to the Seven Hearts Department. These three slaves will cost 3,000 king money. You can just take them. If the Seven Hearts Department wants an explanation, they can answer to me. I will shoulder the responsibilities.”\n\n“Three thousand king money is way too high,” Mister Yang madly said. In the market, an adult slave normally only cost 50 or 60 king money. Even young ones were only around a hundred. Those from a big slave ship were usually even cheaper to buy. Three slaves for 3,000 king money was grossly overpriced.\n\n“You can’t say that. These are the slaves the Seven Hearts Department wants. I am taking you a huge risk here by giving them to you.” Before Manager Wen finished his speech, Han Sen interrupted him. He said to Mister Yang, “Mister, give him the money. I want these three people.”\n\nMister Yang thought he had been totally scammed, but if Han Sen agreed, he had no choice but to give Manager Wen the three 3,000 king money.\n\n“Mister, you are smart. If there is anything else you need, come and find me,” Manager Wen said as he accepted the 3,000 king money. His expression looked extremely happy.\n\ner\n\nIt was just three slaves, and they were not worth much. Yet he had managed to sell them for a hundred times the original price. Manager Wen happily gave him the slave contracts for the three people.\n\nHan Sen accepted the slave contracts. Mister Yang gave them to the slaves. He lifted the mother and daughter.\n\n“What is your name?” Han Sen waved at the middle-aged man.\n\n“Thank you for saving me. My name is Jian Bu Gu.” The middle-aged man waved back.\n\nAfter hearing the name, everybody was a bit shocked. After their reactions were done, the guard who had been hitting the slaves looked disdained and said, “You are a slave, yet your name is Jian Bu Gu. Are you not afraid someone will cut your head off?”.\n\nThe other people laughed and said, “This slave’s name is very bold. He uses the same name as the tutor of the Big Qin Kingdom’s king Jian Bu Gu. It is a shame you have the same name but live a totally different life. One is a famous king tutor in the Qin Kingdom, and one is a cheap slave.”\n\nManager Wen thought it was funny. “A slave’s name is Jian Bu Gu. If he can sell for 3,000 king money, I do not care what he is called. He can even call himself Sky God.”\n\nWhile everyone was talking, Han Sen understood what Jian Bu Gu’s name was. The king’s tutor was one of the three main officers. When the king was too young or no one was in charge, he would assert stewardship over the kingdom.\n\nJian Bu Gu was not just a king’s tutor. He was the first swordsman of the Qin Kingdom. Ten years ago, Jian Bu Gu quit. No one had heard about him for a long time.\n\nNo one would have thought that the slave in front of them was the first swordsman of the Qin Kingdom, Jian Bu Gu.\n\nHan Sen did not know if he was the real Jian Bu Gu. He had never heard his name before, but he could tell that the man was special. He was quiet, and not everyone had that aura about them.\n\nLi Bing Yu examined Jian Bu Gu. She did not believe Jian Bu Gu had become a slave, but she did think this slave looked rather familiar.\n\nAlthough Li Bing Yu had never met Jian Bu Gu, there were paintings of Jian Bu Gu in Wu Wei Dao Palace. That middle-aged man looked a little older than the person in the Jian Bu Gu paintings. He did not emanate the superior feeling of the Jian Bu Gu from the paintings. When she looked closely, the eyebrows looked rather similar."
}