{
    "chapter": 2478,
    "title": "Demon Hell Dragon Tattoo",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2478",
    "text": "The Moon doppelganger exploded. Han Sen’s true self appeared on the other side. Without hesitating, Han Sen turned into a blood shadow and fired himself into the eyes of a Duke class unicorn.\n\nPang!\n\nHan Sen had only just entered the eyes of that Duke class unicorn when a red light fell on the unicorn, bursting the creature’s head into bloody chunks.\n\nHan Sen didn’t stop. He teleported into another Duke unicorn’s eye.\n\nPang!\n\nThe result was exactly the same. That Duke class unicorn’s skull was broken again, but this time, it was via a black light.\n\nHan Sen kept trying to move around with his eye powers, but he was discovered every time. Without an ounce of hesitation, the unicorn Kings merrily killed the unicorns Han Sen fled into.\n\nSeven unicorn Kings whinnied into the sky, and many of the other unicorns turned around to run away. Clearly, they understood Han Sen’s eye skill, and they weren’t going to give him a chance to use it anymore.\n\nSeeing all this, many Dukes and nobles sighed. “It is game over for Han Sen and Lando.”\n\nOrdinary people often sympathized with an underdog. Han Sen and Lando were the best of their level, but now people were sympathizing with them.\n\nLando was already injured, so it didn’t look as if he would last much longer.\n\nHan Sen’s eye skills had been his best chance of survival at this point. If he couldn’t use those eye skills, his end wouldn’t be any prettier than Lando’s.\n\n“Klose, the table is set. Your expectations of that traitor were too high, it appears.” Dragon One sipped tea from his teacup and smiled coldly.\n\n“It isn’t the end just yet. It’s still difficult to determine who the winner will be.” Klose continued to smile.\n\n“What? Does that traitor still have a few tricks up his sleeve?” Dragon One frowned as he looked at Lando, who was still in battle.\n\n“Who knows? It’s difficult to say, isn’t it?” Klose said in a mysterious tone of voice.\n\nPang!\n\nAnother big explosion rocked the battle. Lando was sent flying away again. By this point, his injuries were very dire. There were three bloody holes in his chest, plus countless wounds and scrapes across his body. He was bleeding all over, and his body was beginning to run out of blood to spill.\n\nHis injuries were so serious that any other half-deified would be immobilized by the pain. In their agony, they’d literally scream themselves to death. But Lando still moved as if he didn’t have any pain. He just looked a bit pale.\n\nThe rainbow unicorn was coming for him again. Its eyes were like pieces of glass that reflected the entire universe. The rainbow light was headed for Lando again.\n\nIn its eyes, it looked as if it held the very essence of life and death.\n\nLando’s body danced in the sky, but he no longer had the strength to dodge the attacks that came his way. The scary rainbow light was going to perforate his head.\n\nEveryone thought this was the moment Lando would be killed. No matter how strong the body of a Dragon might be, it couldn’t be revived if the head was annihilated. Only a very few of the Dragon could ever be fully reborn.\n\nLando suddenly groaned like a dragon. But when Han Sen looked at him a little closer, he could see that the groan didn’t actually come from Lando’s mouth. It came from his back.\n\nThe purple draconic tattoo on Lando’s back had started moving. It grew, spreading to cover his entire back. It glowed with a purple light. Purple air hissed out of the dragon tattoo, making it appear as if the dragon tattoo was a living entity.\n\nLando was in the air. He threw his fist in a punch toward the rainbow light. The purple dragon tattoo shone on his back, and the purple air wrapped around his arm in a shroud. It was like the spine of a dragon was wrapped around that launched fist.\n\nA purple dragon came out of the fist and hit the unicorn’s rainbow light. The two powers hit each other inside the clouds, and suddenly, a hole was torn right through space. A giant black hole appeared there and started sucking everything inside. But there was no explosion.\n\n“Huh? Isn’t that the Demon Hell Dragon Tattoo from Dragon Two? Why would it be on the traitor?” Dragon One stared at the purple tattoo on Lando’s back.\n\n“The Demon Hell Dragon Tattoo has very special powers. The legends say it comes from Dragon Two of the prior generation. The same Dragon Two who was Lando’s master. Dragon Two created it in the hope of challenging Dragon One. It was a shame he was beheaded by his student before he could use it,” Klose said with a smile.\n\n“It looks like the Demon Hell Dragon Tattoo wasn’t destroyed. That traitor took it for himself. Very good, very good.” Instead of being shocked, Dragon One was actually happy. He looked at the Demon Hell Dragon Tattoo with excitement.\n\nThe last generation’s Dragon Two wanted to obtain Dragon One’s seat. He used his deified body as a base and refined his blood into a tattoo that became known as the Demon Hell Dragon Tattoo. It was quite the treasure.\n\nNot many Dragons knew about that treasure. And no second Dragon wanted to try it because it was too painful.\n\nUsing his own body and his Dragon blood to create the Demon Hell Dragon Tattoo meant that Dragon Two put himself into a smithy’s furnace to be forged. That pain wasn’t something that just anyone could endure. It was like taking a trip to hell, where you would have to endure endless torture. That was why it was called Demon Hell Dragon Tattoo.\n\nDragon Two of the prior generation suffered for ten thousand years to create this treasure that was called the Demon Hell Dragon Tattoo. He had planned to use it to rise within the Dragon ranks.\n\nWhen that Dragon Two died, the other Dragons thought the Demon Hell Dragon Tattoo was destroyed. After all, the Demon Hell Dragon Tattoo was created by Dragon Two. It was a part of his body.\n\nBut no one thought the Demon Hell Dragon Tattoo had actually ended up on Lando’s body. Not only that, but he could apparently control it.\n\nSeeing the power of the Demon Hell Dragon Tattoo, it was obviously something that had reached deified status. It could create substance chains.\n\nLando himself hadn’t yet become deified, but already he could make the Demon Hell Dragon Tattoo manifest in an incredibly powerful way. If he became deified and was able to use the full power of the Demon Hell Dragon Tattoo, the power he could unleash would be even scarier.\n\n“You knew Lando had the Demon Hell Dragon Tattoo?” Dragon One asked, looking at Klose.\n\n“How was Lando able to kill his teacher if he had the Demon Hell Dragon Tattoo? Are you so naive that you think a half-deified can easily slay a deified?” Klose asked, his voice grating.\n\nDragon One wasn’t angry. He laughed and said, “Good. Today I will claim the Demon Hell Dragon Tattoo, too. Then, the grudge will be over.”\n\n“What? Despite being a Dragon, you have no confidence in what the Demon Hell Dragon Tattoo can achieve?” Klose licked his lips as he spoke.\n\n“That tattoo is strong, but Uncle Dragon Two had only created the prototype. It isn’t entirely finished. And you’re underestimating the power of the Tianxia Unicorns. They aren’t just ordinary deified creatures,” Dragon One said with certainty.\n\nWorry suddenly passed over Klose’s face. He looked at the deified unicorn and Lando."
}