{
    "chapter": 900,
    "title": "Flaming Porcupine",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_900",
    "text": "\"I can mask our scent, robbing the creatures that could locate us through our scent of their abilities to find us. Furthermore, I can detect the faint traces and scents of those that have gone before us. I can read the area,\" Qu Lanxi explained to Han Sen.\n\nHan Sen was surprised. Her abilities did not lend themselves to combat proficiency, but they would be extremely useful, all the same.\n\nShe would undoubtedly prove valuable on the trip he was planning. There was no discernible reason for Han Sen to deny her presence, following this revelation. So, he planned to go with her.\n\nThe ability to erase one's scent was an incredible talent to possess; otherwise, creatures could find, stalk, and attack you with greater ease.\n\nThe next day, Han Sen took Qu Lanxi with him to the forest. Han Sen was a little anxious, almost flat-out worried, about venturing there. He wasn't powerful enough to compete with what was said to lurk beneath the knotted boughs and tangled roots of that domain. The entire place was veiled with mystery and tales of anguish.\n\nIf it wasn't for the wind beast at his side, Han Sen wouldn't even have dreamed of going there at his current stage of development.\n\nThe duo had now now walked half a kilometer beyond the edge of the forest. At this stage of their journey, Han Sen discovered his first wild geno plant. When Qu Lanxi wasn't looking, he absorbed the plant.\n\nWith the wind wolf leading their way, Han Sen managed to absorb a dozen such plants. They made for quite the prize.\n\nThey were only at the edge of the forest, yet the grass was overgrown and impeded their travel. The foliage was thick and coarse, and the trees grew tall and menacing.\n\nIt was said that further-into the forest, the thorns of the forest's namesake would reveal themselves. Spiked vines and woods would choke all paths, and the creatures would be far more numerous and threatening. They weren't in too deep yet, so there was no immediate danger.\n\nBut suddenly, Little Wind stopped. It began to growl, in a signal of warning.\n\nHan Sen comforted the beast and used his dongxuan aura to scan the vicinity. His ability had its limits, however, and so he couldn't detect whatever Little Wind was trying to draw his attention to. It wasn't too close.\n\nQu Lanxi's eyes burned like molten silver, though. She looked around and said, \"I can detect the remnants of a scent, left by a creature around eight hours ago. There were two of them, as a matter of fact.\"\n\n\"Can you discern which creature came by?\" Han Sen asked.\n\n\"Unfortunately, no. I have never smelled such a scent before, so I don't know what could have left it,\" Qu Lanxi answered.\n\nLittle Wind stayed alert, however, and its fur straightened and stood up on end. Han Sen knew that a dangerous creature had to be around somewhere, so he brought his companions with him to hide in the midst of a few bushes.\n\nAs they did this, Qu Lanxi used her scent-masking ability. Unless the creatures saw them directly, they'd be difficult to detect.\n\nAfter a short wait, the brush on the edge of a glade began to rustle. A metallic red porcupine revealed itself.\n\n\"And so, we have already come across our first ordinary creature. I can only wonder how many gene locks it has opened.\" Han Sen scanned the porcupine, and noticed its lifeforce was almost as strong as that of Little Wind.\n\nThe porcupine came out of the bushes and went towards a tree. Then, it began to burrow beneath it. It unearthed some subterranean fungi and started eating them ravenously.\n\n\"Wait here. We're off to go kill it.\" Han Sen was excited to see a lonely, ordinary creature.\n\n\"Be careful, okay?\" Qu Lanxi was nervous, and cared for Han Sen's wellbeing.\n\nHan Sen allowed Little Wind to wait where he was, and snuck behind the porcupine by himself. His basics hadn't left him yet, and so he used one of his assassination talents to approach undetected. When he was three meters away, the porcupine was still enjoying its meal, blissfully unaware of its nearing aggressor.\n\nWhen he was two meters away, Han Sen suddenly fired a coin onto the porcupine.\n\nThe porcupine instantly became enraged. It turned around and looked at Han Sen with fiery eyes, and its spikes straightened out with a desire to kill. Like a projectile, one of the spikes was fired straight at Han Sen.\n\nHan Sen cast dongxuan aura and evaded the spike successfully—it was going for his face.\n\nPang!\n\nThe spike drove through a tree, then bounced off of a second tree and fell down to the ground.\n\nThe vegetation of the Third God's Sanctuary was stronger than the vegetation of the Second God's Sanctuary. In order to pierce through a tree, the force of the spike was horrible.\n\nThe porcupine ran towards Han Sen with the speed of a sportscar. If Han Sen was unfortunate enough to be caught in the roll of that porcupine's spikes, he'd be very dead.\n\nHan Sen used a formation, and with an analysis of the environment, circled the porcupine.\n\nLittle Wind came charging forward, a blistering gust of wind whipping from its mouth. Its gaping maw suddenly became a cannon, one that was primed and ready to fire at the porcupine.\n\nPang!\n\nThe cannonball of wind could only be cast if the creature had successfully opened its fourth gene lock. The air cannon's ammunition was like a bomb, and hit the porcupine with tremendous force. Many of the spikes were ripped away by the wind, peeling the skin as they went. The porcupine was bleeding.\n\nThe porcupine spared no time to tend to its wounds, so it just looked at Little Wind and screamed at it. The spikes of its back suddenly burst into flames, and like bullets, rapidly fired towards the wolf.\n\nLittle Wind did not move away to avoid the incoming projectiles, however. It stood its ground and howled to create a flurry of wind that blew away all the spikes. Not a single scratch was dealt to him.\n\nHan Sen fired another coin at the porcupine, and since it was distracted by Little Wind, it did not dodge. Its speed was reduced immediately, hindered by the crushing weight each coin dealt.\n\nLittle Wind opened its mouth and fired his air cannon again, and after the porcupine had been slowed down by the coins that kept hitting it, it was unable to evade that, either.\n\nThrough the cooperative efforts of Han Sen and Little Wind, the porcupine was rendered paralyzed. It could not move. Little Wind fired a few more cannonballs of wind, and for the finisher, Han Sen brought down his Sonic-Thunder Punch on the porcupine's head.\n\n\"Ordinary Creature Flaming Porcupine killed. Beast soul gained. Consume its flesh to gain zero to ten ordinary geno points randomly.\""
}