{
    "chapter": 1214,
    "title": "Thorn Is Born",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1214",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nA red rose burst forth and stood erect in the pool. Its lifeforce was strange, wavering queerly between powerful and weak.\n\nSnowball approached the pool, but he was clearly afraid of this enigmatic flower. As Han Sen observed the rose, he felt a rumble come from his Sea of Soul.\n\nThorn Baron, who had eaten the Flying Mushroom and gone into a slumber, was beginning to shine with a powerful light. From her figure, thorny vines began to form.\n\n“Is Thorn Baron evolving? Has she become a king spirit?” Han Sen looked on the light in wonder.\n\nThe Flying Mushroom provided a chance for spirits to evolve and become king spirits. It was a supremely rare herb, and the percentage chance of success was low. Thorn Baron had king spirit geno points already, though, so her chance of success was slightly increased.\n\nPang!\n\nThe light that veiled her shattered, and then the vines began to wreathe amongst themselves to create a sphere. Within that wicker-like orb, you could see the figure of a person inside.\n\nThe vines then started to fall with the delicate grace of petals. Thorn Baron’s body was revealed, bit by bit. When Han Sen’s eyes were able to rest upon the bosom that graced Thorn Baron’s pale and voluptuously curvy body, his heart began to race.\n\nThorn Baron’s eyes were different from those naturally possessed by humans, as her pupils were shaped like flowers. As beautiful as they were, they hinted at a streak of danger and gravitas.\n\nThorn Baron arose from her bed of vines with a body that stole the eyes and did not allow them to be turned away. When she stepped forward, the vines and thorns dressed her body and covered up her lady parts.\n\nHer long legs, sexy arms, and slim waist were still plain to see, though, and Han Sen made sure to soak his eyes in the vat of beauty that was her appearance. She was like a botanical bikini model.\n\nHan Sen summoned her and told her, “Thorn Baron, no… Thorn Queen. Congratulations are in order!”\n\nThorn Queen bowed and said, “I have to thank you for providing me with the Flying Mushroom. It is a gift and blessing I will never forget.”\n\nHan Sen wanted to reply, but before he could, Thorn Queen spoke again in surprise. She said, “Master, why is there an Equinox Flower here?”\n\n“You recognize this flower? Magnificent timing, then.” Han Sen was delightfully surprised.\n\n“Emperors exist amongst the ranks of king spirits; there is a similar hierarchy to be found in the realm of plantlife. Few spirits can be born an emperor, but many plants can. The Equinox Flower is a famous emperor-class plant. It has birthed right here before you, and it is already an emperor.”\n\nThorn Queen paused for a moment, but then went on to say, “Even if a king spirit approached it, their power could be drawn and fed upon by the flower. It is dangerous.”\n\n“What does the equinox refer to?” Han Sen asked.\n\n“No one knows. But not even an emperor would dare approach it. It may be a space geno plant, and the equinox refers to a place it has created,” Thorn Queen said.\n\nThorn Queen then noticed the presence of the egg and Snowball. She said, “Has that egg been growing in the pool belonging to an Equinox Flower? That is most strange. How is such a thing possible? It must be a mutation of some kind.”\n\n“The egg belonged to a creature called Ghost-Toxic Chi,” Han Sen told her.\n\nThorn Queen responded with an admittance. “I don’t know what that is, I am afraid. But it must have been a berserk super creature; an evolution stemming from some mutation, of sorts.”\n\nThorn Queen looked at Snowball, who was currently swimming towards the egg, and she said, “That’s strange. I am surprised to see it hasn’t gotten lost, swimming so near that flower.”\n\n“If I take the egg, will the creature that hatches be a berserk super creature?” Han Sen asked.\n\nThorn Queen said, “It is still growing. If you remove it now, I don’t think so.”\n\n“Snowball! Get back here, you mutt.” Han Sen preferred to wait until it was a berserk super creature before taking it.\n\nBut it seemed as if Snowball couldn’t hear Han Sen, and so he kept on swimming.\n\nHan Sen was angered by this disobedience, but before he could use his blood contract to hurt him, Thorn Queen said, “He is in the Hellpool. Believe it or not, he treads the waters of another dimension. He cannot hear you.”\n\nHan Sen was surprised hearing this, to say the least.\n\nThorn Queen gave Han Sen a warm smile, and then she comforted him, saying, “But do not worry. Perhaps I can be of service here.”\n\nThorn Queen reached out her hand and took aim at Snowball. A lengthy vine extended from it, which wriggled through the sky until it reached Snowball. Then, it grabbed the creature and lifted it out.\n\nSnowball was dropped on the ground in front of Han Sen in confusion. Not everything was able to tread the Hellpool to collect something, and Snowball genuinely wanted to please Han Sen.\n\nFor him to be picked up by a sudden vine, he initially thought it was the Equinox Flower looking to make a meal out of him. But it was Han Sen’s spirit that had done so, and what surprised Snowball the most was the fact that another spirit was able to traverse the Hellpool.\n\n“Thorn, how long will it take for the egg to hatch?” Han Sen asked. His primary purpose for even coming to this place was to find Little Silver.\n\n“At least a hundred years.” Thorn Queen answered.\n\n“A hundred years? That long?!” Han Sen frowned.\n\nThorn Queen bowed and said, “I have a request. I hope you can approve it.”\n\n“What is it?” Han Sen was happy to oblige because he liked her a lot, especially when compared to the scheming and conniving Moment Queen.\n\n“I am hoping you will allow me to take that Equinox Flower,” Thorn Queen said."
}