{
    "chapter": 968,
    "title": "Gourd Absorb",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_968",
    "text": "Bao’er clutched her gourd tightly, and from the tip of it, a black hole formed.\n\nThe atmosphere around it broke, and in that space, the very composition of the dimension fragmented. And then, from all around, everything began to be sucked into it.\n\nHan Sen was frozen at the sight, watching the dark, swirling vortex suck in all the bugs like a hyperdrive de-humidifier.\n\nThe gourd was small enough to fit neatly inside Bao’er’s hands. As a result, the gourd was far smaller than the bugs.\n\nAnd yet, it effortlessly vacuumed-in each and every one of the creatures. Even the tank-like scorpion was dragged through the black hole at the mini-gourd’s tip.\n\nHan Sen could hardly believe it, even watching the sacred-blood creatures be sucked inside the gourd.\n\nThe gourd had to be some sort of bottomless well. Despite the countless creatures it had absorbed, there was no indication of it filling up. It was as if a pocket of endless space resided within it, and it could collect all that it sought to.\n\nPat!\n\nSoon after, the bugs were all gone, and an unnerving silence returned to the tangled woodland. And then, just as quickly as it first appeared, the gourd disappeared.\n\nBao’er, empty bottle in hand, said, “I want milk.”\n\n“Okay. I’ll get you the best organic milk I can find,” Han Sen said, smiling.\n\nWith Bao’er there, no one could dare mess with him.\n\nAfter bringing Bao’er back to the shelter, Han Sen filled up her bottle with milk. And calmly, she suckled its rubber end in delight.\n\n“Bao’er, where is your gourd?” Han Sen asked.\n\nBao’er looked at Han Sen with moderate confusion.\n\n“You know, the gourd that absorbed all those bugs.” When she still didn’t seem to understand, Han Sen presented her with a drawing of a gourd.\n\nBao’er, now understanding, said, “It’s mine.”\n\nHan Sen quickly replied, “Oh, I know that. Don’t worry; Daddy knows it’s yours. But I’m just wondering… can Daddy borrow it for a time?”\n\n“Okay. I can give it to Daddy.” Bao’er clapped her hands and the gourd appeared before her. Then she passed it to Han Sen.\n\n“Good girl!” Han Sen accepted the gourd and simulated Bao’er’s energy flow. He aimed it at the bear that had brought him so much trouble and yelled, “Absorb!”\n\nThe white bear p*ssed itself, but strangely, the gourd did not produce a black hole.\n\n“Suck! Suck! Suck!” Han Sen yelled, three times. But still, nothing happened.\n\nThe white bear was frightened with each call, and when Han Sen started yelling, the bear passed out due to the overwhelming fear of imminent death.\n\nIt was like a prisoner who was to be executed at a firing range, but all the guns had jammed three times.\n\n“Why is it not working?” Han Sen asked, bringing the gourd back over to Bao’er. “How can I make it absorb stuff, just like you do?”\n\nBao’er looked confused, not sure what Han Sen was suggesting.\n\nHan Sen tried to explain it in greater detail, but she was evidently too young to understand.\n\n“Can we release the bugs that are inside, maybe?” Han Sen had an idea, regarding the bugs that had been sucked inside.\n\nThere were a few sacred-blood class creatures inside, so releasing them one by one could let him obtain quite a few sacred-blood geno points.\n\nBut unfortunately, Bao’er could not understand this suggestion, either. In response to this, Han Sen tapped the gourd on its head and said, “The bugs… the bugs…”\n\nBao’er smiled and then grabbed the gourd. He thought she had understood, but instead, she tapped the gourd on its head and made it disappear.\n\n“Ugh, I need help. I better enroll in some baby-language academy.” Han Sen felt incredibly disheartened.\n\nSince he could not speak to Bao’er properly and make her understand him, Han Sen planned to kill the bear the old-fashioned way.\n\nAs Han Sen approached it, though, the bear leapt up and began another act of kowtowing.\n\n“It’s too late for that; you’ve already done this once.” Just as Han Sen prepared to finish the bear off, Bao’er started laughing and clapping.\n\nThe bear saw Bao’er’s happiness and did a handstand for her. Then it did a strange performance, using its tongue to jump and hop in the air. Bao’er laughed with exuberant glee.\n\n“He is smart.” Han Sen was surprised.\n\nThe bear, seeing her so happy, crawled near her and tried to lick her feet.\n\nBut Bao’er thought it was too dirty, which soured her mood. She slapped the bear, which sent the furry felon flying into a nearby wall with a crash.\n\n“Ha!” Han Sen then wondered whether or not if he should give the bear an extra chance, if it committed itself to pleasing and providing Bao’er company.\n\nIf it would change its ways and do this, he’d allow it to live as a toy for Bao’er. Also, it could provide Han Sen some blood every now and then to attract bugs and make hunts simpler.\n\nThe bear survived its latest wallop, but its nightmare had only just begun.\n\nHan Sen watched the bear and allowed it to remain near Bao’er’s side.\n\nOver time, he’d occasionally hear the bear scream in agony, following a loud thud.\n\nThe people in the east would always hear these screams, and they started murmuring amongst themselves about what it could have been. Many were in the belief that Han Sen had a secret hobby of torturing animals.\n\nBy the end of each day, the bear was injured and could hardly even move. It thought it could rest, but such wishes were flickers of its naivety.\n\nAt night, Han Sen used his holy light to heal the creature. And the day after, it’d be sent right back to Bao’er for play.\n\nThe bear needed to allow Bao’er to bully it, for that was the only way to keep her happy. And every now and again, Han Sen would come to draw its blood. It felt as if it had been robbed of its bear-necessities, and its life as a free-bear was over."
}