{
    "chapter": 2598,
    "title": "Extreme Evil Path",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2598",
    "text": "Yu Shanxin’s expression didn’t fluctuate in the slightest after hearing Han Sen’s speech. He asked calmly, “Have you heard the tale of the Sky alpha known as Suppress Demon?”\n\n“No.” Han Sen wasn’t in the mood for a story, but if someone like Yu Shanxin wanted to talk, then Han Sen would listen.\n\nYu Shanxin’s smooth voice remained just loud enough for Han Sen to hear him. “In ancient times, before the interstellar area, the Sky lived on a planet where a demon also resided. It ate people. The demon would eat one person every day. But the demon didn’t have its own body. If it wanted to eat someone, it would have to possess the body of one Sky to devour the body of another.”\n\n“Because they were unable to prevent the demon from possessing them, the Sky had many incidents involving fathers eating their sons, wives eating husbands, or even children eating their grandparents. Those things continued to happen until our alpha rose to the challenge. He offered himself to the demon and allowed the demon to assume control of his body.”\n\n“And? Did the Sky alpha somehow imprison the demon?” Han Sen was curious.\n\n“No. Our alpha’s power wasn’t vastly superior to that of the average Sky. The demon gained control of his body, too. The demon used him to eat many Sky,” Yu Shanxin said flatly. That answer wasn’t what Han Sen had expected.\n\nYu Shanxin looked at Han Sen and went on to say, “Although our alpha was controlled by the demon, he managed to accomplish something more than most possessed Sky. Other Sky, when they were controlled by the demon, still had their will. But they didn’t hate the demon. They were scared of it like a tiger. Even if they pretended not to be, they couldn’t lie to the demon. That was because when the demon possessed a Sky, it could peer into their thoughts. No matter what that person did, they couldn’t lie to the demon. So, it didn’t matter what they said or did. The demon would still see into their thoughts. The demon would control them and force them to kill themselves. The alpha was the only exception to this.”\n\nuse\n\n“What did he do?” Han Sen had become very curious.\n\n“He didn’t do anything. He befriended the demon,” Yu Shanxin said.\n\n“I thought you said the demon could see through the thoughts of the Sky. How could the alpha trick a demon like that?” Han Sen asked with confusion. The Sky’s alpha must have hated the demon.\n\nYu Shanxin laughed and said, “That is why Master Alpha was different. He faced an enemy that he hated the most, yet he was able to let go of that anger and treat the demon so kindly. It was as if he considered the demon to be his own son, and no matter how much the demon did wrong, he still forgave it. That was a care that came from the heart. In this universe, aside from my alpha, I have yet to see anyone be able to do the same thing.”\n\n“Are you saying the kindness of Master Alpha touched that demon?” Han Sen couldn’t guess the ending of this story, so this was his best attempt.\n\n“Yes. Master Alpha’s kindness had an impact on the demon. That demon was only supposed to possess someone for a single day before disposing of the host. But when it entered the alpha’s body, it remained there. It never left him, until Master Alpha found a weakness inside the demon and killed it. He ended the nightmare that had plagued the Sky for as long as my people could remember,” Yu Shanxin said.\n\nHan Sen was blown away by this story. The alpha had used love to earn the trust of a demon that could read peoples’ minds, and then killed the demon he had grown to love. Han Sen didn’t know what sort of person could do that. If he had been in the alpha’s place, Han Sen didn’t think he could have achieved the same.\n\n“Teacher Yu, your alpha is a real saint. I’m just a normal man. Do you want me to go feed a demon? I can’t do it. I would be angered by the Very High, and I would likely end up dead.” Han Sen understood what Yu Shanxin meant by telling him the story, but he knew that he couldn’t do it. Understanding didn’t matter.\n\n“It’s okay if you can’t do it. I can help you,” Yu Shanxin said with a smile.\n\n“Really? You can help with this?” Han Sen asked skeptically. He thought Yu Shanxin must have been yanking his chain.\n\nYu Shanxin laughed and said, “Do you know why my name is Yu Shanxin?”.“How am I supposed to know something like that?” Han Sen thought to himself. But what he said was, “I have heard your temper got better when you received this name, Mr. Yu. Was it to make you think more positive things?”\n\nYu Shanxin smiled and said, “I thank you for thinking so highly of me, but I don’t really have positive thoughts. The reason why I am called Yu Shanxin is to tell myself that no matter what happens, I should never give up on myself. It doesn’t matter if I become evil or commit a crime no one else can accept. It doesn’t matter how much I am hated; at the very least, I can avoid hating myself. I need a good heart to love myself with.”\n\nHan Sen was frozen. This was the first time he had ever heard someone explain their good heart to someone else.\n\n“The geno arts I practice are based on evil powers. If I think of evil things, they will be more powerful. When I was younger, the reason I came to Sky Palace to kill the elders was precisely because of this. But the stronger this geno art becomes, the more it claims me. I didn’t practice the skills of killing; I trained the mental fortitude of not allowing myself to ever be claimed by evil. Only I can control myself in this world. No one else can use me. Not even God.” Yu Shanxin was speaking so quietly, but Han Sen could feel the overbearing weight of the man’s words.\n\nBut Han Sen didn’t understand how this conversation had anything to do with the Very High.\n\nYu Shanxin looked at Han Sen and smiled. “The Extreme Evil Path I have practiced doesn’t have a sensing power like the Very High, but it does contain a unique ability. I can use my evil to possess you. And when the Very High use their senses to invade your mind, they will only touch the evil of my mind. And so, all they will feel are my feelings. It will mean that they cannot feel anything about you. That way, you won’t have to worry about their invasive senses. You can enjoy all the benefits of the Very High without having to worry about being watched. Would you reject a swathe of benefits like that?”\n\n“You can really do that?” Han Sen didn’t doubt what Yu Shanxin was saying, despite how far-fetched it seemed. Still, he felt compelled to ask.\n\n“If you don’t believe me, we can conduct a test. Meet Exquisite from the Very High, and then you can find out if I’m telling the truth or not,” Yu Shanxin said with a smile."
}