{
    "chapter": 2348,
    "title": "Flu",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2348",
    "text": "“Is the Ancient Water God going to die soon?” Han Sen asked with a frown.\n\nAlang’s eyes opened wide as he looked at Han Sen, and he said, “How could you say something like that? Aren’t you worried that the Ancient Water God will hear you and kill you?”\n\nHan Sen was shocked and said, “I thought that is what you were suggesting.”\n\nAlang rushed to blurt out, “At what point did I mention that the Ancient Water God was dying? I said we were here to watch the Ancient Water God level up and become a god spirit.”\n\n“Level up to become a god spirit? Does such a level even exist?” Han Sen asked, his brows furrowing.\n\n“It does, according to the legend. It is something that all who are deified aspire to. It has nothing to do with us vendors, though. We are merely here to just watch and rake in some cash.” Alang stopped and then glanced around. He quietly said, “But most creatures here seem to believe the Ancient Water God will fail. So, they are here to try their luck. They want the Ancient God Origin.”\n\n“Ancient God Origin? What is that?” Han Sen asked, blinking.\n\nAlang looked at Han Sen with shock and said, “Handsome, if you don’t know what an Ancient God Origin is, why are you even here?”\n\n“That is business that doesn’t concern you. Hurry up and tell me what the Ancient God Origin is,” Han Sen said coldly.\n\nAlang shrugged and said, “Ancient Gods exist differently than ordinary people and creatures. If one is born, then one must die. If one dies, then another will be born. Only when the older Ancient Gods die can there be a new one. In this universe, there is a fixed number of Ancient Gods. There cannot be any more or any less than a predetermined amount. If Ancient Water God fails to become a god spirit, he will leave behind an Ancient God Origin. That Ancient God Origin will turn into a new Ancient Water God, and it will be born deified.”\n\nAlang paused and said, “The Ancient God Origin is just like the egg of another race. You need the same elemental powers to hatch it. If you get approved by the Ancient God Origin, it will follow you. To a water element creature, that is sure to be a grand servant.”\n\n“Something that great actually exists? If I ate the Ancient God Origin, would I become deified?” Han Sen stroked his face as he spoke.\n\n“Eat it?” Alang’s eyebrows looked like they were going to disappear into his hair. He peered at Han Sen as if he had just seen a ghost. A while later, he said, “Ancient Gods are born deified. They have scary amounts of power. Even if a deified was there, they could do nothing to an Ancient God Origin. Plus, the Ancient God have many deified elites already. They will be protecting it. They would not allow any other deifieds to get close to it.”\n\n“You are right. But if a deified cannot eat it, that doesn’t mean that I couldn’t. This is a good opportunity for me. If I can nab the Ancient God Origin, I can nourish myself a great deal.” After saying that, Han Sen turned to leave, ignoring Alang.\n\nNow Han Sen understood why Miss Mirror had brought him to watch the Ancient Water God become a god spirit. She probably wanted to see if Han Sen could get the Ancient God Origin. But Han Sen still didn’t know why Miss Mirror would want it.\n\nAs Han Sen walked, he suddenly had a cold chill. He sneezed and rubbed his nose, and he spoke to himself, “Who is missing?”\n\nHan Sen continued walking away, but he did not see Alang gritting his teeth as he watched Han Sen walk away. The man’s eyeballs almost popped out of their sockets in his anger.\n\n“How dare he want to eat my Ancient God Origin? Let’s see how you eat it while you’re dealing with this,” Alang snarled. His body spun around, and he and the items in his stall turned into water. He went into the sand, and then, he disappeared without a trace.\n\n“Hachoo! Hachoo! Hachoo!” Han Sen kept on sneezing as if he had suddenly suffered the flu. He felt himself growing fevered, and snot oozed continually from his nose.\n\nHan Sen didn’t feel good. He had the body of a Duke, and he had a King class Original Water King Body. How could he possibly get sick?\n\nHan Sen used some of his power to look himself over. He didn’t detect anything unusual, but his body felt cold and a little dizzy. He sneezed and blew out snot. It looked as if he had come down with the flu.\n\nWhen Han Sen went back to Miss Mirror’s peak, his body was so cold, and his head was spinning rapidly.\n\n“What’s going on with you?” Miss Mirror frowned and looked at Han Sen.\n\n“I don’t know… It’s like I have the flu…” Han Sen’s body was so cold. His head was burning, and it had been years since he had felt this way.\n\nMiss Mirror’s face changed. She leaped over to Han Sen and placed a hand on his forehead. Han Sen felt power rush out of Miss Mirror’s hand and sweep into his body.\n\nThat power was icy cold, and when it went into Han Sen’s body, it quickly swirled around. It made Han Sen feel a bit better, but that sick feeling was still present.\n\n“Where were you, and who did you encounter?” Miss Mirror’s face looked cold as she asked the question.\n\n“I was over there, down in the markets. I just walked around and spoke to a stall owner.” Han Sen pointed to the market below them.\n\nMiss Mirror wrapped an arm around Han Sen. She moved her body, and they suddenly teleported to the market.\n\nMiss Mirror looked around and asked Han Sen, “Which stall owner?”\n\nHan Sen struggled to fight off the dizziness. He brought Miss Mirror through the market to reach that corner.\n\n“He was just here…” Han Sen’s face grew increasingly worried. Alang and the store were gone. He knew that must have happened when he left.\n\nHan Sen was always careful. When he came up to the stall owner to ask his questions, he had already examined Alang. There was nothing strange about the man. Han Sen didn’t know where he had caught the sickness.\n\nFortunately, at that moment, aside from the flu-like symptoms, nothing bad was happening to his body.\n\n“Huh, you dare to hide from me? Let us see who you really are!” Miss Mirror grunted. She raised her hand and pulled out an old mirror.\n\nThe old mirror faced Han Sen’s finger. The light in the mirror started to swirl into an image, and the image looked like an old video that was being rewound.\n\nThe video in the mirror was rewound very fast. All the items and creatures that were once there were now revealed clearly. It rewound to a few days before, but there was just an empty landscape.\n\n“There really was a stall,” Han Sen said, when Miss Mirror turned to look at him. Han Sen stomach sank.\n\nMiss Mirror frowned and said, “I would rather you were lying. If you aren’t lying, then you really did attract the attention of a very scary guy. Even my Space Mirror is unable to reveal any trace of him having been here. He must have been a very scary deified elite.”"
}