{
    "chapter": 2903,
    "title": "Blonde-Haired Lady",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2903",
    "text": "Bai Wanjie agreed. He kept throwing the star orbs one by one at the big egg. The big egg grew brighter and more transparent. The blonde lady’s face on the inside became clearer.\n\nHan Sen looked at the big egg with a frown. He could already see everything crystal clear. The blonde lady was going to be woken up. That made Han Sen nervous, perhaps even a bit scared.\n\n“Why does the Extreme King send their princes and princesses here. What are they after? There is no way they had no idea what was inside this. If they knew and still sent people here without saying anything, it is just so weird.” While Han Sen was thinking, he suddenly noticed Bai Lingshang.\n\n“It looks like a blonde lady inside,” Bai Lingshang said while looking at the big egg.\n\nBai Wanjie threw 70 of the star orbs, which were making the big egg look crystal-like. One was almost able to see the face of the blonde lady inside, but it was still not completely clear.\n\n“This is so weird,” Bai Wuchang said. “There is a creature inside this egg that looks like one of the Extreme King, but the race that is not like us. No one here can come from an egg, right?”\n\nBai Lingshang rolled her eyes and smiled. “Obviously, she was not birthed from the egg. When have you ever seen creatures born with their pajamas on?”\n\n“You’re right,” Bai Wuchang quietly said. “That means someone locked her inside it. Is our mission to rescue her?”\n\n“It is hard to say if we are to rescue or kill her. Perhaps she a higher-level undead.” Bai Wanjie looked at the big egg while he spoke and continued to lob star orbs at the structure.\n\nEveryone stared at the lady. The more star orbs he threw, the clearer the woman’s face appeared. She was as pretty as an angel.\n\nNow, she was frowning. She did not seem happy.\n\nEveryone was staring at her as her eyes suddenly opened. It shocked everyone watching.\n\nShe was not like an ordinary person who opened their eyes after a night of sleep. Her eyes were totally open and entirely wide. Her gold pupils looked made it seem like there were no pupils. Although she had opened her eyes, her vision did not appear focused. It looked very weird, and it gave them a chill.\n\nKatcha!\n\nThe giant egg looked, which now looked like a crystal shield, cracked. In the blink of an eye, the whole giant egg looked like broken steel glass. It turned into countless small shards that rained down. The blonde woman inside was completely visible.\n\nThe blonde-haired woman was floating inside the cave of the mountain. It looked like some wind was coming up from the cave. It made her blonde hair wave.\n\nWithout the blockage of the giant egg, Han Sen finally felt the presence of the blonde lady. It suddenly made his expression change. The blonde lady’s aura was completely different from Wan’er’s, who was usually very tame. This lady’s had a raging mode. It also made people feel sorrowful on her behalf. It made people feel as if she was a weak and injured woman and that no action could reverse the horrible fate she had been subjected to.\n\nThe blonde lady released a feeling that made Han Sen think of two words.\n\n“Her presence feels just like those God Spirits.” Han Sen stared at the golden-haired lady.\n\nHan Sen had killed Sky Vine Radish, Sky Armor God, and Lotus Child. This blonde lady before them felt just like they had.\n\nTheir presence was not very clear. Kings and gods did not exude this feeling. The God Spirits that released this feeling were the ones that combined with creatures of the universe.\n\nNow, the blonde lady made Han Sen feel a familiar sensation.\n\n“Is this blonde lady a God Spirit combined with a creature of the universe?” Han Sen looked at the blonde lady as ideas raced through his head.\n\nBai Wanjie and the others generated their own powers and were ready to fight. It seemed as if they could not feel the scary presence coming from the blonde girl.\n\nThe blonde lady remained suspended. She rose up from the mountain. Her blonde hair and white pajamas were waving fiercely like the wind was pushing and pulling her.\n\n“Hurry up and run!” Han Sen shouted.\n\nAlthough Han Sen could not tell how strong the blonde lady was, the God Spirit presence could not be mistaken. No matter how weak the God Spirit was, it could not be blocked by the primitive Bai Wanjie and the others.\n\n“We are here already. Why do we not give it a go before we run? I am not interested in the throne, but this is such a fun task that I absolutely cannot miss out.” Seeing the blonde lady fly away from the mountain’s entrance, Bai Wuchang laughed. His body turned into its ghost mode. He looked like a ghost, carrying weird substance chains. They were waving toward the blonde lady.\n\nThe blonde lady behaved as if she was not awake. She hung above the mountain. Her eyes were unfocused. She was just frozen watching Bai Wuchang come her way.\n\nBai Wuchang’s knife light was strong. It carried the power to break a yellow river. The knife light slashed the blonde-haired lady. Her pajamas were cut. Knife lights landed on her white skin, leaving a slight impression on her skin. Suddenly, the knife light melted and vanished. It had not even left a red mark on her\n\nThe blonde lady immediately moved her unfocused eyes onto Bai Wuchang.\n\nBai Wuchang roared with the intent to attack again, but everyone felt a bit dizzy. The blonde lady floating above the mountain simply vanished.\n\nHan Sen’s expression changed. He turned his head. He saw Bai Wuchang, who was in his ghost mode, have power touching him where none should have been able to. The blonde lady was holding his neck and making it float.\n\nThe blonde lady’s eyes did not look focused. She was small, yet she used one hand to lift the very bulky Bai Wuchang. It was like she was lifting a chicken by the throat.\n\nBai Wuchang looked as if he was drowning. He was struggling and unable to do anything about it. His eyes rolled, and his skin started to grow old. After a few short seconds, his hair looked grey.\n\n“How dare you!” Bai Wanjie was furious, but he was also scared. He activated his king body and summoned a hammer that was as big as a bucket. He swung it at the blonde lady.\n\nBai Lingshang and Bai Wei looked ferocious. One pulled out an icy sword whereas the other used Extreme King Shocking Sky Punch. One went left while the other went right to attack the blonde lady. They wanted to save Bai Wuchang.\n\nPang!\n\nThe hammer struck the blonde lady on the back of the head, but that only made the lady’s neck move a little. It certainly wasn’t going to stop her body. It did not make her stumble an inch.\n\nBai Lingshang and Bai Wei’s power landed on their foe, but their attacks only damaged her pajamas. They did not even leave red marks upon her skin.\n\nThe blonde lady’s other hand rose. She touched the big hammer. It instantly made the deified weapon shatter. It turned to dust and echoes flying in space."
}