{
    "chapter": 2923,
    "title": "Stone Lantern",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2923",
    "text": "Unless the black-scale dragon’s power was able to rip the time area right away, and its speed was fast enough to ignore the time delay and bolt through the time area, it did not matter how ferociously it attacked. It was not able to harm Han Sen.\n\nTime Ghost was one of the top-class true god xenogeneics in the universe. The power of its beast soul was like a true god treasure. It did not matter how strong the black scale true dragon was. It was not fast enough to tear through the Time Ghost area.\n\nHan Sen dared to visit the big barren systems for an adventure. The time area was one of his trump cards. When he had met the big goldfish, he hadn’t tried using any of his tricks. He had not used the time area.\n\nNow that the Shield of the Medusa’s Gaze had been taken away by the black dragon, Han Sen was not going to keep his true strength concealed any longer. He had no qualms about using the Time Ghost beast souls.\n\nHan Sen stepped through space, running toward the black-scaled dragon. The dragon’s mouth fired draconic presence at him, and the Shield of the Medusa’s Gaze fired its staring lights.\n\nWhen the dragon presence and stare lights entered the time area, they were severely delayed. Even the staring lights, which normally traveled at the speed of light, took a whole lightyear to travel just a few feet. They disappeared before they reached Han Sen.\n\nThe black-scaled dragon realized that its dragon presence was not having much of an effect, which completely shocked the beast. Still, the shock only lasted a split second. In the next moment, the black-scaled dragon used its other talon to hold the stone lantern in front of itself. It then blew on the lantern.\n\nThe black-scaled dragon’s presence went through the lantern and was enveloped by the white flame. It went hovering toward Han Sen.\n\nHan Sen felt a chill, but he did not dare underestimate his enemy. He knew the stone lantern’s power was nothing ordinary. The black-scaled dragon was still able to use the Shield of the Medusa’s Gaze and fire the staring lights. It was probably all because of what the stone lantern was able to imbue.\n\nNow, the dragon presence had flames. It was heading straight for Han Sen. He was staring at it. When the dragon presence entered the time area, it was not affected by the time delay. It was still quickly headed for Han Sen.\n\n“This stone lantern really is evil!” Han Sen’s eyes were on fire. He stared at the stone lantern and dragon presence, which was not entwined with the white fire. He was not freaking out.\n\nHan Sen wanted to make a move, but Bao’er, who was on his back, suddenly jumped up. She was wearing sunglasses. While she was in space, her body exhibited some changes. She suddenly looked like the big, black-scaled dragon.\n\nAfter Bao’er turned into a black-scaled dragon and opened her wide mouth, a tide of black dragon presence was fired out. It struck the dragon presence with the white fire. The two dragon presences kept colliding with each other.\n\nThe universe around was shaking. The ice fields were suddenly exploding.\n\nHan Sen was shocked and happy. “This is so weird! The sunglasses can turn Bao’er into a black-scaled dragon, and she can use the black-scaled dragon’s dragon presence.”\n\nThe two dragon presences kept striking each other. They then suddenly vanished. Seeing the same black-scaled dragon in front of it, the original black-scaled dragon froze.\n\nAfter that, the black dragon was extremely angry. It looked at Bao’er and let out a dragon cry that could go through the clouds and break rocks. The dragon cry became a natural shockwave going toward Bao’er.\n\nBao’er unleashed a dragon cry of her own. It went right back at the black-scaled dragon. Two scary shockwaves were striking each other in space. There were many sounds like things being broken.\n\nAfter they collided, the result of the fight was a tie.\n\nThe black-scaled dragon was furious. As it made another dragon cry and unleashed more dragon presence, the dragon’s scales shone with a strange light. All kinds of powers were headed toward Bao’er. It was insane. It covered the sky and ground. Bao’er was not weak. She also used many powers. The fight between her and the black-scaled dragon was a tie. Aside from the Shield of the Medusa’s Gaze and the stone lantern, whatever power the black-scaled dragon used could also be used by Bao’er. Her power was on par with the black-scaled dragon.\n\n“The sunglasses are a very powerful god personality armament. I do not know which God Spirit’s god personality made it.” Han Sen was shocked by what he was witnessing.\n\nSeeing its power being completely blocked by Bao’er, the black-scaled dragon was shocked and scared. It madly roared and raised its stone lantern again. Its dragon eyes were as deep as a black hole as it stared at the stone lantern’s flames and fired two black lights.\n\nWhen the black light went past the flame, it turned white. Bao’er was not going to look weak to her adversary. Her eyes became dragon eyes. She opened them wide and fired out two black lights, but she did not have a lantern to dye it. Bao’er’s light was still pitch black.\n\nThe black and white lights shot into the air. They were different from the dragon’s presence. This time, when they struck each other, Bao’er’s black light was broken by the white light with ease. The white light was going toward Bao’er.\n\nBao’er was shocked. Her body rolled. Her giant, black-scaled dragon body turned a very small bee. The white light missed her and struck the ice and snow instead.\n\nThe ice and snowfields vanished when they were hit by the white light. It was like it had all turned into nothing.\n\nThe little bee Bao’er had become flew back to Han Sen. Bao’er recovered her body and snuggled into Han Sen’s chest. She patted herself on the chest and said, “That stone lantern is so strong.”\n\n“You just watch for now. See how Dad will get rid of it.” After Han Sen said that, he picked Bao’er up and put her behind him. He then went toward the black-scaled dragon.\n\nWith a simple teleport, Han Sen was directly in front of the black-scaled dragon. The dragon spat out some dragon presence. It hurriedly did it, so it did not have time to collect the ravaging light.\n\nHan Sen did not have his time area active. He used all of his power and put it into the Jadeskin. Both of his fists were like tsunamis going toward the dragon presence.\n\nWhen it met the Jadeskin power, the dragon presence froze in the air. But the dragon presence was too strong. It was only able to freeze by a single layer. The dragon presence kept coming from behind. It broke the ice and landed on Han Sen.\n\nBoom!\n\nHan Sen was flushed away by the dragon presence. He was like an ant in a tsunami. The Jadeskin power was not enough to fight the dragon presence.\n\nHan Sen’s true god power was like paper in front of the black-scaled dragon’s dragon presence.\n\nBlergh!\n\nAfter the dragon presence weakened, Han Sen’s body flew away. He coughed up blood, but he was not injured. His clothes were not harmed. He had hurt an organ but not by much.\n\n“Why am I not injured badly?” Han Sen thought he would be badly wounded, but his wound was very small. He looked at himself. It was the effect of the blue and black robe.\n\nThe black dragon saw it worked and got excited. The dragon cries and dragon presence were all beckoning Han Sen. The dragon was not in a rush to use the stone lantern.\n\nHan Sen’s heart jumped. He raised his hand and pulled the black and blue robe out. He threw it to Bao’er. He waved his fist toward the black dragon’s dragon presence and shouted, “Hold onto my clothes. Watch how Daddy kills the black dragon.”"
}