{
    "chapter": 2927,
    "title": "Worse Than Animals",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2927",
    "text": "Han Sen frowned and looked at Nine Thousand King. He did not know who he was. Han Sen did not know much about Sacred, and he had never heard of this person.\n\nNine Thousand King looked at Han Sen. He then glanced at Qige and quietly said, “This dog hybrid is not important to me.”\n\nAfter that, Nine Thousand King walked over to Qige. It was like he did not even notice Han Sen was standing there holding the bow.\n\nHan Sen kept the bow trained on Qige. He coldly shouted, “Did I agree to hand him over to you?”\n\n“If there is something I want, I do not require the approval of anyone to take it.” Nine Thousand King did not look at Han Sen. He continued walking over to Qige.\n\nHan Sen’s eyes were locked on his target. The bow in his hands released a scary power. It was going to fire the teeth arrow.\n\nAncient Abyss Grandmaster suddenly said, “Brother Han, Qige’s father is Sacred’s Door Guard General. Maybe he knows about the Sacred inside. Perhaps we should just keep him alive.” Han Sen knew he was saying that to smooth the tension that had arisen between him and Nine Thousand King.\n\n“Thank you for reminding me, but this is my prey. No one else can touch him.” Han Sen did not move. The power in the bow was becoming stronger.\n\nQige sensed that if Han Sen let go of the teeth arrow, he would be killed. He would not even be able to dodge it. His body was full of cold sweat. He rolled his eyes before looking at Nine Thousand King and begging, “Nine Thousand King, I am willing to lead the way for you. Please help me!”\n\nNine Thousand King turned around and looked at Han Sen. He coldly said, “Do not think you can be bossy to me just because you have the Dog Crow Bow in your hands. Try shooting me if you have the balls to do so.”\n\nHan Sen did not speak. He let his fingers go, allowing the teeth arrow to fly toward Qige. There was a buzzing noise, resulting in the dog teeth arrow disappearing mid-air.\n\nThe Dog Crow Bow was able to rip space. The arrows fired from it had teleportation powers. Ordinary creatures could not dodge them.\n\nQige was shocked and tried retreating. Although he had the Dog Crow Bow, it was a relic that belonged to his father. He knew he could not dodge the teeth arrow.\n\nBeing shot by an ordinary arrow was fine, but the teeth arrow had rabid power. If he was shot by a teeth arrow, the rabid power would invade his body. It would turn him into a mad dog that would try biting everyone. He would not be able to think anymore and would become worse than an animal.\n\nAs Qige was falling back in shock, a hand appeared in front of him. It held the teeth arrow that was in the air. It was Nine Thousand King’s hand.\n\n“Nine Thousand King, save me, please! I am willing to be your cow. I will be your horse. I will be your servant and slave. I can lead you to Sacred…” Qige was crawling before Nine Thousand King, begging and pleading.\n\nNine Thousand King ignored Qige, who was at his feet. He held the arrow and coldly looked at Han Sen.\n\n“It looks like I have not been out for too long. The universe has mostly forgotten my name.”\n\nWhile they were talking, Nine Thousand King made the teeth arrow in his hands flicker with a weird kind of power. It was like smoke and fire. A gold power seemed to cover the entire arrow.\n\nBuzz!\n\nSuddenly, Nine Thousand King fired the teeth arrow back at Han Sen. Although there was no Dog Crow Bow buff or rip space power, the teeth arrow was just as fast as teleporting. Han Sen saw a gold light flash as the teeth arrow came right before his throat. The sweat on his skin could feel the sharpness of the arrowhead.\n\nHan Sen did not move. He did not want to dodge. He waved his sleeves. The sleeves of the blue robe wrapped around the flickering teeth arrow. He pulled it down and put it in his hands. The gold light on the arrow was gone.\n\nNine Thousand King frowned. He looked at Han Sen with an even colder look.\n\nTo establish peace, Ancient Abyss Grandmaster said, “Sacred is a very dangerous place. Why are you two trying to kill each other over something so petty? If things are like that, you will be giving an advantage to the elites inside Sacred.”\n\nAfter pausing, Ancient Abyss Grandmaster looked at Qige and said, “Plus, although this guy is the child of Crow Sky Dog, after Sacred changed, it is different now. It is not just him. Even if his father came, he might not be able to show us Sacred. It is useless.”\n\n“It does not matter if he is useful or not. Whoever goes against me should die.” Nine Thousand King coldly looked at Han Sen.\n\nHan Sen icily responded, “You’re right. His usefulness does not matter. He is my prey. I will not let anyone else touch him.”\n\nThe two of them stared at each other. Their bodies simmered with a scary presence. Neither one of them wanted to take a step back.\n\nSuddenly, a shadow flashed near the door. Someone else had arrived. This time, it was a pretty woman in black clothing.\n\nQige saw the black-clothed pretty woman and crawled over to her. “Mother, save me…”\n\n“Moon Shadow God, stay out of this,” Nine Thousand King said. He reached out his hand to pull back Qige, who was in the process of running over to the black-clothed pretty woman.\n\nSome invisible power drew Qige back. He was rolling back to Nine Thousand King’s hands.\n\nMoon Shadow God’s expression changed. Her body turned into a shadow. She appeared in Nine Thousand King’s shadow. A black shadow knife came thrusting toward Nine Shadow King.\n\nNine Shadow King shone with a bright, gold light. It melted the knife shadow. The countless knife lights were headed for Moon Shadow God, which forced her to retreat.\n\nAt this time, Qige was sucked into Nine Thousand King’s hands. He was grabbed by the throat, so he started to cry.\n\nMoon Shadow God’s face looked angry as she shouted, “Nine Thousand King, let go of my child!”\n\n“I can let him go. If you listen to me, he can be half my son. I would not hurt him then.” Nine Thousand King looked evil as he checked out Moon Shadow God.\n\n“How dare you!” Moon Shadow God was furious. She was shaking. A shadow flickered on her body. It turned into a night blade that covered the sky. It went straight for Nine Thousand King.\n\nNine Thousand King did not move. He grabbed Qige and released a thousand lights. All those knives cut Qige and made his body bleed as he screamed.\n\n“What do you want from me?” Moon Shadow God had to stop the assault of her night blades. If she kept going, Qige would be killed first.\n\n“Back then, you were stolen by that bastard Evil Sky Dog. I am going to take you back. You just follow me, and I will treat you guys nicely. When I get Sacred Leader’s relic, you will be rewarded by it.” Nine Thousand King flashed an evil smile.\n\nMoon Shadow God looked frightened. Before she spoke, Qige was getting cut by the gold light. He was screaming and crying, “Dad… You will be my Dad. We will follow you. It is our pleasure to follow you. Mother… Dad is very strong. To be able to follow him… It is our pleasure. Just agree with him.”\n\nUpon seeing this, Han Sen and the Extreme King’s deified elites present were frozen. They had never seen such an obscene creature before. He was a true god creature, yet he behaved like that. He was already worse than an animal."
}