{
    "chapter": 1104,
    "title": "Allure of Money",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1104",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nKatcha!\n\nAs the black sword sliced through a multitude of stone walls, more were raised to take the place of their fallen rocky counterparts.\n\nAncient Jade King did not fight Han Sen face-to-face, and he remained purely on the defensive. He kept on dodging and dodging. The only vain attempts of attack he had tried were the occasional raising of spiky rocks from the ground.\n\n“This is a troubling foe. His powers of commanding the earth are formidable!” Han Sen thought to himself.\n\nMaking use of his Devil Pill in conjunction with super king spirit mode made Han Sen a combatant to be feared. He could slice through the rocks with ease, but the sheer abundance of them made it difficult for him to gain any real ground and advance on his enemy.\n\nSeeing Han Sen continuing to chase Ancient Jade King in a dazzling display of cut rock and dust, the hype train was going at full-speed for the spectators.\n\n“Dollar is so good! The king spirit is cowering like a beaten mutt.”\n\n“He is the best surpasser. Hands down.”\n\n“The King is invincible.”\n\n“I bet even those emperors would lose against The King.”\n\n“What if he is an emperor already? Titles can be misleading.”\n\nFlower Empress and Heavenly Empress were watching this match with keen interest, as well. They were amazed by Han Sen’s performance.\n\nThe earth element was incredibly dense and heavy, yet Han Sen was easily able to destroy each shield of stone. They were deployed by a foe with nine gene locks, and yet Han Sen might as well have been dicing butter. It was incredibly likely only emperors could possess such mighty powers.\n\nAncient Jade King was taken aback by The King, too. He had not expected to be subjected to such fierce attacks, and he knew it was only a matter of time before he lost.\n\nThey had both opened nine gene locks, that much was clear. But even so, Han Sen was considerably stronger. All Ancient Jade King could do was dodge, as much as he hated doing it.\n\nHan Sen was able to suppress him, but the moves he used to avoid defeat were cheap and infuriating. He was too good at producing shields. Whenever Han Sen thought there was an opening to strike the opponent himself, he’d still end up hitting a newly-produced wall of rock.\n\nThis wouldn’t have been an issue if Han Sen hadn’t been on a timer. But being on the clock, it was stressful and concerning.\n\nFifteen minutes had passed by this point, and Han Sen’s mind raced in search of a method to knock-down Ancient Jade King and keep him there.\n\nHan Sen was dominating, but no one knew his life was depending on it. He was in a big rush.\n\n“F*ck! I have to use this.” Han Sen stopped chasing Ancient Jade King and instead, summoned a single coin between two of his fingers.\n\nThe coin seemed fairly ordinary, up until it started to glow. After a moment of glowing, a number showed up on it.\n\n1… 2… 3… 4…\n\nIt was ominous to see. And the higher the number went, the spookier it felt.\n\n“What is he doing?” People wondered what Han Sen was going to do next, and what the result of that coin would be.\n\nIf Han Sen put all his power into one coin, it’d still prove useless, they thought.\n\nAncient Jade King was confident in his shields, and if the coin was imbued with such power, he was sure he could use his stone walls to block it while he ran elsewhere in evasion.\n\nThe coin grew even brighter now, as Han Sen did indeed imbue it with a terrifying amount of his own power.\n\nThe numbers continued to rise, until it hit the number ten.\n\nHan Sen felt his body become drained of all strength. The number on the coin was a display of how much of his power had been put inside and multiplied.\n\nIt was incredible.\n\nIf the coin was equivalent to one of Han Sen’s frighteningly powerful punches, then ten meant ten of those.\n\nThe coin quivered with the immense amount of power stored within, with the number ten signifying it having ten times the power it’d normally have.\n\nIt was a new technique Han Sen had developed, which he called “Saving Money.” Saving Money took time, and it wasn’t something that could be done quickly. It’d also cost a lot of power.\n\nAlso, by using Saving Money, he couldn’t go anywhere. He couldn’t move. And what’s more, interruptions would result in a cancellation of all progress made.\n\nWhile that may have been considered a significant downside, it wasn’t all that bad, in practice. The coin could be fired whenever, at any cost of power. If it looked likely he was going to be interrupted, he could just fire it then and there.\n\nBut firing it meant you’d have to start from zero again.\n\nAnd firing it at a lower number wasn’t as effective as it would be at a higher number, either. It’d be much weaker.\n\nIt was a move that had been designed to be used with a teammate. It’d have been much easier to use if there was someone else on the field, distracting enemies.\n\nHan Sen was going to use it now, though, because Ancient Jade King had only proven himself to be a wimp. He didn’t even try attacking.\n\nHan Sen’s coin hit the number ten. To Han Sen, he regarded this as “saving ten dollars.”\n\nIf it was a brave king spirit he was fighting against, he’d have most certainly been interrupted by now.\n\nBut Ancient Jade King had waited for a while, giving Han Sen the space to build up power. Now, after hitting ten, Ancient Jade King decided to try and attack.\n\nSeeing Ancient Jade King shoot a stone wall at Han Sen, Han Sen fired an exchange. He blasted his coin towards the cowardly spirit, uttering the words, “Be tempted by the allure of money and become its thrall.”\n\nThe coin flew towards Ancient Jade King, emblazoned with the number eleven."
}