{
    "chapter": 979,
    "title": "Even Sharks Would Not Let Go",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_979",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe creatures seemed to be playing on the water, but even so, Han Sen did not dare approach the group. There was a silver-scaled aqua dragon there, very similar to the one he himself had just released.\n\n“Why are there so many dragons here?” Han Sen counted five aqua dragons. And strangely, it looked as if they were having fun together in the water.\n\nHan Sen observed their lifeforces and noted that none of them were as powerful as the first he had encountered, with Yaksha.\n\nThere were also slight variations in each of their appearances. The first white aqua dragon had four legs and feet, and no wings. These, on the other hand, did have wings; pretty, silver, semi-translucent wings. They gave them the ability to fly.\n\n“What is this?” Han Sen saw another giant sea monster emerge from the black water.\n\nWhen his vision of it became clearer, Han Sen was shocked. It was a giant white shark, and it had wings as well. It was twice as big as the dragons, and it produced tall waves that disturbed the water as it swam.\n\nWhen the winged-shark appeared, the four dragons almost seemed to behave as kids. They played around it in a friendly manner.\n\nLooking closer, Han Sen noticed that the wings of the dragons were quite similar to the wings of the shark. And what’s more, the dragons had shark teeth.\n\nFurthermore, their bellies were broader than the white aqua dragon’s from before. They looked like western dragons.\n\n“Are these the offspring of both the white dragon and the shark?” Han Sen wondered to himself.\n\nHe thought that, after a thousand years of being trapped so far below ground, the white dragon must have been willing to screw whatever female creature it could find. And that just so happened to be a shark.\n\nAcross that underground ocean, it seemed as if only the shark could freely swim towards the dragons.\n\n“That aqua dragon was one horny dog. You must be pretty desperate, if you’re willing to make babies with a shark,” Han Sen chuckled to himself.\n\nAs Han Sen pondered the curiosity, he heard more splashes. Immediately, another aqua dragon came bursting out from the waters near him. This one had wings, but the body itself was no taller than a human’s. It appeared directly before Han Sen, and it eyed him with curiosity.\n\nHan Sen was taken aback, not expecting to a see a newborn. It hadn’t grown at all, yet.\n\nThe aqua dragon did not know what Han Sen was, and it just stared at him with much inquisitiveness. He could imagine its mind racing to figure out what the strange creature—the human—was.\n\n“Go play.” Han Sen gestured with his hand, trying to shoo the dragon away from him. He had been here long enough, he thought, and he still had to figure out how to return to the surface.\n\nHe couldn’t imagine what might occur if he drew the ire of four aqua dragons and a mamma shark, as well. They weren’t quite sacred-blood in class, but they were still powerful.\n\nThe white aqua dragon misunderstood Han Sen’s command. He thought Han Sen wished to play, so it opened its mouth to say something.\n\nImmediately, Han Sen grabbed the mouth of the baby dragon and clamped it shut. If it spoke, he believed he’d be very dead.\n\nBut it still believed Han Sen was playing, and so it used its hands to rub Han Sen and feel his skin.\n\n“Ssshhh, be quiet.” Han Sen knew there were creatures out there in the world that didn’t always want to fight. And in particular, it was mostly the more intelligent ones that were likely to reason and not kill-on-sight.\n\nSlowly, Han Sen lifted his grip and let go of the dragon’s mouth. With his dongxuan aura, he covered the area to hide their lifeforces and movements.\n\nHe wondered if the dragon understood what he had told it. After removing his hand, it really did not speak. And all it did then was rub its nose against Han Sen, sniffing with curiosity.\n\nHan Sen raised his hand and started falling back, afraid the dragon might have a change of heart if it were to get unintentionally spooked.\n\nBut when Han Sen fell back, the dragon followed. It followed Han Sen until the duo reached a tunnel, far from the sight of all other monsters across that subterranean sea.\n\nHan Sen then had a greedy thought. “If I could lure it back with me, it could be a great help.”\n\nHe then brought out a bottle of pet pills. He took one of the pills in his hand and presented it to the dragon.\n\nThe dragon seemed to take interest in the pill, after a long sniff-test. It tried to take a bite, and almost consumed all of Han Sen’s hand.\n\nThinking hand-feeding might be dangerous, Han Sen resorted to chucking the pill into the dragon’s mouth, just to be safe.\n\nThe dragon quickly swallowed the pill, and it wanted more.\n\nQuickly, Han Sen held the dragon’s mouth again. Then, he grabbed another pill and lobbed it deep down the tunnel.\n\nHan Sen kept doing this for a long time, after. He did so until he had lured the dragon a long way away from the ocean where he had first encountered it.\n\n“Okay, I’ve got him away from there, but… how do I leave this place?” Han Sen wondered, as he looked around for any sign of a passage that might lead him to the surface.\n\nHan Sen had thought it best to follow a running stream earlier, but doing that was what led him to the ocean. Now, he had entered another tunnel far removed from anywhere that was familiar to him. He was well and truly lost.\n\n“I will just have to keep moving.” Han Sen chose a direction and stuck to it.\n\nThe dragon followed, with a clear desire for more pet pills.\n\nHan Sen only had two bottles of the stuff, and he had already given them all to the dragon.\n\nAfter a while of walking, the dragon stopped following him. Without any more pet pills, it wanted to return.\n\n“Don’t go.” Han Sen had spent two bottles of pet pills on the dragon, so he wouldn’t settle for it leaving him. If he was to invest in anything, he’d have to guarantee a worthy return.\n\nBut the aqua dragon ignored Han Sen’s command, and it went off, returning to the ocean.\n\nHan Sen opened the bear’s blood and said, “I have no more pet pills, but have a whiff of this. This stuff is even better.”\n\nThe dragon gave it a sniff, but wasn’t interested. It carried on swimming back.\n\nHan Sen summoned a water drop this time, and pleaded, “Don’t go! How about you try this?”\n\nThe white dragon sniffed the waterdrop and licked it.\n\n“Good boy. Now, if you follow me, there’s plenty more to be had.” Han Sen stroked the dragon’s head, hoping the dragon would follow.\n\nBut then, Han Sen heard splashes from up the river behind them. A silver-scaled aqua dragon appeared, with lantern-bright eyes fixed on him.\n\nWhen their eyes met, Han Sen froze."
}