{
    "chapter": 1953,
    "title": "The Han Family Daughter Is Born",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1953",
    "text": "Since Han Sen had nothing better to do, he tried using Consume. He did not know if he could use it now that he was in human form. It surprised him that he was actually able to activate the geno art.\n\nWhen he used Consume, something changed in his stomach. It was like a xenogeneic’s, but not as strong. His stomach became much stronger than usual, though.\n\nAs he practiced Consume more and more, the power of his stomach increased. It wasn’t long before Han Sen was able to digest steel. Whenever he swallowed a hunk of steel, it’d be converted to energy. The digestion capabilities were scary.\n\nHan Sen was afraid that Consume might affect his body, but after a few tests, his worries were eased. There were no negative side-effects, and so he continued to practice the skill.\n\nHan Sen let Xie Qing King and the others practice Consume, as well. Aside from Metal Eater, though, none of the others were able to make any headway with it.\n\nHan Sen did not know why he could practice it. Maybe it was because of The Story of Genes, or maybe it was because of his time spent as an ant—he couldn’t be sure.\n\nHan Sen was surprised Metal Eater could practice it, though. It would be good for the creature’s evolution, and he was developing at a much faster rate than before.\n\nHan Sen thought about whether or not he should bring Metal Eater over to the geno universe. He was strong, and he had a broad comprehension of Consume, but Han Sen thought that would be a negative. He was afraid that Metal Eater would draw trouble when he crossed over. So, for the time being, he decided against it.\n\n“When will I have the power to challenge deified sorts? If I had that power, I could bring people and creatures over from the sanctuaries without worry. I could build a strong army and bring ruin to the Buddha,” Han Sen thought to himself.\n\n“Dad!” Bao’er came back from school and gave Han Sen a firm hug.\n\n“You have grown up a lot, Bao’er! You are heavier and taller,” Han Sen said, stroking her head as he held her.\n\nBao’er squinted her eyes and said, “Can I go to the geno universe with you now?”\n\n“Not yet. You still need to grow a bit bigger. But soon, okay?” Han Sen smiled.\n\n“Hmph.” Bao’er pouted and acted all angry.\n\n“Okay, I promise you. And I’ll visit you more often, even though I’m there in the geno universe.” Han Sen rubbed her cheeks and smiled.\n\nNine months later, it was time for Ji Yanran to give birth. Han Sen, Han Yufei, Luolan, Han Yan, and Ji Yanran’s parents were all waiting outside the delivery room.\n\nJi Yanran gave birth in their own private hospital, where no outsider could reach them.\n\nThey were so nervous waiting outside. They couldn’t hear a peep of what might have been happening inside.\n\nThey didn’t hear a baby crying, but suddenly the doctor screamed, “Argh! Ghost!”\n\nEveryone was shocked, not knowing what had just happened. Ji Yanran hadn’t screamed, but the doctor sure had.\n\nHan Sen ran inside, and he was shocked at the scene before him.\n\nA half-transparent baby hung in the air, her hands moving.\n\n“Super God Spirit mode!” Han Sen’s eyes opened wide, looking at the child in surprise.\n\nHan Sen’s daughter was in super god spirit mode. She was scarier than Littleflower, who had super king spirit mode. This was like a new and improved version.\n\nFortunately, the baby did not keep super god spirit mode activated. After a while, she returned to looking like a normal baby, and it brought Han Sen much relief.\n\nIf it remained in super god spirit mode forever, that would have been bad. Normal sustenance could not reach her, and she could not be fed milk.\n\nThe Han family daughter was bom without issue. Han Sen had learned his lesson the last time, and he knew better than to suggest that Ji Ruozhen come up with names. Acknowledging this, Ji Ruozhen felt terrible.\n\nHan Sen was also bad at naming things, though. After a long time of thinking, he decided to name the baby Han Ling’er. She was the Han family’s sacred daughter.\n\nEveryone was very careful as they took care of Ling’er. Littleflower had been prone to blowing buildings up as if it was nothing, after all. They could never risk getting Littleflower mad.\n\nHan Ling’er had super god spirit mode, so that was an even scarier prospect. God only knew what would happen if she became displeased.\n\nBut the family was fortunate in that both babies were surprisingly well-behaved. They were very quiet, and people loved them.\n\nLing’er’s birth also helped to wash away the pervasive sadness that had haunted them since Littleflower had been taken. Ji Yanran looked far happier, but she always made sure to mention a wish for Littleflower to return. She’d frequently mention how much Littleflower would love his little sister.\n\nHan Sen stayed at home with Ji Yanran. He was not in a rush to return to Planet Eclipse. He could practice anywhere, and he practiced a lot in the hopes he could become an Earl soon.\n\nBecoming an Earl was much harder than becoming a Viscount. For the next half a year, Han Sen made very little progress. No geno art had yet to reach Earl class.\n\nBut that did not mean the six months were wasted. He spent time researching the red mist orb’s copper palace, and he was able to learn that the throne was a teleporter. It did not just teleport him to Planet Meka. Any Meka xenogeneic space had a teleporter, and could be accessed via that throne.\n\nHan Sen tried using it a few times. Whenever he visited a planet, no Meka attacked him. He was able to figure out that he was now going to a business planet that belonged to the Meka. They allowed other races to visit freely.\n\nHe was attacked the first time because he had entered a private planet of the Meka. Any intruder, even another Meka, would still be attacked.\n\nWhen Han Sen had nothing better to do, he used his beast soul armor to walk around one of the Meka planets. He wanted to take a look at their culture.\n\nThe seven little minks had been fed xenogeneic genes by Han Sen. They had been able to generate xenogeneic gene materials, which then allowed them to generate a xenogeneic gene battle body.\n\nHan Sen walked down a street belonging to the Meka, and a few spherical heads caught his attention. One of them was Clear Sea King. There were a few other Buddha’s there, too. Speechless was amongst them.\n\n“What are they doing with the Meka?” Han Sen wondered, looking at them.\n\nThe Meka were good at making xenogeneic gene battle bodies, but aside from the Meka themselves, not many creatures could use them. It didn’t seem likely that Clear Sea King and the others were on the planet to buy battle bodies.\n\nClear Sea King and the others walked past Han Sen, and none of them recognized him with his beast soul armor on.\n\nNo one could see the Four-Faced Eight-Armed Gold Buddha armor; only the user could. Outsiders wouldn’t notice a thing."
}