{
    "chapter": 1940,
    "title": "Seven Spirit Buddha",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1940",
    "text": "Han Sen didn’t bother to contradict her again. He followed the big group across the desert.\n\nThere was a huge crowd around them initially, but many people quickly began to tire and turn back.\n\nThere was no day and night cycle in Heaven, and the sun was always high in the sky. After ten hours, the sun was still unmoved.\n\nIt was just as Hai’er said, too. The heavenly voice was nearly impossible to ignore. It wasn’t long until Han Sen saw weaker-willed creatures beginning to dance along with the music. A giant danced across the sand. An initial glance might seem amusing, but it ultimately gave onlookers the chills.\n\nMany groups of people walked together. If anyone started dancing with the music, others could snap them out of it. Some creatures that were having difficulty withstanding the music, and they decided to turn back. They didn’t want to risk dying there.\n\nThe music did not affect Han Sen at all, though. He heard it, but it was just annoying, more than anything. Hai’er kept on bugging Han Sen about when he was going to meet up with Speechless, but he was too lazy to answer her.\n\nHai’er refused to give it up, though. He eventually couldn’t stand it. He frowned and asked, “Why do you think I’m in a relationship with her?”\n\nHai’er smiled and said, “I am a woman, too. The way she looked at you could not fool me. Can you swear to God that there’s nothing between you two?”\n\nHan Sen shrugged and did not say another word. He continued walking.\n\nThere was no nighttime in that desert. No one knew the specific direction they should be moving, which eventually resulted in the large crowds splitting up as people ventured separate ways. Most of them continued going forward, though. And that meant they were headed west.\n\nHan Sen was going west, as well. But as time went by, there were fewer and fewer people around him. The desert was too large.\n\nAfter fifty hours of this, aside from Hai’er, there was no one nearby.\n\nHai’er kept walking and asked, “Han Sen, I can’t see anyone close to us. Speechless should be here!”\n\nHan Sen acted like he didn’t hear anything. He merely stroked Bubble, which was perched on his shoulder, and asked, “Did you bring a Magic? What do they do?”\n\nHai’er said, “They aren’t affected by the music. You can use them for a distraction from the music. It keeps your mind from being so easily lured by the heavenly music.”\n\n“I see.” Han Sen had guessed that, but he just wanted confirmation.\n\n“Stop beating around the bush: when is Speechless getting here?” Hai’er asked in irritation.\n\nAs Han Sen started to respond, a shadow appeared over the horizon. They looked in its direction and saw a Buddha with a white robe. The bald head gleamed under the radiance of the sun.\n\n“You see? There is no way I could have been mistaken.” Hai’er looked cocky.\n\n“Look closer; it’s a man. It’s not Speechless,” Han Sen said after a second.\n\nYou’re still pretending? Speechless must have sent that man to pick you up. You cannot lie to me.” Hai’er gave him a you cannot lie to me face.\n\nHan Sen’s face suddenly looked rather pale, and his eyes twitched. He had picked up a very hostile aura coming from that man.\n\n“Let’s go.” Han Sen turned around and started to leave.\n\n“Stop playing,” Hai’er said with an eye-roll, but then she realized that Han Sen was already running off.\n\nHai’er turned to look at the Buddha and found that he had accelerated. He was coming towards her like an arrow. She felt something was amiss now, too, and so she ran after Han Sen.\n\n“Who is that? Isn’t he here to pick you up?” Hai’er asked as she ran.\n\n“I already told you; I have nothing to do with Speechless,” Han Sen said again.\n\nHai’er turned her head to look behind them, and she saw the Buddha getting closer. She was shocked, and said, “If you have nothing to do with her, why are they chasing you? They must have unearthed your dirty secret, and that’s why that man has been dispatched to get rid of you!”\n\nHai’er looked at the man more closely, then screamed. “Seven Spirit Buddha! I was right. You and Speechless have been exposed. This Buddha has been sent to kill you.”\n\n’You recognize him?” Han Sen asked.\n\nHe didn’t know why one of the Buddha would come after him. And since their pursuer was undoubtedly a hostile, Han Sen wanted to know more about him.\n\n“You haven’t heard of Seven Spirit Buddha? He is Speechless Buddha King’s seventh son, but the Buddha King did not leave anything to him in his will. He gave everything to Speechless. Seven Spirit Buddha wasn’t denied an inheritance because he was a disappointment, but because he was too smart. Speechless Buddha King was afraid that his will might limit and actually impede Seven Spirit’s future. So, nothing was left for him. Burning Lamp Alpha himself refused to take students for a thousand years, but decades ago, he made an exception for Seven Spirit Buddha. He must be a Marquise by now.”\n\nHai’er went on to say, “The relationship between you and Speechless must have been exposed. That is why he is here to kill you. So, since this has nothing to do with me, I’ll take my leave.”\n\nAfter that, Hai’er changed course and ran the other way. She wanted to get as far away from Han Sen as she could to avoid getting mixed up in his mess.\n\nHan Sen suddenly sped up, though, and he grabbed Hai’er by the clothes. He picked her up and continued running.\n\n“What are you doing? I thought we were friends! Don’t harm me!” Hai’er struggled, trying to escape.\n\n“I am Knife Queen’s student. The Rebate and the Buddha have a good relationship. If they wanted to kill me, do you think they would allow witnesses to know that I was murdered?” Han Sen coldly said.\n\nHai’er was shocked, and so she stopped resisting. She said, “We should run separate ways, then. He might not come after me. It’s better than dying with you, at least.”\n\n“You’re just a Viscount. If I was the Seven Spirit Buddha, I’d kill you before coming after me,” Han Sen said.\n\n“You say that like you’re really strong, but you’re a Viscount the same as me.” Hai’er smiled.\n\nBut after she said that, she felt Han Sen tucking her under his armpit. Then he accelerated to a point where she could not even open her eyes for the wind.\n\n“How is he so fast?” Hai’er was shocked."
}