{
    "chapter": 3015,
    "title": "God and Immortality",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3015",
    "text": "Han Sen looked at Han Yufei as he said, “If you are willing to explain, then I should be able to understand.”\n\nHan Yufei was non-committal. She coldly said, “Aside from Ancient God and God Spirits, the universe’s creatures have a mortal life. Do you know what determines their lifespan?”\n\nHan Sen thought about it and said, “Different creatures all have different lengths of life. That is usually determined by their genes.”\n\nHan Yufei nodded. “Indeed, unless they die by accident. Otherwise, what affects their lifespan is usually down to what is in their genes. Different creatures have different genes that determine the length of their life. But that is not something absolute. In fact, many other variables can affect a lifespan. For example, there is cryosleep technology in the universe. That is very common. It can slow down the renewal of genes and extend one’s life.” “Cryosleep technology is a stupid idea. When you are frozen, it is like you are dead. In the meantime, it is totally pointless. Compared to that, there are high-class time geno arts that can make your body clock stop so the genes in your body never renew. Technically, you would be immortal and forever young.”\n\n“Just like you.” Han Sen looked at Han Yufei as he spoke. Han Yufei had been trapped in Two Worlds Mountain for god knows how many billions of years, yet she had maintained a youthful image. She had not died. That must have been a result of time powers.\n\nHan Yufei did not answer Han Sen. She went on to say, “According to the theory, many creatures can be immortal. In fact, it is not like that. No matter if normal creatures or true god xenogeneics have a powerful time power, if they live longer than their gene’s lifespan, they will die by accident. Before Sacred appeared, that was very common. Powerful existences, such as true dragons or phoenixes, no matter how powerful they are or how strong their lifeforce, will die at some point in time.”\n\n“Are you saying that the God Spirits take the lifespan of creatures?” Han Sen’s head flashed. He thought about the God Spirits stealing one’s lifespan.\n\nHan Yufei nodded and said, “Yes. It is like that. When Sacred appeared, they forced open the space barrier. They forced the god palaces to appear and killed god knows how many of the God Spirits that descended. The god palaces were heavily damaged. After I was set free, I saw many old antiques that remained alive. Some even hailed from Sacred’s time. With their current lifespan, they cannot live much longer. The only explanation is that because of Sacred’s god fights, there was a flaw in the God Spirit’s control. That is how they were able to use all methods to live up until now. Before Sacred, this had never happened.”\n\n“Does that mean killing God Spirits is to obtain immortality?” Han Sen frowned.\n\nAlthough what Han Yufei was saying made sense, Han Sen still thought there was something amiss.\n\n“Immortality, to me, isn’t what I am looking for, but I don’t like the feeling of being restricted and calculated. How long I live is something I should determine. After all, it is my life. The God Spirits are trying to take those rights away. I am not going to allow them to succeed. I want them to feel what it feels like to have their lives in the hands of others.” Han Yufei used her hands to lift her black-framed glasses as she spoke.\n\n“This woman… She is insane…” Han Sen had to admit Han Yufei was the scariest woman he had ever met.\n\nHan Sen suddenly remembered the scroll. Han Yufei’s crime was committing blasphemy against a God Spirit. Her crime was worse than God’s Retribution. Now, it was starting to make sense.\n\nHan Sen was pretty sure that in the Sacred era, she must have conducted tests on the God Spirits. That was probably a crime that was worse than slaying a God Spirit.\n\nHan Sen stared at Han Yufei as he asked, “What about Sacred Leader? Did he kill gods because of that?”\n\n“That is what he told me, but I do not think that is the real reason. At the very least, he did not do it just for himself. He was probably doing it for someone else.” After saying that, Han Yufei went silent.\n\n“Wan’er?” Han Sen said the name and watched Han Yufei’s reaction.\n\nHan Yufei looked shocked. She asked, “Do you know Wan’er?”\n\nHan Sen thought, “More than just know her.”\n\nHan Yufei did not wait for Han Sen’s answer. She kept speaking. “Yes, that was who Sacred Leader loved the most. Sacred Leader’s reason for killing the gods was probably because of Wan’er. Otherwise, with his power, avoiding God Spirits to live would not have been difficult.”\n\nHan Sen noticed Han Yufei’s tone was a bit off. He quickly asked, “Was Wander Sacred Leader’s real sister?”\n\n“Although Sacred Leader kept saying Wan’er was his real sister, I know for sure that Wan’er was not his real sister because Wan’er was not the same race as him,” Han Yufei said with certainty. “How do you know they are not from the same race?” Han Sen asked.\n\n“Of course, Wan’er was one of my people.” Han Yufei lifted her lips as she spoke. “With the title, she should be calling me auntie. I watched her grow up. Do you think I am wrong?”\n\n“What? Wan’er is the same race as you? What race do you belong to?” Han Sen’s eyes opened wide as he looked at Han Yufei. Even now, he did not know which race Han Yufei belonged\n\nto.\n\n“Witch,” Han Yufei said with a sigh. “Our race almost became extinct a long, long time ago. I don’t think anyone in this universe has heard our name before. Aside from me, I do not believe any others are alive. Back then, there were Tai Yi, Qing Jun, and Purple Fight. Now, they are…”\n\n“Tai Yi? Qing Jun? Purple Fight? Are they all witches?” Han Sen’s eyes opened wide.\n\nHan Yufei developed a wry smile. “Not anymore. Qing Jun has become Sky God. He is not a Witch anymore. Purple Fight is dead. The Purple Fight in Two Worlds Mountain was just his will. As for Tai Yi, he is missing. I am afraid he might have been killed in the god fights.”\n\nAfter hearing this, Han Sen felt extremely weird. He had not expected Wan’er and Han Yufei to come from the same race or to learn that Qing Jun and Tai Yi were once a Witch.\n\nAfter the god palaces appeared, Han Sen had been looking for Qing Jun’s god temple. He wanted to kill him so that he could exact vengeance. He had searched the entire length of the god palaces and was unable to locate Qing Jun’s flag. He did not know which god temple he resided within.\n\nRegarding Tai Yi and the Metal God Temple, Han Sen was not able to find it. That made Han Sen feel strange.\n\nHan Sen told her about his encounter with Tai Yi and how he repaired the Metal God Temple, broke space, and departed. He wanted to know what she might say. After Han Yufei heard that, she looked shocked. She asked, “Is Tai Yi still alive?”\n\n“Yes, but he fixed Metal God Temple and broke space,” Han Sen said. “I have not seen Metal God Temple amidst the others since the god palaces appeared. What is that all about?” Han Yufei laughed. “Of course, you were unable to find it. The Metal God Temple is the god temple Sacred tried to recreate. He wanted to replace the original god temple to become the leader of the universe so they would not be restricted by the god palaces and geno hall. They wanted to replace the entirety of the god palaces. Before they could succeed, Sacred was destroyed, and Metal God Temple was ruined. I did not know Tai Yi rebooted Metal God Temple.”\n\nHan Sen wanted to say something, but he felt the entire laboratory start to shake. The ice walls were breaking. Even the metal was breaking. It was like there was an earthquake.\n\nSome scary presence covered the entire place. Even with Han Sen’s slowed reaction, he sensed how scary it was."
}