{
    "chapter": 82,
    "title": "Fighting Luo Tianyang",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_82",
    "text": "Han Sen: Not evolved.\n\nStatus: None\n\nLife span: 200 years.\n\nRequirements for evolution: 100 geno points.\n\nGeno points gained: 100 ordinary geno points; 100 primitive geno points; 47 mutant geno points; 29 sacred geno points.\n\nBeast souls gained: Sacred-blood black beetle; sacred-blood bloody slayer; sacred-blood purple-winged dragon; mutant three-eyed cat; mutant black barracuda; mutant black stinger; mutant sawfish.\n\nHan Sen looked at his current data and felt satisfied. Now he had as many as three sacred-blood beast souls and several mutant beast souls.\n\nOnly two of the mutant beast souls were less than satisfactory and they were both from someone else. The mutant three-eyed cat was a pet that was useless at the moment and the mutant black barracuda Lu Weinan gave him was an aquatic mount, which was completely useless on the land.\n\nAt a grove near Steel Armor Shelter, Han Sen was meeting with Lin Beifeng. Han Sen was deliberately giving Lin the mutant creature meat he promised a few days later than when Dollar sold mutant black stingers.\n\n\"This is for you.\" Han Sen took two dried sawfish out of his bag and gave them to Lin. Black stingers were no longer an option, so he had to give the fish to Lin.\n\n\"Two!\" Lin was overjoyed.\n\n\"Yes, it was a good trip.\" Han Sen gave him back the rest of the arrows, which were not really put into use.\n\n\"It’s fine. Keep them. Sen, can I join you next time?\" Lin Beifeng looked at Han Sen expectantly.\n\n\"I will if there is an opportunity. Please take the arrows back.\" Han Sen insisted.\n\nLin had to take the arrows back, and the two returned to the shelter as they were talking.\n\nAt the gate of Steel Armor Shelter, they ran into Son of Heaven’s gang. Luo Tianyang stared at Han Sen as if he were to devour the guy.\n\n\"Son of Heaven, long time no see,\" Lin said.\n\n\"Lin, why are you with him?\" Son of Heaven gave Han Sen an unkind glance.\n\n\"Sen is my friend and there seems to be nothing that can’t be forgiven between you two. How about we let Han Sen buy us drinks and you can just let it go?\" Lin asked Son of Heaven.\n\n\"Let it go? Who do you think you are?\" Luo Tianyang looked at Lin contemptuously.\n\n\"Shut up!\" Son of Heaven stopped Luo Tianyang, and said to Lin, \"Lin, it’s not that I don’t respect you, but it is not that simple. If it is not settled properly, it will never be over.\"\n\n\"Settle how? I will pay however much you think he owes you,\" said Lin.\n\n\"It’s not about money. You can ask him yourself,\" Son of Heaven said and entered the shelter with his gang.\n\n\"Sen, what was that about?\" Lin looked at Han Sen puzzled. He thought their conflict was only the \"Ass Freak\" incident.\n\nHan Sen told him about the purple-winged dragon and Lin smiled wryly, \"It was indeed a big deal for Son of Heaven.\"\n\nLin paused and laughed. \"But it does not matter, you did not get the beast soul anyway. I will try to mediate between you two. It’s not a good idea to have Son of Heaven as an enemy. Just between us, you could offend a gentleman, but never a villain.\"\n\nThe two also entered Steel Armor Shelter. Everyone inside the shelter seemed to be talking about some news.\n\nHan Sen listened carefully, and it turned out that Dollar was against Luo Tianyang in the second round.\n\n\"Dollar against Luo Tianyang! It must be an excellent fight. Son of Heaven must still be bitter from Dollar seizing his bloody slayer beast soul. Luo Tianyang would probably try to kill Dollar for him.\"\n\n\"Kill Dollar? I don’t think he can even last longer than ten minutes.\"\n\n\"That’s not fair. Dollar is strong but so is Luo Tianyang. With the support from Son of Heaven, Luo probably has as many beast souls as he wishes. I think the result is hard to tell.\"\n\n\"I say it’s easy to tell! Dollar will win.\"\n\n\"Ha-ha, I agree. Does Luo Tianyang have wings? Can he fight a golden-horned Shura?\"\n\n\"Exactly, how can Luo Tianyang even compare? I think it will take three minutes for Dollar to get rid of him.\"\n\n…\n\nHan Sen did not expect to meet Luo Tianyang in the second round. He sneered inwardly, \"The mills of God grind slowly. This bastard is now in my hand.\"\n\nLin Beifeng’s eyes lit up. \"Last time I missed Dollar’s fight. Let’s go watch this one.\"\n\n\"I will not go. There is some family business I need to take care of.\" Of course Han Sen couldn’t watch—if he went, then Dollar would be missing.\n\n\"You won’t come? It’s Dollar.\" Lin was shocked.\n\n\"What's so special about him? He is just a person.\" Han Sen shrugged.\n\n\"He is special. I never admired anyone, but Dollar is an exception, just because he fought that Shura,\" Lin said.\n\n\"OK, but I really need to go home, so maybe next time.\" Han Sen chuckled inwardly.\n\n\"Unfortunately, video cameras don’t work in God’s Sanctuary, or we can record it and post it on the Skynet. It will go viral for sure.\" Lin Beifeng bemoaned and left for the martial hall.\n\nHan Sen took a detour and reappeared in the shelter after he put on the black beetle armor. This time he was prepared and wore a cape over the armor, covering almost everything. Although he looked strange, he wasn’t recognized like last time.\n\nHan Sen found a corner seat in the stands and sat down, watching others fight as he waited for his turn.\n\nBefore long, a group of people sat down close to him. Han Sen was shocked to see they were the Bullseye members, with Yang Manli leading the team.\n\nThey were a big group and Han Sen had picked a sparsely seated corner, so they all came here.\n\nSu Xiaoqiao was seated next to Han Sen. Yang Manli and Liu Hongtao were only two seats away.\n\n\"I say buddy, why are you covered all over in such hot weather? Are you dressing as a witch?\" Su Xiaoqiao always liked joking and threw a comment at Han Sen.\n\n\"Brat, I’ll deal with you later,\" thought Han Sen, not saying anything.\n\n\"Manli, who do you think will win, Dollar or Luo Tianyang?\" Several members of Bullseye started a heated discussion."
}