{
    "chapter": 3002,
    "title": "Real Human",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3002",
    "text": "“Roar!” Han Sen’s arm subconsciously opened. He looked into the sky and roared. His eyes had turned blue. They flickered with a scary light.\n\nHan Sen’s brain was still very clear, but his body was very hungry. It was like he was a junkie. His head knew this should not continue, but the reactions of his body made him unable to control himself.\n\nBlue light flickered. Han Sen’s body broke space. Suddenly, he went in front of Moment God. He grabbed her neck and lifted her.\n\nMoment God was in the time loop, so she could not block Han Sen’s attack. She could only watch.\n\nHan Sen felt like there was a beast inside him that wanted to kill very badly. He grabbed Moment God by the neck. He unleashed a scary power as he squeezed.\n\nHalf of that power was from the blue blood power. A small part was from Han Sen’s own body power. Aside from that, any other geno art power lost its usage. Aside from Blood-Pulse Sutra, other geno arts were not usable.\n\nWith the blue blood power running, Blood-Pulse Sutra’s running exhibited weird changes. Han Sen was no stranger to these changes. Before, Human King had given him the other part of the Blood-Pulse Sutra, and those changes came from the other part.\n\nKatcha!\n\nMoment God’s neck was twisted by Han Sen. Her neck had a blue mark. Even the time loop could not make the injured, blue part recover. The hit did not kill Moment God. Han Sen’s hand was waving like a knife. He kept slashing Moment God, who was unable to fight back. He slashed many wounds onto her god body. Her wounds, flesh, and bones turned blue.\n\nAfter having the blue blood power, Han Sen used empty hands and fists to leave wounds that revealed the bones beneath the skin of Moment God’s god body. Before that, Han Sen had used the light scissors and was unable to harm her flesh.\n\nThe whole universe was silent. They looked at Han Sen tearing Moment God apart. Before long, he ended up smashing her brain. Just as Moment God’s brain broke, the clock with Moment’s End shattered. It turned into a light shadow that shattered and disappeared.\n\n“Annihilation class God Spirit hunted: Moment God. God Spirit received.” In the next second, Han Sen saw Moment God’s corpse turn into dust in the sky. The dust gathered itself and raced to a pin that was like a needle.\n\nHan Sen picked up the pin. He heard another announcement in his head.\n\n“Annihilation class god personality armament received: Moment Needle.”\n\nMoment’s End was gone. The temple’s space returned to normal. Bao’er, Bai King, and the others were freed from the time loop.\n\nHan Sen stared at Dollar, who was Bao’er. His brain knew that, but his body felt as if he suddenly wanted to kill Bao’er.\n\n“What is going on?” Han Sen was scared, but he could not control his body. His hands uncontrollably raised. His five fingers shook with insanity. He was thrusting forward to clutch Bao’er’s head.\n\nHe did not have time to think. Han Sen tried his hardest. He controlled his body to rush outside the god temple. He was afraid that within the next second, he would lose all control of himself and end up killing Bao’er.\n\nHe forced his body to run out of the Moment God Temple. In doing that, Han Sen’s body continued to shake. He felt as if he wanted to turn around, go back, and kill Bao’er.\n\nIt was not easy to rush out of the Moment God Temple. Han Sen wanted to use Galaxy Teleportation, but he noticed he was no longer able to use God’s Wander. The blue blood power stopped all other powers in his body.\n\nGalaxy Teleportation did not work, but his body was still forced to teleport elsewhere. That came from the blue blood power.\n\nPang!\n\nHan Sen did not know where he had teleported to. He saw lots of asteroids around him. His body hit a planet very hard. It was like a giant asteroid smashing into it. The planet now had a big, circular hole in it. The rocky ground was like a sea wave spreading for a thousand miles.\n\nHan Sen kneeled at the center of the circular hole. His body was shaking. Although he was away from Bao’er, he still had that desire. He had the desire to kill.\n\n“Blue blood… Blue blood power has a problem…” Han Sen’s body had broken into a cold sweat. That was the result of him forcing his body to resist.\n\nHis mind was not able to combine with his body. It made Han Sen feel terrible. A voice that was not too far from Han Sen began to speak. “Do not try to control it. That is your true power. That is who you are. Let the blue blood fill up every inch of your body. Let it activate your body. Let yourself enable his true power.”\n\nHan Sen was having trouble raising his head to look. He saw the woman in red clothes was there. She was holding her umbrella. She was not far from him. Beneath the umbrella, a man was looking at him from above.\n\nHan Sen gnashed his teeth and asked, “What did you do to me?” Even his voice was shaking.\n\n“No, no, no. I did not do anything to you,” the man said with a smile. “What you should be asking is what do you want to do now? You still have not recognized what you are capable of. You still don’t know what you truly want.”\n\n“I know who I am, and I know what I want. I know that I don’t want blue blood, too.” Han Sen’s body was shaking as if he was insane. Sweat was dripping from his face.\n\nThe blue blood power was too strong. Merely controlling his own body was absurdly difficult.\n\n“Do you really know who you are?” The man came out from the red umbrella. He squatted next to Han Sen. He reached out his hand and tilted Han Sen’s jaw. He looked at him as if he was smiling, but he wasn’t smiling.\n\n“Human King… It is you…” Han Sen finally saw his face. It was a handsome face, and it had some unique presence normal people did not have. It was like some king that was far superior to anyone else.\n\nThe man’s finger tilted Han Sen’s jaw. He coldly laughed and said, “My Child, you do not know who you are. You are different from who you think you are.”\n\n“I do not know what you are talking about. Get your blue blood out of me.” Han Sen wanted to turn his face to escape from Human King’s hand, but his blue blood power body did not listen.\n\n“My Child, you are my heir. Your body is flowing with my blood, and now you have my blood. From now on, you are a pure human.” Human King stroked Han Sen’s cheeks. He smiled and said, “It will not be long before you understand. That is the pride and superiority of being a human. You will enjoy it all.”\n\n“I do not need to be a real human. I am me. I am Han Sen.” Han Sen gnashed his teeth as he spoke.\n\n“That is not going to cut it, My Child. Enjoy living like a real human. You will soon thank me, and you will return to me.” Human King pulled out his finger. He wiped away the sweat on Han Sen’s cheek. He then got up and left. Han Sen was holding his own body. He tried to raise his head. He saw the red-clothed woman hold the umbrella while walking away with Human King. Suddenly, they were gone."
}