{
    "chapter": 2672,
    "title": "Swordheart Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2672",
    "text": "“I would consider Gru’s power to be middle-of-the-road out of the twelve silkworms. He can be a whetstone for other silkworms to grind against, and he will be an excellent demonstration of Han Sen’s strength.” Liyu Zhen looked excited as he stared at the video.\n\nLi Xue Cheng looked nervous as he said, “As long as Han Sen doesn’t reach first place, anyone else can claim the metaphorical throne. I do think we may have overreached with our gamble, though. Even Open Sky Elder wagered the fabled Open Sky jewelry on Han Sen ending up in first place. That was so strange… Open Sky Elder knew this silkworm fight wouldn’t allow the use of treasures. Why would he still bet on Han Sen reigning supreme? If we lose, we will lose everything we have.”\n\n“Don’t worry. It doesn’t matter who bets on Han Sen winning. He won’t be a match for Shale, no matter what.” Liyu Zhen spoke as if he was trying to assure himself as well as Li Xue Cheng.\n\nThe fact that Open Sky Elder had placed such a heavy bet on Han Sen made them feel quite uncomfortable.\n\nAt the same time, Open Sky Elder was smiling as he watched Han Sen and Gru square up against each other. Li Qiyu, another Very High elder, looked at Open Sky Elder and said, “You really wagered the Open Sky jewelry that Han Sen would win this contest? You realize that this entire event has been rigged in Shale’s favor, right?”\n\n“I know.” Open Sky Elder smiled and nodded. His expression didn’t waver.\n\n“If you know, then why are you doing this? You’re just handing an item of immense value to Li Xue Cheng and Liyu Zhen.” Elder Li Qiyu looked at Open Sky Elder.\n\nOpen Sky Elder laughed and said, “You know I’ve always wanted the Evil Dragon Orb that belongs to Liyu Zhen’s father. He guards the item quite greedily and refuses to loan it to me, though. Therefore, I had to think outside the box to come up with a way to get my mitts on it. If Liyu Zhen loses this bet, will he really be able to fork over materials worth the price of the Open Sky jewelry on his own? No. Therefore, he will have to go and see his father. He will undoubtedly have to give up the Evil Dragon Orb.”\n\n“But with Shale here, how could they lose?” Qiyu Elder couldn’t understand what Open Sky Elder was thinking.\n\n“What if Shale isn’t fighting at full strength right now?” Open Sky Elder smiled at the other man as he spoke.\n\n“Not at full strength? What do you mean?” Qiyu Elder asked, entirely confused.\n\nOpen Sky Elder laughed and said, “Remember when Shale went to Demon Lake to hunt down xenogeneics? I had a business matter that took me there at the same time. And there, I saw Shale get his hands on something precious.”\n\n“What did he get from Demon Lake?” Qiyu Elder wondered out loud. Then, his eyes widened and he said hoarsely. “Did he get Demon Fruit?”\n\nOpen Sky Elder nodded and laughed. “I saw Shale holding the Demon Fruit in his own hands. And then, I watched him eat it.”\n\nQiyu Elder looked at the valley in the video in shock. He was trying to see where Shale was. As he searched, he said, “Does that mean Shale has fallen from deified status?”\n\n“Of course. Demon Fruit is a treasure from the anti-material world. Even a born-deified cannot withstand its effects. Shale has been brought down from deified to King class. The Demon Fruit’s Demon Baby God can do miraculous things, and even though Shale has become King class, his potential has been increased a level. He already had a ten armor talent. So, after getting the Demon Fruit, he sacrificed his deified level for another armor talent. Although his eleven armor talent isn’t genuine like the ones in the legends, it is still a very rare talent level. You won’t find anyone else like this in the entire universe.”\n\nAfter pausing, Open Sky Elder went on to say, “Now that he’s taken in the Demon Baby God, it will be a long time before Shale becomes a deified again. There is now a high chance that Han Sen will win this fight.”\n\n“If you knew what had happened, why didn’t you tell me sooner? If I had known, I would have increased my bet. I would have enjoyed causing more problems for Liyu Zhen and Li Xue Cheng.”\n\nOpen Sky Elder shook his head and said, “I’m still gambling. Although Shale isn’t deified anymore, he still has the will of a deified. I’m not sure if Han Sen can win. Plus, the other silkworms aren’t weaklings, either. Fortunately, Yu Shanxin quit the silkworm bouts. Otherwise, Han Sen’s chances of reaching first place would have been greatly decreased.”\n\nQiyu thought about it and deduced that Open Sky Elder was most likely correct. Although Shale wasn’t deified anymore, Han Sen still might not be able to reach first place. Open Sky Elder wanted to make a bet, but the end of this fight was still uncertain.\n\nGru’s swordmind shook the sky. The steel greatsword came slashing toward Han Sen, just as it had been swung toward Yu Shanxin earlier.\n\nNow that Han Sen was facing that attack himself, he realized just how scary it was.\n\nThat swordmind was like a knife hitting the galaxy. It felt like an entire galaxy might buckle under its weight. And Han Sen was opposing that strike with only his body.\n\n“Yu Shanxin was able to use his hands to hold back that sword light. The fitness of his body couldn’t be any weaker than mine.” Yu Shanxin was a scary guy.\n\nAs he considered the attack, Han Sen’s body moved on its own. He vanished, and Gru’s attack was now slashing toward empty air. Han Sen had employed God’s Wander.\n\nHan Sen emerged on the other side of Gru. However, the Extreme King’s swordlight had reoriented itself and was still coming toward him.\n\nSo, Han Sen teleported away again. But still, Gru’s sword light was able to catch up to him. He teleported a few more times, but none of his jumps shook off the pursuit of Gru’s attack.\n\n“Weird. How can he predict where I teleport to?” Han Sen thought, furrowing his brows. His God’s Wander wasn’t as good as Galaxy Teleportation, but he was still very good at small distance jumps. Within a short range, he could go anywhere he wanted. He only had to think about it, and he would teleport to where he wished to be.\n\nGru was teleporting after him and somehow managing to keep up. This fact alone was enough to prove how powerful the man was.\n\nBut Han Sen didn’t have much information on Gru, and he didn’t know what sort of powers the man wielded. He felt a bit confused about it all.\n\n“Why is this happening? How can Gru predict where God’s Wander will take Han Sen?” Li Keer was shocked, too.\n\nExquisite frowned as she studied the two fighters. “If my judgment is correct, Gru cannot predict where Han Sen is teleporting to. Instead, he is tracking Han Sen with his area power.”\n\n“Area power? Isn’t Gru’s area a sword area?” Li Keer asked, trying to recall. In Gru’s profile, it said that his area was a sword area, and his king body was sword-based. It made his sword skills stronger.\n\n“It is a sword element, but it is also a very special sword area,” Exquisite said.\n\nHan Sen kept teleporting, but he couldn’t escape Gru’s swordlight. He decided to teleport somewhere far away to put some distance between Gru and himself.\n\nThis time, Gru was unable to catch up in time. Han Sen immediately realized how Gru had been predicting his movements. If the man’s attack had possessed some sort of automatic tracking function, as Han Sen had first supposed, then the attack would have caught up with him no matter how far he traveled.\n\n“You have a very powerful area. What is it called?” Han Sen asked, looking at Gru. He could tell that this was all the effect of Gru’s area power.\n\n“Swordheart Area. My sword goes straight for the heart. Under the power of this area, I will sense your movements in my heart no matter where you go. In my area, no target can escape my swordheart’s targeting ability. Even invisible foes and chameleons are visible to me,” Gru said coldly."
}