{
    "chapter": 2545,
    "title": "Ji Yang Sheng",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2545",
    "text": "Han Sen was out hunting xenogeneics with Gu Qingcheng and Elysian Moon. All of a sudden, though, he felt a strange movement in his Sea of Soul. Han Sen was surprised by this, and so he looked inside himself. There, he saw the black crystal armor twitching slightly. For an instant, some sort of vortex appeared around his body.\n\nThe vortex only lasted for a second, though. Then, the black crystal armor returned to its usual motionless self as if nothing had occurred.\n\n“What the hell?” Han Sen wondered as he glanced around. He didn’t see anything dangerous.\n\nFar away, in a certain system inside the core area, Third Sister’s eyes looked magical. The shadow of a man appeared and began to grow clearer. The image was on the verge of revealing his face.\n\n“Argh!” Suddenly, Third Sister screamed and cupped her hands over her eyes.\n\n“Third Sister, what happened?” Li Keer was shocked. There was blood seeping out of the gaps between Third Sister’s fingers.\n\n“Someone broke my scrying skill. Who is this Dollar?” Third Sister lowered her hands. Her eyes were red, and tears of blood were rolling down her face. Li Keer was shocked seeing this. Third Sister’s Very High Sense was much stronger than her own. The powerful Very High had only just used her scrying skill, and her eyes had been injured. It was difficult to believe.\n\n“Dollar is Dollar. He said he is human!” Li Keer realized she actually knew nothing about Dollar.\n\n“What is a human? This Dollar isn’t someone ordinary. He broke my scrying skill. He must have some sort of deified protecting him. How could someone who doesn’t even have a name possess deified protection?” Third Sister gritted her teeth as she spoke.\n\n“I don’t know.” Li Keer’s face kept changing. She hadn’t expected Dollar to have such a mysterious background.\n\nBoth of them spent some time trying to guess where Dollar had come from. Third Sister didn’t dare try to steal a look at him again, though. As a result, neither of them could come up with a solid idea for who he truly was.\n\n“I want to see who he is.” Third Sister lowered her hands emotionlessly. Her eyes had recovered a little. They weren’t bleeding, but they still looked injured.\n\nShe planned on waiting with Li Keer for Dollar to show up so she could find out who he was.\n\nHan Sen did not know the situation of Li Keer and Third Sister. He was busy killing xenogeneics with Gu Qingcheng and Elysian Moon. Along the way, he kept practicing using his teleportation talents and Big Destroyed in combat. Although he was growing more familiar with both skills, he needed to test out their practical applications in real fights.\n\nWhile the three were fighting a metal wolf, someone appeared before them. When that person laid eyes on Han Sen, he was immediately recognized.\n\n“Han Sen, you aren’t dead?”\n\nWhen he realized someone else was there, Han Sen stopped using his teleportation skills and Big Destroyed. Turning to take a look, he noticed it was the Extreme King’s Princess Bai Wei.\n\nBai Wei looked at Han Sen with a conflicted expression.\n\nShe thought Han Sen had been killed by Bai Yi. She had always wanted to help Han Sen and herself. She even wanted to save Bao’er. Little did she knew that it wasn’t Bai Yi that had killed Han Sen; it was Han Sen that killed Bai Yi.\n\nAnd then Bai Wei thought about the things Han Sen had done. She couldn’t believe the fake prince claimed an Extreme King’s alpha statue and did so many horrible things in his time with her people.\n\nThe scariest thing about him was the fact that he escaped the wrath of the Extreme King without being damaged. And he traveled through the Tianxia System while the Extreme King were pursuing him. He had done so many shocking things in the universe that it was hard to fathom. He even grabbed Bai Wuchang and held him as a hostage. Ultimately, the Extreme King couldn’t do anything to him, and above all, they’d lost track of him.\n\nThinking about what Han Sen had accomplished in recent times, Bai Wei felt as if her own experiences were nothing.\n\nNo matter how bad her situation became, at least she was a bona fide royal amongst the Extreme King. She would always have resources, and no one would dare try to take her life.\n\nHan Sen was just an outsider, and yet, he had become a very famous character in the historical annals of the Extreme King. She was a real royal and yet, compared to Han Sen, it was like he was in the sky and she was stuck on the ground. There was no way she couldn’t do all the things he could, she believed.\n\nIn the time since they had last met, Bai Wei had changed a lot. Those changes had happened because she had pondered these questions thoroughly. It was all due to Han Sen. So, Bai Wei had very complex emotions when it came to confronting Han Sen again.\n\nSeeing him there now, Bai Wei had no intention of attacking.\n\n“Congratulations, you have now reached King class.” Han Sen bowed before Bai Wei.\n\nBai Wei looked at Han Sen. A while later, she said, “Just go, and don’t ever let me see you again.”\n\nBut Han Sen still went on to say, “I will never forget how you took care of me and my daughter. If you need anything in the future, have someone deliver a message to me. I will do whatever I can, and I will put my utmost effort into not disappointing you.”\n\nHan Sen still really liked Bai Wei; after all, she had tried her best to save Bao’er. He had always felt as if he owed her something.\n\n“When we meet again, we will be enemies and not friends,” Bai Wei said. Then, she turned around and flew away from Han Sen in the opposite direction.\n\n“Then let us hope we never meet again.” Han Sen, Gu Qingcheng, and Elysian Moon also flew away.\n\nThe three of them were traveling through space when Elysian Moon suddenly stopped. She floated and pointed in the direction of a planet.\n\n“There is something amiss up ahead.”\n\n“What is wrong?” Han Sen didn’t sense anything unusual coming from the planet. His Dongxuan Area still couldn’t reach that far.\n\nElysian Moon frowned and said, “I don’t know. But I can sense that an extremely dangerous presence resides on that planet.”\n\n“Is it a xenogeneic or some other sort of creature?” Han Sen asked.\n\n“It should be a xenogeneic,” Elysian Moon said quietly.Han Sen’s eyes brightened. “A xenogeneic is great. You guys hang back while I go take a look.”\n\nHan Sen readied himself to attack when suddenly, a bunch of people came flying over. They were clearly coming toward Han Sen.\n\n“Demons?” Han Sen frowned upon seeing the people with purple horns approach.\n\n“I am Ji Yang Sheng. I have admired you for a long time, and finally, I have the chance to see you in person. This is a great privilege.” A half-deified Demon bowed to Han Sen.\n\nThe Demon man looked very pale and very handsome. He was very polite, too. It would be hard to find a reason to hate him.\n\n“Thanks.” Looking at Ji Yang Sheng, Han Sen knew he must have been quite famous amongst the Demons. Otherwise, Kings and half-deifieds wouldn’t have been following his leadership.\n\nHan Sen thought to himself, “That Demon protector Moldo wanted me to come and bless a prince of the Demon. It cannot be this guy, can it?”\n\nAfter Ji Yang Sheng bowed before Han Sen, he looked at Gu Qingcheng and Elysian Moon. Something strange passed through his eyes, but it only happened for a second. No one noticed it."
}