{
    "chapter": 1099,
    "title": "Joining the Fight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1099",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Don’t be so melodramatic. Those things are useless to me, just use them and be happy.” Han Sen was starting to sweat, as he wasn’t really a cripple.\n\nQueen then looked around her and said, “So, are you familiar with this area? If you are, draw me a map. Tell me all about the creature hotspots.”\n\nHan Sen had already been on a cartographic trip, so he had several maps ready to provide her. As soon as Queen accepted the maps, her time of rest was over. She marched right out of the shelter.\n\n“What a waste of a fine body. Still, she’s got bigger balls than most men.” Han Sen licked his lips.\n\nQueen returned a few days later, having suffered a number of wounds and lesions. She brought with her a mutant deer.\n\nQueen knew Han Sen must have been very powerful to possess so many beast souls, so she didn’t bother bringing back the carcasses of any ordinary or primitive creatures.\n\nHan Sen knew Queen’s fitness wasn’t too high, though, so he was impressed at her bringing-down of a mutant creature.\n\nHan Sen had maxed out his mutant geno points already, but he still accepted it to show appreciation.\n\nQueen returned to the Alliance to heal, after that. When she was fit as a fiddle, she came back to the sanctuary and went off on another hunt. Each hunting trip would end up longer than the last, and each return would have her in a worse condition.\n\nSometimes, when Queen returned to the shelter, Han Sen wouldn’t be there. So, she’d leave the creatures in the shelter waiting for him. She would then send Han Sen a blank message. If he replied, though, she wouldn’t do the same.\n\nHan Sen returned to the sanctuary after a time away. When he arrived, Queen was gone. “Why is she working so hard on my behalf?” Han Sen really admired her.\n\nA month passed, and because Queen hadn’t signed up at the shelter, Han Sen won first place. His entry into Divinity’s Bout was confirmed.\n\nQueen had been gone two days at this point, so he had no clue when she’d return.\n\nWhen Divinity’s Bout started, Han Sen donned a suit of armor and went straight to the Martial Hall. Then he proceeded to the battle area.\n\nSpirits were everywhere. It was to be expected, though. Spirits were the dominant species of the Third God’s Sanctuary. No other human would show up.\n\nHan Sen hid his energy flow, so no one could tell whether he was a human or a spirit.\n\nHan Sen checked out the match list to see what was in store. He hadn’t fully recovered yet, but if he was able to go up against a weak spirit, he wagered he’d be fine.\n\nWhat he saw disappointed him, though. He was first going to go up against Fei Yu King. It must have been a powerful spirit.\n\nUsing super king spirit mode would be pointless here, as it’d render him weak. He’d most likely win the fight, but he’d be spent, and he’d be unable to take part in the next. To hit the top ten of the Third God’s Sanctuary’s Divinity’s Bout, he could not use it.\n\nHan Sen decided to not participate and planned to just sit and spectate the fights instead.\n\n“Fei Yu, your opponent is called Dollar. Weird, huh? That can’t be a human, can it?” Han Sen heard this while he looked for a seat.\n\n“You’ve gotta be kidding me!” Fei Yu King responded. “It’s probably some trolling spirit who couldn’t even be bothered to spell out his title in full.”\n\n“You’re probably right. If it was a human, it’d be a human with a death wish,” the other spirit said.\n\n“I wish it was a human, though. They are sad and pathetic creatures. Last weekend was wonderful; I spent some time torturing a few humans to death. Their screams were a delight!” Fei Yu King spoke with no certain tone or display of emotion. He spoke as if it was just an ordinary chat, and something common to say.\n\n“Haha, you are a king spirit. Of course you would think they are weak. They have no principles, though, I’ll give you that. They’re comparable to dogs, and mangy as they can be, too. Put out your hand without striking them, and they’ll think you’re giving them a treat.”\n\nMany nearby spirits joined in with their talk, all saying horrible things to put-down humans.\n\nHan Sen’s face turned green with their wretched speech. Learning how they treated humans, and for what pitiful reasons they’d happily kill them, Han Sen was fuming.\n\nSpirits were able to respawn, so they had no idea of the fear humans felt when it came to the possibility of death.\n\nHan Sen looked at Fei Yu King. He didn’t know which humans he had gleefully tortured and murdered, but he was angry nonetheless. He felt his chest want to explode with the sudden hatred he felt for the spirit.\n\n“Fei Yu King, huh?” Han Sen could use super king spirit mode to participate in one fight. If he was to use it on the murderous spirit, that would make him happy enough.\n\nIn human shelters, the fights were streamed through the Martial Hall. No one expected another human to fight, let alone become a Son of God. Those who watched merely wanted to spectate how spirits battled each other. Their fights were usually quite the spectacle.\n\nSu Xiaoqiao was currently in Trench Shelter. He paced around the Martial Monument, looking to see if he could find the name he most wanted to.\n\n“What are you doing?” Someone’s vision had been blocked by his scurrying.\n\n“I am looking for Dollar,” Su Xiaoqiao responded, as he looked.\n\n“I don’t think he’d join a fight like this. There are far too many king spirits there…” the person said.\n\n“I found it!” Su Xiaoqiao exclaimed with feverish excitement."
}