{
    "chapter": 1190,
    "title": "Asura Betrayal",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1190",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhile Han Sen was flying back, someone called out his name. When he turned around to take a look, he saw an eight-year-old child squirming and writhing around on the ground as if in pain.\n\n“Baby Ghost?” Han Sen was surprised to see him there.\n\nHe was glad he was alive and had not been killed. He didn’t have any green sproutlings popping up all over him, but there was definitely something wrong with him.\n\nHe used to have the face of a child, but now he was a child completely. The head was still frighteningly large, however. His lifeforce was weak, almost as weak as a newly-spawned Golden Growler.\n\n“What happened to you?” Han Sen asked.\n\n“Talk later. For now, we should get moving.” Baby Ghost clearly did not know Sky King had returned to the tree.\n\nHan Sen grabbed Baby Ghost and returned to the underground shelter with him. Then, he ordered Moment Queen to move the shelter.\n\nLittle Angel and Han Sen were weak, and in their current state, they no longer had the ability to combine together and fight Sky King. As such, they decided the best course of action was to leave.\n\nHan Sen spoke to Baby Ghost and asked, “I thought you went looking for Sky King after I told you the truth of matters. What happened to you?”\n\nBaby Ghost answered, “I told Qing Jun, and we only went and spoke to the others. We didn’t consult Sky King, but we were going to. But before the opportunity arose, the tree began to revive.”\n\n“Okay, and what happened to you?” Han Sen asked.\n\nBaby Ghost explained, “Fortunately for me, I had Ghost Baby to escape. I abandoned my vessel and sacrificed a portion of my spirit stone to survive. I say fortunately loosely, as now I’m only a shadow of what I once was. My progress has been wiped; I don’t even have a single gene lock open.”\n\n“Just being alive is enough, Baby Ghost. Even if you’re weak, being alive is more than worth the sacrifice.” Han Sen smiled softly to comfort him.\n\nQing Jun was in even worse condition, though. Those that had escaped into the Cruel Bottle were all alive, but they were stuck inside the bottle and unable to exit. If they left the confines of the bottle, the Sky Tree would finish the job and absorb them. Being unable to get rid of the vines meant they’d possibly be stuck inside the bottle forever.\n\nThe Cruel Bottle was like a room that operated independently to everything else, but it had to be sealed and had to remain sealed. It could not be opened, lest the Sky Tree finish what it had already started.\n\nAside from destroying the Sky Tree, Han Sen had no clue how he might proceed. There didn’t seem to be any other way Han Sen could remove the vines. The creatures and spirits had each consumed too much lifewater, too, so the core of a Sky Fruit would be largely ineffective.\n\nIn the meantime, though, Han Sen decided to return to the Alliance. Little Angel and Han Sen were both still too weak, and for the time being, they wouldn’t even have the strength to tackle a super creature.\n\nHan Sen rested there for two days, and after that, he started refining the Life Geno Essence of the Sky Peacock.\n\n“Life Geno Essence absorbed: super geno points +1.”\n\nHan Sen was delighted, hearing the announcement chime more than once. In total, the Life Geno Essence provided him four points in total.\n\nSuper creatures in the Third God’s Sanctuary were different. Some could give eight to nine super geno points, whereas others could only give three to four. Han Sen guessed it had something to do with the generation of a super creature, but he hadn’t had much time to test and prove such theories.\n\nSky Peacock was a mount beast soul, and Han Sen considered it to be fairly useless.\n\nWhen Han Sen’s condition and health improved, he didn’t jump back to start hunting super creatures again. He realized he still needed a lot more strength to fight an emperor, though; he had to be careful where he next ventured.\n\nIf he combined powers with Little Angel, the cooldown period was extreme. The boost didn’t last very long, either, so he knew he couldn’t rely on that trick very often. It had to be used as a last resort.\n\nWhat Han Sen wanted to do most right now was research the vines and find a way in which he might remove them without destroying the Sky Tree. If he saved all the creatures and spirits inside, they’d all owe him one, and they might end up following him. If that was true, he’d more than have what it took to take down a king-class shelter.\n\nDragon King gave Han Sen a number of ideas, but Han Sen didn’t dwell on many of them. He didn’t think he should trust Dragon King as much, anymore.\n\nThat being said, Han Sen understood Dragon King never wanted to bring harm to him. Dragon King had made a simple blunder, and the results of his time in Immortal Shelter did not come about through some evil machination or scheme the spirit had hatched, as Moment Queen might do. After all, if something bad happened to Han Sen and he was killed, that would be game over for Dragon King, too.\n\nSo, more than anything, Han Sen had just called Dragon King’s overall intelligence into question. It boggled Han Sen’s mind how someone so dumb might have once been an emperor.\n\n“Please have faith in me. I have a plan. This could really work.” Dragon King felt sorry for what had happened and desperately wanted to get back into Han Sen’s good books.\n\nDragon King was relying on Han Sen to find him a vessel, after all.\n\n“The Asura Sutra can get rid of those vines,” he said, but Han Sen struggled to believe it.\n\n“If you practice the Asura Sutra, you can fix them. Back then…” Dragon King realized he had said something he should not have mentioned.\n\n“Back then what?” Han Sen asked.\n\nDragon King knew, if he didn’t play his cards right and only do good for Han Sen, he’d be trapped in the ring for all eternity.\n\n“Asura was one of the generals who beat Sky King. His Asura Sutra is bad for the tree, but you would need to find a spirit of that bloodline to perform it,” Dragon King said.\n\n“Didn’t you say Sky King was an emperor? And Ancient Devil Emperor beat Sky King himself? So Asura was just a general, but he was able to defeat Sky King, too?” Han Sen thought there were inconsistencies in the spirit’s tales, and he wasn’t sure whether or not he should give Dragon King the benefit of the doubt.\n\nBut Dragon King then explained, “Folk of the Asura bloodline can defeat Sky King. Besides, he betrayed Mister Ancient Devil. You remember Devil’s Realm and Ancient Devil Shelter, don’t you? That was the consequence of his betrayal.”"
}