{
    "chapter": 172,
    "title": "It’s You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_172",
    "text": "Han Sen was Ji Yanran’s boyfriend, and My-girlfriend-is-Ji-Yanran was really Ji Yanran’s boyfriend. This news made many feel incredible and relieved at the same time.\n\nAfter all, unless it was Ji Yanran’s boyfriend, who would be so shameless to use that ID?\n\nBut the news was still earthshaking in Blackhawk, whose campus belle finally had a boyfriend, Han Sen.\n\nJi Yanran was the campus belle, but Han Sen was even more famous--the genius who had the Starry Cup in his pocket, beat the Chosen in black and white boxing and killed it at Hand of God.\n\nMany people only felt a bit surprised when hearing the news, and soon thought that it was rather natural.\n\nEven the photos of Han Sen and Ji Yanran together looked sweet and natural.\n\nWhen the two stood together, people noticed that although Han Sen was not as good-looking, he had a man's determination. What was more incredible was his skin was even better than his girlfriend’s, making many girls jealous.\n\nAny picture with Ji Yanran and Han Sen in it was beautiful. They looked perfect together like a sword belonged to its knight. If they were with anyone else, it would not be the same.\n\n\"Wait, have we met recently?\" The more she looked at Han Sen, the more familiar Qu Lili felt. Suddenly, Qu Lili thought of something incredible and her eyeballs almost fell out. She pointed at Han Sen. \"You... you... dormitory...\"\n\nBefore Qu could finish that sentence, Ji Yanran blushed and dragged her back to the dorm.\n\n\"Sweetie, I did not see that you have such potentials. Tell me, when did you have this guy under your skirt? I can’t believe you pretended not knowing him and said you had no idea who your boyfriend was,\" said Qu Lili with a faint smile, glancing at Ji Yanran who had her face covered up in a blanket.\n\nJi Yanran said with a look of pretended annoyance, \"It’s not like that. I really did not know it was him.\"\n\n\"Ha! If you did not know it was him, why did you make out with him in public?\" Qu Lili twitched her mouth and showed no confidence in her statement.\n\nJi Yanran sat on her bed and took the blanket off her face. \"Well, I will confess now. I really did not know before...\"\n\nJi Yanran explained the story from the moment when she met Han Sen on the spaceship.\n\n\"Sweetie, you had your eyes on him then, right?\" Qu Lili asked after listening, squinting.\n\n\"What? I’m nothing like you ...\" Ji Yanran was speechless.\n\nAt this time, Ji’s comlink rang and it was Han Sen.\n\n\"Aha! It must be Han Sen. So romantic, a phone call right after you parted...\" Qu Lili said, grinning.\n\nJi Yanran was so shy that she had an urge to hang up, but eventually ran to the washroom and picked up.\n\nAfter a while, Ji Yanran came out and said, \"He said that we barely ate anything before we left, and wanted to invite us eat something in a private room at the cafeteria. You want to go?\"\n\n\"Who is he?\" Qu Lili gave an ambiguous smile.\n\n\"Are you going or not?\" Ji Yanran pouted prettily in embarrassment.\n\n\"Of course, I will ask him to spare me one of his friends.\" Qu Lili twirled away to get dressed.\n\nWhen Ji Yanran and Qu Lili entered the private room, they saw Han Sen and Zhang Yang sitting there chatting.\n\nSeeing Ji Yanran and Qu Lili come in, Han Sen quickly pulled a chair next to him and asked Ji Yanran to sit there. Zhang Yang did the same for Qu Lili.\n\n\"Han Sen, you hid the secret well and had Yanran to yourself so quietly,\" commented Qu Lili with a faint smile.\n\n\"I have not had the opportunity yet,\" replied Han Sen with a smile.\n\nJi Yan turned red and ground her foot into Han Sen’s, making him yelp.\n\nQu laughed herself senseless and said, \"Han Sen, let me reintroduce myself. My name is Qu Lili, Yanran’s best friend.\"\n\n\"Han Sen, Yanran’s only boyfriend. And this is my classmate and roommate Zhang Yang.\" Han Sen touched Zhang Yang and said, \"You can introduce yourself.\"\n\nZhang Yang puffed out his chest and said, \"Zhang Yang, student at Archery Department, Han Sen’s roommate, and the greatest commander the Alliance will ever see.\"\n\n\"Well, there is an ambition. I admire that. To us!\" Qu Lili raised her glass of wine.\n\nThe four were all cheerful and young, so it took no time for them to get acquainted.\n\n\"Han Sen, if you and Yanran are a couple, how could you join the Heavy Warframe Society instead of Hand of God Society?\" Qu Lili asked.\n\n\"Hand of God is not challenging enough, and I was not good at warframes so I wanted to learn.\" Han Sen told the truth.\n\n\"I would only take this answer from you.\" Qu Lili heard Han Sen's answer and suddenly laughed.\n\nWhen Han Sen was about to say something, his comlink rang. Han Sen checked the number and excused himself to answer the call.\n\n\"So mysterious. Is it a girl?\" After Han Sen finished, Qu Lili asked directly.\n\nJi Yanran also wanted to ask, but was too shy to do that. Hearing Qu Lili’s question, she stared at Han Sen.\n\n\"No, a friend is looking for me, and I'll go to meet him later,\" Han Sen said.\n\n\"Such a fussy friend. Just ask him to join us,\" Qu Lili said.\n\nHan Sen paused, and Qu Lili continued, \"Han Sen, are you afraid we are going to see your friend?\"\n\nHan Sen suddenly laughed. \"Sister, if you do not mind, we can ask him to come over.\"\n\n\"Do it! I can handle ten friends of yours.\" Qu Lili was cheerful and carefree."
}