{
    "chapter": 78,
    "title": "Rock-Paper-Scissors",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_78",
    "text": "\"Drinking without a drinking game is always a little boring. How about we play a little game?\" It only took a short while before Tang Zhenliu suggested a game.\n\n\"Drinking game? We have a kid here.\" Qu wange rolled her eyes at Tang.\n\nTang winked at Fang Jingqi and the latter smiled and said, \"Wange, no worries. Nothing over the line. We are kid-friendly here.\"\n\nFang Jingqi turned to ask Tang, \"How about red hands?\"\n\nWhen Fang Jingqi said these words, Han Sen was slightly startled. He thought that Fang was trying to set him up, but in fact, it seemed that he was setting Tang Zhenliu up.\n\nTang frowned. \"Red hands is too easy to play and not good for drinking. Let’s play ‘pouring the wine.’\"\n\n\"Pouring the wine\" suggested by Tang Zhenliu, was a game where two players sat across a table with a cup of wine and a plate on it. The two would play rock-paper-scissors first and the winner should grab the wine and pour it at the loser’s face. The loser needed to grab the plate and block the wine with it.\n\n\"Is this game appropriate?\" Fang Jingqi only knew Hen Sen was good at red hands but wasn’t sure if he’d be good at this game.\n\n\"Well, you three play. I’ll take Yan to the gym.\" Qu Wange was afraid that this would be a bad influence on the little girl and led her away.\n\nWith the ladies gone, Tang felt more at ease and challenged Han Sen, \"We are all men here so don’t be afraid of losing face. Do you dare to play or not?\"\n\n\"Of course, but a game’s no fun without a bet,\" Han Sen said.\n\nHearing Han Sen’s reply, Fang Jingqi was thrilled. He thought to himself, \"It seems Han Sen is confident. Tang, you are going to make a fool of yourself. I will record how miserable you are and show it to you if you dare to brag about yourself again.\"\n\nTang rejoiced over Han Sen’s reply as well. He thought, \"Fortunately this kid does not know who I am, or he wouldn’t even dare to play with me, let alone to suggest a bet.\"\n\n\"What’s the stake?\" Tang Zhenliu pretended to be reserved.\n\n\"A hundred thousand per round.\"\n\nHan Sen was just concerned about the money to pay for Yan’s nutrition solutions and physician—more than one million per month was simply beyond an average household’s means.\n\nHe didn’t even have the number for the first month in his account and had to sell mutant creature meat back in God’s Sanctuary to come up with it.\n\nBut all he had left was mutant black stingers, and he didn’t really want to sell more after the 30 he sold to Qin Xuan. If the same creature appeared too often, its value would drop and people might think it was easy to hunt that creature.\n\nSo, Han Sen did not intend to sell mutant black stingers any more unless he had to.\n\n\"Good, I really like playing with a straightforward guy like you. One hundred thousand per round it is.\" Tang was overjoyed inwardly. He was just thinking it wouldn’t be satisfactory enough just to pour wine on Han Sen’s face and it chanced that the kid had offered money as well.\n\n\"You will have to wait ten thousand years before you could win money from me. I am the king of rock-paper-scissors and I can win nine of ten rounds. I will wait to see you cry.\" Tang wanted to give Han Sen a banner for being a great citizen. He was just so nice to offer Tang both his face and wallet.\n\nThe three soon decided on the rules, to win rock-paper-scissors didn’t count as winning the round; a winner must also successfully pour the wine on the opponent’s face.\n\n\"You guys can start. I’m terrible at rock-paper-scissors, so I’ll first observe.\" When they were deciding which two were to play first, Fang threw his hands up.\n\nHe had no intention to play and just wanted to record the game.\n\n\"Alright, you can play when we get tired.\" Tang was pleased by Fang Jingqi’s quitting as it gave him more time to kick Han Sen’s ass.\n\nTang laid the plate and a glass of wine on the table. The glass was an ordinary one and could hold about five ounces of wine.\n\n\"Shall we use water instead?\" proposed Han Sen. He was afraid that Tang would be soaked in wine and it wouldn’t be safe if Tang caught on fire.\n\n\"Water is boring. Wine it is.\" Tang wouldn’t miss an opportunity to humiliate Han Sen more.\n\nHan Sen did not speak. Tang Zhenliu said to Fang Jingqi: \"Fang, you call it so that it is fair. I am afraid someone may challenge the result otherwise.\"\n\n\"OK.\" Fang Jingqi agreed, stood between the two, cleared his throat and called, \"Rock... paper... scissors!\"\n\nWhen Fang Jingqi said \"scissors,\" Han Sen and Tang Zhenliu almost reached out their hand at the same time. Han Sen used scissors, while Tang used rock.\n\nExcited that he had won, Tang grabbed the glass of wine and poured it at Han Sen.\n\nUnfortunately, Han Sen had put up the plate with some panic and blocked the wine.\n\n\"Could Han Sen actually be bad at this game?\" Fang Jingqi hesitated as he did not expect Han Sen to lose. Looking at Han Sen’s smiling eyes, Fang could not help but wince,\"No, Han Sen is ruthless. He is just trying to get more from Tang.\"\n\nHaving understood what was going on, Fang Jingqi grinned and thought, \"Tang, you are doomed tonight. I will try to record everything.\"\n\nHan Sen was of course setting Tang up, since he had asked for it himself anyway.\n\nAnd Tang was rich enough as well. Others might not be able to come up with the stake, but since Tang could earn more than ten million with one performance match, he probably would feel nothing from losing a few million.\n\nThe game itself was a test of reflexes and timing. Both rock-paper-scissors and fetching the object one should choose was highly demanding for one’s reflexes. The one who could respond fast had a great advantage in the game.\n\nHowever, what was more important was the ability to predict the opponent’s next move, which was the essence of rock-paper-scissors."
}