{
    "chapter": 2354,
    "title": "Suppress Demon Coffin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2354",
    "text": "Han Sen walked toward the Nine-Headed Bird. Darkness flowed from the creature, consuming all that could be seen in every direction. Han Sen knew that the darkness was coming for him, that it would trap his body in less than a second.\n\nPang!\n\nHan Sen hit the darkness, but it was like he was striking a plate of steel. The impact made his hand go numb, and the wall of black around him remained unmoved.\n\nThe darkness seemed to solidify into walls of flat stone. It enveloped the entire area around Han Sen, trapping him inside a small box.\n\nHan Sen kept punching the black stone around him, his Kingese continuing to shine. But even so, the black stone didn’t break. Dark demonic symbols began to appear across the surface of the stone.\n\n“The sky above has a bird of nine heads, and hell below holds the suppressing demon coffin. No matter how strong your Kingese body is, you cannot escape the binding area of my demon coffin.” Nine-Headed Bird’s voice sounded in Han Sen’s ear.\n\nHan Sen examined the demonic symbols across the stone. One of them looked rather like a bird’s head, and it turned and squawked at him.\n\nXius and the other observers saw the black coffin close around Han Sen. The pitch-black coffin was disturbing to look at, and a nine-headed bird stood on its lid. Each of the bird’s nine heads looked off in a different direction, and it kept the coffin suppressed. A demonic air swirled around the coffin, and no matter how Han Sen tried to attack, the demon coffin would not budge.\n\nHan Sen’s fist kept striking, but he couldn’t break through the suppressing field of the demon coffin.\n\nThe demonic symbols flashed across the coffin’s interior, and a bird head appeared again. The weird bird eyes stared at Han Sen and the creature chuckled. “Don’t waste your breath. My Suppress Demon Coffin can bind both gods and demons. Even if a deified was in your place, they wouldn’t be able to break out of this coffin. You can hand over the Ancient God Origin now. If you don’t, and the Suppress Demon Coffin falls into the demonic abyss, even I won’t be able to help you out.”\n\nHan Sen ignored the bird. He kept punching against the Suppress Demon Coffin, but it was proving to be futile. Han Sen’s power slammed uselessly into the demon coffin’s walls. There was a power, like an abyssal one, absorbing his strikes. He was unable to hurt the demon coffin.\n\nHan Sen summoned his Purple-Eye Butterfly. He had a look at the demon coffin, and he learned that the demon coffin wasn’t a solid item. Instead, it was being continually formed and fueled by power coming from the demonic abyss. It was connected to that abyssal and demonic world. Furthermore, the coffin was now slowly falling into that place of darkness.\n\nThe Suppress Demon Coffin’s demonic air had grown strong, continually replenished by the streams of darkness coming from the bird’s nine heads. The eyes of the fiend were unleashing a demon light, which seemed to be making a path for the demon coffin.\n\nThe demon coffin was slowly descending into the dark as tentacles made from a dark substance pulled it down. Just as Nine-Headed Bird had said, not even a deified would be able to escape once they fell into that dark abyss.\n\n“Prince Sixteen, you are so talented. You also have the protection of the Kingese. You could achieve so much. Why throw away your life for the Ancient God Origin? You will live a long and good life, surrounded by many beautiful women. You will reign over all of the Extreme King. Dying is not worth it,” said the bird’s head in a tempting tone. It had emerged from the coffin walls again.\n\nHan Sen found it annoying, so he punched it. The bird’s head vanished back into the coffin, and Han Sen’s power was absorbed by the stone walls.\n\nHan Sen’s head spun with thoughts. “This demon coffin area is so weird. I’m afraid ordinary power cannot break it. The Kingese are strong, but they are still combined with my flesh, which means I cannot control them. I cannot cast the Kingese beyond my skin. Relying on the power of the Kingese to break the demon coffin’s area will be pointless.”\n\n“Nine-Headed Bird, if I go into the demonic abyss, this item will be useless for you, too. You will lose the Ancient God Origin, and you will also become an enemy of the Extreme King. Do you want to be killed?” Han Sen said.\n\n“Others might be afraid of you and the Extreme King, but we Pirates are not. You should just hand me the Ancient God Origin while you’re ahead. Otherwise, you’re going to be buried in the demonic abyss. Extreme King or not, it does not matter to me,” Nine-Headed Bird laughed sinisterly.\n\nHan Sen didn’t move, and he said, “Unless the Very High were supporting you, the Pirates wouldn’t dare to go against the Extreme King by themselves. You need to think about this. I’m carrying thousands of Kingese. I’m a genius unlike any the Extreme King have ever had. Father really loves me. If you bury me in the demonic abyss, what do you think my father will do? Do you think the Very High will fight the whole of the Extreme King on your behalf?”\n\nNine-Headed Bird went quiet, then hissed, “Do not talk crap! Give me your Ancient God Origin if you want to live. Otherwise, even if King Bai himself came here, you would still die in the demonic abyss.”\n\n“I’m very bad-tempered. I only respond to the nice cop. Trying to intimidate me like this will never make me hand over the Ancient God Origin, no matter how dire my circumstances might be.” Han Sen paused, and then said, “But if you want to make a wager with me, and I lose, I will give you the Ancient God Origin.”\n\nNine-Headed Bird frowned and asked, “What are you proposing?”\n\n“You have used the Suppress Demon Coffin to trap me. This is nothing. You and I stand here without dodging. You punch me, and I punch you. Whoever moves first loses. That will test the real mettle of a man. If I lose, I will give you the Ancient God Origin,” Han Sen said.\n\nNine-Headed Bird’s eyes flashed. He gave Han Sen a look of scorn and said, “You have the Kingese body, which makes you stronger than my half-deified body. Why would I agree to this wager?”\n\n“I won’t use the power of the Kingese. If I use the Kingese power, I also lose,” Han Sen said.\n\n“Are you serious?” Nine-Headed Bird’s eyes flashed. He was staring at Han Sen as he spoke.\n\n“I promise in King Bai’s good name. If I break my promise, then King Bai will die,” Han Sen said.\n\nWhen Nine-Headed Bird heard Han Sen use King Bai’s name to make the promise, he believed him. He still harbored some suspicion, though. “I’m willing to make this gamble. But I will have to hit you first. If you move or use your Kingese, then you lose.”\n\n“Sure,” Han Sen answered quickly.\n\nNine-Headed Bird, hearing Han Sen answer him so quickly, grew even more suspicious. After a moment of thought, he said, “We can only use our own power to fight. We cannot make use of xenogeneic treasures.”\n\nHan Sen’s face paled slightly. He cocked an eyebrow and said, “Isn’t it normal to make use of xenogeneic treasures?”\n\nNine-Headed Bird grinned widely. “Using xenogeneic treasures is worse than using king areas. You don’t like my Suppress Demon Coffin area, yet you insist on xenogeneic treasures?”\n\n“About that…” Han Sen’s face still looked worried.\n\n“Hurry up and make your decision. The Suppress Demon Coffin is on the verge of falling into the demonic abyss. If you do not decide now, then you won’t be able to turn back.” Nine-Headed Bird laughed again.\n\n“Sure. I agree, but I will have to take the first swing.” Han Sen could see that the Suppress Demon Coffin was teetering on the edge of the demonic abyss, and it made him grit his teeth.\n\n“No, I will hit first,” Nine-Headed Bird replied instantly.\n\nHan Sen’s face kept changing, and he didn’t speak. A scary demonic air had made its way inside the Suppress Demon Coffin. The coffin warped, and the tentacle-like strand of demonic power was feeling its way forward, coming for Han Sen.\n\n“Fine. We agree, then!” Han Sen screamed when he saw the dark, demonic tentacle reaching out lecherously to touch him.\n\n“Heehee, that is it, then.” Nine-Headed Bird snickered. The Suppress Demon Coffin then opened and Han Sen emerged.\n\nSuppress Demon Coffin was consumed by darkness as the black tentacles surged up around it and pulled it down into the black."
}