{
    "chapter": 71,
    "title": "Destroy the Nest",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_71",
    "text": "Swarms of black stingers flew in and out the nest and there were at least tens of thousands of them, filling Han Sen and Lu Weinan with dread.\n\n\"Big brother, you do not mean to kill all these hornets, do you? Looks like they are all primitive creatures. There are so many of them and they can fly. It’d be hard for us to get out safely,\" Lu Weinan swallowed and said.\n\nHan Sen was happy to see the towering old trees and the flowers on the ground. He thought, \"The poster did not lie. There is indeed such a place.\"\n\nAfter watching for a while, Han Sen said to Lu Weinan, \"Let's go farther.\"\n\nLu Weinan had to follow Han Sen. They didn’t dare to approach the nests, so they flied high in the sky. The flower field was dozens of miles long and there were tall trees everywhere. There was a huge hornet nest on almost every tree. No one knew how many black stingers there were in this area. It was scary just to think about it.\n\nSoon after, Han Sen saw a giant tree that was more than twice as tall as the others. The hornet nest on this giant tree was the size of a castle, and there were scarlet black stingers the size of a pigeon flying in and out from time to time.\n\nLu Weinan looked at the nest eagerly and said, \"Are those scarlet hornets all mutant creatures? How many of them must there be?\"\n\nHan Sen was also a bit dumbfounded. The poster said he had seen one. Although Han Sen had guessed there should be more than one, he didn’t predict that there would be a whole nest of them.\n\n\"There must be a beast soul among so many mutant black stingers.\" Han Sen was excited, realizing it was difficult to handle so many mutant black stingers at the same time.\n\nThe needle of the mutant black stinger was blood-red and at least two inches long. It looked very sharp as well. No one could resist the poison on it if stinged.\n\nAfter all, they were mutant creatures. Han Sen didn’t want to depend on his sacred-blood armor completely. Once the armor was pierced, he would be risking his life.\n\nThe only fortunate fact was that the closest primitive hornet nest was a mile away, so the primitive black stingers didn’t dare to get too close to this area.\n\n\"Comrade Lu, it’s time to test your loyalty.\" Han Sen patted Lu Weinan on the shoulder.\n\nLu Weinan suddenly changed his expression, \"Big brother, you do not want me to lure the mutant black stingers away, right? I will die.\"\n\n\"Do not be so pessimistic. Well, you do not really need to go there yourself. Just use your iron-feathered bird to attract their attention and I’ll use that opportunity to ruin their nest. When the mutant hornets run wild and scatter around, we could just kill some of the single ones.\" Han Sen said with a smile.\n\nHan Sen said before Lu Weinan could say anything, \"Do a good job, and I will give you two mutant hornets when the plan goes through. Think about it, boy.\"\n\nIn order to keep Lu Weinan in line, Han Sen promised him the reward first.\n\nLu Weinan suddenly swallowed the reply he had, patted his chest and said, \"It’s my honor to risk everything for you. Tell me what to do, big brother.\"\n\nTwo mutant hornets could gain him quite a few mutant geno points.\n\n\"Very good, I am seeing great things in you. You are responsible for directing your iron-feathered bird to poke at the nest and attract most hornets away. But don’t let the bird fly too high. If the hornets couldn’t follow, they would return to the nest. Try to keep them away as long as possible, and I’ll take care of the rest,\" Han Sen said.\n\nLu Weinan looked surprisedly at Han Sen, \"Even if I can get most of the hornets away from the nest, there are certainly some remaining inside. Are you gonna be fine walking over like this?\"\n\nLu Weinan did not expect that Han Sen would risk approaching the nest himself, which was far more dangerous than his part. He wasn’t in direct danger by using the iron-feathered bird to lure hornets away. If things got bad, he could also take the beast soul bird back.\n\nThe fortress-like hornet nest was connected to the tree trunk, and it wouldn’t be easy to take down.\n\n\"I have a plan. Just buy me some time and do not let those hornets come back too fast,\" Han Sen said calmly.\n\nAs long as the majority of mutant black stingers were lured away, he wasn’t afraid of a dozen that might still be in the nest.\n\n\"Will do!\" Lu Weinan hid behind a boulder with Han Sen and commanded his iron-feathered bird to seize a large stone with its claws and flew above the nest.\n\nBang!\n\nThe iron-feathered bird dropped the stone at the nest and the three-foot-long stone made a big hole in the nest.\n\nWith a buzzing sound, mutant black stingers rushed out from the nest madly toward the iron-feathered bird like a scarlet cloud.\n\nLu Weinan quickly commanded the iron-feathered bird to lead the mutant black stingers away.\n\nHan Sen was watching the nest closely all the time and saw almost no mutant black stingers around the nest.\n\nWhen the mutant black stingers were led dozens of yards away. Han Sen suddenly summoned the beast souls of the purple-winged dragon and bloody slayer, with the mutant sawfish spear in hand, he flew toward the nest, looking like a winged centaur warrior from the myth.\n\nAlmost just in the blink of an eye, Han Sen threw himself at the nest, breaking the nest badly. Swinging the spear into a storm, he tore the nest apart as if it were made of paper. Some mutant black stingers were trying to attack him, but were all killed with the spear in a short while. None could stop him.\n\nThere was a mutant black stinger that approached him, and its sting didn’t even pierce his armor, leaving only a small white mark on it.\n\nLu Weinan was shocked. He knew Han Sen was strong but didn’t realize Han Sen had such great shapeshifting beast soul.\n\nWhen the better half of the huge hornet nest had been destroyed by Han Sen, a hornet twice the size of a mutant one flew out, its whole body transparent as red crystal.\n\nThe moment this biggest hornet flew out, all the mutant hornets that were lured away by the bird all flew back to the nest, as if they could feel something.\n\n\"Be careful. The hornets are all back. That may be their queen!\" Lu Weinan roared."
}