{
    "chapter": 3020,
    "title": "Sacred Leader Armor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3020",
    "text": "In the dark zone of the big barren systems, a little beast was in front of the ruins of a holy palace. The beast looked like a cat but didn’t look like a cat. It looked like a fox but did not look like a fox. There was also a handsome young boy.\n\n“How could this happen… Auntie Mei… Old Vulture… Where are you guys?” The young man was shouting. He kept searching in the hopes of finding something.\n\nThe results disappointed him. Aside from a few bloodstains, nothing else remained.\n\n“This is… Is it Auntie Mei’s blood…” The young man saw the bloodstains on the wall and was shocked. His face turned a little bit pale. Old Cat jumped atop the broken wall. He sniffed it and seriously said, “That is probably her blood.”\n\n“What happened here?” Littleflower gnashed his teeth. He used his hands to touch the bloodstain. The moment his hand touched the blood, some weird power went into the bloodstain.\n\nThe bloodstain had a weird shadow. It was like time was rewinding. It played back the image of what happened before. It revealed to him a scene that was like a movie.\n\nIn the video, there was a scene that showed Qin Lan murdering Auntie Mei. Littleflower gnashed his teeth. His lips almost started to bleed with the nibbling.\n\nIt was a shame the scene showed only Qin Lan murdering Auntie Mei. It did not show anything else.\n\nLittleflower moved toward another bloodstain. He put his time and space powers into the bloodstain. He quickly saw Qin Lan murdering Old Vulture, the eyeless beast, and Red Ghost.\n\n“I am going to kill him! Old Cat, tell me where he is.” Littleflower’s eyes had turned red. They looked like they were almost bleeding.\n\n“Littleflower, calm down,” Old Cat said. “You cannot fight him yet.”\n\nLittleflower was so angry that it was visible in his eyes. He stared at Old Cat and asked, “Didn’t you say I only needed to max out my Super Gene, and then I could get out of the sanctuaries and quickly level up? Tell me what to do.”\n\nOld Cat looked glum as he said, “You have just become deified, and that Qin Lan is way above true god class. If you want to level up that much in a short amount of time, it will be extremely difficult. There is a way, but it is very grueling and painful.” “Tell me what to do,” Littleflower confidently said. “No matter what, I am going to exact my revenge.”\n\n“Fine. I hope that stuff is still here, then.” Old Cat hesitated a little, but he walked over to the sacred hall’s ruin. He went over to the statue of Qin Xiu that was broken.\n\nOld Cat circled the broken base and walked around it twice. He put out his claws and pressed a button at the bottom. The bottom made a “katcha” and started moving. It revealed an entrance that led underground. Stone stairs quickly revealed themselves.\n\n“Follow me,” Old Cat called out to Littleflower as he started descending the stone stairs.\n\nLittleflower followed. The stairs did not go on for long. After about 90 feet, they reached the end. An old stone door was at the very end of the stairs. Many weird symbols were carved on the door. The symbols were abstract. It was difficult to tell what they were depicting.\n\n“You should try to see if you can push open the door,” Old Cat said. “If what is in there was not taken, I think it can help you a lot.”\n\nLittleflower reached out his hand and pushed the stone door. With his power, the stone door did not budge.\n\n“You need to use your sacred body power to push the door open,” Old Cat said. “The stone door can only be pushed with sacred power.”\n\nLittleflower nodded. His body blazed with a white flame. The space around them was distorted by the presence of the fire. He placed his hand on top of the stone door.\n\nThe white fire around his body was like water melting into the stone door symbol. The symbol was dyed white. It released a holy light. Katcha-cha!\n\nWhen the symbols on the stone door lit up, the stone door slowly opened. Littleflower opened it a little. Light seeped through the gap of the ajar door. That light steadily grew stronger.\n\nWhen the stone door was completely opened, Littleflower looked at what was beyond it. He was shocked.\n\nBeyond the stone door was an old stone hall. The deepest point of the hall had a black, mysterious set of armor. It was like a statue quietly standing there.\n\nLittleflower looked at the black armor and asked, “Old Cat, is this what you’re talking about? Is it this set of armor?”\n\n“Yes. That armor is the armor Sacred Leader Qin Xiu wore. It is the strongest treasure in the universe. It has incredible power. You only need to earn its approval. Once you wear it, you have the power to go against the world. Not just Qin Lan, but you could even lay waste to 10 Qin Lans. But…” Old Cat paused and didn’t continue his sentence.\n\n“But what?” Littleflower asked.\n\n“This armor is something only Sacred Leader Qin Xiu can wear,” Old Cat said. “Aside from him, even the highest level of God Spirit could not wear this armor. You have the sacred body, but I do not know if you have its approval. If it does not work, you will be in great danger. I advise you to wait a bit longer. Once you become true god and use your holy body to wear the armor, your chances of success will be much higher.”\n\nLittleflower looked at the armor and asked, “Is there a chance of me succeeding?”\n\n“There is a 50% chance,” Old Cat replied.\n\nLittleflower walked to the armor and said, “That is a high enough percentage to take the risk. I cannot wait much longer. Tell me, how can I wear it?”\n\n“Use your holy body to conquer it,” Old Cat said while squinting his eyes. “If you get its approval, it will let you wear it.” “OK.” Littleflower walked in front of the armor. The bright white light was on fire. He stared at the armor and pressed it.\n\narn\n\nBoom!\n\nWhen Littleflower’s hand touched it, his white light fire started going to the armor. The black armor suddenly turned very bright. It was just like Littleflower’s body. It was burning with a white flame. His eyes were shining with a weird light.\n\nLittleflower frowned. He felt his body was madly going for the armor. It was like it was being pulled into a bottomless abyss that could never be filled.\n\nPang!\n\nThe armor suddenly split. It shattered into a bunch of lights. It was headed for Littleflower. It suddenly wrapped around Littleflower’s body and created a new set of armor.\n\nThe new armor was snow white. The white light kept glowing nonstop. Only the eyes were pitch-black like ink. It was like a black demon flame was inside it.\n\n“Argh!” Littleflower was wrapped up by the armor. He raised his head and roared to the sky. His short hair grew fast. It grew from his helmet like a black waterfall. Between the gaps of the armor, black demon flames sputtered out. The black and white colors created a startling contrast."
}