{
    "chapter": 2511,
    "title": "Little White Cat",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2511",
    "text": "The little cat was only around the size of a man’s hand. It looked very cute, and its legs were pink in color. The contrast between the pink fur of its legs and the white fur of its body was quite lovely.\n\nThe woman picked up the cat from the ground and placed it in her hands. Han Sen could see the woman’s hands in the video. Her fingers were long and delicate, and her skin was flawless. Her hands were beautiful. She didn’t have long nails or any adornments or accessories like rings.\n\nShe placed the little white cat inside a transparent container. Then she put on a pair of disposable gloves, the type commonly used for doing experiments, and brought out a needle. She injected an unknown fluid into the little white cat.\n\nAfter receiving the injection, the little white cat quickly fell asleep. The video then remained trained on the sleeping cat. It was like the woman was just standing still, holding the camera steady.\n\nBut after a while had passed, Han Sen realized that the woman couldn’t have been standing there all that time. She must have put the device in a corner and left it running.\n\nBecause nothing much was happening on the screen, Han Sen fast-forwarded through the video file. He noticed something shocking at the video sped forward. The sleeping white cat grew twice as big overnight. The video ended like that.\n\nHan Sen opened the second video. The image seemed to be the same. He could see the little white cat inside the transparent container. But shortly after, the little white cat woke up, and the woman wearing disposable gloves reappeared. Once again, she gave the little white cat an injection.\n\nThe little white cat, who had just woken back up, was put to sleep again. The woman stroked the little creature’s head and said in a soothing voice, “My good child. You must make it. Mama believes in you.”\n\nInjection… sleep… injection… sleep…\n\nThis process seemed to go on forever. And in this cycle, for seven days, the little white cat grew to the size of an adult tiger.\n\nAs it grew larger, the little white cat began to look more and more familiar.\n\n“Is that actually the white tiger outside?” Han Sen wondered. Honestly, though, he was not too surprised by the revelation.\n\nAnd then, the cycle continued. The little white cat didn’t spend much time awake. For most of the video, it slept under the influence of the injections.\n\nBut its body was continuing to grow. It was now much larger than the mushroom-headed white tiger that inhabited this island.\n\nOn the twenty-third day, the woman discovered that the little white cat had a small and delicate mushroom on its head. Although the mushroom was just the size of a bean, the woman was surprised and said, “Kid, you made it.”\n\nAfter that day, the white cat and the mushroom continued to grow bigger and bigger. The woman’s tests also continued.\n\nOn the thirty-seventh day, the white cat had become a mammoth-like beast. The container was no longer big enough to contain it. While it slept, she opened the container and stood next to the giant white cat’s head. It was like she was taking a selfie. She filmed herself and the little white cat together.\n\nThis was the first time Han Sen had seen the woman’s face. Previously, he had only heard her voice and seen her hands and arms.\n\nWhen he saw the woman’s face, he couldn’t help but scream, “Is that her?”\n\nThe woman in the video was wearing a white lab coat. She had a ponytail, and she was wearing black glasses. She was the woman that had been trapped in Two World Mountain. But she seemed to be a very different person here than she had been when Han Sen met her. She was softer here, although compared to the average person, her personality would still seem distant and reserved.\n\n“Is that her ship? Has she been here before? How did she get out?” Han Sen thought excitedly.\n\nIf that woman had come here and managed to escape, then he should be able to get out, too. But Han Sen didn’t know how the woman had managed to get out.\n\nAnd Han Sen was a little confused about why the woman hadn’t taken her guinea pig with her when she left.\n\nHan Sen needed to find answers to the questions that the video had raised, but the videos came to an end there. He had watched the last one. The final video ended with her and the little white cat sharing a selfie.\n\n“D*mn it! Couldn’t you have filmed a little more?” Han Sen thought in frustration. But at least he had found out that escape from this realm was possible. So that was good news, at least.\n\nHan Sen watched the video to the end, but he didn’t learn anything else. The video just filmed the white cat, and the camera remained in a fixed position. Aside from the selfie at the end, it was almost all filmed from the same angle.\n\n“Captain! This is so bad… Captain! Something is climbing up the island!” a pirate shouted as he knocked on Han Sen’s door.\n\nHan Sen switched off the video, exited his room, and went straight to the command deck. There, he saw that creatures were emerging from the black sea. They were like black snakes. They were as thick as barrels, and their heads were serpentine. Their mouths were oddly squarish when they opened, but they possessed many fangs. They looked very scary.\n\n“There are living creatures in the black sea?” Han Sen was shocked. The corrosive powers of the black sea had been beyond even the deified white whale’s ability to withstand. It was hard to imagine how such creatures could survive in that sea.\n\nWhen those weird snakes emerged, they started to eat the mushrooms on the land.\n\nAlthough there were many mushrooms, there were many black snakes, too. It wasn’t long before they had eaten a few acres’ worth of mushrooms.\n\n“Meow!” came a sharp cry. The white tiger swooped in from the sky, slashing with its claws. The bodies of numerous snakes were ripped apart.\n\nThe injured snakes bled a black juice, but their broken bodies still tried to bring down the white tiger.\n\nThe white tiger slammed its paws down to squish the heads of the snakes into jelly.\n\nThe white tiger didn’t seem to possess area attacks, but its power and speed were very impressive. Its abilities seemed to be deified.\n\nThe white tiger shifted, and it suddenly became a group of white tigers that descended on the horde of weird snakes.\n\nHan Sen knew from the white tiger’s speed that these were not doppelgangers. The tiger was simply moving so quickly that it was leaving behind afterimages. His vision couldn’t follow the speed at which the creature went.\n\nEverywhere the white tiger went, black heads were torn from serpentine bodies. A few minutes later, the ground was littered with the broken bodies of a few hundred weird snakes. The surviving snakes returned to the depths of the black sea.\n\nThe dead black snakes rotted very quickly. They dissolved into black juices on the ground. Most of them slowly trickled back to the black sea, whereas others dried up on land.\n\nAfter all the weird black snakes returned to the black sea, the white tiger roared at the sea, then turned around and went back to the mushroom forest."
}