{
    "chapter": 2262,
    "title": "The Power of Science",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2262",
    "text": "Han Sen’s fingers brushed the silver handle, and before he moved to grip it completely, silver lightning leaped out at his fingers.\n\nA vibration moved through Han Sen’s body, and then he felt as if he had lost control of his own consciousness. There was a sharp cracking noise, and Han Sen was sent rocketing away. His flight ended when he crashed into a white bone wall.\n\nFortunately, Han Sen was wearing his King class Galaxy Lobster armor, so the hit didn’t hurt too much. But his entire body ached, as if cramps were twisting him from the top of his head down to his toes. He convulsed slightly on the ground.\n\n“Well, that was scary. The lightning might not have done too much damage, but the soreness afterward is pretty terrifying!”‘ Han Sen mustered every ounce of his strength to get up. He crawled across the ground as white bubbles frothed from his mouth. He pulled himself into a sitting position, but he still felt extremely weak. He wasn’t able to stand up just yet, so he sat very still as his head spun.\n\nThe blood kirin leaped off of the black kirin’s back. It circled Han Sen, making a low keening sound. It was as if it was saying, “Are you okay?”\n\n“I’m fine. What kind of lightning is that, though? It is so weird. My King class armor did nothing to repel it.” Han Sen understood now why the lightning had been able to hurt the blood kirin, despite the beast ‘s strength. That lightning bypassed all forms of defense and zapped right into a person’s body.\n\nThe blood kirin was unable to answer his question, but Han Sen could tell that the creature was disappointed. It was sad that Han Sen was unable to pull out the weapon.\n\n“Don’t worry; I will find a way to pull it out.” Han Sen thought this was still a good opportunity. He looked into the blood kirin’s face, and he knew that the creature would be incredibly happy if Han Sen managed to retrieve the weapon. Perhaps he could even tame it at that point.\n\nThinking of how cool it would look to ride the blood kirin, Han Sen thought he should give it another try.\n\nThe blood kirin didn’t seem particularly excited by the prospect of another attempt, though. It clearly didn’t believe Han Sen had what it took to remove the weapon from the corpse.\n\nHan Sen wasn’t confident, either, truthfully. But if he was being attacked with lightning, perhaps he could wrap the handle with some sort of insulating material before pulling the weapon out.\n\nHan Sen pulled a bunch of insulated gloves from Destiny’s Tower. He put on several layers of gloves to make sure he wouldn’t get shocked. Then, he flew back onto the black kirin’s back. He looked back at the blood kirin and thought, “Although you are a King class xenogeneic that might one day become deified, you’re still so dumb. You don’t know anything about a little thing called science, do you? Well, big brother will show you how humans make use of their intelligence to solve problems such as this. Get ready to be amazed and compelled to obedience by the power of your big brother San Mu!”\n\nAfter that, Han Sen reached out and grabbed the silver handle. Based on his first experience, Han Sen knew that the lightning was scary, but it wouldn’t be powerful enough to kill him. That reassurance made Han Sen feel a lot safer.\n\nHan Sen confidently wrapped his hands around the silver handle and tried to pull it out. Then, silver lightning was discharged.\n\nThe insulating gloves did not work. The lightning wreathed his entire body before blasting him away. He crashed into a big bone wall, his armored body cracking its surface. Many extra bones were shaken down on top of him.\n\nNow Han Sen could only think, “F*cking science. I actually thought science would apply to this world. I am too naive. This is madness! My brain hurts.”\n\nBecause Han Sen had gripped the handle more firmly, the shock of the electricity was magnified. It took Han Sen half an hour to regain full consciousness, and he didn’t try to move as he recovered. When he started feeling better, he lifted his head to look around. He realized that the blood kirin had actually dragged him away from the white bones.\n\nLuckily, the blood kirin wasn’t hostile towards him. He had been inside the blood kirin’s mouth, but despite that, the creature hadn’t injured him in any way.\n\n“Well, sh*t. How did that even happen?” Han Sen thought gloomily. He rested a little bit more, as his body was on the precipice of a complete recovery.\n\nThe blood kirin looked at Han Sen as if he was a naughty child. That gaze of disdain made Han Sen feel embarrassed.\n\n“I can’t pull a weapon out of a dead body? I won’t accept that!” Han Sen stood up and stared at the handle with rage. When he thought back to the ache that had suffused his entire body, though, he gave up on the idea of trying to grab it again.\n\n“Hmph. I couldn’t make it work, but at least I’m not alone. I have help, so what is there to be afraid of?” Han Sen thought. Then, he released Bao’er from Destiny’s Tower.\n\n“Bao’er, do you see that weapon sticking out of the kirin’s back? It is protected by very powerful lightning, and so I cannot take it out. Do you think you can take it out for me?” Han Sen smiled at Bao’er as he spoke.\n\nBao’er’s eyes opened wide when she looked at the weapon. She thought for a moment, then shook her head. “No.”\n\n“No way! You cannot pull it out, either?” Han Sen was surprised. This was the first time he had heard Bao’er admit so plainly that she couldn’t do something.\n\nBao’er blinked and said, “There’s something wrong with that weapon. Its soul is very messy. It would not be very nice to touch it. I would be electrified if I went up to it.”\n\nHan Sen’s heart sank. Not even Bao’er could take the weapon. There really was no hope for pulling it out.\n\nBut then Bao’er went on. “You can let Little Silver try. He is attuned with lightning, so he might have a way to do it.”\n\n“How did I forget Little Silver!” Han Sen slapped himself on the head. The lightning must have rattled his brain and made him forget Little Silver for a bit.\n\nHan Sen quickly summoned Little Silver. As soon as Little Silver appeared, he hugged the fox tightly to his chest. Then he flew up to the black kirin’s back.\n\n“Little Silver, that weapon has lightning power. I cannot move it, though. Do you think you can pull it out?” Han Sen asked, pointing at the silver handle.\n\nLittle Silver leaped down from Han Sen’s arms. It walked elegantly around the silver handle, its silver eyes peering keenly at the metal.\n\nSuddenly, Little Silver stopped. Its body crackled with silver lightning. That lightning spread fast, and the fox’s body began to swell and transform. Ten tails of lightning rose behind the fox, swaying like the heads of a hydra.\n\nThe next second, that ethereal, lightning form of a fox opened its mouth. It grabbed the silver handle and tried to pull it out of the black kirin.\n\nThe silver handle fired its own lightning in response to the fox, and the bolts of power collided in a display of eye-searing brilliance. It seemed as if the two powers were exploding when they touched each other.\n\nThe lightning didn’t send Little Silver flying like it had Han Sen and the blood kirin. The fox held onto the handle firmly, and slowly, it began to pull the handle up and away from the back of the black kirin.\n\nWithin that storm of silver lightning, Little Silver slowly pulled at the handle, and the weapon slowly began to slide into sight. Han Sen could see triangles across the weapon, and there was a strange symbol within every triangle. Lightning arced and jumped around the symbols."
}