{
    "chapter": 2993,
    "title": "United",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2993",
    "text": "Rain slid down the roof. It landed on a stone board and created some bubbles.\n\nLooking outside, there was an old house at the peak of a mountain. There were also lots of other mountains. The rain created a layer of mist that draped the mountains.\n\nCrunch!\n\nThe rain was very heavy. The door of the old house opened. Because the house was so old, the door made sharp noises. Even the sound of the heavy rain was not able to keep it down.\n\nThe big door of the old house was pushed open. The first thing that appeared was an elegant pair of red high heels. Next, there was a white, smooth, jade leg, and a red qipao.\n\nA woman was wearing a red qipao. She was holding a red umbrella. She walked into the house with her body wagging seductively. Her hair was like a cloud.\n\n“Fortune-teller, how long are you going to hide?” The red-clothed woman with the red umbrella walked into the center of the old yard. She looked at what was in the house and spoke her words like a ghost.\n\nHer voice was soft, but the rain still could not hide it.\n\nThe room had a door with flower carvings on it. It was pushed open. An old man stepped out with a flag. His other hand clutched a wine gourd. He was sitting on a broken square table. After taking a sip of alcohol, he looked at the red-clothed woman, who was outside, and said, “If I were able to hide for one hour, I would hide for one hour. If I could hide for one more second, I would hide for one more second. I would rather survive for as long as possible than be dead. If I can live a bit longer, I will live a bit longer.”\n\nThe rain was too much. The umbrella was very low, so one was not able to see what the red-clothed woman looked like. Yet her ridiculously curvy body and long black hair, which looked like a waterfall, were very eye-catching. One may not have been able to see her face, but one could recognize her.\n\n“I am afraid you would prefer death compared to living,” the woman chillingly said as she stood in the rain.\n\nThe old man laughed and said, “That means you are here to collect my life.”\n\n“It depends on whether you are accurate or not,” the red-clothed woman said. “That will determine if I take your life.”\n\nThe old man picked up his gourd and had another sip of alcohol. He squinted his eyes as he asked, “So was I accurate or not?”\n\n“You were accurate but also not accurate,” the red-clothed woman replied.\n\n“I really don’t understand what you are saying.” The old man laughed as he asked, “Which is accurate, and which is not accurate?”\n\nThe red-clothed woman was silent a moment before saying, “The prediction you did for my master was very accurate. The god palaces appeared again, but the other half is not accurate. The god palaces did not break through. They still suppress a full sky.”\n\nThe fortune-telling old man laughed. “Master is in too much of a rush. It is not time yet.”\n\n“There is only a month left,” the red-clothed woman said. “Even an Annihilation god temple has yet to be broken. I do not see how the geno hall will be broken in a month.”\n\n“When the time comes, you will understand.” The fortune-telling old man looked dull. He looked at the red-clothed woman and said, “But I suggested it first. Your master needs to do as the old man says. If there is no mistake, the prediction will come true.”\n\n“I am here for that,” the red-clothed woman said. “My master does not understand why he must do that. What does it have to do with breaking the god palaces? That person has the ability, but he has never reached that level. With his power, he cannot break the god palace.”\n\n“Predicting someone’s fate is not easy. The old man traded his whole life to get this result. About the progress, I, the old man, cannot predict it all. If you do not believe the old man, you do not have to do it.” The fortune-telling old man spoke as if he did not care.\n\n“I hope you are right. Otherwise, you should know that if you make the master mad, even that guy in the geno hall will not save you. From now on, you stay here. Until that day comes, you can predict your life. You can’t blame others.” The red-clothed woman turned around and left after speaking. In the rain, she walked until the rain covered all vision of her body.\n\nThe old man squinted his eyes and looked at the sky full of rain. He said to himself, “If I did not want to, do you guys think you can really find me and trap me here? You really underestimate me, Han Jinzhi.” While he was speaking, the old man was holding the wine gourd and the cloth, which had the word “destiny” written down. He walked out of the living room and headed for the yard behind the old house.\n\nThe raindrops dripped off the old man, wetting his clothes and hair. Only the cloth that told one’s fortune did not touch any water. It was like it was immune to the rain.\n\nThe old man walked to the farthest part of the yard, which was the highest point of the mountain. He waved his hand and walked a few circles in the yard. After a while, he calculated something. He paused for a bit before placing the cloth into the gap of the stone board. He walked back a few steps and looked at the cloth. He fixed the angle and position. With a look of satisfaction, he said, “The end is not the end of fate. I, Han Jinzhi, cannot change fate, but I will not let that moment be the end.”\n\nAfter that, the old man walked back into the living room. He laid on the broken bed and yawned. He quickly fell asleep. Han Sen and Bai King spoke for a while. Han Sen then left the asteroid field. Bai King wanted to kill Moment God. It did not seem like a mere coincidence. He knew the relationship between Han Sen and Golden Growler, so he must have known Han Sen was planning to save Golden Growler.\n\nBai King had also mentioned he had a way to break the time god powers that had claimed Golden Growler, which would allow Golden Growler to be set free. He could then use Golden Growler’s power to fight Moment God.\n\nAfter everything came together, Bai King planned to kill Moment God. Bai King did have a request. After Moment God was killed, he wanted to be the one to take the god personality armament.\n\nHan Sen did not have a problem with that. He lacked the confidence for killing Moment God by himself. If it worked, he was fine with giving Bai King the god personality armament. In Bai King’s plan, he needed to have Dollar do it. He also needed to cooperate with Han Sen. That very much troubled Han Sen.\n\nBai King only knew Dollar was the Holy Baby. He did not know Dollar was Han Sen too.\n\nHe saw Han Sen go to save Golden Growler, and he agreed with Han Sen’s power too. He asked Dollar to contact Han Sen so that he could chip in and help them out.\n\nHan Sen thought Bai King knew his secret, which is why he asked him. After Bai King’s explanation, he knew he had no clue.\n\nBai King only knew Dollar was the Holy Baby and that the Holy Baby came from Space Garden. Thus, he guessed that Dollar was a good friend of Han Sen and wanted him to contact Han Sen.\n\nBai King never imagined a crystallizer and a xenogeneic would have been the same person. “Where am I going to find a Han Sen for him?” Han Sen had a wry smile. Although Space Garden had many elites, none of them had developed fully. He could not find anyone who was able to disguise himself as Han Sen or Dollar."
}