{
    "chapter": 2980,
    "title": "Moment God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2980",
    "text": "After Fox Queen’s departure, Han Sen did not think this was right. Why had Fox Queen appeared right then and there? She had not selected any other God Spirit. She had just happened to choose him, who had only just appeared in his own god temple.\n\n“To be able to do tricks in a god palace, it must be that God.” Han Sen started to think it must be related to God, who was possessing Gu Wan’er.\n\n“No way, I cannot keep using this god temple. If it keeps opening, perhaps something bad might happen.” Han Sen thought about this and put away his Sky God Crown. He left his god temple.\n\nAfter Han Sen put away the Sky God Crown, the God of Wealth Temple shut down. Because there was no god inside the temple, no one could go there and challenge it.\n\n“What does that God want from me? In the god lists fight, the one in second place was only able to earn a Destruction class god personality armament. Even if I was in first place and leveled up one more, I would just receive a Disaster class god personality. Is it not too much to give an Annihilation class god personality armament to someone?” Han Sen was confused. God must have done all of that on purpose.\n\nNow that he thought about it, even that God would not have expected Golden Growler to give him the first seat. There was no way he would have expected that.\n\n“Was that decision made immediately?” Han Sen still did not think that was right.\n\nHan Sen was not able to come to a conclusion he liked, so he stopped wasting time. He looked at the sky full of god temples and scanned it for No World God’s temple. He wanted to fight No World God first.\n\nWhen Han Sen discovered No World God Temple, he noticed No World God’s god temple was still shut down.\n\n“He is not here.” That depressed Han Sen. Judging from the experience he had as a God Spirit, God Spirits only had three ways to shut down their god temple.\n\nOrdinarily, they were only allowed to shut down a god temple for a short period of time. That allotted time was the only time a God Spirit could leave the god palaces. They were not able to be gone for a long time. Every time after using that permission to leave, it would be a long time before they were allowed to leave again.\n\nThe other way was if the God Spirit had been slain once. It did not matter if the God Spirit was swapped. If the God Spirit was willing, they could shut down the god temple for an entire month.\n\nOf course, they were not likely to give up that right.\n\nThe longest time a temple could be shut down was for the duration of time a God Spirit possessed a creature of the universe. If they left their god temple like that, their temple could pretty much be closed forever. No one was able to challenge them. One had to wait until the God Spirit returned. Then, the God Spirit’s ability to be challenged would be re-enabled.\n\nFox Queen entered the temple and made a wish. Every creature saw that. Although they did not know what happened after Fox Queen exited the temple, it gave people very strange feelings.\n\nMany creatures wanted to go to the god temples for the creation of wishes. They had all sorts of wishes to make.\n\nThe God Spirits would not mind those people coming to make their wishes either unless it was for some special reason. Otherwise, not many God Spirits would have killed the wishers.\n\nBut that was in the future. Han Sen did not have time to care that much. After he went silent for a bit, he flew toward a god temple amid the god palaces. No World God was not there, so Han Sen selected another God Spirit that was Disaster class. He wanted to see how strong a Disaster class god spirit was.\n\n“Huh? Is that Dollar?”\n\n“It is him! The universe’s god list first elite is challenging a God Spirit.” “What god list first elite? Golden Growler gave that to him.”\n\n“Regardless, Dollar’s power is very strong. I wonder what level of God Spirit he will challenge.”\n\n“It will most likely be a Destruction class one. After all, no creature dares to challenge a Disaster class God Spirit.”\n\n“No way! He is flying to a higher level of god palaces. Is he going to save Golden Growler?”\n\n“Stop making jokes. Han Godfather and those two true gods from Empty Mountain were beaten by Moment God with ease. Dollar would die by going there.”\n\n“It is hard for us to say. Dollar and Golden Growler’s relationship is special. Golden Growler gave him the first place. It is only fair that he would try to save him, right?”\n\nAfter a while, many creatures watched Han Sen fly toward a Disaster god palace. Someone said, “There’s no way he’s going to challenge Moment God. That would be him having a death wish.”\n\n“Golden Growler really is blind. He gave him the god list’s seat. It is just like Godfather Han.”\n\nWhile everyone was talking, Han Sen entered the radius of the god temple. He was on the god temple’s plaza.\n\nIt was a very old stone god temple. The god temple looked like a medieval church. The god temple had two floors. There was a big stone clock.\n\nThe minute, hour, and second hands were ticking slowly. It was like a normal watch but very large.\n\n“Moment God.” Han Sen looked at the god’s title on the god flag. He was shocked.\n\nAnyone knew that this Moment God could be a Time Disaster God Spirit. Han Sen had come to challenge Moment God because he wanted to see how things fared in xenogeneic mode. He wanted to see if he could fight a Disaster class God Spirit so he could ready himself to fight Moment God in the future.\n\nThey were both time element God Spirits. If he was unable to fight a Disaster class God Spirit, he could not fight an Annihilation class Moment God.\n\nA sharp and squeaky voice came from the god temple’s stone door. “Heaven has roads we do not walk. Hell has no doors, and you come knocking. Do you have a death wish?”\n\nWith that sound, the stone door opened up. A shadow emerged from the god temple.\n\nHan Sen and the races of the universe’s creatures and people stared at the God Spirit that was coming out from the god temple. This was the first time someone had sought to challenge a Disaster class God Spirit. It was a very eye-catching sight.\n\nWhen that shadow walked out of the stone temple’s door, many creatures saw that it was a weird creature.\n\nIt looked like a human, but its skin was a black carapace. It looked like a human bug.\n\nIts eyes were very weird. The eyes had no pupils. They were just white. Within the eye white, there was the illustration of a clock. It included the hands that told the time and the numbers they went around.\n\nHan Sen was not about to underestimate this foe. After all, he had never fought a Disaster God Spirit before. The God Spirits he used to kill were all Destruction class. He held the Sky Vine Radish God Lance and gathered up the power on the tip of the lance. He used the Dongxuan Sutra to the max. Suddenly, the whole universe was a complicated machine in Han Sen’s eyes. Countless universes were spinning.\n\nBzzt!\n\nA lance was thrust forward. It was like space was punctured by that lance. It went in front of Moment God.\n\nMoment God coldly smiled. Its left eye was like a watch. The needles rotated quickly. The speed of Han Sen’s lance was fast, but Moment God was faster. It went left a little and avoided the attack of the Sky Vine Radish God Lance.\n\nHan Sen’s expression did not change. The lance was like heavy rain striking down, but Moment God moved swiftly. It was like it could just move without thinking. Han Sen’s heavy storm-like lance attack did not touch its body."
}