{
    "chapter": 1684,
    "title": "Accidentally Meeting Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1684",
    "text": "Crash!\n\nHan Sen hit the ground hard, writhing around as if his bones were about to snap. He felt sure that the composition of his body had become softer.\n\nHe set a hand on the floor to pick himself up and noticed that he was lying on something very soft. It gave him a shock. He heard a scream, and he jumped up and away from the noise.\n\n“It’s you!” Han Sen and another voice spoke the same line at the same time.\n\nHan Sen looked at the floor. There was a red, fox-like cat standing there. It was the Nine-Life Cat.\n\nHan Sen hadn’t seen the Nine-Life Cat since he left the last time. Han Sen didn’t expect to see him again, especially under these conditions.\n\n“No way! The Nine-Life Cat should be in the Fourth God’s Sanctuary. I have already leveled up to the Alliance, so why am I seeing it here? Did it ascend, as well?”\n\nNine-Life Cat looked at him with shock and confusion.\n\n“Why are you here?” Again, they spoke the same line at the exact same time.\n\nHan Sen pointed at the Nine-Life Cat tattoo on his back and said, “This brought me here, I think?”\n\nNine-Life Cat looked at Han Sen, but it could not see the tattoo he was referencing. Han Sen turned around so the cat could see the tattoo. The shock on the Nine-Life Cat’s face deepened.\n\n“Is this a bad thing?” Han Sen asked with worry.\n\nNine-Life Cat walked closer to Han Sen and checked his tattoo out Then, he jumped on his shoulder, touching the tattoo. “What is it? Say something!” Han Sen demanded when the Nine-Life Cat remained silent.\n\nNine-Life Cat jumped off of Han Sen’s shoulder and then leaped atop a tablet, saying, “It’s not bad. But if you go out, people will think you are a part of Nine-Life Cat”\n\n“Go out where?” Han Sen asked without thinking.\n\nBut then Han Sen realized what the cat was implying. He looked at Nine-Life Cat, and if going out meant what he now had in mind, it really was quite shocking.\n\nNine-Life Cat gave him a very human-like smile, and he said, “Ah, you won’t understand. You can’t get out of here, anyway.\n\nIt doesn’t really matter for now.”\n\n“Do you mean getting out of the sanctuary?” Han Sen still wanted to ask.\n\nNine-Life Cat looked surprised, but he didn’t answer. He just used one of his paws to scratch his side as he repeated himself. “You can’t get out of here, anyway. It doesn’t really matter for now.”\n\n“Just in case I need to know, you should tell me!” Han Sen wanted to punch the kitty to get him to answer the question.\n\nNine-Life Cat laughed and said, “It’s nothing much. I’m just saying that Nine-Life Cat does not have a good reputation out there. If you are lucky enough to get out, just don’t let anyone else see your tattoo. If it gets you killed, don’t take it out on me.”\n\nHan Sen’s heart sank. “Can I remove it?”\n\nNine-Life Cat rolled his eyes. “It has merged with your body. It’s a part of you! You really think it’s possible to remove something like that?”\n\n“Fine! Cut the crap!” Han Sen yelled. That was not the answer he had been hoping for. “I’m busy, and I’m running out of time and patience.”\n\nNine-Life Cat jumped off of the tablet and started walking in another direction. Han Sen noticed that they appeared to be in some sort of graveyard. The tablet Nine-Life Cat was sitting atop was a headstone.\n\nBehind the stone there was another one, half-covered by patches of grass. Surprisingly, the grave was smaller than the sort you might expect to see for a human.\n\nHe looked at the headstone, but he was unsure of what it was dated. All the text across its surface was faded. Some very light markings were visible, but what they meant, he hadn’t a clue.\n\n“What are you doing? Follow me!” Nine-Life Cat gazed back at Han Sen with a look of annoyance.\n\nHan Sen followed as he was bid to, and they walked past many headstones. They were all in various states of decay, so he couldn’t learn much about where he was.\n\n“What is this place? Some kind of old graveyard?” Han Sen asked Nine-Life Cat after catching up with him.\n\nNine-Life Cat smiled and said, “This is the Fourth God’s Sanctuary. We’re not in the Alliance.”\n\nThat’s what Han Sen had thought, but when it was confirmed, he really was given a shock. “No way! This is the Fourth God’s Sanctuary? I thought after you go to the Alliance, you aren’t allowed to come back. And why is my body not being harmed by being here?”\n\nNine-Life Cat used his claws to point at Han Sen’s new tattoo and laughed. “With this tattoo, it’s not only the Fourth God’s Sanctuary you can return to. If you want, you can hop back into the First God’s Sanctuary. Why? Because now you are a part of Nine-Life Cat.”\n\n“What is Nine-Life Cat exactly?” Han Sen asked.\n\nHan Sen was curious about this. He only knew that it had some connection to the elusive Human Emperor and that the Nine-Life Cat was some sort of a mascot for Blood Legion. It was like a representative symbol.\n\nHan Sen thought Nine-Life Cat might have been a strong creature that followed Human Emperor. But all things considered, that no longer seemed likely. Nine-Life Cat, whatever it was, was bigger than what he was thinking. It looked like it was even connected to some pretty big things beyond the sanctuaries.\n\nBut now Han Sen remembered people had told him that Human Emperor took Nine-Life Cat as something serious. Han Sen didn’t care for it very much, but now, things obviously weren’t so simple.\n\n“I told you that you wouldn’t understand. If you can get out, though, you will know.” Nine-Life Cat did not want to talk about this much.\n\nHan Sen wanted to ask some more, but Nine-Life Cat suddenly stopped moving.\n\nHan Sen saw a headstone marking a grave. It was similar to the other tablets, though, in which the words had all faded away.\n\n“Since you are here, help me dig this grave up.” Nine-Life Cat pointed at the small, grass-laden headstone.\n\n“We’re digging up graves now? This is horrible! You can do that yourself!” Han Sen shook his head.\n\nHan Sen did not know what the kitty wanted, and there was a chance that the creature would put him in danger. Whatever the case might have been, he wasn’t quite willing to risk it.\n\nNine-Life Cat rolled his eyes and jumped atop the grave. With his little paws, he started to dig. He told Han Sen, “Fine! You don’t have to dig, but as for the special item that might reside below, you will have nothing to do with it!”"
}