{
    "chapter": 2693,
    "title": "Blood Marrow Geno Fluid",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2693",
    "text": "The Red Blood Demon wasn’t like ordinary primitive deifieds. Not even Han Sen’s Apollo Set would be enough to let him fight the creature.\n\nHan Sen had already stated his intentions. He was going to kill the Red Blood Demon. Han Sen acted as if it would be the simplest thing in the world, but to any of the Very High, it would have sounded like he was daydreaming.\n\n“If you don’t believe me, then feel free to wait around. It isn’t my time that’s being wasted, after all.” Han Sen shrugged, as if he didn’t care one way or another.\n\nAfter that, Han Sen settled himself next to the stone pavilion to rest. The damaged Apollo Set would take a while to recover, as well.\n\nFortunately, the Apollo Set was good at mending damage it had sustained. If it hadn’t possessed such advanced self-repair abilities, it would have been a pile of scrap metal already.\n\n“Red Blood Demon’s fighting abilities are overpowered. If I was already a primitive deified, killing it would be easy. But right now, as I am, depending on the power of treasures will make it very difficult for me to bring this beast down.” Han Sen kept thinking about how he fought before. He was trying to find a way in which he might kill the Red Blood Demon.\n\nBecause Exquisite and Li Keer had been focusing on practicing Under the Sky, they hadn’t been visiting Han Sen very often. Han Sen thought that he was right on the precipice of his chance to succeed. He just needed to find a chance to fight the Red Blood Demon when they were not around. Then, he could use whichever geno art or beast soul he fancied.\n\nLi Xue Cheng frowned. The Very High were very strict about their rules. Even though he was one of the Very High, he couldn’t circumvent the rules.\n\nIf Han Sen wasn’t going to give up, Li Xue Cheng really would have to wait another month. If Han Sen couldn’t kill the Red Blood Demon before the time limit, Li Xue Cheng could register for permission to enter and slay the fiend.\n\nBut Li Xue Cheng was being hung to dry. He was in a rush to get as many resources as possible, so he didn’t want to wait a month.\n\nHe rolled his eyes. He walked to the stone pavilion, looked at Han Sen, and said, “You said you will find a way to kill the Red Blood Demon, right?”\n\n“That is correct,” Han Sen said with a nod. He had been fighting the Red Blood Demon for a while now, and he hadn’t really gotten much out of it, other than a general understanding of the Red Blood Demon’s capabilities.\n\n“Very good,” Li Xue Cheng said, nodding to himself. Then, he turned around and left. That surprised Han Sen. He wasn’t sure what the man meant by that.\n\nHan Sen had thought Li Xue Cheng would hang around and annoy him for a while, but the man left without another word. Han Sen thought about the expression he had seen on Li Xue Cheng’s face, though. It was unlikely that the man would give up so easily.\n\nLi Xue Cheng left Jail Demon Hall to seek out Liyu Zhen.\n\n“You know that Han Sen has been in Jail Demon Hall trying to kill the Red Blood Demon, right?” Li Xue Cheng asked Liyu Zhen.\n\n“So? Does it matter whether I know this or not?” Liyu Zhen was annoyed by just hearing Han Sen’s name. He had lost so much on his wager during the silkworm fights. Although his family had paid off much of the debt, he still had a lot he needed to repay. Paying it all off would be incredibly difficult.\n\nAt this time, Liyu Zhen was in no mood to wonder about what Han Sen was doing. Just thinking about how to pay off all of his debts was enough to make his head explode.\n\n“I was going to ask for someone’s help to kill the Red Blood Demon and gather more resources, but Han Sen registered to kill the Red Blood Demon before I did. I need to wait another month before I can register,” Li Xue Cheng explained what had happened.\n\n“What is that supposed to mean?” Liyu Zhen didn’t understand why Li Xue Cheng was bothering to tell him all this. The Very High were strict when it came to the law. The two young men had no choice but to abide by them. If Han Sen had already registered for permission to hunt, then as long as he didn’t concede, no one could go there and attempt to steal his kill.\n\n“As far as I know, he has been in the Jail Demon Hall for a while. He has been fighting the Red Blood Demon every day. I don’t think he can actually kill the Red Blood Demon. I think he wants to use the Red Blood Demon to practice his fighting skills. I think he will keep going until his time there is up,” Li Xue Cheng said.\n\n“Is there a problem with that? Many of our people do the same thing.” Liyu Zhen still didn’t understand what Li Xue Cheng was talking about, but he knew the other man had to be hinting at something.\n\nUpon hearing Liyu Zhen say this, Li Xue Cheng laughed. But there was something sinister in the sound of his laugh. He said, “You know that many students of our race have done this in the past. Why have fewer attempted such a thing in recent years?”\n\n“That is because…” Liyu Zhen trailed off halfway through his response. He now understood what Li Xue Cheng was getting at. He looked at Li Xue Cheng with shock and said, “You want to use the glitch in Jail Demon Hall to kill Han Sen? That isn’t very nice. If the rest of our people find out, it will be considered a huge crime. We might end up being exiled to confinement on a small and empty island.”\n\n“Not if Han Sen activated the glitch himself. If that happened, it would have nothing to do with us,” Li Xue Cheng grinned darkly. He then went on to say, “He was the reason that we lost everything. Are you really going to sit back and accept that?”\n\n“Jail Demon Hall’s restrictions originally weren’t as strong as the real body of the Red Blood Demon. Because of that, the beast almost managed to escape. When it was realized how close the Red Blood Demon came to escaping, our elders added another security measure to guarantee that the Red Blood Demon could never break free. If the doppelganger gains enough power to break out of the first level of restrictions, then the extra security protocol goes into effect. Jail Demon Hall instantly goes into complete lockdown. A long time ago, one of our primitive deified warriors was battling the Red Blood Demon. The Red Blood Demon became enraged and activated that special restriction. When the Jail Demon Hall went into lockdown, it trapped that primitive deified inside. He was unable to teleport away. When they opened Jail Demon Hall again, they found that the Red Blood Demon had already eaten the man. All that was left of him was a little blood on the floor.”\n\nLiyu Zhen said quietly, “But when that happened, they decided to modify the restrictions. They increased the level of power needed to trigger it. Unless the Red Blood Demon went completely nuts, I don’t think it would be able to trigger that security measure again. Han Sen can’t really threaten the Red Blood Demon, so there’s no way he could inspire that much fury in the creature. So, how could he trigger the glitch?”\n\n“If he isn’t able to do it, we can help him. Every time he leaves the hall, he’s badly injured. He uses Very High geno fluids to heal. You’ve met the man before, and you have a connection to the current situation that I think we can exploit. I’m sure you can give him some better geno fluid to recover, right?” Li Xue Cheng said.\n\n“You mean like Blood Marrow Geno Fluid?” Liyu Zhen’s eyes brightened. Now he knew what Li Xue Cheng really meant.\n\nBlood Marrow Geno Fluid was made from the Red Blood Demon’s xenogeneic genes. It was very good for recovering from injuries. Of all the healing geno fluids that existed, it was one of the priciest. It was usually used by deified elites.\n\nIt worked very well for deified wounds, so its efficiency with Kings went without saying. As long as a person wasn’t dead, they could be healed in a short amount of time.\n\nBut not many knew that because the Blood Marrow Geno Fluid was made from the Red Blood Demon’s xenogeneic genes, the Red Blood Demon was very sensitive to it. Using a small amount wouldn’t have much of an effect. But if Han Sen used too much and then entered Jail Demon Hall, it might trigger the true ire of the Red Blood Demon."
}