{
    "chapter": 2418,
    "title": "Swapping Minds",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2418",
    "text": "While Miss Mirror was speaking with two of the four Spring Rain Kings, whose names were Red Cloud and Night Wind, a sound erupted from Han Sen’s place, interrupting their discussion.\n\n“I am stupid!” someone screamed.\n\nThe three of them swapped strange glances. The voice undeniably belonged to Falling Leaf, but they couldn’t believe Falling Leaf would ever yell those words.\n\nAside from Miss Mirror and the four Kings of Spring Rain, Falling Leaf was known as one of Spring Rain’s best. She was a very cruel woman, but she worked hard. She was proud, violent, and always ready for a fight. How could those words pass through the mouth of someone like that?\n\n“Was that who it sounded like?” Night Wind turned to Red Cloud and Miss Mirror with a confused expression.\n\n“We’ll end things here for now. You two can go home.” Miss Mirror frowned. She stood up and went to Han Sen’s place. She wanted to see what Han Sen was up to.\n\nA woman like Falling Leaf wasn’t someone who could be forced to say anything of the sort. She would rather die than make that sort of admission.\n\nIf Han Sen had used some trick to fool Falling Leaf, Miss Mirror wouldn’t ignore such a transgression. She had sent Falling Leaf to look after Han Sen, but she wouldn’t stand for the woman being bullied.\n\n“Why are you here?” Han Sen asked with a pleasant smile when he answered the door and saw Miss Mirror.\n\n“What did you do to Falling Leaf?” Miss Mirror frowned.\n\n“What did I do to her? I haven’t spoken much with her. She’s been playing with Bao’er all this time. Go and take a look, if you want to.” Han Sen moved aside and gestured for her to enter.\n\nMiss Mirror didn’t believe Han Sen. She walked through the entry and went into the living room. There she found Falling Leaf playing card games with Bao’er.\n\n“Miss Mirror!” Falling Leaf shot to her feet and bowed.\n\n“Are you okay?” Falling Leaf’s forbidding face was covered in little stickers. The sight almost made Miss Mirror want to crack up in laughter.\n\n“I’m okay.” Falling Leaf’s face blushed deeply, but she didn’t remove the pieces of paper stuck to her face. She was a killer, and killers always kept their word. She might have lost the game, but she wasn’t going to disgrace the rules.\n\n“I’m glad to see you are okay.” Miss Mirror looked at Han Sen and said in a hard voice, “Follow me.”\n\nHan Sen shrugged and followed Miss Mirror into the garden.\n\n“You know Falling Leaf is one of my people. You should be careful how you choose to treat her.” Miss Mirror settled herself into one of the garden chairs and looked at Han Sen as she spoke.\n\nHan Sen laughed. “I haven’t done a single thing to her, and I wouldn’t want to do anything to offend her, either. She is merely playing with Bao’er. You can ask her if you don’t believe me.”\n\n“It is good that you haven’t mistreated her. I’m just warning you, though. Don’t do anything that will make her or me unhappy,” Miss Mirror said in a firm voice.\n\n“Understood.” Han Sen shrugged again.\n\n“Give me your hand.” Miss Mirror was looking at the ring Han Sen wore, and her request came with the glimmer of hesitation.\n\nAlthough Han Sen wasn’t a bad fighter, he was too low level. Miss Mirror didn’t think Han Sen, with his current power, could be of much assistance to her. But since she was there, she knew it would be a good idea to get to know him a little better.\n\nThe mind and the heart were inseparably linked, so the best way to learn someone’s personality was through their mind. It was a very accurate way of reading people.\n\n“What are you doing?” Han Sen asked as he extended his right hand in front of Miss Mirror.\n\n“Are you playing dumb?” Miss Mirror stared at Han Sen.\n\n“Of course not. You should have just told me more clearly.” Han Sen laughed and pulled back his right hand. He extended his left hand instead, the Mirror Spirit Eye Ring glinting on one of his fingers.\n\nMiss Mirror observed the Mirror Spirit Eye Ring, and a lump rose in her throat. Seeing the ring made her mind harken back to the man who had once worn it. That man had been smart and gentle.\n\nEven now, thinking of that man made her heart leap.\n\nMiss Mirror never regretted marrying that man. Choosing him had been the most precious experience in her entire life, but God hadn’t allowed her to be by his side forever.\n\nThinking of that man would have made any woman’s heart jump, and then seeing the current master of the ring, Miss Mirror could only sigh.\n\nAlthough Han Sen was good, compared to that man, she thought he couldn’t begin to compare.\n\nMiss Mirror reached out her hand and put her Mirror Spirit Eye Ring next to Han Sen’s ring.\n\nMiss Mirror’s face didn’t possess supermodel-like beauty. She wasn’t as hot as someone like Gu Qingcheng, certainly. She was more like a well-dressed and mature lady.\n\nBut Miss Mirror’s hands were too pretty to criticize. Every finger was long and slender. Her skin was white like jade, and her nails glittered like crystals.\n\nHer hands were lovely and elegant. Han Sen had seen many pretty women in his time, but this was the first time he had ever seen such beautiful hands.\n\nMiss Mirror’s hand came closer to Han Sen, and the Mirror Spirit Eye Ring reacted. The emerald ring began to glow.\n\nWhen those two eye-like gems touched each other, Han Sen and Miss Mirror both shivered. They felt a strange power generate in the Mirror Spirit Eye Rings, and then the power went into both of their bodies. The energy traveled up their arms and straight into their brains.\n\nHan Sen’s body vibrated. He looked around, finding himself in a place where it was raining. The springtime rain was falling as if God himself was crying.\n\nBut when those tears fell, they watered everything around him. The trees, the flowers, the grass, the chestnuts. The rain soaked into all of them, and the sadness held within the rain provided a source of infinite lifeforce and hope.\n\nHan Sen had studied the forty-eight water minds of Destiny’s Tower, and the spring rain mind was one of them. Miss Mirror’s mind was spring rain, but it wasn’t focused on the rain itself.\n\nHan Sen felt the way her emotions shifted and swayed within her mind. Suddenly, he really admired this woman. This mind was professional and enduring. It was like the strongest a deified being could achieve.\n\n“No wonder her organization is called Spring Rain. This mind can only be felt. It isn’t something that could be explained. Achieving this sort of mind is very difficult. Miss Mirror is a very complicated and even contradictory woman. I cannot judge her as I normally would another.” As Han Sen observed and sensed the spring rain mind, he learned much from it.\n\nMiss Mirror’s body shivered, too. She felt a mind inside her consciousness.\n\nBut that mind wasn’t too strong or surprising. It didn’t impress her much.\n\nMiss Mirror didn’t take Han Sen’s mind seriously, as she had only touched their rings together so she could learn more about him. But when the presence of his mind began to expand, Miss Mirror was stunned.\n\nWhat Miss Mirror saw, in terms of Han Sen’s mind, was something akin to a flower ready to open. The mere bud might not have been very impressive, but as she tried to understand, she peeled away the petals. But try as she might, she couldn’t peel them all away. She couldn’t get to the center of the flower, and that disturbed her."
}