{
    "chapter": 890,
    "title": "The Power of a Bucket of Water",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_890",
    "text": "Han Sen slowly stepped away. If he wasn't injured, he'd have happily continued his approach, slain the toad, and grabbed the watervine.\n\nBut for now, he couldn't do that. Once he was healed, however, he resolved to return and kill it.\n\nThe toad, fortunately, did not seem to have noticed Han Sen. So, without trouble, Han Sen decided to go back. After fetching a bucket of water, he took off back to the house with Meowth at his side.\n\nChu Ming saw Han Sen riding Meowth on his way back. With surprise, he said, \"You have a pet beat soul? What class is it?\"\n\n\"Sacred-blood from the First God's Sanctuary,\" Han Sen responded.\n\n\"What is the point of bringing it here, then?! You could probably walk faster than that useless thing!\" Chu Ming exclaimed.\n\n\"I am injured right now, don't you recall? I'm only riding it due to my injury.\" Han Sen hopped down off of Meowth and retrieved the bucket of water being carried in his pet's mouth. Then, after approaching the tree, he poured the water on its roots.\n\nHan Sen touched the tree and slyly dropped a lifeforce waterdrop to its root, as well. It was quickly absorbed.\n\nAfter that, Han Sen put the bucket aside and started walking back to the house so he could rest.\n\n\"That's it?!\" Chu Ming yelled with shock and aggravation.\n\n\"Yeah, that should do it.\" Han Sen nodded.\n\n\"You toss some water on the ground and tell me that should do it? After all that waiting around?!\" Chu Ming could hardly believe what he was hearing.\n\n\"Well, what else do you expect me to do?\" Han Sen smiled.\n\nChu Ming's mood had dropped a considerable amount, and so he said, \"I knew I shouldn't have placed any modicum of faith or hope you could aid us and this tree. Pah! What an imbecile. What use is that water going to provide, eh?\"\n\n\"I don't know. Maybe it'll be a boon and instigate the tree's revival? It might work. It might not.\" Han Sen then continued toward the house.\n\nChu Ming wasn't keen to let this go, and his temper had been inflamed. He turned to Qu Lanxi and said, \"This yahoo is toying with us. A three-year-old could toss water on the roots of a tree.\"\n\n\"He is still very injured. We can't exhaust him too much.\" Qu Lanxi wasn't half as disappointed as Chu Ming, primarily due to the lack of hope she had for the tree in the first place.\n\nOnly Chu Ming was sulking, but there was nothing he could do about it. And as much as he might have liked to, killing his burden and woe-bringer Han Sen would not achieve anything.\n\nAfter Han Sen poured water onto the roots, he was done with the tree for the day. He planned to examine its lifeforce the day after.\n\nIf the Dragon-Blood Tree could absorb one such waterdrop a day, then it meant he'd have to find more plants; a lot more.\n\nHan Sen lay down on the bed and practiced the Blood-Pulse Sutra, hoping his health could fully return quickly. Meowth was around the gourd often, showing a new interest in the item.\n\nNothing new had come from the gourd, since Han Sen's arrival in the Third God's Sanctuary. Aside from its continued pulsing, nothing had changed with it.\n\nWhen Han Sen had nothing more to do and was bored, he spent some time with the gourd, pleading for it to deposit the weapons inside it. He tried a number of ways to get them out, but every method resulted in failure.\n\nThe next day, Han Sen was woken to Chu Ming shouting again; he was becoming his morning rooster, it would appear.\n\n\"How is that possible?!\" Chu Ming spoke with complete shock and disbelief, but his body had frozen like a cartoon statue, as he stared at the tree in the yard.\n\n\"What is it this time?\" Qu Lanxi walked out of the house and then froze mid-step; she too had caught sight of the tree.\n\nThey were in greater shock now than they had been upon seeing the tree first sprout its leaves.\n\nHan Sen soon followed them out the house, and when he did, Chu Ming ran towards him in a crazed dash. He grabbed his clothes and said, \"You! How?! How did you do that?\"\n\n\"How did I do what?\" Han Sen asked.\n\n\"How did you make the Dragon-Blood Tree razzle and dazzle like this?\" Chu Ming pointed towards the tree as he spoke.\n\nHan Sen looked at the tree and even he himself was surprised by what he saw. The tree's branches and twigs were all decked out in full, healthy red leaves. It looked like a gorgeous maple tree.\n\nOvernight, the tree had grown as if it had received appropriate nourishment every day for the past several months.\n\n\"It grew that fast?\" Han Sen did not expect the tree to grow this much, after the length of a single night, following an absorbance of one waterdrop.\n\nIf he had known this would happen, he wouldn't have used an entire waterdrop. It was too obvious something was afoot, and the sudden flourishing of the tree would be far too suspicious.\n\n\"San Mu, what did you do? How did the tree grow that fast?\" Qu Lanxi politely asked Han Sen, in utter surprise at the morning's revelation.\n\nIt was difficult to believe that a Dragon-Blood Tree could grow into such a beautiful state overnight through natural circumstances and methods of cultivation.\n\n\"You saw what I did, didn't you? I fetched a bucket of water and simply poured it on the roots of the tree. I didn't do anything else.\" As Han Sen made his excuse, he swore to himself he'd never use an entire waterdrop again.\n\n\"But that was just river water; there is no possible way it could turn our tree into something as remarkable as this. Tell me, my darling cur, what did you do?!\" Chu Ming's delight had slowly curdled into annoyance. With his rudeness seeping back into his words, he asked Han Sen with an irritated tone.\n\n\"Believe it or not, but I really did only pour out a single bucket of water,\" Han Sen said with a wry smile.\n\nThey did not entirely believe what he was saying, but they felt like that they had to. After all, they had watched him pour the bucket of water on the tree and later return indoors for the night.\n\nFurthermore, Han Sen was injured and had no money. Even if Han Sen bought beast-blood, they should have been able to see it.\n\nAlthough things were oddly suspicious, to the best of their knowledge, Han Sen really did only pour out a bucket of water onto the roots of the tree. And following that, somehow, the Dragon-Blood Tree was flourishing crazily fast.\n\n\"If I knew water from the river could achieve this, I would have done it myself many years ago,\" Chu Ming said to himself out loud, with a face full of regret.\n\n\"San Mu, are you an experienced arborist?\" Qu Lanxi asked Han Sen, with an expression that said she was suddenly unsure of him.\n\n\"I told you I only learnt a few methods from Professor Sun. But I too am surprised they work as well as they do.\" Han Sen gave her a smile.\n\nAs they were talking, Chu Ming grabbed the bucket and started racing off into the fields.\n\n\"Where are you going?\" Han Sen quickly stopped Chu Ming with his question.\n\n\"I am off to the river to retrieve more water. If I do this, we can get it to grow even faster!\" Chu Ming replied, excitedly.\n\nHan Sen then laughed in response and said, \"Quality over quantity, my friend. Sometimes less is more, for if we add too much water to its roots, the results we seek may sour. Things could backfire and potentially ruin the tree.\"\n\nWhen Chu Ming heard this, he immediately dropped the bucket. He ran in front of Han Sen and said, \"Yes, sir! From now on, I'm going to listen to whatever you have to tell me!\""
}