{
    "chapter": 2681,
    "title": "Back to Deified",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2681",
    "text": "“It must be the Demon Fruit… The Demon Fruit is working! Is Shale going to become deified right in front of us?” Li Xue Cheng merrily proclaimed.\n\nLiyu Zhen was thrilled as well. “Now I understand. Shale knew that the silkworm fights were going to start, but he decided to eat the Demon Fruit anyway. He hoped to use the pressure of a challenging silkworm fight to accelerate his growth and activate the dormant Demon Fruit power that resided in his body. During his fight with Han Sen, the Demon Fruit inside him has slowly been refined. Now, it must have all been absorbed. It will make him deified in the middle of this very fight.”\n\n“Shale is really leveling up to deified? There will be no more debating which of the two will emerge victorious now. It will be impossible for Han Sen to defeat a deified Shale.” Li Xue Cheng had been quivering with fear earlier, but now his quaking was due to unbridled glee.\n\nThis silkworm fight had been a non-stop rollercoaster of emotions for the two men. Li Xue Cheng’s emotions had gone up and down so much that he had thought his heart was going to leap out of his chest.\n\nThe fires around Shale’s body turned black. Black symbols were appearing across him, as if they were being carved into his exposed skin. A frightening presence was emanating from the symbols. Shale’s power began to generate substance chains.\n\n“Back to deified once more?” Han Sen frowned. He wasn’t blind. He could see that Shale’s power was changing.\n\nShale tipped his head back and roared to the sky, and the power of his substance chains exploded. His previously golden hair was suddenly dyed pitch black.\n\nShale used to look like a gold lion. Now his body had shrunk, but his muscles looked more solid and powerful than ever. It was like every cell in his body had filled up with an unimaginably grand power.\n\nThe new, black-haired Shale didn’t look as wild. He looked mysterious and alien. The black symbols were visible all across his face, and black flames quivered across his body. He looked like some sort of demon lion from hell.\n\n“He has returned to deified.” Li Keer’s face looked sickened.\n\nIt didn’t matter how talented or strong Han Sen was; he couldn’t defeat a deified Shale. After all, deifieds were completely different from all other ranks beneath them. They were as different as the sky and the ground.\n\n“Shale must have planned from the beginning to use this fight to become deified again. He wanted to use Han Sen as his whetstone,” Exquisite said glumly, then sighed. She understood the truth behind it all now.\n\n“That was excellent planning on Shale’s part,” Li Keer said with a grunt. “He ate the Demon Fruit before the silkworm fight. If no one presented him with a serious challenge, he could secure first place. If he did find someone who could stand up to him, he could refine the Demon Fruit and return to being deified and still secure first place and all the spoils. He is a very smart man, I will confess.”\n\nExquisite shook her head. “But again, it isn’t that simple. A normal person would struggle to become deified again whether or not they refined the Demon Fruit. Shale was able to become deified because his talent was that exceptional. This may not have been his plan at all.”\n\n“No matter what his reasoning was, these are the results,” Li Keer said in frustration.\n\nQiyu Elder and Open Sky Elder both looked very ill. And the Very High people who had placed big bets on Han Sen looked just as bad.\n\nThey thought they had seen a sound hope of victory, but it was all gone now. Since the moment Shale became deified, their hopes and dreams were squashed. Their hearts fell to the bottom of the blackest abyss, and they couldn’t see the light of hope anymore.\n\n“I apologize. I tried to control my power, but I was unable to suppress it. I have now returned to deified class.” Shale ceased attacking. He felt guilty about what had happened.\n\nWhat he said made everyone watching want to cough up blood. Many creatures wanted nothing more than to become deified, and Shale had been doing his best not to. That was quite upsetting.\n\nIf anyone else had said this, they might have sounded cocky. But Shale was renowned for his honesty, and he certainly wasn’t putting on an act. He had genuinely tried to suppress his power, but he ended up becoming deified anyway. He had wanted to finish this fight as a half-deified.\n\nBut fighting Han Sen had required too much from him. He had no choice but to use his full power to fight, and so he was unable to hold back the energy of the refined Demon Fruit. Once that dam of power broke loose, he had become deified.\n\n“There is no need to apologize. Your level is a part of your power.” Han Sen didn’t think it was shameful for someone to fight against an opponent of a lower level. If someone had a higher level, they must have earned it.\n\n“Today’s fight won’t count. I will wait until you become deified, and then we will fight again,” Shale said, looking at Han Sen.\n\n“This fight isn’t finished yet,” Han Sen responded, his face unchanged.\n\nShale shook his head. “Although I don’t want to win while you are at a lower level, I still need this first place. So, I’m sorry. We should abandon this battle for now.”\n\n“There is no need to apologize. Didn’t I just say our fight hasn’t ended yet? If you can win, then it was because you were better than me. But in order to decide that, we must first fight and see who the victor truly is.” Han Sen gazed at Shale calmly. He didn’t look very emotional.\n\nWhen Liyu Zhen heard Han Sen say this, he coldly laughed and said, “This Han Sen really doesn’t know his place. Shale has given him plenty of opportunities to bow out gracefully, and he even offered to leave this place together. That meant he would give Han Sen second place. But still, the brat insists on fighting. If he gets kicked out right now, he definitely won’t end up in second place, either.”\n\nLi Keer, Exquisite, and all the other Very High thought Han Sen’s response had been too cocky. He should have accepted second place instead of losing now.\n\nBut in contrast to their own thoughts, Li Keer and Exquisite didn’t detect any fear within Han Sen. Instead, they felt an overwhelming sensation of calm and confidence in him.\n\nThere was no need to be angry. There was no need to hate. There was no need to blame fate or the people around him. This powerful, placid confidence was something only superior people could possess.\n\n“But now Han Sen is a ridiculously dire situation. Why is he still this confident?” Exquisite and Li Keer thought that Han Sen had no reason to be so self-assured, but his confidence was so strong that it affected them anyway. They began to feel like they should trust in Han Sen.\n\n“Come on. Keep going. I will fight you. Whether I win or lose, I will walk out of here alone,” Han Sen said calmly as he looked at Shale.\n\n“Yes, this is how it should be.” Shale’s eyes flared with excitement. He looked at Han Sen as if he was looking at his favorite piece of art.\n\nPerhaps Han Sen’s power wasn’t as strong as Shale’s, but Shale wouldn’t underestimate him. The substance chains around him exploded madly. He was like some leonine power of darkness that had crawled up from the depths.\n\n“Because of the respect I have for you, I will fight with all my power.” Shale’s voice was like thunder as he swung his fist at Han Sen."
}