{
    "chapter": 2622,
    "title": "Healing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2622",
    "text": "“Motherf*cker… If you don’t get lost, I’m going to clobber you to death with my hammer!” The blacksmith spoke the common tongue with a heavy accent. He swung his hammer wildly as he ordered Han Sen out of his shop.\n\nAfter Han Sen got tossed out of the smithy, a bucketful of water followed him out, drenching him. His fox ears flopped downward when they were wet, and the sight made Exquisite laugh.\n\nHan Sen noticed the smile on Exquisite’s face, and he said, “You should smile more. You look much better like that.”\n\nExquisite’s smile quickly vanished, and she returned to looking like a statue once again.\n\n“At this point, most of the populace of Black King City is like the blacksmith you just met. Taking a treasure from here might be a little harder than it used to be. You should think about my offer. If you come with me to the Very High, I can guarantee you at least one deified treasure,” Exquisite said emotionlessly.\n\nHan Sen started to wipe away the water beaded across his face.\n\nHe walked back over to the same blacksmith and asked if the man was willing to sell the anvil. The well-muscled blacksmith threw another bucket of water at Han Sen and swung his hammer. Han Sen narrowly evaded the strike.\n\nHan Sen wasn’t angered by this, though. If someone had tried to lay claim to his treasures, he probably would have behaved the same way. He might have done far worse, in fact.\n\nne\n\nWOL\n\nHan Sen walked around Black King City and came up with nothing. When night-time came, Han Sen had to depart Black King City.\n\nEveryone had told him that Black King City wasn’t dangerous as long as he followed the rules, but that was only true during the day. If he and Exquisite remained in Black King City at night, they would probably end up dead.\n\nA long time ago, when White Jade Jing was first discovered, a few students had spent the night in Black King City. The next day, they were nowhere to be found. They had vanished. A deified investigator was sent after them, but he disappeared as well. Ever since then, students had been forbidden from staying overnight in Black King City. They had to leave before the sun descended past the horizon.\n\nHan Sen walked away empty-handed. Exquisite didn’t seem upset to have found nothing, but she hadn’t gone there for treasure, anyway. She was happy moseying around with Han Sen.\n\nAfter that first trip, Han Sen wasn’t very interested in returning to Black King City. He preferred to spend his time studying the geno arts that appeared in the seventh tower. He made no plans to go to Black King City again.\n\nHan Sen had been studying those texts for a while now, but their volume and variety were impressive. There was a new text every day, and there was never a duplicate. There was always something new available for him to study.\n\nThe words on the books were like the Kingese on the King Tree’s leaves in the Extreme King. Han Sen had never seen the symbols before in his life, but for some reason, he could still understand what they meant.\n\nHowever, if he copied the texts down, the meaning would be lost. It was a strange sort of magic.\n\nA year passed. It was the calmest year of Han Sen’s life. He read books, he healed, and his body started to recover. Occasionally, he even went to Black King City. There was no fighting there. There was no bloodshed. Han Sen felt as if he had become quite the lazy boy.\n\nAfter that year of recovery was done, his damaged body was halfway healed. He read all the books in the seventh tower.\n\nWhat annoyed Han Sen was that the effects of the Charming God’s Jian were becoming stronger. It was changing more aspects of Han Sen’s body.\n\nHis appearance didn’t change much. He still had his fox-like ears and tail, but the rest of him was human.\n\nHowever, Han Sen could feel that something was changing within his eyes. He didn’t know how to describe it. He wasn’t trying to be flirtatious, but when he met peoples’ eyesespecially women’s—they would feel as if he was hitting on them.\n\nWhen he spoke with the Yun sisters, Yun Suyi would blush and hang her head low for the longest time whenever he happened to glance at her.\n\nYun Sushang didn’t have much of a reaction, but she rarely visited him now.\n\n“If this keeps going on, people are going to think I’m some player who is unfaithful to his true love.” Han Sen found the situation to be incredibly disheartening. Women didn’t seem to want to get close to him anymore. Not even Exquisite.\n\n“Are you the Charming God’s Jian or the Repulsive God’s Jian? If this keeps going on, aside from my wife, no woman will be willing to talk to me.” Han Sen lift the Charming God’s Jian and shook it a little as he lectured it.\n\nFortunately, Han Sen wasn’t very worried about the opinions of women. That made the weird changes a little easier to deal with.\n\nHan Sen was bored at home one day, so he decided to return to Black King City.\n\n“Big Brother Bull, how goes the blacksmithing today?” Han Sen went to the smithy and smiled at the blacksmith.\n\n“None of your godd*mned business!” grunted the blacksmith that Han Sen had called a “bull.”\n\n“Tell me when you want to sell that anvil of yours, yeah? We can talk about the price,” Han Sen said with a smile. He wasn’t put off by the harsh welcome.\n\n“Maybe in your next lifetime,” the bull-man said.\n\nOver the course of that year, Han Sen had gone to the smithy every few days. He wasn’t in a rush to get the anvil. He just wanted to forge a good bond with the people of the city. It would be great if he could get his hands on a piece of treasure, but he wouldn’t be upset if he didn’t. His trips to the city had become a sort of vacation.\n\nIn the beginning, the people despised Han Sen and shied away from him. After his repeated trips, however, the people got used to seeing him around. Although they were still wary of his motives, they didn’t scurry away from him as they once had. The blacksmith bull-man even spoke to him occasionally.\n\nAlthough the man was grumpy whenever he spoke, a conversation was a conversation.\n\nLike usual, Han Sen began to meander through the city.\n\nHan Sen knew the place like the back of his hand, but he hadn’t found anything valuable within it.The legends claimed that when Black King City was first discovered, there were treasures everywhere. Even a random brick might contain untold power.\n\nBut there were too many people in Sky Palace, and over the years, all of the city’s treasures had been plundered. The items that remained, like the anvil, would be very difficult to take away.\n\n“Brother Han, come over here.” Han Sen was walking down the street when a wooden door near him suddenly opened. A thirty-year-old woman with a bun on her head appeared in the doorway wearing a flower dress. She waved at him quickly.\n\nHan Sen recognized her. She was the daughter-in-law of the Liu family. She hadn’t been married for long when her husband died, and she had been single ever since. Everyone referred to her as the Liu Widow.\n\n“You need something?” Han Sen stepped over toward her. He carefully kept his ears from pricking up. He had once heard a story about the Liu Widow’s house containing a treasure.\n\nMany of Sky Palace’s students had wanted to claim the Liu family’s treasure for themselves, but none of them had been successful.\n\nHan Sen knew that the Liu Widow was the only remaining member. Perhaps he would be able to buy that treasure now.\n\nAs soon as Han Sen walked inside, the Liu Widow slammed the door shut with great force. She leaped onto Han Sen with wolf-like hunger in her eyes, and she clung to him lecherously, her arms wrapped around him like an octopus."
}