{
    "chapter": 1244,
    "title": "He Is Still Alive",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1244",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBlind Man was one of the few strangers Han Sen cared about.\n\nWhen they first met, Blind Man gave Han Sen a book that was similar to Primal Innocence. A long time later, he had randomly delivered to Han Sen a cauldron with the nine-life cat symbol on it.\n\nEven if Blind Man was from Blood Legion, it was still strange of him to give such a thing to Han Sen of all people.\n\nAccording to the Xuan Men successor, Blood Legion was the only other faction with true power. As such, Han Sen knew to exercise great caution when dealing with people who were associated with the organization.\n\n“Come with me,” Blind Man said, with a lowered voice.\n\nHan Sen followed after Blind Man, thinking there could be no risk of danger there in the Alliance.\n\nFortunately, Blind Man did not lead Han Sen someplace too private. Han Sen was taken to an AI-operated restaurant. They scanned their cards and then sat down.\n\n“Why in the sanctuaries did you send me that cauldron?” Han Sen finally had the chance to ask.\n\nBlind Man laughed and said, “I was saving you.”\n\nHan Sen frowned and responded, “Don’t talk such crap. Tell me the truth.”\n\nBlind Man smiled and said, “I am. I’m being serious when I tell you it can save your life. Before you become a demi-god, eat what’s inside.”\n\n“Why would I want to eat it?” Han Sen thought Blind Man had gone mad. After all, why would Han Sen consume something that belonged to Blood Legion?\n\n“You’ll eat it, that much is certain,” Blind Man said.\n\nHan Sen laughed and balked. “Well, let me tell you how wrong you are!”\n\nAfter this brief exchange, Han Sen readied himself to leave. He wanted to know more about Blood Legion, but Blind Man didn’t seem like the sort who wanted to have a proper sit-down and chat.\n\n“Stay. There is something you should look at first,” Blind Man said, knowing this would invoke Han Sen’s curiosity and prevent him from leaving.\n\nHan Sen looked back and froze when seeing what Blind Man was now holding.\n\nBlind Man’s hands were very coarse and leathery, but the thick fingers held a ring. It was fairly ordinary, in that it had been forged with silver and been stoned with diamond.\n\nEven in the Alliance, that was just a common ring.\n\nBut it stood out to Han Sen all too well because his mother had a ring that was identical. It was her wedding ring.\n\nWhen Blind Man witnessed Han Sen’s petrified reaction, he placed the ring down on his table. Han Sen picked it up and read the inside. It read: “Love, Lan.” Han Sen was taken aback.\n\nHe remembered this. When Han Sen was young, he was given this ring by his father to hold, and he had read the inscription inside. His father was digging a pool at the time, and he wanted Han Sen to hold onto it in case it fell off and got lost.\n\nHan Sen only knew the word “love,” but did not understand the word “Lan.” He remembered asking his father about that, as well.\n\nHan Sen’s father told him that the “Lan” referred to his mother. This perplexed him at the time, because his mother’s name was Luo Sulan. The “Lan” of her name meant “orchid,” but the “Lan” on the ring had been inscribed with a different character. They were homonyms, but they had been spelled differently.\n\nIt was only a few years ago that Han Sen had come to learn his mother’s true name was Luo Lan, and it was that “Lan” that was on the ring.\n\nIt had been too many years since Han Sen had seen the ring, though. He couldn’t be certain he was remembering things correctly or that Blind Man was actually showing him the original.\n\n“What is this?” Han Sen asked.\n\nBlind Man laughed. His voice cracked roughly, as if he had spent a few too many years drinking and smoking.\n\n“If you don’t know what this is, give it to Luo Lan. She will know.”\n\nHan Sen stared at Blind Man for a while after that. When the time to break the silence came, Han Sen lifted his head and said, “Is this what you wanted to show me, then?”\n\n“The owner of the ring wants you to know you need to eat what is inside that cauldron before you become a demi-god,” Blind Man said.\n\n“You think a ring and a subtle-implication is going to convince me?” Han Sen said. Even if his father was standing right in front of him, he’d have to pull at his cheeks and give him a thorough examination to believe he was the real deal.\n\nBlind Man said, “Do you know the color of the cat?”\n\nHan Sen was not sure what he meant by this, as cats could come in a variety of colors.\n\n“This isn’t some secret-handshake or code, is it? I mean, I wouldn’t know. I’m not a member of your organization,” Han Sen said.\n\nBlind Man shook his head and said, “It is blue. Why? Because someone painted it blue.”\n\nHan Sen felt as if he had been stabbed with a knife, and the object of this pain had been twisted around. His mind was blown.\n\nHan Sen recalled there was an old white cat living in his house when he was just a child. It was always sunbathing in the yard. Once, Han Sen used paint to color it blue. His father was mad about this, and he told Han Sen never to touch the cat again, as it once belonged to his great-grandfather.\n\nThat was the first time Han Sen had seen his father get properly angry, so it was something he was not likely to forget.\n\nHan Sen and his father cleaned the cat, but it died just a few days later. Han Sen was sad for a long time following this, believing it was his own actions that had led to the death of the cat."
}