{
    "chapter": 3013,
    "title": "Doesn't Know",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3013",
    "text": "Han Sen was shocked. Han Jinzhi had him seek out Han Yufei, but Han Yufei did not know who Han Jinzhi was. That was quite a weird twist. “You don’t know a Han Jinzhi? He is an old man, and something of a fortune teller. He has double-eyelids above long and narrow eyes.” Han Sen described Han Jinzhi’s appearance. Han Yufei shook her head. “You know that I was trapped in Two Worlds Mountain. Unless he is someone from Sacred era, how am I supposed to know who he is?”.\n\nHan Sen was shocked. He thought, “Yes. Han Jinzhi is not so old. He might be old for humans, but before someone like Han Yufei, he is less than a few years old. How could he know who Han Yufei was?”\n\n“Come on in first.” Han Yufei turned around and went into the laboratory.\n\nHan Sen said his greetings, and Dragon Lady followed. The snow fairy shut the door behind them.\n\nThat icy bunker-slash-laboratory was full of ice. The temperature was low. Han Sen saw drawers and cans made of ice. Through the half-transparent ice, some weird stuff was visible inside them. There were organs of creatures, some colorful liquids, and some large ice cupboards with entire xenogeneics in them.\n\n“Take a seat.” They entered a room that looked somewhat like a lounge. Han Yufei sat on an ice chair. She looked at Han Sen and asked, “Did you say that guy Han Jinzhi told you to find me here? How does he know I am here? How does he even know my name?”\n\n“He told me to come and look for you here but said nothing else. I thought you might be close to him,” Han Sen felt depressed. It seemed as if he had been tricked by Han Jinzhi.\n\n“I can tell you with complete certainty that I have never heard this name before. I do not know this person.” Han Yufei was silent a moment and then asked, “Why did he tell you to come and look for me?”\n\n“My body has blue blood. I thought you would know that already.” Han Sen frowned.\n\n“Blue blood? What blue blood?” Han Yufei frowned.\n\n“Did you not see what happened in the god palaces?” Han Sen asked with shock.\n\n“I have so much research to do, so I have no time to watch such things,” Han Yufei said.\n\nHan Sen told her about Human King dribbling all the blue blood on him. After Han Yufei heard his tale, her face changed. She grabbed Han Sen’s hand. Before Han Sen could react, she pulled a needle out of nowhere and thrust it into one of his fingers. She drew some of his blood.\n\nBefore he said anything, Han Yufei ran out of the lounge. She went into a laboratory, which had all kinds of tools.\n\nDragon Lady and Han Sen wanted to enter, but Han Yufei did not even look at them as she said, “Stand outside and do not come in.”\n\nHan Sen knew that normal people should not enter a laboratory. If they fiddled with some tool and messed up a test, that would be bad. So, he just waited outside.\n\nFortunately, the laboratory wall was made of ice. It was crystal clear, so they could see what was going on inside.\n\nHan Yufei used all kinds of tools and tubes to research the blue blood. After an hour, she came out of the laboratory.\n\n“Not bad. The blood inside your body is Sacred blood.” Han Yufei was checking Han Sen out. She went on to say, “So, your body already has Sacred Leader’s genes. Otherwise, you would not be able to combine with that blue blood. As for that guy who gave you the blue blood, where did he get Sacred Leader’s blood from? The amount of it is almost like Sacred Leader himself.”\n\n“Could that person be Sacred Leader?” Han Sen always wondered if Human King and Qin Xiu were the same person.\n\n“No,” Han Yufei said with confidence.\n\n“Why not?” Han Sen did not know why Han Yufei was so sure about that.\n\n“Follow me. I need to give you a full-body check.” Han Yufei led Han Sen to another laboratory. She said, “Sacred Leader’s blood is different from ordinary blood. If the guy you told me about was the real Sacred Leader, then he could not have spoken to you face-to-face.”\n\nHan Sen was confused, so he asked, “What does that mean?”\n\nHan Yufei kept walking and said, “You should have heard about Sacred Leader wearing armor at all times. No one has seen his face. Isn’t that correct?”\n\n“Yes.” Han Sen had heard about that before. Since he had met Qin Xiu’s soul and saw his statue, he had not thought it was a big deal.\n\nHan Yufei said, “Sacred Leader wore armor because his body was special. If he did not wear armor, his body would have had a big problem. Let’s not say he cut his hands and gave you blue blood, as Sacred Leader would never have exposed his hands outside of his armor. So, the guy who gave you blue blood must not have been Sacred Leader.”\n\nWhile they were talking, Han Sen was led into another laboratory by Han Yufei. This laboratory was different from the last one. This laboratory had been constructed with impressive technology, and the temperature was not quite as low.\n\nHan Sen entered a chamber. Han Yufei started the tool that would enable a full scan of Han Sen’s body.\n\nAs Han Sen was lying in the chamber, he asked, “Was Sacred Leader’s body sick? Why would he have problems if he did not wear armor?”\n\n“You should feel it, right?” Han Yufei asked. “When your blood turned into blue blood, you were cut off from all the rules and powers of the universe.”\n\nHan Sen nodded and confirmed. He did not just feel it. It was very strong.\n\n“Sacred Leader himself did not just create a barrier. Without the protection of the armor, his body would have been destroyed by the ruling powers of the universe. He would have had to fight against the whole universe. You know the ending.” Han Yufei kept using her tools as she spoke.\n\nWhen Han Sen heard that, his heart jumped. “That sounds so familiar. It sounds like in the sanctuaries. When you level up to a higher sanctuary, the higher-level sanctuaries rules would destroy you.”\n\nHan Yufei looked at the data on the monitor and frowned as she said, “Weird…”\n\n“What is weird?” Han Sen asked. “Aside from the blue blood genes inside your body, there is another gene,” Han Yufei quietly said. “That gene is very close to the blue blood genes, but it cannot combine with the blue blood. It is because of that gene you did not become completely blue blood.” “That should be the Nine-Life Cat tattoo.” Han Sen told her about the Nine-Life Cat tattoo. Now, Han Sen was starting to believe what Han Jinzhi had told him. It looked like Han Yufei would be the one to sort out his current problems. At least, Han Yufei understood blue blood.\n\nHan Yufei looked at the data on the monitor and spoke to herself. “Nine-Life Cat genes, huh? That should be impossible, unless…” She suddenly thought of something. She quickly controlled the tool and rescanned Han Sen’s body."
}