{
    "chapter": 2620,
    "title": "Anvil",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2620",
    "text": "“What a weird city. It suppresses my power. Although my body is as strong as usual, I don’t think I’ll be able to any more powers than any ordinary creature can. I’m like an ordinary being now.” Han Sen was shocked. He tried activating all kinds of geno arts, but he couldn’t find any that were usable in that strange realm.\n\nAs Han Sen tried to figure out exactly how his power was being limited, a Sky man approached him and bowed politely. “Brother Han, my name is Bo Qin. I am a tour guide for Black King City.”\n\n“Brother Bo Qin, what is going on?” Han Sen asked, looking at the city’s civilians. Bo Qin laughed and said, “There is a cafe nearby with excellent tea. Since we’re close, let’s have a cup of the stuff and discuss the city, shall we? What’s going on in Black King City is rather complicated, so it can take a while to explain.”\n\n“Yes, please do that, Brother Bo Qin.” Han Sen followed Bo Qin to a nearby cafe on a street corner. The two of them sat in a room on the second floor. They could look out across crossroads in front of them, which gave them a view of half the city.\n\nBo Qin ordered some tea. Han Sen was still partially convinced that the whole city was merely an illusion, but when he took a sip of his tea, he was forced to discard that idea.\n\nThe tea had a sweet fragrance, and its taste was just divine. It was definitely not an illusion.\n\n“Don’t worry, Brother Han. Black King City is a very real place. It’s just different. This dimension only contains this town. The beings here can only live in the city. They live and die here, unable to practice or grow their strength. Furthermore, their lifespan is only a few decades,” Bo Qin said with a smile.\n\n“If these people here can never practice, why is the place so dangerous that I need a spell with me at all times?” Han Sen asked, confused.\n\nIf things were really as Bo Qing said, then nothing in that place could hurt him. Why would Yun Changkong have warned him so seriously?\n\n“The beings in Black King City are ordinary, but the city itself is not. I believe you have already felt it, in that our power has been restricted. Aside from the strength of our bodies, our powers are lost.”\n\n“Even if we only have our physical powers, the beings here cannot hurt us.”\n\nBo Qing nodded and said, “The beings here cannot harm us, but the rules that bind Black King City can. They might even kill us. There are two things you cannot do in Black King City. One is that you cannot lose your Black King spell. The second rule is that you cannot harm the other beings here. It doesn’t matter how weak they are; if you hurt them, you will be punished by the rules of Black King City. Even if you’re deified, the consequences are dire.”\n\n“Then what is the point of us coming here?” Han Sen asked with a frown.\n\n“There is a point. The creatures here are weak, but the stuff in their houses isn’t. There are 1987 houses here. Many generations of these people have lived in the same houses. They have treasures in their abodes that hail from eras that are long past. For the beings that live here, never practicing, they are a waste. If we were able to claim them, however, they might have some use. Think about it: there might even be deified treasures just hanging around like easy pickings.” Bo Qin paused before going on to say, “But in Black King City, you cannot steal. You cannot rob. You cannot bring harm to the occupants. The people must give you their items willingly. If you violate these terms, Black King City will punish you even if you are deified.”\n\n“That is a very strange set of rules… But if the people here don’t practice, where can these treasures possibly come from?” Han Sen asked.\n\nsure\n\n“I don’t know. Just like nobody knows why the White Jade Jing exists, no one knows why Black King City operates the way it does and where the people that live here come from. And no one knows how they can keep on living in this small city. All we have to do is try and take the items that we might need,” Bo Qin said.\n\n“Can I trade with them?” Han Sen asked.\n\n“Yes, but you cannot force them into an exchange,” Bo Qin answered.\n\nHan Sen asked more about the situation involving Black King City, and Bo Qin informed him of what he knew. He made sure to stress the taboos involved with living there.\n\nAs Han Sen was readying himself to leave, Bo Qin said, “Remember, Brother Han… We cannot use our powers here. Even if deified treasures are right in front of us, we can’t tell what they are without our powers. We can only see what they look like. Sometimes you’ll find that you’ve spent a lot of effort in return for a Baron class piece of junk. That is a frequent occurrence in Black King City. So, be careful what you select. If you find something you like, don’t miss out. I sincerely hope you can get a deified treasure.” “Thank you for explaining all of this to me, Brother Bo Qin.” Han Sen said goodbye and departed the cafe. He hit the streets again.After walking a few steps, he saw a blacksmith’s smithy erupt with sparks. Two shirtless blacksmiths were swinging their hammers, with each strike of the anvil making a ding ding sound.\n\nWhen Han Sen saw the anvil, his eyes brightened.\n\nThe anvil was pitch-black, and it was shaped something like the head of a bull. It was flat on its top and thin near the bottom. It looked quite aged, however. It seemed to be caked in rust, but Han Sen could tell that it wasn’t actually rusty. The red color was rising from within the anvil.\n\nThe anvil was a platform that the blacksmiths used to hammer iron weaponry. When the iron was pulled out of the fire, they would use hammers to shape the red hot metal atop the anvil.\n\nHan Sen could tell that the anvil was very old. God only knew how many years it had resided in the blacksmith’s smithy, but it hadn’t yet broken. And there were no dents or markings to testify to its eons of use. He could tell that it was quite a special item. If it hadn’t been, there would have been the telling signature of hammer marks and scorched clumps of iron atop it. Not having any marks would be impossible for an ordinary item.\n\n“Is this anvil a treasure? What level is it, I wonder?” Han Sen stood outside the smithy as he leered at the anvil. He couldn’t use his powers, so he couldn’t discern the rank of the anvil.\n\n“This anvil must be a treasure, I just can’t tell what level it is. It might not be too bad. Many Sky Palace students must have wanted that thing through the years, but the blacksmiths that live here cannot do their work without the anvil. So, after all these generations, no blacksmith has been willing to sell or part with the anvil,” said a familiar voice behind Han Sen.\n\nHan Sen turned around to see Exquisite next to him. She was robed in white clothing."
}