{
    "chapter": 2783,
    "title": "God’s Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2783",
    "text": "“I need the genes of other creatures to keep myself from turning into a god.” Violet turned to look at the giant jade god. His eyes looked very sincere as he spoke.\n\nXie Qing King laughed out loud. He lifted his lips and said, “You make it sound so good. I think you need the genes of other creatures to avoid turning into a vegetable.”\n\n“This is a test given to me by a god. It is the first step on my path of ascendance. The first step for me becoming a god,” Violet said coldly. He didn’t seem shaken or put off by Xie Qing King’s mockery.\n\nHan Sen was still a bit confused by all this, so he asked, “If you need the genes of other creatures, why aren’t you gathering the genes from the creatures that are dying up above us? Why are you praying to the god down here?”\n\nViolet smiled and said, “I don’t need to take part in the chaos on the surface. When you guys came down here, everything was settled. You guys will become the sacrifice to the god, and I will take his place.”\n\n“If I’m understanding you correctly, what you’re saying is that you aren’t the one who needs the genes. It’s him, isn’t it?” Han Sen asked, pointing at the giant jade god.\n\n“You are quite smart. The power of the god’s corpse is too strong. If I absorb it immediately, my body won’t be able to withstand its power. But if I let the god’s corpse absorb the genes of other creatures, those genes might help to soften the god’s energy. Then, I can absorb the power of the god’s corpse. Once the power is diluted slightly, it shouldn’t be as destructive to my body.” It seemed like the plan had almost succeeded. Violet was in a good mood, and he clearly wanted someone else to appreciate how successful his plan had been. That was why he was taking the time to brag to Han Sen and Xie Qing King.\n\nHan Sen sighed and shook his head. “You are pathetic. I didn’t think you would be so stupid as to do something like this. You are about to become his sacrifice, too.”\n\nViolet smiled and said, “I know what you mean, but that’s impossible. When gods die, they die. It doesn’t matter how powerful they were in life; once they’re dead, they’re just inanimate objects.”\n\n“Are you sure that is true?” Han Sen kept an eye on the jade giant. He didn’t think a god would die so easily.\n\n“Of course. I want to let him absorb the genes of other creatures, and I have expended a lot of effort making this happen. The more genes he has, the more power I will get.” Violet sounded very confident.\n\nHan Sen didn’t know if all the men who had fallen under a god’s thumb were this dumb, but it was clear that Violet was completely convinced. It was like Violet was being sold as a slave, yet he was taking pride in calculating how much he was worth.\n\n“Time is almost up. You guys should offer up your power for me to become a god.” As Violet was speaking, a jade substance chain rose from his body. The purple flower on his head turned green and sparkled like a piece of crystal.\n\n“Deified power is nothing special. When I become a god, I will show the universe the true meaning of power. True god deifieds will be eliminated on a whim. The Very High, Ancient Gods, and Extreme Kings will be wiped out. The only high race in the universe will be the Flower Gods. I will be the leader of the universe.” Violet’s eyes were brimming with passion.\n\n“What a naive kid. You should wait until you’ve become a god to make proclamations like that.” Xie Qing King quickly retreated. Then, he shouted at Han Sen, “Brother, I will leave you to deal with this psycho. Get rid of him. I don’t want to become food.”\n\n“Since when did you learn how to fall back?” Han Sen thought that was strange. Xie Qing King had retreated. That had never been the man’s style before.\n\n“It would be stupid to fight when I know the likelihood of my death is very high.” Xie Qing King lit up a cigar and clamped it between his teeth as he spoke to Han Sen. “I’m not deified yet, so I will let you perform. Enjoy the moment before I catch up with you. When I become deified, your time to shine will be up.”\n\n“This guy is becoming more and more human.” Han Sen looked at Xie Qing King happily. When he was in the sanctuaries, he had been blinded by the need to fight. He would never have behaved so rationally.\n\n“Teacher Xie, I like your comics, and I admire your talent a great deal. But real life is not a comic. Right now, Bai Wanjie and those other nobles are nothing compared to me. I am stronger. I am afraid your guard will be of no protection to you.” As Violent spoke, his substance chains became green vines. They writhed like long dragons as they reached out for Han Sen.\n\nIn the blink of an eye, Han Sen was trapped between the vines. He was wrapped up like filling in a dumpling.\n\n“Teacher Xie, before I kill you, I will let you witness the power of a god. It is a shame you will be unable to draw this for one of your comics.” Violet’s eyes looked spaced-out. The green vines were hollow likes hoses, and they looked as if they were going to suck something out of Han Sen’s body.\n\n“God is above everything. God controls everything. God can take away everything. Although I am not God, I can take anyone’s power for myself.” Violet’s face was full of haughty confidence as he finished boasting, but then his eyes widened.\n\nThe green vines were attempting to suck Han Sen’s power out of his body, but it wasn’t working. Nothing was being drawn from him. That confused Violet a bit.\n\nXie Qing King laughed and said, “I forgot to tell you. You aren’t God yet. And even if you did become God, it would be pointless. That is because the guy in front of you is God’s Daddy. Even if you become God, you would still have to kneel before him.”\n\n“What are you talking about—” Violet didn’t even get the chance to finish his sentence.\n\nPang!\n\nThe green substance chains that had become vines were suddenly shattered. Han Sen walked safely out of their clutches. He looked at Violet and said, “That was the breadth of your amazing god powers?”\n\n“Impossible… Even Bai Wanjie couldn’t tear down my powers so easily… But you… Who are you?” Violet looked at Han Sen with shock.\n\n“God’s Daddy!” Han Sen said simply. He walked up to Violet, and his body was suddenly cloaked in half-transparent white armor. His form was wreathed in a white flame.\n\nViolet recomposed his power with the intent of fighting Han Sen, but when he generated his green substance chains, he froze. He was suddenly hanging in the air, and he couldn’t move. It was like he had been pinned in space.\n\n“You… Who are you?” Violet was shocked as he realized he could no longer use his power. His body and his power were like a volcano that was ready to erupt, but he couldn’t quite release an attack.\n\nHan Sen kept walking forward. The Dongxuan Area controlled the universal cogwheels of the encompassing zone. Unless Violet’s power was stronger than his, the Flower God wouldn’t be able to use his universal cogwheel. He wouldn’t be able to unleash his power."
}