{
    "chapter": 2278,
    "title": "Unbreakable Statue",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2278",
    "text": "“Plus, I know that there is hell blood in the statue, but I don’t know where it is concentrated. And since you are still so weak, I’m not even sure you can damage it. On top of that, even if I do get the hell blood, the success rate of activating my own hell blood is low. That is why I have told you it is a one in a billion chance. If you have a method of escape, I suggest you make use of it now.” By the time Yisha finished speaking, her face had grown even paler.\n\nHan Sen turned to face the statue, then he activated his Purple-Eye Butterfly.\n\nIf he wanted to live, he needed Yisha. He didn’t want to watch her die, either. If there was a way to save her and resolve his own dire situation by extension, he wanted to try. It was killing two birds with one stone.\n\nBut as Yisha had said, it was a dangerous thing to attempt. If they failed, there was a very high chance he could die.\n\nIf Han Sen’s strike didn’t work, the ghost statue might attack him in return.\n\nFortunately, Han Sen had the bird’s nest to defend himself. With a shield like that, he didn’t have to be afraid.\n\nPlus, he had the blood kirin. Even if his own power couldn’t break the body of the ghost statue, the blood kirin’s strength might be enough.\n\nBut before he could allow the blood kirin to attack, Han Sen first needed to locate the hell blood inside the ghost statue. And when he had located it, he had to ensure success in a single hit. He didn’t know if he would be given a second chance.\n\nThe Purple-Eye Butterfly kept analyzing the ghost statue. Han Sen detected many mysterious substance chains wrapping around and through the statue. Those substance chains were very complex, and they were difficult to understand. But Han Sen didn’t have to understand how the ghost statue was made; all he had to do was locate the point where the hell blood was stored.\n\nThrough the Dongxuan Aura and Purple-Eye Butterfly’s combined analysis, Han Sen’s eyes eventually brightened. “It’s there!”\n\nWhen Han Sen looked at the ghost statue’s eyebrow, he noticed there was an extra tight substance chain. The purple substance was so thick that he could not detect a single seam.\n\n“Blood Kirin, attack here!” Han Sen lifted his Thunder God Spike and took aim at the ghost statue’s eyebrow.\n\nThe blood kirin was carrying Han Sen, and the beast glowed with red light. Blood air swirled around to cover its entire body. It loosed a thunderous roar before leaping up at the ghost statue’s eyebrow.\n\nYisha was surprised as she watched her student. She was too weak to participate, and it was only now that she noticed the beast that Han Sen was riding. It was a scary half-deified being, she could tell. It wasn’t an ordinary half-deified creature, either; it had to be at the very top of what was achievable in that class.\n\nYisha was surprised Han Sen was able to command such a powerful mount. The sight gave her a little bit of hope to cling to.\n\nA xenogeneic that was almost as strong as her might be able to crack the ghost statue and retrieve the hell blood she required.\n\nWhile Yisha was mulling this over, the blood kirin’s claws were tearing through the fabric of space. The beast lashed out at the ghost statue’s forehead, sending a vicious attack against the statue’s brow.\n\nBut suddenly, the ghost statue shone with purple light. Before Han Sen and the blood kirin could react, the statue’s other hand grabbed the blood kirin, just as it had Yisha. Its sharp nails dug into the blood kirin’s flesh.\n\nThe blood kirin let out a horrendous screech. The statue’s talons easily punched through the creature’s tough scales, and they were digging in deep.\n\nHan Sen was saved by the fact that the ghost statue’s claws only went for the blood kirin. He tumbled to the surface of the bridge. Looking up at what had occurred, he was given a shock.\n\nWithout a doubt, the ghost statue’s power was deified. Even the blood kirin couldn’t fight it off. The powerful creature was in the statue’s hand, and no matter how much the blood kirin tried to struggle, it could not pry itself free from the claws.\n\nThe blood kirin kept squirming in a bid to get free, but that only made the claws sink in deeper. Blood seeped out in greater and greater volume.\n\nYisha looked depressed. She had underestimated the statue’s cunning. She thought she was pulling the attention and power of the ghost statue’s power, but now, she realized that the ghost statue had more power than she initially assumed. The power it had used to attack the blood kirin was as great as anything she could unleash herself.\n\n“Blood Kirin, don’t move!” Han Sen shouted up at the blood kirin from where he stood on the bridge.\n\nThe blood kirin, upon hearing Han Sen’s voice, stopped squirming and resigned itself to the pain it was already feeling. When the blood kirin stopped fighting the ghost statue, the powers of the ghost statue’s claws seemed to lessen.\n\n“D*mn it! Now I understand. It wasn’t because Yisha and the blood kirin weren’t strong enough. The thing attacked them because they have hell power already.” Han Sen looked at his own purple body and the purple air.\n\nThe ghost statue wasn’t a creature. Just as Yisha had said, it was indeed a statue. And inside its body was a pocket of hell blood. That was the source of its strength. While it did have a lot of power, it lacked intelligence. It didn’t make plans or schemes; it did the job it was programmed to do.\n\nIt was the hell power inside Han Sen that would cause the statue to act. If Han Sen used his power, the hell power that was now inside his body would be triggered. And the ghost statue, in turn, would be prompted to make its move.\n\nThe events would play out like falling dominoes. Unless Han Sen could get rid of the hell power, not even a deified elite could block the ghost statue’s attack.\n\nOnce enough hell power accumulated within Han Sen’s body, the ghost statue would attack him even if he didn’t act first.\n\nJust as it had been for Yisha. When she walked across the bridge, she hadn’t attacked the ghost statue, but the statue still grabbed her. That was why she was unable to evade it.\n\nHan Sen and the blood kirin hadn’t activated the ghost statue when they walked near it because of the bird’s nest. Han Sen had thought that the bird’s nest was ineffectual against the hell power, but it actually had gotten rid of some of it. That was why the hell power in Han Sen and the blood kirin hadn’t triggered the ghost statue to attack the moment they walked up to it.\n\nHan Sen suddenly felt a headache coming on. The problem was no longer getting the hell blood from the statue; it was the fact that he couldn’t even hit the ghost statue. If Han Sen used a certain amount of power, then the hell blood that had accumulated in his body would be triggered. Then, the ghost statue would come after him. He wouldn’t be able to escape if he was struck by it.\n\n“Just go.” Yisha was smart, and she understood the issue as well. She knew she couldn’t escape her predicament. Once their bodies were infected by hell powers, all hope of defeating the ghost statue was lost. The same would be true even if a deified elite joined them.\n\nHan Sen stared at the ghost statue and did not speak. He didn’t want to simply leave. He hadn’t saved Yisha yet, and now the blood kirin had been captured as well. There was no way Han Sen was going to throw in the towel and call it quits now.\n\nHan Sen was holding the Thunder God Spike. The wings on his back flashed, and he teleported in front of the ghost statue. But the instant he got close enough to strike, the fist that was holding Yisha slammed into him.\n\nPang!\n\nHan Sen used the bird’s nest to protect himself, but he was still sent flying. He flew in a long arc that ended with a crunching impact with the hard surface of the bridge. Han Sen’s body was like a meteor thudding into the earth. He might not have broken the bridge, but the same could not be said for his body. He coughed, and blood sprayed the ground in front of him."
}