{
    "chapter": 2762,
    "title": "Dead Yesterday, Alive Today",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2762",
    "text": "Ancient Devil gave Han Sen a predatory grin. “Haven’t you heard about dying and then being reborn? If you don’t die, how are you supposed to dodge Super Space Slash?”\n\nHan Sen had heard of rebirth before, but he didn’t know what it had to do with Super Space Slash. He wanted to find a way to counter Super Space Slash because he wanted to live. What was the point of killing himself?\n\nAncient Devil pointed at Han Sen and said, “Before, we all swore to die like it was yesterday. And after, swore to live like today. Today, you are still alive. Then, what is the difference if you were to die yesterday?”\n\nAs he listened to Ancient Devil, Han Sen felt like he was lost in an impenetrable fog. He had no idea what Ancient Devil was talking about, but he knew that continuing to ask wouldn’t improve the situation. Unless he agreed to let Ancient Devil go, of course. Otherwise, Ancient Devil would continue to avoid reaching the crux of the matter and explaining what was required to break Super Space Slash. Although in truth, the hints that Han Sen had received thus far weren’t all that bad.\n\nAfter leaving Destiny’s Tower, Han Sen thought about what Ancient Devil had said to him. He still couldn’t understand what the man was saying.\n\n“Suicide… and dying yesterday… Being alive today… What is Ancient Devil trying to tell me?” Han Sen spent a long time thinking the matter over, but he couldn’t quite figure it out. It felt like the concept was just beyond reach.\n\nSuddenly, an invisible shockwave rolled through the air. Two shadows emerged from a quickly-gathering mist, and they landed on the plaza of the palace.\n\n“Exquisite and Li Keer are finally here!” Han Sen exulted, once he looked closer to confirm that it was them. Ever since he had been locked up in this bottle world, he hadn’t seen hide nor hair of Li Keer or Exquisite.\n\nAs both of them walked before him now, Han Sen didn’t say anything. He knew Exquisite and Li Keer were only youngsters among the Very High. They wouldn’t be allowed to make any important decisions. Even if they wanted to free Han Sen, they didn’t have the authority.\n\n“The scales across your body are gone!” Li Keer gasped, looking Han Sen over.\n\n“Yes. I don’t know why, but the scales just vanished. Can you ask the leader if I can leave now?” Han Sen said.\n\nExquisite and Li Keer looked at each other. It was as if they wanted to tell him something, but they were hesitant to actually say it. In the end, Exquisite ended up saying, “The leader still wants you to stay in the bottle.”\n\n“Does that mean he’s going to keep me bottled up in here forever?” Han Sen said with a frown.\n\n“Don’t worry,” Li Keer assured him. “We will try our best to show everyone that you aren’t a threat. We will try to get your freedom back as soon as possible.”\n\n“My body no longer possesses the scales. Doesn’t that help erase any suspicions they have about me?” Han Sen pointed out, but his voice didn’t sound particularly hopeful.\n\nExquisite sighed. “If the scales had been removed by my people, of course, they wouldn’t remain suspect. But now it seems that the scales have simply disappeared by themselves. I’m afraid the leader and the elders won’t believe that the scales just vanished of their own accord and went away for good.”\n\n“That means I’m still to be trapped here?” Han Sen’s mind had become placid once again. He didn’t expect the Very High to let him go. He would have to escape using his own power.\n\nLi Keer tried to provide comfort by saying, “We will try to help you in any way we can. You just need to hold out a little longer, okay?”\n\nHan Sen wasn’t a rookie who had only just started adventuring. He knew these were just words of comfort that wouldn’t lead to any real changes in his situation.\n\n“If I can’t leave this place, can you bring me some books so that I’m not completely bored?” Han Sen asked flatly.\n\n“What kind of books would you like to read? In a situation like this, I don’t think our people will let you read any kind of geno art,” Li Keer said, as straight as an arrow. She was often like that, telling Han Sen what he needed to know.\n\n“No geno arts. I just want some books about philosophy and theology. Something about life and death would be best.” Han Sen was hoping that these books might give him inspiration, perhaps revealing what Ancient Devil meant when he spoke of suicide.\n\n“Let me find a way. We will try and get these books for you,” Li Keer answered.\n\n“Thanks a lot.” Han Sen smiled.\n\n“You’re our silkworm. This is what we should be doing…” Li Keer trailed off halfway and fell silent. Han Sen’s situation now was different. He wasn’t really their silkworm anymore.\n\nBut Han Sen seemed to be doing better than they had expected. The way he casually spoke with them, he didn’t sound as if he was going to be locked up forever.\n\nBefore they left, Exquisite told Han Sen, “I will tell the leader that the scales have disappeared. They will most likely send someone to examine your condition. But I don’t think there is a high chance of you leaving. So, do not put too much hope in getting out soon.”\n\n“I understand,” Han Sen said with a nod. He knew Exquisite had no authority in this matter, so the final say-so wasn’t her decision to make.\n\nNot long after they left, a Very High true god elite appeared before Han Sen. He checked Han Sen out and asked Han Sen some questions. Han Sen had already composed his answers a long time ago, so when he was asked what had happened, he had a story ready to go. The explanation wasn’t entirely perfect because Han Sen kept trying to avoid talking about certain things. The Very High elder couldn’t tell what was going on.\n\nAfter the Very High elder left, no one came to see him for a few days. Han Sen spent the entire time practicing the Sit and Forget Sutra. Time passed rather easily.\n\n“It has been a while since I saw Yanran and Ling’er. I wonder if Ling’er has grown up yet. And I wonder what is going on with Littleflower. Mom and Dad said they wanted to spend some time traveling. I wonder if they have come back yet…” Sometimes, Han Sen would get distracted as he thought about how much he missed his family.\n\n“The Sit and Forget Sutra is completely different from Under the Sky. One of them is about entering the world, and the other is about exiting the world. Combining them will be hard. And I have never practiced Very High Sense before, so I have to use Under the Sky as a base. If I start from the beginning with my practice, I don’t know how long it will take for me to learn the Sit and Forget Sutra.” Han Sen had no way of accurately predicting when he would elevate the new skill to a usable level.\n\nThe Sit and Forget Sutra and Under the Sky were similar in structure, but according to the theory, they operated on different wavelengths. They were practically polar opposites. Even though he had managed to obtain the alpha’s experience and mind, he couldn’t combine the two techniques.\n\nWhile Han Sen was stewing in his own frustration, a shadow appeared through the mist surrounding the palace. It was an old Very High man Han Sen wasn’t familiar with.\n\nThe old man didn’t speak. He only tossed something at Han Sen, then turned around and left.\n\nHan Sen raised an eyebrow, having no clue what the old man had just done. He picked up the item and looked it over. It was a mini laptop, about the size of a person’s hand.\n\nHan Sen turned on the computer. He couldn’t connect to the internet, but there were many ebooks inside it.\n\nNow Han Sen understood. This was probably Li Keer and Exquisite’s delivery.\n\nHan Sen browsed quickly through the titles, and he realized that ebooks really were the only things that the computer contained. Most of the books were about philosophy and theology. There wasn’t anything about geno arts, at all.\n\nHan Sen hadn’t really expected to find a geno art, anyway. He flicked through the books. With how much his brain had evolved, it was an easy task for him to memorize the exact contents of a book with a million words. He could recall the content perfectly, without forgetting a single word. Understanding it, however, was something else entirely.\n\n“Flush Real Sutra.” Han Sen jerked when he saw the title of one of the books."
}