{
    "chapter": 2359,
    "title": "Hunting King Class Xenogeneics",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2359",
    "text": "As far as Han Sen knew, Bai Yi cleared Planet Water Zone a long time ago. Even Lan Haixin hadn’t bothered sending out hunting parties. But now, Han Sen had met two King class xenogeneics in a row. Both were in the same vicinity, too. This posed a big problem.\n\nPulling out his Thunder God Spike, Han Sen went towards the King class electric eel.\n\nHan Sen didn’t really care what change Planet Water Zone was experiencing right now. He was just going to kill any King class creatures he found. Getting King class genes was good for him.\n\nHe used his Original Water King Body, then unleashed his dragon area as well. Han Sen moved like a water dragon as he rushed toward the big electric eel. The Thunder God Spike flickered with scary silver lightning, and the sound of thunder rumbled along its path.\n\nHan Sen’s King areas entangled the giant electric eel. The water restricted the eel’s body, and the creature swam extremely slowly, as if it was moving through mud.\n\nWhile Han Sen rejoiced at the success of his attack, the electric eel suddenly loosed a crackling discharge of lightning. The lightning created a scary thunder area and merged with Han Sen’s own area. The electricity shot through the water and into Han Sen. His hair instantly poofed straight out and began vibrating with the force of the current.\n\nPang!\n\nHan Sen’s electrified body bounced away. He came to a stop after arcing through the water for a long time. His tongue felt numb.\n\n“A king area focused purely on attack is too scary. And that electricity has a strong paralytic effect. This is at least a sixth-tier area. This electric eel will be hard to deal with.” Han Sen held still in an attempt to hide himself, but the electric eel was already rushing toward him. Its thunder area came with it, and streams of electric chains shot out of its mouth.\n\nHan Sen used his water skills to dodge the thunder area and the lightning chains. Fortunately, he still had the benefits of his water areas. He moved much faster in the water than the electric eel did. If not for his speed advantage, he would have already taken more hits. That would have been extremely painful—even if his body could withstand it.\n\nAfter dodging out of the eel’s immediate attack range, Han Sen summoned Spell’s dual pistols and started firing. It wasn’t the sea conch, so Han Sen didn’t have to worry too much about its blocking abilities.\n\nWhen the bullets entered the thunder area, the eel reacted immediately. It spewed more of that lightning to destroy the incoming bullets.\n\nBut one or two of the bullets still managed to strike the eel’s scales. Familiar symbols began to shine across the impacted scales, showing the results of Han Sen’s Turtle skill.\n\nThe Turtle skill took effect, and after a few more shots landed, the electric eel was much slower. However, the lightning on its body was still incredibly strong, and the creature’s thunder area covered the surrounding region, so Han Sen couldn’t get close to the creature.\n\nPang!\n\nSpell became a sniper rifle, and Han Sen fired a bullet toward the electric eel. The bullet shattered the eel’s scales and tore into its side. Purple Teeth power spread across the wound.\n\nHan Sen’s techniques weren’t King class yet, and his Original Water King Body only had a first-tier area. Taking down a King class xenogeneic with a sixth-tier area would be incredibly difficult.\n\nLuckily, the Turtle skill worked well against the eel. Because of that, the foe was unable to catch up to Han Sen. He led it to the seabed, firing continually at the creature. Teeth power continued to shred its wounds. As it lost more and more blood, the electric eel’s area grew weaker.\n\n“Xenogeneic King hunted: Electric Dragon. Xenogeneic gene found.”\n\nHan Sen watched the giant electric eel’s body sink while the announcement played in his head.\n\n“It is a shame I didn’t receive its beast soul. An electric beast soul would have been very powerful.” Han Sen swam over to the electric eel’s body and dug out its xenogeneic gene.\n\nHe summoned his Shadow Queen Bee and let it eat the big electric eel’s body.\n\nShadow Queen Bee hadn’t matured yet, and Han Sen was already a Duke. The Queen Bee wouldn’t be useful to him at this point, but since he had the meat available, he might as well let her eat it. Otherwise, it would all be wasted.\n\nShadow Queen Bee crawled over the body and ate with difficulty. Han Sen swallowed the entire electrified bone that was the xenogeneic gene. He also used his Consume talent to refine it with haste.\n\nA numb feeling swept over Han Sen’s body. It was like his cells were electrified, and they began to vibrate with energy.\n\n“Duke gene… Duke gene…”\n\nWhen Han Sen finished refining the electric bone, his Duke gene tally had reached eighty-four. He was close to having a hundred.\n\n“If I kill two more King class xenogeneics, I’ll have maxed it out. And then, I can open The Story of Genes’ first gene lock.” As Han Sen was calculating, he heard a boom in the distance.\n\nSomething tore its way out of the little hole under the mountain, dramatically widening the opening. The blood kirin emerged from the swirls of debris and returned to its ordinary size.\n\nBlood dripped from the blood kirin’s mouth, and grievous injuries marred its scales. It was in very bad condition.\n\nPatong!\n\nThe blood kirin made it back to Han Sen, then fell onto its stomach on the seafloor. It struggled to get up.\n\nWounds covered its legs, and one leg had been twisted ninety-degrees. Black blood oozed around the wound.\n\nThe black blood drifted into the water around the blood kirin’s body, then turned into some sort of small black bugs. They latched on to the blood kirin and started nibbling on its wounds and scales.\n\nThe blood kirin was a cruel and violent beast, but now it was actually squealing.\n\nHan Sen was shocked. The blood kirin was a half-deified xenogeneic that was nearly peerless, and judging from the way it had been injured, it had encountered something other than the sea conch.\n\nThe blood kirin’s blood continued to become bugs, and Han Sen couldn’t determine what sort of power had been used against his companion.\n\nHan Sen was still holding the Thunder God Spike, and he poked it into the blood kirin’s wound. The black bugs began to shriek as Han Sen electrified them, and after a minute, they all fell off the wound.\n\nThose bugs vanished, but the blood gushing from the blood kirin’s wounds was turning into more black bugs. If that continued, the blood kirin’s veins were going to run dry.\n\nHan Sen looked at the little bugs, and he realized they were actually small sea conches.\n\nHan Sen used his Purple-Eye Butterfly to see what was going on with the blood kirin. Many small, black sea conches were squirming around inside the blood kirin. There were too many to count, and the sight of them made Han Sen feel sick. At the rate that the blood kirin’s body was being devoured, it wouldn’t be long until only its bones remained.\n\nHan Sen wondered how he might save the blood kirin, but then something else came crawling out of the hole that the blood kirin had expanded. The newcomer’s body swelled back to normal size. It was that same, King class sea conch.\n\nBefore Han Sen could react, another sea conch emerged from the hole. This one was beautiful and full of color. Its shell was like a crystal, and its colors shifted and glowed like a rainbow.\n\nWhen Han Sen saw that beautiful sea conch, the color drained out of his face."
}