{
    "chapter": 2707,
    "title": "God Spirit Storm",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2707",
    "text": "Han Sen could feel a weird sort of presence being released from Bao Lian’s body. Even Han Sen had to compliment him, saying, “The Extreme King’s king bodies are so scary. Just using his king body has allowed him to increase his presence by many multiples. The deifieds of an ordinary race cannot fight against the deifieds of the Extreme King.”\n\nWhile Han Sen was still lost in thought, Bao Lian closed his eyes and said, “I didn’t want to kill you, but you seem to be seeking your death. Don’t blame me for doing what you have asked me to do.”\n\n“If you have power, show me what you’ve got. Otherwise, stop talking crap,” Han Sen said.\n\nBao Lian didn’t speak. He opened his eyes and suddenly looked at Han Sen.\n\nHan Sen felt like Bao Lian’s vision was now on him. He suddenly felt a foreign energy wind around him, but what this new power was, Han Sen couldn’t determine. It was like it was there, but it was not there.\n\nAfter that look, Bao Lian turned his head away and started running off.\n\n“We haven’t determined a winner yet. Where are you going?” Han Sen said with a frown.\n\n“You’re dead. Go and prepare your funeral,” Bao Lian said over his shoulder as he continued heading away. His sprinting form soon disappeared from sight.\n\nHan Sen wanted to go after Bao Lian, but that strange, almost undetectable power was making him feel sick.\n\nSince Exquisite and Li Keer were near, Han Sen didn’t want to use his other geno arts to get rid of the effect. He looked at them and said, “Did you both see what kind of power Bao Lian used on me?”\n\nLi Keer shook her head. “Bao Lian is an heir of the former ruler King Bao. Bao Lian is one of his children. Right now, King Bai is in charge. King Bao wasn’t very powerful, therefore he isn’t that famous.”\n\n“Can you tell what element was used against me?” Han Sen asked.\n\nExquisite examined Han Sen’s body. After a while, she said, “The Very High are very skilled when it comes to sensing types of energy. But Bao Lian’s power is very strange. Not even I can tell what element he used. It felt like causal power, but that isn’t exactly right.”\n\nWith Exquisite and Li Keer both being unable to determine what they had just witnessed, Han Sen frowned. He used The Story of Genes to examine his body, but he didn’t find anything weird within him.\n\nHis power seemed to be unaffected. There were no hidden wounds or anything. He had no clue what Bao Lian’s power had done to him.\n\n“Is Bao Lian playing a prank on me?” Han Sen double-checked his body to ensure things were all right.\n\nExquisite and Li Keer examined Han Sen using many different methods, but they failed to learn anything.\n\nHan Sen could detect some sort of power surrounding him, but it couldn’t be removed. In his heart, though, he felt as if something was deeply wrong.\n\nWhile Han Sen was trying his best to avoid using his Dongxuan Area, he suddenly heard a scary sound coming from the sky.\n\nThe three of them immediately raised their heads to see what was coming. The sunny skies were becoming cloudy and overcast. All of a sudden, everything around them became pitch-black. Within the blink of an eye, the sky looked dark.\n\n“A God Spirit Storm is here. We have to go.” Exquisite and Li Keer looked to be in shock. They pulled Han Sen away with them by making use of Galaxy Teleport. They wanted to stay as far away from the God Spirit Storm as they possibly could.\n\nExquisite and Li Keer were already half-deified. They only dared to venture across these lands due to the fact that they had the power of God’s Wander. They could use it to avoid the areas that were claimed by God Spirit Storms.\n\nOtherwise, with their current power, it would only take a couple of deified xenogeneics to bury them.\n\nAfter using Galaxy Teleport, Han Sen found himself in a desert. There was no way to tell how far he might have teleported away, but the sky no longer had a God Spirit Storm brewing in it.\n\nBefore the three of them had enough time to come to their senses, they heard the sky growl with a scary peal of thunder again. The ominous cloud covered the sky again.\n\n“Why are we so unlucky? We’ve run into a God Spirit Storm again,” Exquisite said with a frown.\n\n“We don’t have time to worry about that right now. Let’s just run,” Li Keer said quickly. If they ended up getting dragged into a God Spirit Storm, there was an 80% to 90% chance they would end up slaughtered.\n\nThe three of them used Galaxy Teleport again. They went to someplace else. But as soon as they appeared in their new location, the sky showed signs of a brewing God Spirit Storm once more.\n\nThis time, even Han Sen could feel that something was wrong. His eyes narrowed and he said, “It cannot be Bao Lian’s power doing this to me, can it?”\n\n“That is impossible. Bao Lian is just a primitive deified. His power is far too weak for him to affect—much less control—a God Spirit Storm. He’s the lowest rank of deified, and even a true god couldn’t summon a God Spirit Storm,” Li Keer said.\n\nThe three of them used Galaxy Teleport again, but after a few more jumps, they realized that a God Spirit Storm would begin to brew wherever they went.\n\n“I must be right. It must be Bao Lian’s power affecting the God Spirit Storm and causing it to spawn around us.” Although this possibility was hard to put stock in, there didn’t seem to be any other explanation.\n\nBefore they met Bao Lian, no God Spirit Storms had plagued them. But now, God Spirit Storms were appearing wherever they went. It was obviously connected with Bao Lian’s power.\n\nLi Keer and Exquisite found this to be incredibly difficult to believe. After all, Bao Lian was just a primitive deified; the notion that he could control a God Spirit Storm was outlandish. But then again, this was the fact that was staring them in the face. They had no choice but to accept the reality in front of them.\n\n“The God Spirit Storm comes too quickly. We don’t have enough time to open the door to leave the god area. And if we keep using Galaxy Teleport, we won’t last long that way, either,” Li Keer said. Her face was rapidly losing its color.\n\nGalaxy Teleport was a bit of an energy hog. The further they teleported, the more energy it cost them. But teleporting only a short distance wouldn’t take them far enough from the God Spirit Storm to keep them safe.\n\nHan Sen was studying God’s Wander, but he hadn’t learned Galaxy Teleport yet. He had to be carried by Exquisite or Li Keer, and that was costing them even more energy.\n\nIf they kept using Galaxy Teleport like that, the two of them would only have the energy to make another 20 to 30 jumps. With the power they were spending, the distance they could travel would continue to decrease.\n\n“Keer, you teleport to another location. Exquisite will teleport somewhere else with me. Then, we’ll meet up on our next jump,” Han Sen said to Li Keer.\n\nThe two of them could sense what Han Sen was thinking. They didn’t object, and they did as he instructed.\n\nWith this test, they were able to confirm that the problem was indeed Han Sen. After Li Keer teleported away by herself, she didn’t encounter a God Spirit Storm again.\n\nAnd when Exquisite and Han Sen teleported, they were immediately hounded by the God Spirit Storm again.\n\n“It looks like I underestimated that deified elite.” Han Sen had to admit his failure this time. He had lost completely. Bao Lian, who was just a primitive deified, had placed him quite firmly in a terrible situation.\n\nThis was a very dangerous situation for him to be in. Exquisite and Li Keer had followed him there, but if the two women opened their doors, Han Sen wouldn’t be able to leave. He had to open the god area gate himself. However, judging by the time it took to open the door and how long it took for a God Spirit Storm to spawn, he would be sucked into the storm before he could slip out of the god area.\n\nRight now, he was at the end of the road. Unless the God Spirit Storm stopped chasing him, that was. Otherwise, he would end up in the storm. Thinking about the countless deified xenogeneics that spawned inside those storms, Han Sen’s head felt itchy."
}