{
    "chapter": 2628,
    "title": "The Fight That Was Meant to Be",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2628",
    "text": "As the two of them returned from their fight in White King City, Han Sen’s heart was unsettled. Both Black King City and White King City gave Han Sen the unsettling feeling that he was being watched by some larger entity.\n\nBut the Sky didn’t have the power to control the White Jade Jing. If someone really did have authority over that place, that would be truly scary. Han Sen and Lone Bamboo had worked together to kill the deified xenogeneic in White King City. News of their feat spread through Sky Palace like wildfire. The next day, when Han Sen decided to go to Black King City, he found Exquisite standing on his little jade island.\n\n“Lady Exquisite, why are you here?” Han Sen knew this was bad news. It had been so long that their agreement had slipped his mind. He hadn’t thought about it when he accepted Lone Bamboo’s invitation to visit White King City.\n\nNow that everyone knew he had helped kill a deified xenogeneic, Exquisite thought it would be a fine time to revisit her arrangement with Han Sen.\n\nIt was just as Han Sen thought. Exquisite eyed him up and down and said, “Killing a deified xenogeneic isn’t the work of a crippled man. You seem to be in fine shape, if you ask me.”\n\nEven though Han Sen wanted to object and claim he wasn’t healed, he knew Exquisite would no longer believe him.\n\nHan Sen fell silent, then nodded and said, “I’m almost healed. If you are in this much of a rush, give me a time and date.”\n\n“Scheduling something for the future is asking for further delays. How about right now?” Exquisite didn’t want to wait any longer. She was worried that if they continued to drag this out, she would never be able to claim him.\n\n“Sure. Where?” Han Sen asked. He knew this had to come to an end at some point.\n\n“The battle arena.” Exquisite obviously wanted everyone in Sky Palace to attend. Once everyone knew what was going on, it would curtail Han Sen’s ability to delay proceedings any longer.\n\n“Sure,” Han Sen agreed. Then, he went to the arena with Exquisite.\n\nShortly after Han Sen and Exquisite arrived, the news of their bout spread quickly. All of Sky Palace heard what was happening, and a short time later, all of the floating islands around the arena were packed with spectators.\n\nEveryone already knew why Exquisite had stayed in Sky Palace. When it was reported that Han Sen had gone to the arena with Exquisite, it was pretty obvious what was going to happen.\n\n“Do you guys think Brother Han can defeat Exquisite?”\n\n“Of course he can. Brother Han has an eleven armor talent. Exquisite only has a nine armor talent.”\n\n“There’s more to it than that. The God Spirit Touch evolved under Han Sen’s influence, so there could have been a mistake.”\n\n“We know too little about the way talents are judged. However, everyone knows of the Very High’s gene powers. Although Brother Han isn’t weak, he has mostly relied on xenogeneic treasures to achieve what he has This time, he won’t be allowed to use treasures. That is bad news for Brother Han.”\n\n“Bullsh*t! Brother Han doesn’t need treasure, and he can beat anyone at the same level.”\n\n“Brother Lone Bamboo is here, too…”\n\nWhen Han Yan and the Yun sisters heard the news, they all ran to the stadium. Yun Suyi was a bit worried about it, and she said, “If Brother Han loses, does that mean he will go to the Very High immediately?”\n\nHan Yan shook her head with a serious expression. “Don’t worry. Big Brother doesn’t know how to lose.”\n\n“But what if he does? The people in the Very High aren’t easy to defeat…” Yun Suyi was still rather worried.\n\nHan Yan looked at Yun Suyi, and she couldn’t keep herself from sighing.\n\nHan Yan could tell Yun Suyi fancied her brother. From the time she spent practicing with Yun Changkong, she had learned that Yun Suyi was a good girl. “It’s a shame that big brother already has Yanran, and their relationship is amazing.” Han Yan shook her head in dismay. She felt a bit sad for Yun Suyi.\n\nIn the hall, a woman turned to Sky Palace Leader. “If Han Sen loses, are you going to let him go to the Very High?” “If he loses, of course he will go,” Sky Palace Leader said coldly.\n\n“Leader, I think you should know how important Han Sen is for the prosperity of Sky Palace,” the woman said with a frown.\n\n“That is why the Very High want him so badly. Do you think that the Very High’s old man would allow Exquisite to give up on Lone Bamboo so easily?” Sky Palace Leader smiled.\n\n“If the Very High know that Han Sen can bless people, isn’t that even worse for us? Our plan will become even more difficult to complete,” the woman said.\n\nUpon hearing that, Sky Palace Leader frowned. A while later he said, “The first seat has been in the Big Silence System for a long time. We don’t know what happened to him. We don’t know when he’ll be back, but without him, I don’t believe if this can continue.”\n\n“I have sent a group of people to the Big Silence System, but in a place like Big Silence, it can be practically impossible to find a single person. Out of every hundred people that go there, it is likely only one will return.” The woman sighed.\n\n“Wait a bit longer. If this really doesn’t work, then we’ll have to put pressure on Yu Shanxin,” Sky Palace Leader said.\n\nThe woman nodded and didn’t say anything further.\n\nSky Palace Leader’s gaze was fixed to the arena. He didn’t say anything, but he was thinking to himself, “Maybe he is a good choice. Although he won’t stand much of a chance, it is better than putting all my eggs in one basket.”\n\nIn the arena, Han Sen looked at Exquisite. Exquisite said emotionlessly, “Per the terms of our agreement, you will not use xenogeneic treasures. You can only use your body and geno arts to fight. If you win, I will leave and never allow the Very High to pester you again.”\n\n“If I lose, I will follow you to the Very High. I will listen to your orders,” Han Sen said quickly. “Good.” Exquisite nodded. Her expression was chilling. Her third eye slowly opened to reveal the tai chi yin yang eye.\n\n“She has just come on stage, and she’s already using her Very High Eye. It looks like Exquisite is taking Brother Han seriously.”\n\n“It is rare to see the Very High in a fight, especially when they are still Kings. And even more so to watch them use their Very High Eye.”\n\n“That just proves Exquisite is desperate to get Han Sen to join the Very High.”\n\n“If it was me, I would have just followed her and done whatever she said. Your development would benefit so much with the Very High, and you’d be surrounded by beautiful women. Why wouldn’t he want to go? I wonder what goes on in Lone Bamboo and Han Sen’s minds.”\n\n“That’s why you’re just a bottom-of-the-barrel student. Han Sen and Lone Bamboo are geniuses.”\n\nHan Sen looked at his enemy gravely. They were both ninth-tier Kings. Han Sen wasn’t afraid of any creature, but Exquisite was from the Very High. She had countless geno arts and secret skills in her pocket, so he had to be very careful.\n\nThe moment she opened her Very High Eye, Exquisite became that robotic person again.\n\nShe just stood there, not saying anything or even glancing around. Raw power suddenly rushed down into the arena. The whole place was twisted by some strange energy.\n\n“Is that her real power?” Han Sen squinted slightly. He saw the space around the woman continue to thrash and twist. Although Exquisite was right in front of him, he could barely see her now."
}