{
    "chapter": 1031,
    "title": "Phoenix-God Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1031",
    "text": "The reason they were to meet in the virtual community was because Qin Junhao had a contract with a spirit. He escaped from the shelter where he was held, so returning to the sanctuary might have resulted in a painful death.\n\nWhen Han Sen went there to meet with him, he saw Lin Weiwei, Lin He, Chen Hu, and Zhao Xin standing next to a tall young man.\n\nLin Weiwei introduced this person to him, and Qin Junhao proceeded to explain the concerning matters to Han Sen.\n\n“Me and Brother Seven thought you may be unaware of the existence of a king spirit. When I learned you had been able to kill a super creature, though, I fear we may have worried too much.” Qin Junhao sighed.\n\n“No, this is important information. I’m glad to have learned this, and while we knew about super creatures and king spirits, we did not know there was a king spirit in the vicinity. If you hadn’t risked life and limb to inform us, we might have been caught with our pants down,” Han Sen said with appreciation.\n\nQin Junhao then said, “You are welcome. If you have someplace to run, it is best to move now. Else, stay here and never return to the sanctuary.”\n\nHan Sen asked, “Brother Qin, aside from Holy-Sword Emperor, are there any other king spirits or super creatures we’d do well to know about in the region?”\n\nQin Junhao swiftly answered, “There aren’t any more king spirits. But super creatures? Yes. There are two of them. One belongs to Holy-Sword Emperor through a mutual respect, earned by him having saved the super creature’s life one time. The other super creature is there by contract.”\n\nWhen Han Sen heard that there were two super creatures, he looked dismayed.\n\nIf Holy-Sword Emperor was on a journey to some remote desert, he might have had an easier time obtaining its spirit stone. But with news that there were two super creatures still there, guarding the shelter, he doubted he could pull it off.\n\nFurthermore, if there were super creatures, the rest of the shelter had to be packed with sacred-blood and royal spirits. Han Sen could not kill them all at his current level.\n\nHe could enable his super king spirit mode, but he’d have one hour to complete the entire conquest. Even if he risked running inside for the sole purpose of obtaining the spirit stone, if it had been hidden, he wouldn’t have enough time to eliminate the enemies there and then commit to a search. His body would be practically crippled afterwards, too.\n\n“Brother Qin, can you tell me about the Phoenix Desert and God Mountain?” Han Sen fancied the idea of slaying the king spirit, but he had to collect as much intel as he could.\n\n“Yes, I can tell you what I know.” Following this, Qin Junhao told Han Sen everything he knew.\n\nPhoenix Desert was a dominion of creatures now, but one-hundred-thousand years ago, an emperor spirit ruled the area.\n\nThis spirit’s title was Phoenix, and he was the most powerful spirit to have ever existed in the Third God’s Sanctuary.\n\nBut then he went to the Fourth God’s Sanctuary, leaving no heir behind. Over time, Phoenix’s shelter became known as God Mountain.\n\nMany warriors traversed those blistering deserts, all in search of God Mountain and the treasure it contained.\n\nBut nothing ever came of such searches. In fact, most never even found the fabled location known as God Mountain.\n\nHoly-Sword Shelter was fairly close to Phoenix Desert, but try as he might, not even Holy-Sword Emperor had been able to locate God Mountain.\n\nWhen Brother Seven entered the Third God’s Sanctuary, he spawned in Holy-Sword Shelter.\n\nHoly-Sword Emperor had just lost a fight, and in his foul mood, he planned on killing Brother Seven in a vain attempt to make himself feel better.\n\nBut Brother Seven managed to prove to the spirit that he would be useful. After being spared, he worked tirelessly in his service. Eventually, he helped Holy-Sword Emperor discover the exact location where God Mountain could be found.\n\n“Brother Seven was good. He did something a king spirit could not!” Chen Hu said. Everyone shared this thought.\n\nQin Junhao said, “He’s not a great fighter; the fortitude of his mind is his greatest asset. He is intelligent. He is a geographical professor, who just so happens to be well-versed in the arts of Feng Shui. While he proved to be of some worth, he was still hesitant about wanting to assist a king spirit. So, even though he helped him locate God Mountain, he made sure it would take a long time.”\n\n“Brother Seven is a good man,” Han Sen said, admiring him.\n\n“But still, it was all in vain,” Qin Junhao continued to say. “Holy-Sword Emperor found a geno item. This item allowed him to find the entrance of God Mountain. He has taken Brother Seven with him, but Brother Seven said he would do his best to stop the spirit from obtaining a certain treasure, no matter what it took.”\n\nQin Junhao sighed and spoke with remorse, saying, “Brother Seven is such an honorable man. He shouldn’t be forced to die this way. I’m still only breathing because of him; I’d have died years ago, if it weren’t for him. He’s the one that bid me to come here and inform you of all this, too.”\n\n“You said he left a map that would show where the mountain is?” Han Sen asked.\n\n“Yes,” Qin Junhao answered.\n\n“May I have a copy?” Han Sen asked.\n\n“Of course. What do you plan to do with it, though?” Qin Junhao wondered.\n\n“I want to go to Phoenix-God Mountain; maybe there is something I can do to help Brother Seven,” Han Sen said, squinting.\n\nQin Junhao looked as if he was in shock, and he said, “No! You can’t. That place is too dangerous, and Holy-Sword Emperor is most mighty and strong. And with Brother Seven’s contract, there is no possible way you could save him.”\n\n“If there’s a will, there’s a way.” Han Sen did not explain too much about what he was thinking of doing. More than anything, right now, he simply wanted that map."
}