{
    "chapter": 2461,
    "title": "Digging the Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2461",
    "text": "Han Sen had no reason to hesitate. The geno universe was messy enough, and the woman was just one of the many beings that lived there. It didn’t matter if she was good or bad.\n\nHan Sen pulled out his Ghost Teeth Knife and used it to swipe the mountaintop. He wanted to cut through it.\n\nBut when the Teeth power hit the mountain, that symbol glowed with a deep light. The Teeth power vanished.\n\nThe blade of the Ghost Teeth Knife still struck the mountain, however, carving a mark across the stone.\n\nHan Sen slashed a few more times, and aside from the physical strikes of the weapon, no other powers could damage the stone. The symbol carved into the mountain seemed to just consume any powers that came against it.\n\n“If I have to keep slashing and slashing like this, how long is this going to take?” Han Sen thought gloomily. He tried to cut through the symbol on the mountain first to see if he could remove it.\n\nBut when he tried to strike the symbol, it seemed to sink down into the stone, rather than remaining on the surface. He couldn’t tell how deep it might have sunk beneath the surface.\n\nHan Sen didn’t know what to do, so he just kept striking the peak of the mountain. Luckily, no dangerous creatures had appeared to harass him. Despite all the loud noises ringing from the stone mountain, no hidden xenogeneics were waking up from their slumber to come and see the commotion.\n\nThe light was still resting on the grass, too. It didn’t seem to care what Han Sen did.\n\nHan Sen kept digging, and before long, he became really sweaty. He felt like a senile old man as he hacked away at the side of the mountain. Luckily, the peak was pretty small. Han Sen guessed it might take another two days for him to cut all the way through it.\n\nAfter digging for ten hours straight, Han Sen’s hard work had opened the peak a little. Nothing happened, though, which reinforced Han Sen’s feeling of security.\n\nDong!\n\nHan Sen struck again. But when he raised his knife, he saw that blood was leaking from the stone where his knife had just landed.\n\n“What? Why is the mountain bleeding?” Han Sen’s heart jumped. He took a step back and fell into a defensive position himself.\n\nHan Sen didn’t like the fact that the mountain was bleeding, especially after his time in Du God City. That place had made him afraid of bleeding rocks.\n\nHan Sen wasn’t afraid of having a real fight, but he was unsettled by tricky monsters that messed with people’s heads.\n\nNing Yue’s little green sword had come from a bleeding rock. Han Sen still wouldn’t dare go close to that terrible thing.\n\nAs he watched the blood trickle from the rock, Han Sen’s scalp felt numb. He wasn’t frightened, exactly, but he felt very uncomfortable.\n\nHan Sen waited a while, and he noted that only a small volume of blood had trickled out. And no other weird things seemed to be happening. He waved his hand and brushed the blood away from the wall to look at the knife mark.\n\nWhat he saw next chilled him.\n\nIn the deepest part of the knife mark, Han Sen could see flesh. He didn’t know what creature this might have been, but he had cut a wound into it that was a few centimeters long. The blood had been coming out of that wound.\n\nHan Sen looked at the wound that had now stopped bleeding, his lips pressed into a tight, bloodless line.\n\nHe didn’t know what the creature inside the mountain was. If it had been dead, it shouldn’t have been bleeding.\n\nIf it was alive, how could that be? It had been buried under an entire mountain. Just the mere thought of that was scary.\n\nThe wound he had cut into the creature was the only place that Han Sen could see its flesh. He hesitated a bit, but he eventually decided to resume digging.\n\nHe had already come this far, so he couldn’t just give up now. That wasn’t his style.\n\nEven if the creature was still alive, that didn’t matter to him. If it couldn’t get out of a mountain, it couldn’t have been too horrifyingly strong.\n\nHan Sen used his knife to keep digging around the flesh. If he could dig away the rocks that covered it, he might be able to get a better view of the creature.\n\nHan Sen dug for a while more, and slowly, the excavation site expanded. Eventually, he uncovered a scrap of yellow cloth. The body part Han Sen had wounded was actually a leg.\n\nHan Sen could tell that the leg belonged to a woman. The pants certainly appeared girly.\n\nHan Sen frowned, and he kept on digging. More and more parts of the being were starting to be revealed, and soon, Han Sen was able to confirm that it was indeed a woman.\n\nHe carved carefully into the rock, revealing the woman’s white feet. She was wearing yellow pants, and she had very long legs.\n\nHer upper body was still inside the mountain, so he couldn’t yet tell what she looked like. But he couldn’t detect a lifeforce from her body. She was like a corpse.\n\nBut when Han Sen checked out the wound on her leg again, the cut appeared to have closed. And earlier, she had been bleeding. At this point, Han Sen had no idea if the woman was alive or dead.\n\nHan Sen had a sudden and disturbing thought. He used all his strength to dig away the rest of the mountain. More and more parts of the woman became visible. When Han Sen dug her head out and got a look at her face, his eyes opened wide.\n\nThis woman looked exactly the same as the woman in the wooden house. Even a twin wouldn’t look this similar.\n\n“What’s going on? Why is this woman buried here? If this woman is alive, then who is that woman in the wooden house?” Han Sen shivered as he thought of all this.\n\nBut when Han Sen removed the last of the rock that had held the woman in place, she showed no sign of moving. It really did look like she was dead. She wasn’t breathing, and she had no heartbeat.\n\nBut when he glanced at her face, she looked more at peace than anything. She looked as if she was softly asleep.\n\nHan Sen examined the woman, but she didn’t look sick. She just didn’t seem to have a lifeforce.\n\nHan Sen placed his power into her, but that quickly proved pointless. He couldn’t kickstart her lifeforce.\n\nThe locks on the stone book were still present, as well. So, Han Sen set the woman aside and resumed digging.\n\nHan Sen dug steadily through the stone, and it was only a matter of time before he broke through. His hands were getting pretty sore, and he could hardly hold his knife anymore.\n\n” Xie Qing King is far better suited for this sort of work. With his power, and him yelling ‘Alu alu alu!’ it would get done much faster,” Han Sen thought as he continued digging.\n\n“Han Sen…” Suddenly, Han Sen heard someone call his name. He was about to answer, but when he opened his mouth, his face paled slightly. He quickly closed it.\n\nThe woman told him that if he spoke a word, he would die. There was no one here, anyway, so who could have possibly called him?\n\n“Is it the body of the woman?” Still keeping his jaw firmly shut, Han Sen turned around to observe that woman’s body. When he was halfway through his turn, he froze.\n\nThe woman’s body had vanished.\n\n“Han Sen…” The voice called out Han Sen’s name again. This time, it was right next to his ear, too. He even felt a soft wind tickle his cheek."
}