{
    "chapter": 1262,
    "title": "Strange Occurrence at the Lake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1262",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen stood on a cliffside overlooking the lake. At the water’s center, bubbles began to arise. When they reached the surface of the water, they popped and boiled with an extreme amount of fizz. It was like the opening of a firmly shaken soda can.\n\n“Is the super creature in the lake about to emerge?” Han Sen guessed, as he observed the bubbly activity. But after a while of waiting for something to occur, nothing actually did.\n\nThe bubbles continued to appear, and soon reached a frothy amount. It was as if the lake was boiling with the ferocity of a volcano.\n\n“What is this super creature doing?” Han Sen thought to himself.\n\nHan Sen’s Dongxuan Aura picked up the movement of a rock nearby the lake.\n\nHan Sen looked over at it with his proper eyesight, and lo and behold, he saw it. There was a rock, and as if by magic, it was rolling itself down towards the raging waters of the lake.\n\nHan Sen wondered why the rock had started to move by itself.\n\nThe large rock was not moving too quickly, and its coming was fairly gentle. But when it was a good two meters away from the lake’s shore, it stopped.\n\nHan Sen examined the way it had come, and the rock had left no trace or imprint in the earth it had rolled over.\n\nThe rock was like a boulder. It was ten meters high and had a diameter of six meters. It was a lumpy thing, and observing it from a distance initially gave the illusion of a miniature hill picking up stakes and moving location.\n\nAmidst Han Sen’s confusion around this strange happening, he then noticed a hole inside the boulder. Its diameter was a solid one meter at every angle.\n\nHan Sen hadn’t noticed it at first, and he believed it had only just appeared. It was like a hatch, or something cut out from its original structure.\n\nSoon after, something crawled out of the hole.\n\nIt was a big red toad, scaled from head to toe. On its head, it wore a red pot as if it were a crown. It was a strange accessory to see adorning a toad.\n\n“Is it looking for water?” As Han Sen asked himself this, his eyes flickered back to the hole the toad had emerged from. Weirdly, it was gone.\n\n“Something most peculiar is cooking, that’s for sure.” Han Sen made himself comfy in a position that was a little more hidden and watched intently.\n\nThe toad was a super creature, that much was certain. While it was next to the waters of the lake, the red pot on its head opened.\n\nHan Sen peered into it, and that was when he saw a number of eyes staring back at him. Han Sen was currently garbed with the Night Cloak, though, so there was no chance he could have actually been spotted.\n\nFrom out of the pot, the triangle-shaped head of a snake emerged.\n\nWhile the pot might have looked separate, and more like an accessory to the toad, it was actually a part of the creature. It was rather confusing for Han Sen to see.\n\nBut the snake head he was seeing now was just as strange. It was composed of bones, and it did not even have a tongue to rattle and shake with a seething viciousness. It still had its fangs, though, and the eyes were red gems of a sinister light.\n\nWhen the snake came out and revealed more of itself, the rest of its body was seen to be the same. It was practically a skeleton snake.\n\nThe snake head had looked as big as the pot, but the entire body must have been six meters long, not to mention its wide girth. How it had all fit inside the pot on the toad’s head was quite the conundrum.\n\nThe snake slithered around the toad, and then the toad seemed to issue it a command to enter the lake. Without hesitation, it followed the order and set off swimming to the center of the lake.\n\nThe bubbles in the lake did not appear to be harmful, and the snake had no trouble as it swam.\n\nThe toad issued another command to the snake, and after this, it started to dive.\n\n“So, Mister Bone Snake must be a scout. But who is the real puppet here? Is the toad here by its own volition, or is it also a goon for someone else?” Han Sen pondered.\n\nSuddenly, there was an explosion of bubbles. The water in the lake was thrown into turmoil. Soon after, things returned to semi-normal. The bubbles continued at their original pace and the waters were soothed.\n\n“Blergh!” The toad spat out some blood, and in shock, it began to fall back away from the water.\n\nThe toad wished to reach the rock it had first emerged from, but something came out of the lake and grabbed the toad. The thing tried dragging the toad back in with it.\n\nThe toad struggled, and its claws dug into the earth. The nails broke under the pull of that supremely powerful shadow. With long, skin-crawling marks in the earth for a wake, the toad was pulled into the black depths of the lake.\n\nThe toad’s struggle beneath the water was plain to see, and the lake was upset in response. It was pulled in deep. When things suddenly turned quiet, an unnerving mist dyed the surface of the lake red.\n\nHan Sen was shocked at what he had just witnessed. The toad was a super creature, but it had been killed effortlessly. Whatever monster resided in the lake must have been extremely powerful to do such a thing."
}