{
    "chapter": 1891,
    "title": "Red Mist Mink",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1891",
    "text": "The little beast got hit, and it squealed in agony. It turned around and jumped towards Han Sen. Han Sen was very fast, and because his rabbit shoes were Duke class, he had Duke class speed to run with.\n\nThe beast was only Earl class, so it was much slower than Han Sen.\n\nHan Sen moved like a shadow. He swung his Ghost Teeth Knife and hit the little beast again. Every time he did this, a small wound was left on the creature. Over time, after many more strikes, those cuts were all over its body.\n\nThe wounds kept bleeding as a purple mist oozed out of the injuries. It was only a matter of time before the wounds started to spread.\n\nThe beast was injured, and being unable to withstand the pain, it sought to race back into Red Mist Valley to escape.\n\nHan Sen felt depressed. He had the speed, and he had a good knife to boot. Unfortunately, his powers were actually quite weak. The Viscount class godlight, with Teeth Knife, could not grievously injure the Earl class beast.\n\nHe continued to slash at the beast as well as he could, but the foe was still able to escape into the valley.\n\n“Little Uncle, draw him out again!” Han Sen retreated to a position where he could hide.\n\nLittle Uncle ran back to the entrance, but this time without the bike. The bike was too weak right now, so it was pointless bringing it before an Earl.\n\n“Where are you running off to, boy? Come out and fight Grandpa Wang again!” Wang Yuhang kept barking into the mist, but the creature did not reveal itself again. Perhaps it was because the beast really was quite injured.\n\nWang Yuhang shouted like that for a while, until his voice started to crack and leave him. Still, their foe refused to reveal itself again.\n\n“Hey, is it working? If it doesn’t work, we’ll just have to find another way,” Xie Qing King shouted at Wang Yuhang.\n\nWang Yuhang acted confidently, and he said, “What do you mean? Is it working? No! But I am a man, and I will not give up so easily!”\n\nAfter that, Wang Yuhang turned his back to the entrance of the mist-veiled valley and pulled down his pants. He bent over to reveal his butt, and in a bid to provoke the enemies inside the mist, spread his cheeks. “If you have the balls, you’d come out and fight with me! Otherwise, your kid is my kid.”\n\nSqueak!\n\nAfter Wang Yuhang shouted, a red shadow appeared. It was the same beast, and it was still bleeding from the lacerations it had procured earlier. It ran out, very angry, as if Wang Yuhang had just slaughtered its parents.\n\nWang Yuhang started running, and eventually resummoned his armor. Unfortunately, he was a little late in doing that, and he suffered a bite. He lost a big chunk of flesh from his backside, which bled profusely.\n\n“Oh my God!” Wang Yuhang kept running as fast as he could. Fortunately, he was able to reequip the armor and avoid getting bitten again. But the blood from his bum dyed the armor red.\n\nThe beast was still not keen on giving up, though, and it kept running after Wang Yuhang.\n\nHan Sen gripped his knife and ran out after it. With his speed, he caught up rapidly. The Ghost Teeth Knife, with Tusk, had created a nasty wound on the monster. The beast’s recovery had been slow, as a result. The wounds it had incurred were still bleeding, and they were continuing to spread.\n\nThe beast wanted to kill Little Uncle, but Han Sen hit it again. Now that it had regained its senses, it tried to reverse course back to the valley.\n\nHan Sen kept slashing it. He cast Jadeskin and the Blood-Pulse Sutra, and he ran them both at maximum velocity. His body looked like jade, and his blood was boiling.\n\nDong! Dong! Dong!\n\nAfter three swings, Han Sen felt as if his own blood was going to spill out. A weird, blood-like power entered his Ghost Teeth Knife and dyed it red.\n\n“Mutant Blood Ascended to Viscount.”\n\nThe announcement rang inside Han Sen’s mind, and it brought him sheer delight. The Blood-Pulse Sutra had finally leveled up.\n\nKatcha!\n\nThe now reddened Ghost Teeth Knife was covered in a Jadeskin godlight. It came down on the beast and sliced its paws off.\n\nHan Sen felt very happy about this. The red blade he now wielded was flashing, and blood was being thrown about everywhere. Before the enemy could escape all the way into the mist, Han Sen was able to cut off its head.\n\n“Red Mist Mink Xenogeneic Earl hunted; xenogeneic gene found. Xenogeneic beast soul obtained.”\n\nHan Sen was happy. He picked up the beast and cut it open. He found a red bone inside its body, which he knew was the prized xenogeneic gene.\n\n“Help! I’m going to die.” Wang Yuhang was on the ground, screaming. His butt had been sorely injured.\n\n“No one told you to be that reckless.” Xie Qing King kicked Wang Yuhang’s bleeding butt, which prompted another scream.\n\n“You guys have no heart. I did this for you lot!”\n\nXie Qing King looked at the man with disdain and said, “You had it coming.”\n\n“Little Silver, go heal him,” Han Sen called to Little Silver.\n\n“No… argh!” Before Wang Yuhang could finish, Little Silver fired two bolts of lightning at him—one from each eye. They struck Wang Yuhang’s bum and had him squealing in even more pain.\n\nLittle Silver’s Viscount class healing was very effective. Its only downside was that it dished out a lot of pain. Wang Yuhang’s wounds were completely healed after a short amount of time.\n\n“Little Uncle, try again. See if there are any more xenogeneics inside.” Han Sen smiled at Wang Yuhang.\n\nWang Yuhang didn’t want to, but he still shouted before the entrance of the valley. He wasn’t taking his pants off this time, though.\n\nAfter a while, there appeared to be nothing more. Xie Qing King decided to sketch some shadows and send them into the valley, though. They soon disappeared, but not because they were attacked.\n\n“It looks like there are no more xenogeneics inside.” Xie Qing King put his book away and approached the valley.\n\nThey all entered that place, and as suspected, they weren’t attacked. The red mist was too strong, though, and they couldn’t make out anything.\n\n“The mist is too strong! I can’t see anything. I won’t be able to see any sort of treasure, assuming there is something here,” Wang Yuhang said.\n\nThey couldn’t find anything there, so eventually, they abandoned the valley.\n\n“There has to be something. It’s just that finding it will be annoying.” Xie Qing King frowned.\n\nHan Sen was going to say something, but suddenly, an aircraft came flying down towards Mirror Lake.\n\n“It doesn’t look like an aircraft that belongs to the Rebate. Who would seek to visit this place now, of all times?” Han Sen frowned and called for everyone to return.\n\nThere weren’t many electronic tools that could be used on Planet Eclipse. If they wanted to get some intel, they’d have to go back to base.\n\nOutside of Mirror Base, an aircraft came to park. When the door of the ship opened, it revealed a woman with white, monk-like robes. The woman was very beautiful, and she had a red dot on her forehead. She was a Buddha."
}