{
    "chapter": 2442,
    "title": "I Am an Offering",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2442",
    "text": "Han Sen pulled the broken sword out of Red Cloud’s hand and swung it across the face of the statue. A deep furrow was gouged into the statue’s face, and blood started to leak from it. The statue didn’t move, however. The statue wasn’t as hard as Han Sen had expected, though. After a few more of those strikes, the stone statue’s head fell off.\n\nThe severed neck of the statue gushed blood, but it was just a statue. Where the blood came from, Han Sen had no idea.\n\nStrangely, once Han Sen cut off the head of the statue, it didn’t behave like the Blood Eye Evil God had upon being decapitated. Instead of getting stronger or fighting back, it simply died.\n\nHan Sen examined the statue again to confirm what he thought he saw. The statue was dying. It dried up like a withered plant. It looked somewhat like a bergamot flower. The stalk and its flowers were dark red. The stone head that had been lopped off was the plant’s largest blossom.\n\n“It is a plant!” Han Sen remarked in surprise. He didn’t hear any killing announcement, which made him doubt that the plant was actually a creature.\n\nAfter the flower died, Miss Mirror’s red eyes started to fade. It looked like the red-eye powers were finally gone.\n\nMiss Mirror, however, was too injured to rejoice. She remained on the ground, unable to rise. Han Sen put an arm around her back and helped her sit up. “What happened? Why is Red Cloud here? Why are you hurt?”\n\nMiss Mirror opened her mouth but struggled to speak. “Something happened back at base camp. We need to go back now.”\n\nWhen Han Sen heard that, his face turned grey. Without asking any further questions, he simply picked up Miss Mirror. With her in one arm and Lady Wan’er in the other, he sprinted back to the stone fields.\n\nWhen they reached what was left of the base, their hearts sank. What Han Sen saw sickened him. The base had become a ruin and been painted red with the blood and gore of its inhabitants. No one was left alive.\n\nMiss Mirror looked terrible. A third of Spring Rain’s members had been brought there, and now they were all gone. Furthermore, one of the four Kings was dead, and Red Cloud had been reduced to a King class soldier. Miss Mirror had lost so much.\n\nHan Sen’s face looked awfully glum, too. He feared Ning Yue and Bao’er might have been killed in the carnage.\n\n“Dad?” Han Sen turned to begin searching through the rubble of the ruin, but all of a sudden. Bao’er emerged over the top of one heap. It was like a mountaintop. She jumped onto Han Sen’s chest and wrapped her small arms tightly around his neck.\n\n“Bao’er!” Bao’er was okay, and as she clung to his neck, Ning Yue and Falling Leaf came over the rubble, too. Han Sen was so overjoyed that he dropped Miss Mirror to wrap his arms around Bao’er.\n\n“Argh!” Miss Mirror was too injured to catch herself, and she hit the ground hard. She coughed up some blood and looked rather angered at being suddenly dropped.\n\n“Miss Mirror!” Falling Leaf ran over to pick Miss Mirror up. She imbued her superior with some of her healing powers.\n\n“Don’t bother, I am too injured for that. I won’t heal quickly regardless, so just tell me what happened,” Miss Mirror said abruptly, wiping some of the blood from her mouth.\n\nFalling Leaf told her everything that had transpired, but for some reason, she left out the part with the white-haired man and the conversation he had shared with Bao’er. She also left out the bit regarding the little bird becoming a fiery phoenix. She only said that, after the white-haired man appeared, the people of the base went crazy. They all started killing each other until none of them remained.\n\nBut for some reason, a few of them had been unaffected. They were able to escape amidst the chaos.\n\n“That white-haired man, where did he come from?” Miss Mirror asked with a frown.\n\n“I don’t know. When we first saw him, he was already walking around the base and everyone was going insane,” Falling Leaf said with a shake of her head.\n\nMiss Mirror suddenly had a thought, and she turned her gaze back to Falling Leaf. “That stone. Go and see if the stone is still there.”\n\n“We’ve already looked,” Falling Leaf answered. “The stone is gone.”\n\nMiss Mirror sighed and said, “Go find Red Cloud and bring her back here. We will have to wait for reinforcements to arrive.\n\nHan Sen handed the broken sword to Falling Leaf. She went to the stone fields and brought the frozen Red Cloud back. Although the red-eye power had vanished from the rest of them, Red Cloud was still crazed, and her eyes were still clouded with that shade of red. After she was released, she again tried to attack everyone around.\n\nHan Sen had to freeze her once more. When the reinforcements came, he was going to let them deal with it.\n\nAs for Miss Mirror, Han Sen knew why she had been injured so badly. Han Sen had taken too long, and Miss Mirror had been reaching the limits of her ability to withstand the red-eye power. Then the feelings of addiction had suddenly vanished.\n\nMiss Mirror thought Han Sen had sorted out the red-eye problem, and so she felt relieved.\n\nBut just as she was starting to relax, that addicted feeling washed over her again, and this time it was a few hundred times stronger. The attraction drew Miss Mirror back toward the original statue, and Miss Mirror could no longer resist it.\n\nMiss Mirror’s mind was still quite clear, but her will was no longer strong enough to control the urge. When she approached the statue, she noticed that Red Cloud had come there, too.\n\nMiss Mirror was thrilled for a moment, as she thought Red Cloud might be able to use the broken sword to break the statue. But Red Cloud was crazy, and she attacked Miss Mirror as soon as she saw her.\n\nMiss Mirror couldn’t control her own body well enough to fight Red Cloud, and so Red Cloud beat her to the brink of death. Miss Mirror had been left lying on the ground, struggling to remain conscious.\n\nWhat happened next chilled Miss Mirror’s blood, though. Red Cloud bowed before the statue and began praying. From what Miss Mirror could understand, Red Cloud wanted to use her as some sort of offering. Han Sen had come in time, thank God. If he hadn’t, Miss Mirror would have been killed.\n\nHan Sen thought this was very suspicious, too. He didn’t fully understand what was going on.\n\nHan Sen kept Wan’er close. If she was any distance at all from Han Sen, her eyes and hair would start to turn gold. The further away from him she was, the faster she would turn.\n\nHan Sen experimented with it a little. Wan’er couldn’t be ten meters away from him. Otherwise, even in her coma-like state, her hair would turn gold.\n\nAnd when Wan’er was within ten meters of Han Sen, his ability to use his super god spirit power was greatly diminished. The power would begin to fade as soon as he summoned it. The closer to Wan’er he was, the faster it faded.\n\nClearly, the two of them had a dramatic effect on each other. Luckily, though, the effect only limited Han Sen’s super god spirit body; his other powers remained intact.\n\nHan Sen asked Miss Mirror not to say anything about Wan’er. Han Sen didn’t think Miss Mirror would agree to his request, so it was a surprise for him when she actually assented. She did, however, have a condition of her own regarding the secret.\n\n“What? You want me to be an offering?” Han Sen looked at Miss Mirror with wide eyes."
}