{
    "chapter": 526,
    "title": "Beast Soul of Nightmare",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_526",
    "text": "When Han Sen was at the nest again, he summoned all his beast souls.\n\nFor the time he spent in the Alliance, the golden pincer king had already been evolved into a berserk sacred-blood beast soul, and the golden armor looked even better at this point.\n\nThe gargoyle glyph had also been summoned. The desert bird was hovering over his head, enhancing all the beast souls further. Han Sen felt he had enough strength to blow up a planet.\n\nOf course, that was only an illusion. However, he was much better than before.\n\nInto the nest again, the silver berserk gargoyle quickly rushed toward him.\n\nHan Sen did not dodge this time, blocking the gargoyle's arm with his ghost-pawed claws.\n\nBang!\n\nThe claws and the arm of the gargoyle suddenly clashed, leaving a new long injury on the gargoyle's arm. Silver blood suddenly started to flow.\n\nHan Sen stepped half a step back. His strength was no weaker than this berserk creature.\n\nThe gargoyle roared fiercely, trying to grab Han Sen with its claws, its nails looking like silver daggers.\n\nHan Sen was not weaker than it in terms of either strength or speed. In addition, his footwork was much better than the creatures. So, there was no way Han Sen would let it grab him. As he swayed, not only had he dodged the attacks, but he had also managed to leave scratches on the gargoyle, making it bleed.\n\nThe gargoyle roared angrily, but it could do nothing to Han Sen. It could not even touch Han Sen's body because Han Sen's kiting skills were so good.\n\nAs Han Sen was feeling content, the gargoyle suddenly scratched at him. Just when he dodged the attack, the arms of the gargoyle suddenly gained 2 inches and still clawed at him.\n\nThe ten nails looking like silver daggers suddenly hit Han Sen's armor.\n\nDing!\n\nThe sound of metal made people's ear hurt. However, the nails that looked like daggers did not manage to penetrate the armor, but only left some shallow marks on it.\n\nHan Sen was more than surprised. Berserk golden armor and berserk gargoyle glyph combined, the defense was incredibly strong. Even the berserk gargoyle did not manage to hurt him.\n\nThis strike gave Han Sen more confidence. He took back the ghost-pawed claws and hit the gargoyle with his fists.\n\nBoom boom!\n\nHis fists were thrown, and legs were dancing.\n\nHis fists hit gargoyle, making it step back continuously.\n\nThe gargoyle was overpowered by Han Sen and killed by Han Sen in the end using the yin force.\n\n\"Berserk sacred-blood creature inferno gargoyle killed. No beast soul gained. Meat inedible.\"\n\nHan Sen was dazed. It was the first time he encountered such a result. There was no beast soul or meat. What bad luck exclamation were\n\nLuckily, Han Sen did not mind. There was an egg, which 100% would produce a sacred-blood beast soul. In his hand, it was the same as a berserk sacred-blood beast soul.\n\n\"What sacred-blood beast soul should it be? I would prefer a pair of wings, were a beast soul add-on like the devil sword.\" Han Sen climbed up the cells carefully, looking inside.\n\nThere were many cells at this place. However, as he went deeper, he did not see any other creatures. It seemed that the gargoyle was the only creature there.\n\n\"Is there not an egg?\" Han Sen became a bit worried. Luckily, very soon he saw the egg, making him feel relieved.\n\nWalking up to the egg, Han Sen broke it with the claws and heard the familiar voice.\n\n\"Producing beast soul…\" Han Sen saw a piece of fog coming out of the egg, which gradually became a beast soul in front of him.\n\nThe beast soul looked like it was made of tungsten. It looked like a tiger or a panther. With a horn looking like a lightning bolt, the creature had wings on its back. As it blinked, it looked incredibly fierce.\n\nThe beast soul turned into a light, entering Han Sen's sea of soul. He suddenly heard a voice.\n\n\"Beast soul produced. Sacred-blood beast soul nightmare gained.\"\n\nHan Sen quickly looked at the information of nightmare and saw it was a flying beast soul.\n\nHe summoned nightmare and suddenly had a huge pair of tungsten devil wings on his back, looking rather cool.\n\nHan Sen tried its speed and found it was much faster than the sacred-blood wings from First God's Sanctuary indeed. He almost reached the exit of the nest immediately.\n\n\"Ha ha, I can fly again eventually.\" Han Sen was overjoyed. With the ability to fly, it would be easier for him to do a lot of things. The sacred-blood wings should be fast enough in Second God's Sanctuary.\n\nWithout hesitation, Han Sen fed the black crystal to nightmare. Berserk sacred-blood wings should be the fastest humans had ever seen in Second God's Sanctuary.\n\nWith nightmare wings, unless he had encountered a super creature, Han Sen could be the king of Second God's Sanctuary.\n\n\"It will be even better if I have sacred-blood bow and arrow. Then, I could go back to the top and look down on the entire Second God's Sanctuary.\" Han Sen felt it was a pity that the sacred-blood bow and arrow beast souls were hard to find. After destroying the egg, Han Sen did not have any need to stay in Goddess Shelter, so he decided to check out the situation on the icefield.\n\nPreviously, Li Xinglun and the others had already been discussing taking down the royal spirit shelter. Han Sen wondered if they had achieved an agreement. If the three shelters could unite to conquer the royal spirit shelter, Han Sen would have the opportunity to gain another royal spirit.\n\nUsing Crystal Palace, Han Sen entered the frozen lake from the sea. The angel, Snow Charmer, Meowth, and Mad Shield were also summoned by Han Sen. He had no need to worry about being seen by others, and his trip was rather nice.\n\nSnow Charmer and Mad Shield were in charge of hunting the creature's in the water. After getting mutant meat, Mermaid Princess and Archangel would serve him. He was simply in heaven.\n\nWhen reaching the frozen lake, Han Sen had gained three more mutant geno points, which was because the mutant creature killed was too big in size, so Han Sen had only finished one third of it.\n\nAs for the gigantic creatures that looked very fierce, he thought he should learn some hyper geno arts that could be used under the water, so that he could hunt those creatures later.\n\nEven if he could not eat all that meat, he could feed it to Archangel. When Archangel transformed, Han Sen would be invincible in Second God's Sanctuary.\n\n\"When I go back to the Alliance, I must find a way to get my hands on a hyper geno art that could be used under the water. I wonder if there is one that could allow me to breathe under the water,\" Han Sen wondered.\n\nHe came to the Starwheel Shelter again, before Han Sen went to Li Xinglun, Zhu Ting found Han Sen.\n\n\"Han Sen, I eventually found you. I have made an agreement with Blackgod and Philip. We will attack the royal shelter in a couple of days. Come and help me, will you?\" Li Xinglun said excitedly."
}