{
    "chapter": 2650,
    "title": "Different Kind of Luck",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2650",
    "text": "“Why should I let you see them?” Han Sen asked, his voice relaxed and unhurried. He casually rolled up the paper, then turned a cold glance on Liyu Zhen as he spoke.\n\nLiyu Zhen looked at Han Sen with disdain, then chuckled darkly. “You are with the Very High now.”\n\n“Yes. And?” Han Sen’s face remained expressionless.\n\nLiyu Zhen wasn’t annoyed. Instead, he smiled and said, “I just want you to know that if a Very High asks something of you, you cannot say no.”\n\n“Oh, yeah? I just said it. What are you going to do about it?” Han Sen said.\n\nHan Sen thought Liyu Zhen was going to fight him, but it didn’t seem like Liyu Zhen was going to go that far. He just continued to stare coolly at Han Sen, and then, the third eye in his forehead opened. His black and white pupils looked like a tai chi yin yang symbol. That black and white symbol began to spin. It looked like some invisible light was brewing within it.\n\nHis gaze now looked as if it could see through everything, and it made Han Sen frown.\n\nLiyu Zhen looked into Han Sen’s yellow piece of paper. With a disdainful look, he said, “I thought you had pulled up something nice, but it’s just a pornographic picture. I overestimated you, clearly.”\n\nAfter that, Liyu Zhen went back to ignoring Han Sen. He returned to his fishing spot and continued with the task.\n\nIt was a coincidence. Liyu Zhen sat there and fished for a while. But later on, his Underworld Silk began to move. It shook a lot, and it appeared as if something big was on the other end.\n\nLiyu Zhen quickly pulled the line. He tried his hardest to tug it out, but the thing seemed heavy.\n\nPang!\n\nAfter ten minutes of wrestling with the submerged foe, Liyu Zhen managed to pull out an item from beneath the mist of the lake. The object bounced right out of it and landed on the shore.\n\nHan Sen couldn’t help but look at it. He saw a big gold sword that was similar to the one Bao’er had retrieved. It looked a lot rougher around the edges, though. It also seemed to lack the jewels. It was just a big gold sword that was missing its luxurious touches.\n\nLiyu Zhen looked at the big sword with excitement. He spoke to himself, saying, “Gold Slash… Is this the deified Gold Slash? The Seventh Uncle was right. My luck has finally turned around.”\n\nHe picked up the big gold sword with a look of unbridled joy. He was extremely fond of his new catch. And after goofing around with it for a while, he decided to end his day of fishing. He put his Underworld Silk away and started to leave with the golden sword in his hand.\n\nWhen he passed by Han Sen, Liyu Zhen looked at him. He acted as if he was talking to himself, but the words of poison were obviously meant for Han Sen to hear. “This is the luck that separates you from I. You can only fish up that useless and dirty pornography, while I get deified treasures.”\n\n“Really? Your piece of crap sword is a deified treasure?” Han Sen said with a laugh.\n\n“Such an ignorant kid you are! Gold Slash is an obscenely rare treasure to fish up from the Underworld Lake. It is deified at the very least. Although it is a primitive treasure, it is much better than your dirty pictures,” Liyu Zhen said with a cold laugh.\n\n“That means there are higher-level Gold Slashes to be found, right?” Han Sen asked.\n\n“Of course there are. One of our leaders managed to obtain a butterfly-class Gold Slash, but that doesn’t matter to you. Carry on fishing up your useless, dirty porn… Haha!” Liyu Zhen held his sword proudly and laughed as he wandered off. He laughed in mockery.\n\nHan Sen couldn’t be bothered with the man. He thought to himself, “It looks like the sword Bao’er got was also a Gold Slash. But it is obvious that Bao’er’s is of a higher class. Which class it is has yet to be determined, though.”\n\nAfter Liyu Zhen left, Han Sen felt a lot more comfortable where he was. It felt good to have no one watching him again. He planned to fish one more item out of the lake, then let Bao’er carry on while he went back to practicing with his geno arts.\n\nNot long later, Han Sen felt the Underworld Silk move. Something had latched onto the line.\n\nHan Sen thought it would just be another yellow paper, but the item he pulled up was black. It wasn’t the same yellow paper as before.\n\n“Has my luck taken a change for the better?” Han Sen’s heart jumped. He quickly grabbed the black thing to take a look at it.\n\nWhen Han Sen picked it up, a chill ran through him. This new item was also a sheet of paper, but it was black this time, and it was much thicker than the yellow sheets he had previously retrieved.\n\n“Am I going to collect seven different colors of paper before I move on? Can I summon a dragon along with it?” Han Sen complained, turning the paper over so he could check it out.\n\nHan Sen had a look, and the sight made him freeze. This new piece of paper was indeed quite different. The thick black parchment appeared to be the cover of a book. Furthermore, there were three words written on the front.\n\n“Xuan Yellow Sutra. This cover cannot be a cover for all of those yellow papers, can it?” Han Sen was shocked. He flipped it over and had a look at all the small words inside the cover.\n\n“If the man is in chaos, the sky and the earth will be in chaos. And the sky and the earth will turn yellow.” Han Sen was shocked. This line of words was the prologue of the Xuan Yellow Sutra. This was definitely some sort of geno art, but it didn’t seem to have anything to do with the yellow papers he had collected.\n\n“Maybe this isn’t a cover for the yellow papers. Maybe it’s meant for another book?” Han Sen thought the entire situation was strange.\n\nHan Sen hesitated. While Bao’er began fishing, he brought out all of the yellow papers and started to piece them together. He noticed all of the yellow pages had numbers. So, Han Sen arranged them in order of their numbers. There were many missing pages, however. The highest number was 254, but Han Sen only had 20 pages in total.\n\nHan Sen put them down next to the Xuan Yellow Sutra and noticed that their size was a perfect fit. Still, he couldn’t be sure if the cover was really meant for his yellow papers.Han Sen thought this was a bit weird. He looked at the contents of the yellow paper, and when he looked over them, he felt a strange sensation.\n\nHe thought the pictures had merely been the doodles of some horny guy in ancient times, so he had never inspected them closely. But now that he was, he noticed something.\n\nThe people in the picture were covered in thin veins of blue and red. The small lines were very light. If Han Sen hadn’t decided to examine the papers closely, he wouldn’t have noticed them at all. Few drawings were so realistic that they mapped people’s veins and arteries.\n\nBut after a thorough inspection, he realized they weren’t blood vessels. The small, blue lines should have been meridians, and the red were likely the presence.\n\nHan Sen was so shocked, and he thought to himself, “This isn’t a porn picture. It is a geno art! But why would a geno art look like this? It is easy to misunderstand it.”\n\nDue to the fact that there were no descriptions or text, and Han Sen was missing many more pages, he couldn’t be entirely sure it was a geno art. But regardless, his interest in it had been sparked.\n\nHan Sen took the Underworld Silk away from Bao’er. He continued fishing, and a little while later, he fished up another yellow paper."
}