{
    "chapter": 2563,
    "title": "Try Your Best",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2563",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nTwo demon crocodiles appeared at the same time. Han Sen teleported over to the one that was farther from him. He gave the closer one to Exquisite, as he didn’t want to steal the kill from her.\n\nGravity was strong there. Even teleportation happened slowly beneath that level of pressure. When Han Sen teleported near the demon crocodile, Exquisite had already killed the creature.\n\nExquisite looked at Han Sen and then teleported again. She appeared in front of Han Sen, cutting the other demon crocodile in half as well.\n\nThese crocodiles were just second or third-tier Kings, but they lived in an environment with strong gravity. Their bodies were incredibly dense and hard. It was scary to see Exquisite kill one in a mere second.\n\nBut Han Sen was no longer focused on Exquisite’s skills. If they had been engaging in a simple competition before, things had now gone beyond that. This was straight-up thievery.\n\n“Lady Exquisite, do you have to be in such a rush?” Han Sen said, looking at her.\n\n“If I can earn more by putting in more work, why wouldn’t I do my best?” Exquisite asked coolly. There was no emotion in her voice. She spoke as if this was something that she did every day.\n\n“You are right. People should do all they can.” Han Sen looked at Exquisite and nodded.\n\nLi Keer hastily tried to repair the atmosphere of the group, and so she said, “Please do not mind her behavior, Dollar. Third Sister is always like this. She doesn’t hate you.”\n\nHan Sen laughed and said, “Lady Exquisite is right. Trying your best is the right thing to do. I need to learn from her.”\n\nThe atmosphere was awkward, to say the least. Li Keer didn’t know what to say now. The three of them continued to travel forward. The planet was very large. They had to slog forward under the weight of its gravity. After flying for an hour, they spotted another demon crocodile.\n\nAs soon as the creature came into view, Han Sen and Exquisite were gone. Exquisite wanted to make sure that she didn’t let Han Sen kill a single demon crocodile. She was going to get every one.\n\nLi Keer felt glum. She didn’t want to test Han Sen this way, but if this was how Exquisite wanted to do things, she had no choice but to accept it. After all, she was low-ranking in the Very High. She had no authority over Third Sister Exquisite.\n\n“If this keeps going, Dollar will get angry,” Li Keer thought to herself. She didn’t know what she could do to make their relationship better.\n\nWhile she was thinking, Li Keer saw the demon crocodile’s skull crumble. In a split second, its metallic head was reduced to sand.\n\nLi Keer was surprised. The creature hadn’t died by Exquisite’s space cutting skill; that was the geno art called Big Destroyed.\n\nExquisite knew many geno arts, but not even she knew Big Destroyed. The geno art couldn’t be learned unless someone had the body of a Destroyed. Although there were some members of the Very High that had been fortunate enough to study Big Destroyed, the numbers of such people were few. And they had a great deal of difficulty becoming proficient with the skill. Exquisite had never bothered with it.\n\nLi Keer took a closer look. It wasn’t Exquisite that had broken the crocodile’s head. It was Han Sen. She was surprised, and she murmured to herself, “He really did learn Big Destroyed.”\n\nWhen Li Keer had seen Han Sen receive Big Destroyed in trade, she had thought Han Sen was being an idiot. She believed it would be impossible for him to learn it. However, in such a short amount of time, Han Sen had become proficient with the skill. And on top of that, he could use it in battle now. It was scarcely believable.\n\n“Is this guy that talented?” Li Keer looked at Han Sen with shock.\n\nBefore, Han Sen had easily learned God’s Wander. When he did, Li Keer was very surprised. Now, he was showing off Big Destroyed.\n\nThe most unbelievable thing about it all was that Han Sen had managed to kill the demon crocodile before Exquisite could. Li Keer couldn’t believe it.\n\nLi Keer didn’t think there was any way that Dollar’s teleportation ability could be superior to Exquisite’s. Dollar had only just learned God’s Wander, after all.\n\n“How can he be faster than Third Sister?” Li Keer looked at Exquisite. Exquisite was staring at Han Sen.\n\nExquisite’s face was expressionless, but she was shocked on the inside. She was thinking as hard as she could, trying to figure out how Han Sen was faster than her. It should have been impossible.\n\n“Lady Exquisite, I’m sorry.” Han Sen laughed and dug out the demon crocodile’s xenogeneic gene.\n\n“You got it with your power. There is no need to apologize,” Exquisite responded in a level tone. Then, she resumed her flight.\n\nExquisite thought she must have underestimated Dollar. Because of that, she must not have tried her best. “This is good. It is great that I can force him to reveal his true power.”\n\nBut Exquisite formulated a plan to keep Han Sen from securing any other kills after this.\n\n“Dollar, you really managed to learn Big Destroyed?” Li Keer flew over to Han Sen and tried to chat with him.\n\n“I got lucky. I’ve only just learned it,” Han Sen said.\n\n“Are all humans so talented? Why have I never heard of this race before?” Li Keer and Han Sen started to chat.\n\nHan Sen and Li Keer were talking, but Han Sen kept his eyes peeled for crocodiles. Li Keer was a little distracting, and Exquisite wasn’t talking. All of her focus was placed on her surroundings. She was going to make sure she killed any creatures that appeared before Dollar could get to them.\n\nSuddenly, a demon crocodile appeared in front of Exquisite. Exquisite used God’s Wander to teleport over to it. But when she appeared in front of that demon crocodile, the crocodile’s head had already been crushed. Han Sen was standing right next to her, chuckling.\n\nLi Keer and Exquisite were both frozen. When this happened the first time, they could convince themselves that it had been a fluke or a mistake. This time, however, they couldn’t deny that Exquisite had simply lost.\n\nThis time, Exquisite had tried her best to reach the demon crocodile first, but she had lost to Dollar again. And on top of that, he’d been in the middle of a conversation with Li Keer.\n\nExquisite let her eyes linger on Han Sen for some time. Then, she looked back at Li Keer and asked, “Is he using God’s Wander?”\n\nExquisite could tell that Han Sen was using God’s Wander, but there was no way Han Sen’s God’s Wander was better than hers. Her experience with God’s Wander should have been far greater than Han Sen’s. She shouldn’t have lost to him.\n\n“That must be God’s Wander, right?” Li Keer wasn’t sure anymore, either. She knew that if Dollar was using God’s Wander, he couldn’t be any faster than Exquisite. But somehow, he was.\n\n“Next time, take a closer look and observe. See if he is truly using God’s Wander,” Exquisite instructed.\n\nThe three of them kept on traveling. When they saw another demon crocodile, Exquisite focused her mind beyond what she thought was possible. But even so, she was still slower than Han Sen.\n\nThis time, Li Keer and Exquisite were able to confirm that Han Sen was indeed using God’s Wander. But he should have been no better than a beginner with God’s Wander. He should have been far slower than Exquisite.\n\nBut this beginner level of God’s Wander was faster than Exquisite’s advanced techniques. Exquisite couldn’t believe this truth, but as they continued to move forward, she was no longer able to collect any more spoils from the demon crocodiles. The next seven demon crocodiles were stolen by Han Sen."
}