{
    "chapter": 2311,
    "title": "Legendary Extreme King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2311",
    "text": "Bai Wuchang had been strung up like a caught rabbit while fighting a Duke. The news spread through the Extreme King like wildfire. It became a well-known tale far and wide. Bai Wuchang had been beaten and hung upside-down by a Duke. And that Duke was Bai Wei’s own Royal Guard. No one believed the story when they first heard it.\n\nAfter all, Bai Wuchang had the infamous Phantom Ghost King Body. He was the sort of foe that gave King class opponents headaches. How could he have been beaten so handily by a mere Duke?\n\nThose who didn’t believe the tale soon discovered that the story was true, of course. Some of the royal children had taken videos of Han Sen and Bai Wuchang’s fight. They were published all across the Extreme King’s internet. The video was hastily downloaded and watched by many people.\n\n“Sh*t! Who is this guy? He has such sneaky knife skills.”\n\n“Too sneaky. He didn’t gain victory by fighting Bai Wuchang face-to-face. With those invisible knife silks to exhaust all of the prince’s powers, I wouldn’t even call this a fight.”\n\n“You know nothing. That is precisely why this Duke is so scary. Even Prince Wuchang couldn’t level the fight between them.”\n\n“It is scary. Prince Bai Wuchang’s Phantom Ghost King Body has always defied restrictions, and that Duke bound him anyway. That man’s power is frightening. It seemed to resemble the Rebate’s Teeth Knife, actually. But Teeth Knife cannot produce silks like that, and there’s no way it could touch the Phantom Ghost King Body.”\n\nThe fight became a hotly debated topic. They were used to Bai Wuchang occasionally selecting victims to pummel with his power, but they didn’t know how to react when Bai Wuchang got manhandled by a Duke. The feelings elicited by this were hard to explain.\n\nAll of the princes and princesses behaved so awkwardly now. After all, King Bai was very affectionate to Bai Wuchang, and he was a very cocky man. Many of the royal children avoided Bai Wuchang, but deep down, they didn’t agree that he was the most talented prince. That reputation, combined with his preferential treatment, made them rather jealous.\n\nBut now, Bai Wuchang had been taught a lesson by a Royal Guard. Many of the royal children were happy to see him get knocked down a peg or two.\n\n“So what if he is talented? He is just some dumb*ss with powerful limbs! He got played by an outsider Duke. He is embarrassing, and yet, Father treats him so well.” A prince that saw the video laughed.\n\nMiss Mirror watched the video multiple times. She looked more and more shocked by each replay.\n\nWhat she had seen in The Grave of Soldiers and Kings was very different from what she was seeing now. It made Miss Mirror wonder if the Duke in the video was really the same Han Sen she had witnessed in the Grave.\n\nInside the Grave, Han Sen used only raw power to fight. He was like some muscle-bound ape, hellbent on crushing all that came at him.\n\nBut in this fight, Han Sen was sinister and cunning. He played Bai Wuchang from beginning-to-end. The frustrated prince was unable to release his own Phantom Ghost King Body power.\n\n“What a powerful strategy and amazing knifeskills. Did he learn those in Sky Palace? But can Sky Palace’s knifeskills suppress the Phantom Ghost King Body?” Miss Mirror stared at the video in deep contemplation.\n\nSuddenly, Miss Mirror’s gaze stopped at Han Sen’s hand. The video wasn’t very clear, so Miss Mirror couldn’t be exactly sure what she was seeing.\n\n“Zoom in here and enhance this image,” Miss Mirror called out to a couple of techs while pointing at a finger on Han Sen’s right hand.\n\nThe image zoomed in and clarified. There was a silver and emerald ring on Han Sen’s finger.\n\nThe moment Miss Mirror saw the ring, her face whitened. Her jaw clenched as she stared. That calm, attractive expression of hers was gone, and she was starting to look like a completely different person.\n\n“That ring… Why does he have it? Did he find his grave inside The Grave of Soldiers and Kings?” Miss Mirror’s expression was unreadable.\n\nShe stared at the ring on Han Sen’s finger for a while before returning to her bedroom.\n\nAfter closing the door behind her, Miss Mirror took out a little box from beneath her bed. She hesitated at first, then slowly opened it. She looked inside it with a conflicted expression.\n\nThe box held a silver ring. It was set with an emerald that looked like an eye. It was just like the ring Han Sen had dug up from The Grave of Soldiers and Kings, but this one was a size smaller than Han Sen’s.\n\nMiss Mirror touched the ring in the box, but she didn’t take it out. Then, she closed the box and put it back.\n\nMiss Mirror’s expression looked normal again, but something unsettling was still visible in her eyes.\n\nMiss Mirror turned around to leave the room, but she hesitated and returned. Her eyes looked so serious as she took the box out again. She picked up the ring, placed it on her finger, and spoke to herself.\n\n“You might have kept it hidden for many years, but you couldn’t hide it forever. You would have never thought that the ring would wind up in the hands of an outsider Duke. If you were to learn of this, you’d be rolling in your grave.”\n\nAfter that, Miss Mirror laughed. She laughed so hard that her eyes began to glisten with tears. “Interesting, so interesting… This Han Sen is most intriguing.”\n\n…\n\nInside an Extreme King palace, an elegant woman was watching Bai Wuchang practice knife skills. She frowned and said, “Wuchang, I told you that when learning the arts of combat, you need to be more versatile. Depending solely on your Phantom Ghost King Body is a bad plan. I hope you learned a little lesson from this experience. Consider it a warning. You need to learn more from your teacher Ancient Abyss.”\n\nBai Wuchang didn’t answer or even look at her. He clenched his knife and kept swinging it through the air. He didn’t use power, though. He looked like a commoner practicing combat.\n\n“I’m talking to you. Are you listening?” A little anger crept into her voice as Bai Wuchang ignored her.\n\nBai Wuchang eventually stopped, looked at the pretty woman, and spoke coldly. “I am going to Extreme Mountain.”\n\nThe pretty woman jerked her head up and said, “No. No way! That is too risky.”\n\n“I blaze my own trails,” Bai Wuchang stated flatly. Then he left the training grounds without hesitation.\n\n“Wuchang, stop right there! Do you hear me? I will not allow you to go to Extreme Mountain. This is impossible…” The pretty woman’s face was twisted, and her voice was very sharp.\n\nBut Bai Wuchang walked away without looking back. He sounded certain when he said, “The moment I exit Extreme Mountain is the moment I will go and fight Han Sen again.”"
}