{
    "chapter": 2293,
    "title": "Passing the Test",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2293",
    "text": "“Dad, the woman has no more blood. Dad… he cracked open the woman’s brain…” Bao’er kept reporting what was happening.\n\n“Bao’er, stop looking!” Han Sen called Bao’er back into his arms. He didn’t want her to see such a bloody scene.\n\nBao’er was actually quite old at this point, but in Han Sen’s eyes, she’d be a little girl forever.\n\nBao’er jumped off of Han Sen’s shoulder to sit on his chest. She looked curiously at the Four Symbols Seal and the trapped xenogeneic that was still struggling inside.\n\nHan Sen still couldn’t feel anything behind him, but after hearing what Bao’er had said, he felt sick with worry. The images of what she had described kept repeating inside his mind, and nothing he tried to think about could scrub them away.\n\n“Jade Cat, what are you doing!” Han Sen finally shouted at the statue of the jade cat.\n\nThe jade cat already seemed to be sleeping again, and it showed no reaction to Han Sen’s call.\n\nAfter a while, the prisoner’s chains began to rattle again. As it left the space behind Han Sen’s back, it slowly entered his field of vision. The prisoner left in pretty much the same manner that he arrived, slowly and seemingly vacant-minded.\n\nThere was one small difference, however. He was dragging the corpse of a woman behind him.\n\nTo be more accurate, that was not the body of a woman. It was a female creature’s body.\n\nHan Sen couldn’t see what the female creature’s facial features had been, because a large hole had been punched into the creature’s head. There was a gaping cavity where the face had been. The upper part of her body was humanoid, though, and the lower body was like a snake. She looked like one of the Ghana, but unlike the Ghana, there was a spiraling horn on her head. It was silver and around one foot long, and it was reminiscent of a unicorn’s horn.\n\nThe snake scales of her lower body were silver, as well. They were so bright that they made her form seem a little transparent. Holes had been torn through her head and chest, but there was no blood oozing out. It was just as Bao’er had originally said, in that the blood of the woman had run dry.\n\n“What is that weirdo’s presence here supposed to mean? Why would he draw a woman on my back?” Han Sen wondered, somewhat shaken.\n\nBut Han Sen didn’t seem to be injured or impaired. His body was fine, his Galactic Lobster Armor was fine, and it looked like the creepy prisoner guy was leaving now that he had drawn his picture.\n\nAlthough the whole experience had been rather disturbing, the creature hadn’t actually hurt him. So, Han Sen knew he’d just have to stop thinking about it.\n\n“Bao’er! Could you use some water to wash your dad’s armor? Wash away the mess he made,” Han Sen said to Bao’er. While the paint hadn’t been harmful, he was still unhappy to have it on him.\n\nBao’er jumped off of Han Sen’s chest and walked behind him to do as he asked. Then her surprised voice said, “She is gone!”\n\n“What is gone?” Han Sen’s heart jumped into his throat.\n\n“The picture he drew is now gone,” Bao’er said.\n\n“How could it be gone?” Han Sen was very confused about this, and so he proceeded to ask, “Did the picture just get smeared?”\n\nBao’er shook her head. “Dad, there’s nothing on your back. It is very clean, and there is not even the smallest semblance of a bloodstain. The ugly woman drawing is all gone.”\n\nHan Sen had no idea what to make of this, so he asked Mister White, “Mister White, what is going on?”\n\nMister White shook his head. “I don’t understand any of this, either. We couldn’t see your back, and we were only able to see that he was drawing something on you. I don’t know what it was that he actually drew.”\n\nHan Sen didn’t like not knowing, but there was little that he could do about it. He checked his body and noted how nothing seemed to have happened, so for now, he shelved all thoughts about it.\n\nNothing strange happened after that. The four of them kept sending power into the Four Symbols Seal. It maintained a firm hold on the snared xenogeneic clone. Days passed, and after what felt like forever, they reached the ten-day deadline.\n\nAlthough the four of them were quite exhausted by this point, they had at least managed to survive the ten days.\n\nWhen the xenogeneics returned to their palace lairs and the doors of their palaces closed, the four of them almost collapsed.\n\nThe jade cat statue smiled and began speaking again. “Congratulations! You have passed the Sacred Leader’s test. You can now receive the relic left behind by the Sacred Leader.”\n\n“Where is the treasure?” Han Sen asked, forcing himself to ignore his exhaustion.\n\n“Right here,” the jade cat statue said. The jade pillar below its feet then suddenly opened up, revealing a small jade box. It was impossible to guess what might lay inside.\n\nHan Sen started forward to pick up the box, but then, his heart jumped up. He saw that Crime was holding a broken sword, slashing towards Han Sen.\n\nThe blood kirin was angered by this, and so it roared and leaped towards Crime.\n\nBut Crime’s darkness covered everything, and Han Sen’s eyes were unable to pierce it.\n\nHan Sen didn’t move his eyes, though. The bird’s nest was still on his head, and he leaped towards where the box had been before everything went black.\n\nIn Crime’s area-of-effect, all seven of Han Sen’s senses were blocked. But because he had the protection of the bird’s nest, he wasn’t concerned about any attacks that Crime might launch.\n\nBut the next second, Han Sen’s face changed. A weird power came down to strike the bird’s nest. The power locked onto the bird’s nest and pulled it away from Han Sen’s head.\n\nThen, he and Bao’er were tied up by something like a rope. The rope jerked them roughly to the side.\n\nThe darkness faded. Han Sen noticed that he and Bao’er were now bound by loop upon loop of white rope. Next to them, there was a net with Han Sen’s bird’s nest inside it. The net must have been quite special if it was able to bind a deified bird’s nest.\n\nCrime held the net in one hand and the jade box in the other.\n\n“Thank you for helping me obtain the Sacred Leader’s treasure,” Crime said coldly to Han Sen, holding the box casually under one arm.\n\n“Who are you?” Mister White frowned at Crime.\n\nCrime smiled and said, “Mister White, I am your faithful guard Crime.”\n\n“You look like Crime, but Crime is just a King-class guard. You most certainly aren’t. Crime wouldn’t possess Prince Fourteen’s Sky Net,” Mister White stated flatly, his frown deepening.\n\nCrime slid the box into his chest pocket. Then, he lifted his broken knife and spoke to Mister White. “You think too much. Although I am half-deified, I am still your guard. But aside from you, I have a duty to Prince Fourteen, as well. Prince Fourteen wants this item, so I will have to take this back with me.”\n\n“Mister White, we both work for Prince Fourteen. You have helped me a great deal, and I will tell Prince Fourteen of your involvement. But this is not where this should be discussed… We need to get rid of him first,” Crime said. Then his broken knife came swinging towards Han Sen."
}