{
    "chapter": 1183,
    "title": "Incorrect Judgment",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1183",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen Han Sen heard what he was told, his immediate reaction was to frown. Surprises were nothing new to him at this point, but this one hit a little harder than most.\n\n“You are the Vice-Leader of Blood Legion? In that case, you know who the leader is?” Han Sen asked.\n\n“You aren’t a member, so I’m not obliged to tell you anything. But now that you’re out of that shelter, I heartily recommend you don’t return,” Baby Ghost said.\n\nHan Sen thought the person who gave him the paper must have noticed or sensed he was wearing the Nine-Life Cat pendant, and that the parchment used was in reference to it. That didn’t seem to be the case, though. Baby Ghost did not seem to know about Han Sen’s connection with Blood Legion, and the paper Baby Ghost had been using to warn Han Sen had only been intended to flaunt the organization he was a member of.\n\n“If you don’t think I’m a member, why would you help me?” Han Sen asked.\n\nHan Sen had just met one of the most important figures of the enigmatic Blood Legion organization. Although he could not be one-hundred percent certain he was not being told a falsehood, he wanted to ask as many questions as he could and learn more. This was a wildly rare opportunity.\n\nBaby Ghost merely stared at Han Sen, saying, “Your image; you remind me of someone.”\n\n“Who?” Han Sen was not expecting this response.\n\n“Han Jingzhi,” Baby Ghost answered.\n\nThe composure of Han Sen’s mind was given a shake, but he still managed to calmly ask, “How do you know him?”\n\nBaby Ghost’s face suggested he had just taken a brief trip down memory lane. When he returned to the situation at hand, he just told Han Sen, “You don’t need to know anything about all this. Just don’t go back to Immortal Shelter.”\n\n“At least tell me why. Give me one good reason why I should leave. I can’t just walk away after everything, all because of your few measly words,” Han Sen proclaimed.\n\nBaby Ghost turned around and said, “If you want to go back, go back. I won’t stop you. But on your head be it, should things run afoul for you.”\n\n“Wait!” Han Sen brought out the Nine-Life Cat pendant that was tucked beneath his shirt and said, “If you are the Vice-Leader of Blood Legion, surely you know what this is, don’t you?”\n\nBaby Ghost turned back around, and the stiffness of his face dropped in shock. His eyes widened as they peered at the pendant.\n\nBaby Ghost suddenly moved.\n\nHan Sen opened his gene locks, ready to fight. But what happened in the next second surprised even him.\n\nBaby Ghost had dropped onto the ground so quickly that a crater was formed. In that shallow pit, he bowed before Han Sen.\n\nPang! Pang! Pang!\n\nBaby Ghost bowed repeatedly, with alarming speed and sincerity. All the while, his lips murmured and mumbled incoherent speech.\n\nHan Sen froze in his place, having not expected a reaction such as this. This was a king spirit of the Third God’s Sanctuary. It had the potential to beat any human. But there it was, down on its hands and knees in respect to a small item belonging to a human organization.\n\n“Is Blood Legion that big of a deal?” The pendant he always carried with him suddenly felt much heavier.\n\nBaby Ghost then stood up. In a state of shock, he asked, “Who are you? Why would you possess that relic?”\n\nSeeing Baby Ghost’s face, Han Sen felt giving him the wrong answer now would swiftly lead to his death.\n\n“Han Jingzhi gave it to me,” Han Sen answered.\n\nBaby Ghost’s face changed to one that was resolute. He barked, “That’s impossible! Han Jingzhi could not have possessed such a relic.”\n\n“But this did belong to him,” Han Sen re-confirmed.\n\nBaby Ghost then said, “It belongs to Blood Legion; what are you suggesting?”\n\nHan Sen always thought Han Jingzhi might have been the leader of Blood Legion. There was definitely a strong association between the two, after all. But now, hearing Baby Ghost’s reaction, that didn’t seem likely.\n\nThe fact that Baby Ghost was willing to state Han Jingzhi’s name so freely also suggested he wasn’t the leader or anyone of renown and importance within the ranks of Blood Legion.\n\n“Han Jingzhi is a part of Blood Legion, isn’t he? Why would it be impossible for him to have it?” Han Sen asked.\n\nBaby Ghost’s expression had turned dark, as if the fancy for murder had taken over his mind. Angrily, he spat out his words, saying, “You really are talking sh*t! Han Jingzhi is not a member of Blood Legion and there is no possible way for him to possess that relic. Be honest with me, boy; lest I pry the answers out of you with profound agony and suffering.”\n\nHan Sen was shocked, hearing Han Jingzhi was not even a lowly member of the organization. If Baby Ghost really was the Vice-Leader, then it clearly meant he knew more about Blood Legion than Han Sen did. And that flipped all of Han Sen’s theories thus far on their head.\n\nBut why would Han Jingzhi ask Uncle Bug to join him in a search for the relic? Why would he know about its existence, given where it was found?\n\n“Believe it or not, this was originally Han Jingzhi’s. A lot of people can verify this claim,” Han Sen said, standing his ground.\n\nBaby Ghost looked at Han Sen as if he was trying to scan his mind and discover the truth behind some lie he was being told.\n\nHan Sen then said, “So tell me, how do you know about Han Jingzhi?”\n\nBaby Ghost wished to say something more, but his face changed. Then, he turned to look through the dense brush of the walnut forest.\n\n“Wait here and do not follow me back to the shelter. I will be right back.” Baby Ghost then took off back towards the Sky Tree.\n\nHan Sen knew something big must have gone down in with the Sky Tree during their absence; otherwise, Baby Ghost would not have run off in the middle of their conversation.\n\n“Is the tree in the midst of reviving?” Han Sen also ran towards the Sky Tree.\n\nHe had waited a long time for this opportunity, so he wasn’t going to miss it.\n\nEverything seemed fine in the tree, though, as spirits and creatures were performing their labor duties like normal. Dry Bone King quickly ran over to see Han Sen, though, and promptly brought him up to the higher floors.\n\n“Mister Immortal has finished his practice. He has summoned us to the Immortal Hall. Where have you been?” Dry Bone King asked as he pulled on Han Sen to move quicker.\n\nHan Sen was shocked. If Immortal Emperor was becoming a reality, then that meant the tree was ready to spring back to life."
}