{
    "chapter": 1689,
    "title": "Treasure in the Box",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1689",
    "text": "Five crystal-looking fingers were held against the box like the keys of a piano.\n\nThe thing started to climb out of the metal box in a strange manner, and as it left, the light inside the container dimmed. When the hand came out of the metal box, Han Sen and Old Cat were both shocked seeing it.\n\nThey thought some monster would climb out, but when the hand came out, it was just that It was just a hand with nothing else attached.\n\nThe hand was like jade, and it was connected only to a small portion of arm. There was nothing else after. The back end was like a rocket, though, exuding a fountain of light\n\nThe inside of the metal box was now empty, and the light was gone.\n\n“You said there is geno armor inside. What is that thing?” Han Sen asked, pointing at the jade hand.\n\n“I… do not know…” Old Cat looked at the hand, seeming confused.\n\nHan Sen wished to say something, but before he could, the hand bounced up. It clenched into a fist and shot forward with the light propelling it from behind. It was firing at Han Sen.\n\nIt was so fast, Han Sen was surprised. Evading it was difficult, even with the armor he was wearing.\n\nHan Sen dodged the fist. He couldn’t figure out what the hand was, and he most certainly didn’t want to touch it.\n\nThe hand was like a living creature. It turned around and came for him again.\n\nHan Sen kept trying to dodge, but the speed of his armor wasn’t enough to keep up with the fist. He had to use his dongxuan movements and Heavenly Go to escape the hand.\n\nHan Sen was shocked. The last thing he wanted was to touch it. The hand was far too weird, and he had no clue what it was.\n\n“Old Cat, come and help!” Han yelled, looking at the Old Cat after another quick dodge.\n\nOld Cat didn’t like Han Sen’s suggestion, so he jumped atop the tablet and watched.\n\n“Calm down! What’s the rush? I’ll observe it and learn its weakness. When I discover what it is, I’ll come and save you. Okay?” Old Cat did not move, and he just waved his tail while he spoke.\n\n“When are you going to find it? Hurry up now and take it. Maybe it’s a treasure, and you can have it!” Han Sen tried to entice Old Cat to give him aid by making that promise.\n\nOld Cat was not buying it, though. He continued to lay on the tablet, squinting his eyes. “It depends entirely on fate. If the treasure belongs to me, none can take it”\n\n“Are you helping me or not?” Han Sen felt disheartened.\n\n“I want to, but I have no clue what this is. Please, allow me to observe,” Old Cat said calmly.\n\n“If you keep observing, I will be killed. And then you will be next.” Han Sen felt severely pressured. The hand was so fast, it was like light. It almost seemed like there were many fists attacking him at once.\n\nHan Sen kept on dodging. If he didn’t figure something out soon, he’d have no choice but to block it\n\n“You look so handsome, it’s no wonder why it likes you. I really envy you. I can just stand here and be completely ignored. D*mn!” Old Cat squinted his eyes.\n\n“You can go to hell,” Han Sen said, then gathered strength in his own fist to combat the other with a punch.\n\nThe fist’s speed was too fast now, so he couldn’t dodge it, anyway. He could only try to go up against whatever power the fist held.\n\nFirstly, though, Han Sen tried to lead the hand to the cat’s position. But the hand didn’t care for the feline. It went right past the cat, straight for Han Sen.\n\nOld Cat looked at Han Sen and the hand. He didn’t strike, because he wanted to see how strong the hand was, too.\n\nHan Sen’s fist came into contact with the hand, and he used all of the power he could muster, alongside what the geno armor could provide.\n\nIt was only sixty percent, but it was shocking enough it could probably sunder a mountain.\n\nBut when Han Sen’s fist hit the hand, he couldn’t punch it away. There was no shockwave, either.\n\nHan Sen’s fist came right against the hand, and the hand deflated like a balloon. It struck itself to Han Sen’s fist.\n\nThe next second, the hand was shining with a bright light. The disconnected part gloved Han Sen’s right hand.\n\nHan Sen was shocked, and he desperately wanted to get rid of it. It was too late for that now, though. The jade hand had gloved Han Sen’s right hand.\n\nPang!\n\nHan Sen’s geno armor disconnected. It went back into his Sea of Soul, as if it was afraid of something.\n\nHan Sen was shocked. His fitness was low, and the geno armor was something he absolutely required. Now that it had disconnected, its protection was no longer available. This was bad news.\n\nHan Sen wanted to summon Destiny’s Tower, but when he looked at his right hand again, he was shocked.\n\nThe jade-looking hand was gloved around his right hand, but in a different way than Han Sen had first thought.\n\nWhen the hand gloved Han Sen’s right hand, it turned into a gauntlet that looked like jade, but it wasn’t jade. It looked like bone, but it wasn’t bone.\n\n“Is this thing like those crystal shoes? Is it a glove?” Han Sen thought of this possibility.\n\nBefore Han Sen could think any more, a strange power from his right-hand started pulling him forward. He couldn’t keep his body from suddenly getting pulled into darkness.\n\n“Sh*t! This thing is just like those motherf*cking crystal shoes.” Han Sen was struggling to stop the process. It didn’t work, though, as the glove was much stronger than him."
}