{
    "chapter": 1834,
    "title": "Planet Eclipse",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1834",
    "text": "“Get ready for what?” Han Sen asked. Having a planet to oneself should be a good thing, but Yisha’s tone didn’t make it sound as if it was.\n\n“You are my student now, so I will take care of everything. But if you have your own planet, that means you will have to be on your own. I cannot take part in its development, and you will have to pay taxes. The numbers aren’t small, either.” Yisha went on to say, “Narrow Moon has a lot of planets, but the good ones have already been taken by the current Kings and Nobles. There aren’t many left to choose from. Only the poor and cheap planets, really. If you don’t do a good job, make a lot of money, and pay the necessary taxes, it is likely that people will start laughing at you.”\n\n“I don’t want a planet. I just want to be with you, and have you teach me,” Han Sen quickly said.\n\nIt would be difficult for Han Sen to find a backer with infinite resources like her. Who would want to give it up in exchange for ownership and residence on a no-name planet that wasn’t developed?\n\nYisha looked at him coldly, and she said, “You are Knife Queen’s student. I cannot allow you to hide away from hardships. Besides, this is a law for the Rebate. You are required to go there. If you embarrass me, and you are unable to pay your taxes, I will deal with you myself.”\n\nHan Sen feigned bitterness, and he said, “Queen, I am just a Baron. I don’t even have a helper. How am I supposed to develop a planet by myself?”\n\nYisha laughed when she saw Han Sen’s expression. “Don’t worry! You won’t have to pay taxes for the first three years. It is only then that the taxman will come calling. Starting from the fourth year onwards, you will have to pay. The taxes won’t be staggeringly high, but the amount you must pay will increase year after year. You are my student, so of course I can help you with this.”\n\n“And don’t worry about the people. When you have ownership of a planet, you can recruit as many people as you want The Feathers have fallen, so many places are at war right now. It will be easy to nab a few of those.” Yisha smiled.\n\nHan Sen did not want to go to those planets, but she wasn’t going to give him a choice in the matter. This was something he had to do.\n\nLuckily, Yisha said she would still continue teaching him knife skills. It made him feel much better to know that she wasn’t entirely letting him go.\n\n“Ghost Teeth Knife rejected me. Are his skills so talented it preferred him? But he is not of the Rebate, so how could he have learned the Teeth powers? It’d be good for him if he was able to.” Yisha watched Han Sen as he left, and she retreated into thought.\n\n“Night River King, Black Steel and Han Sen received King class weaponry. They can both have a planet There aren’t many decent ones remaining, so what would you like to do about this?” An officer brought out a planetary chart and displayed it in front of Night River King.\n\nNight River King observed the chart and said. “Give Black Steel Planet Scorpio.”\n\n“Planet Scorpio? That is a planet with many mines. There are a lot of rare metals there, and the ecosystem is diverse and balanced. Once upon a time, Rocks Fall Duke offered a grand sum in the hopes of its purchase. And you didn’t accept his offer for purchase. Black Steel is a very lucky person.” The officer laughed.\n\nNight River King smiled. “Black-Moon King is a blacksmith of the Rebate. Black Steel is talented and has a King knife. He will be something big, in time. Providing him with this planet will be beneficial for the advancement of our race. It won’t belong to him totally, though.”\n\n“Good thinking,” the officer said, with a bow. “And out of the leftover planets, Planet Jadeshell is the richest. Shall we give it to Queen’s student Han Sen?”\n\nNight River King shook his head. “I have matters to attend to there. Give him Planet Eclipse.”\n\nThe officer, when he heard it, seemed stunned. “My King, there are no mines there! There is no water, and neither are there any plants. There are xenogeneics lurking there, and the weather is awful. Considering the number of xenogeneics that are there, it would be difficult for any Viscount to etch out a living. A planet like this is for an Earl or above. Wouldn’t it be too cruel to give it to Han Sen?”\n\nNight River King hummed, and he said, “Planet Eclipse may only have xenogeneics, but it is rich with them. He is lucky to receive this special treatment.”\n\nAfter that, Night River King coldly laughed and said, “Han Sen is not one of our kind. And his genes are not stable. We cannot afford to spend vast amounts of resources on him. If it wasn’t for Queen, I wouldn’t provide him a planet at all.”\n\nThe officer gave a wry smile. Being sent to Planet Eclipse would be a far worse fate For Han Sen than being sent to a barren planet. Going to those poorer planets wouldn’t be dangerous, but the same couldn’t be said for Planet Eclipse.\n\nAccording to the laws of the Rebate, Queen couldn’t directly partake in the development of the planet. Han Sen needed to hire people himself. If he was unable to recruit folks of Earl rank or above, even getting started would be a monumental task. Anyone who went to that planet would be in perpetual danger.\n\n“Will Queen agree to this decision?” the officer carefully asked.\n\n“I am in charge of planetary distribution. She cannot say anything about it. And if the boy has a problem with it, he can forget all about it,” Night River King said coldly.\n\nPlanet Eclipse?” Yisha, seeing what Han Sen was going to be given, frowned sternly. Her urge to help Han Sen was now greater than she expected it to be, and resisting it was difficult.\n\nIf Planet Eclipse was owned by a Duke or a King, developing it wouldn’t have been too hard. But you would spend so much to earn so little, so no Duke in their right mind would want to go there. It could be a treasure for Barons and Viscounts, but they wouldn’t have what it took to develop the planet.\n\nPlanet Eclipse was like a flavorless rib of chicken.\n\nNight River King gave Han Sen Planet Eclipse to cause him trouble. That much was obvious.\n\nAnd when Yisha explained the situation to Han Sen, she told him, “If you do not want to go, it is fine. If you want, stay and learn some knife skills with me.”\n\nYisha was too proud and arrogant to give up easily, but she didn’t want to explain herself, either. If she told people she wanted to raise Han Sen up to be a Duke, the elites would probably help her. But Yisha’s personality made her despise the act of explaining things. If people tried to stop her, she would be driven to accomplish her tasks all the more.\n\nAfter Han Sen heard about the planet he was to be given, though, his eyes shone. He bowed and said, “Queen, I would like to go there!”\n\n“Really?” Yisha looked at Han Sen with shock. She had already explained the state of Planet Eclipse to him, but he still wanted to go. That was a surprise."
}