{
    "chapter": 2344,
    "title": "The Crime of Killing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2344",
    "text": "“Sure, I’d go with you to steal things from Destiny’s Tower. If I was insane,” Han Sen mumbled to himself. He had no intention of cooperating with Fox Queen.\n\nFor now, his identity hadn’t yet been exposed. He could still deny any allegations that came up, but stealing something from Destiny’s Tower was akin to asking for death.\n\n“My Prince! My Prince!” Han Sen was planning on hunting down some Duke xenogeneics when he heard Lilly’s voice.\n\n“I just wanted to kill some monsters to collect xenogeneics genes. Can’t you just leave me alone for a bit?” Han Sen felt depressed. That Siren servant Lilly was coming after him, repeatedly calling out for her prince.\n\nLilly was a Siren, too, but she had been raised by Bai Yi’s mother. She wasn’t with Lan Haixin. As a result, she was the only servant that Bai Yi had.\n\nPerhaps Lilly still remembered that Bai Yi’s mother had been good to her, and that was why she decided to stick with Bai Yi. She was really loyal to him, and her only goal was to serve him well. It was rare to witness such loyalty.\n\n“My Prince, it is good that you are here… the Sentence Court… the Sentence Court’s people are here… They… They said the blood kirin went against the rules of King’s Garden…” Lilly swam to him, gasping as she spoke.\n\nHan Sen frowned and said, “Where are they?”\n\nThe blood kirin had killed Prince Swordstar’s guard in King’s Garden. Han Sen knew that incident would come back to bite him. He just didn’t expect the turnaround to have happened so quickly.\n\n“They are in Ocean Hall. The princess is greeting them right now. She wants you to return so that you can provide them with an explanation,” Lilly said.\n\n“Okay. I will go and talk to them, then.” Han Sen had to give up on his plans for hunting right now. He followed Lilly back to Underwater Town.\n\nLan Haixin was sitting in the palace, her face expressionless. She didn’t look good.\n\nHan Sen had been hiding in the garden, and she had dealt with all the nobles that came visiting. If she didn’t need Han Sen to open the Siren relic, she wouldn’t have cared about him at all.\n\nNow, though, the people from the Sentence Court were visiting. This wasn’t something she could handle alone, and so she had to let Han Sen deal with these matters by himself.\n\nLan Haixin didn’t know how Bai Yi had earned the Kingese protection, but she knew how easily he could cause trouble.\n\n“It was so hard for me to get a half-deified guard, and it has caused so much trouble. The killing in King’s Garden has brought the Sentence Court knocking on our door. There is no way he will be allowed to keep the blood kirin,” Haixin thought to herself.\n\n“Who is looking for me?” Han Sen brought the blood kirin in with him from the outside.\n\n“I am Chu Nan from the Sentence Court, My Prince.” The half-deified elite in the lobby slowly bowed to Han Sen.\n\n“Ah, it is Courtman Chu. Why have you come looking for me?” Han Sen knew, but he asked anyway.\n\nChu Nan signaled to a man next to him. The servant presented Han Sen with a document. Chu Nan himself said, “I am so sorry, My Prince. Your blood kirin murdered Prince Swordstar’s guard in King’s Garden. Prince Swordstar told us in the Sentence Court. We are here to arrest him, so please forgive us.”\n\nAfter that, the two servants came forward to arrest the blood kirin. But Han Sen stopped them.\n\nChu Nan quietly said, “My Prince, this is an order that comes directly from the Sentence Court. Please do not make this any more complicated than it needs to be. If we cannot bring him back today, then it will force the captain to visit. Then, things will be far worse.”\n\nHan Sen laughed and said, “I’m not making anything complicated. The blood kirin is my guard, and I’m the one that commanded it to kill in King’s Garden. So, I am the leader that caused this. The crime is mine. I will go with you. There are rules, and I need to be judged. I am a prince, so I should follow the law.”\n\nAfter that, Han Sen reached out his hands. He told Chu Nan he could lock him up so they could leave.\n\nChu Nan and the others were shocked. People had been killed in King’s Garden before, and the princes were usually responsible, but they always pinned the murders on their guards. But now, this was in reverse. The prince was taking the crime for the guard. They looked flabbergasted.\n\n“In that case, My Prince, we are so sorry. We do not need to cuff you. Please, just come with us.” Chu Nan didn’t formally arrest Han Sen, but he didn’t plan to let him go, either.\n\nThe Sentence Court was allowed to lock up figures of royalty. If Han Sen wanted to take responsibility for the crime, then Chu Nan wouldn’t stop him.\n\nThere were connections between Prince Swordstar and the Sentence Court. What happened with the blood kirin required an explanation. It would have been great if Bai Yi really had committed the crime, as he would have felt much better.\n\nLan Haixin watched Han Sen and the blood kirin get taken away. She looked sick, and she said, “Is that guy crazy? He is going to jail on behalf of some silly mount. He has lost all his pride as a prince.”\n\nHan Sen followed Chu Nan to the Sentence Court. He was locked in the prison there, and he had to wait for the trial before being sent to the proper penitentiary.\n\n“Bai Yi is going to take the crime that he murdered in King’s Garden. Is he crazy?” Prince Swordstar, when he heard this news, was shocked.\n\nBut then, a wide smile crossed his face. He said, “That is good. If he wants to die, then we just let him. Murdering in the King’s Garden will have him stuck in prison for a hundred years, even if he is a prince.”\n\nThe Sentence Court captain, who was trimming a fern, heard what the prince said and laughed. “If it was an ordinary noble, they would be served a death sentence. But he is a Prince, and it was a guard that was killed. He will probably be in jail for a dozen years. It is hard to tell exactly how long, though.”\n\n“Ten years is still good.” Prince Swordstar rolled his eyes and went on to say, “Right, just don’t let that blood kirin go, either. Does he think he can save everyone? Who does he think he is?”\n\n“Of course. The laws of the Extreme King are fair. We will not wrong a good man. We will not let go of a bad man,” the Sentence Court captain said coldly.\n\nChu Nan brought Han Sen and the blood kirin to jail. He opened the door and said, “My Prince, I am sorry that you have to live here.”\n\nHan Sen didn’t walk inside. He looked at Chu Nan and said, “Mister Chu, can I ask a favor of you?”\n\n“I…” Chu Nan looked conflicted.\n\n“It is nothing big. Can I have him in the same prison cell as me?” Han Sen stroked the blood kirin’s head as he spoke.\n\n“That is okay…” Chu Nan looked at Han Sen strangely. Hesitantly, he said, “My Prince… are you really planning on accepting responsibility for this crime?”\n\n“I would like to, but I’m afraid others will not allow me to,” Han Sen said simply.\n\nChu Nan was confused. He understood Bai Yi’s situation. Although he had done two things that shocked the entirety of the Extreme King, that couldn’t pardon him from the crime. Since the guard had been killed, Han Sen would end up going to prison if Prince Swordstar did not relent.\n\nEven if it was the crown prince that stood accused, he would get a guard to admit the crime. If he confessed to the crime like Han Sen, he would end up going to jail, as well."
}