{
    "chapter": 1943,
    "title": "Intense Fighting",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1943",
    "text": "Several tornados raged across the desert. They were searching for Han Sen almost hungrily. When the tornados reached a specific dune, it exploded and a person emerged. He went straight west.\n\n“Amitabha!” Seven Spirit waved his white robe, and the tornados retreated into his sleeves. He looked like a dragon with yellow wings as he came after Han Sen.\n\nHan Sen was running forward, and the shape of a yellow dragon that was a few hundred yards long was giving chase. It looked like a yellow vortex that wanted to suck him in.\n\nHan Sen’s blood was burning. His Spell armor glowed with light. Han Sen looked like a bird, soaring through the sky to avoid the power of that tornado.\n\nSeven Spirit emerged from the trailing tornado and threw his palm forward at Han Sen. It turned into a golden, roaring lion. Han Sen’s body responded like a phoenix. He borrowed strength from the air itself to accelerate. His body performed a stunning arc to neatly avoid the lion’s attack.\n\nSeven Spirit clicked his fingers, and then the gold light turned into the spirits of the Buddha kings. They all rushed forward to attack Han Sen.\n\nThere was a dragon, a lion, a sheep, an elephant, a horse, a bug, and even a fish. They were all different types of animals. The dragon was powerful. The lion was intimidating. The sheep was implacable. The elephant was strong. The horse was fast. The bug was creepy. The fish was spiritual. They all possessed a different power, and they all had an effective synergy with one another.\n\nHan Sen borrowed the speed of the rabbit shoes to keep up with Seven Spirit, but he didn’t dare fight him head-on.\n\nA Marquise would be too strong. If Han Sen got hit, he could die in a moment.\n\n“Seven Spirit! I have no grudge with you. Why do you want to kill me?” Han Sen shouted as he tried to hide from the scary attacks being aimed at him by the seven spirits.\n\nSeven Spirit’s desire to kill him was a grave issue. Even if Han Sen escaped, it could pose trouble in the future if Han Sen didn’t understand why Seven Spirit wanted him dead. In order to sort this out, he needed to figure out what had inspired Seven Spirit’s rage.\n\nBut Seven Spirit refused to answer. His finger kept making spiritual markings. He kept creating Buddha light marks and infusing them with a desire to kill Han Sen.\n\nHan Sen saw Seven Spirit wasn’t going to answer, and so after dodging the next spirit mark attack, he said, “I know! You must really love Speechless. But Speechless loves me, and she wants to have sex with me. That is why you’re mad, right?”\n\nDespite what he said, Han Sen did not think that was the reason. He just wanted to goad his nemesis into talking.\n\nHai’er kept saying Seven Spirit wanted to kill him because of Speechless, but that made no sense to Han Sen. Speechless’ plan to seduce him had backfired, but no matter how prideful someone was, they could not kill a student of a half-deified elite over something like that.\n\nThere must have been an important reason why Seven Spirit wanted to kill him.\n\nSeven Spirit heard Han Sen, though. With a look of fury, he said, “Shut up! Speechless is not someone you can be allowed to pollute.”\n\nAfter that, Seven Spirit’s Buddha light shone. A giant Buddha hand rose from his back, then began approaching Han Sen. The palm had seven spirit marks, too.\n\nHan Sen could see that the sky was now full of creatures, raining down towards him. Seeing it made him feel terrible. The seven spirits were scary, and he knew he’d be unable to dodge them.\n\nHan Sen’s eyes froze, then he ran in front of the Buddha horse. When he did, he felt an impact shudder through his body and into his own hand. Then he was sent flying.\n\nHan Sen used Yin Yang Blast, and the impact of the horse’s hoof sent Han Sen shooting off like a kite. He was flying far away.\n\nHan Sen began running as soon as his feet touched the ground, coughing blood as he went. His opponent was too strong. He had used most of his power to deal with that force, but somehow, it had still managed to damage his body. If he hadn’t been wearing his Marquise armor, he would have been killed.\n\nSeven Spirit did not have the power to keep using Buddha Hand. The Buddha light dimmed, and he returned to pursuing Han Sen.\n\n“Seven Spirit, it isn’t strange for a girl to fall in love. You cannot change someone’s heart by force. Speechless thinks I’m hot. She wants to be with me. Killing me is pointless, as I will always be in Speechless’ heart. She’ll never forget about me,” Han Sen said, as he made his escape.\n\nHan Sen could not defeat Seven Spirit, but if he could make his enemy mad enough to lose his cool, perhaps there was a chance of pulling through.\n\nSeven Spirit’s face turned green, and he said, “Shut up! Don’t talk about her like that.”\n\nSeeing that Seven Spirit really did care about Speechless, Han Sen was delighted. He had to do what he could to live, so he said, “Speechless and I are so in love. She mentioned you to me. She said you were nice, but you are extremely boring. You don’t know how to treat a woman. You don’t even dare to touch her fingers. You aren’t a real man!”\n\nSeven Spirit did not say anything. He kept casting his seven spirits marks like mad. Han Sen had managed to gain some distance from Seven Spirit, so they weren’t terribly close together. Han Sen managed to dodge every attack, too, so there wasn’t as much of a threat.\n\nSeven Spirit knew this was pointless, so he stopped attacking. He used his power to close the gap, instead. By doing that, he was able to catch up quickly.\n\nThis guy is annoying!” Han Sen’s chest was rumbling, and he was still coughing up blood. He was thankful he had his mutated blood. He wasn’t losing as much blood as he would have otherwise, but he could not heal.\n\n“Seven Spirit, a man should be more straightforward. I only used a little effort to make her come after me. I touched her body all over, and you didn’t even touch her fingers. You are such a sad man.” As he provoked Seven Spirit, Han Sen kept thinking about how he could survive this.\n\n“Shut up!” Seven Spirit was enraged. His Buddha light brightened considerably, and then he used a thousand Buddha Hands.\n\nThis time, he did not use his seven spirit marks. He merely pulled out a wooden instrument. He struck it, and the sky flashed above them. Han Sen felt a rumble of thunder in his heart.\n\n“Argh!” Han Sen felt electricity course through him. More blood spilled from his lips, and he almost fell over."
}