{
    "chapter": 2617,
    "title": "Sword Given to the Luckiest Person",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2617",
    "text": "Sky Palace Leader nodded to the Tenth Elder. “If I’m correct, then it is what you’re thinking. I cannot believe it was in Sky Palace all along. It was right under my nose.”\n\n“This… is it possible?” Yun Changkong’s voice trembled. He stared at Han Yan’s jade box.\n\nThe jade box gleamed in the light. There weren’t many adornments or engravings on it; it was a simple box, with no markings or patterns to identify it. Many Sky Palace elites wouldn’t have been able to tell what it was.\n\n“Old Yun, you should explain what is inside that jade box,” the Sixth Elder couldn’t help but ask.\n\nYun Changkong looked at Sky Palace Leader, who nodded. Yun Changkong’s expression was difficult to read as he said, “You guys know about the Eleventh Leader, right?”\n\n“Yes. The Eleventh Leader was a Sky Palace genius. Everyone knows about him. He was the strongest elite in Sky Palace that entered the geno hall.” Sixth Elder rolled his eyes, but then his eyes widened and his face lost its color. “Is this jade box related to the Eleventh Leader?”\n\nYun Changkong nodded and said, “You guys should remember the records that were created before the Eleventh Leader went into the geno hall. He left behind words.”\n\n“The sword that will go to the luckiest person!” many elders shouted at the same moment. Everyone’s eyes opened wide. They stared at the jade box Han Yan was holding.\n\nYun Changkong nodded solemnly. “The Eleventh Leader’s sword skills were so fierce. He was like a god. He was a swordmaster from a family of swordsmen, and his talents brought him great strength. The Eleventh Leader’s sword skills were remarkable, even from a young age. He practiced with swords at the age of three years old. His swordmind reached the level of deified before he was twenty years old. He became the leader of Sky Palace before he was deified. When our race was in crisis, he destroyed traitors and battled enemies. Back then, even all the deified elders listened to him so they could make Sky Palace the best it could be. We have been stable for a billion years because of him. Referring to his lifetime as the Sky’s ‘Golden Age’ isn’t even enough to describe him. He was the one who left the inscription near Sky Pond that reads ‘Outer Sky.””\n\n“Special people do special things. The Eleventh Leader’s sword skills weren’t passed on to anyone else in Sky Palace. He didn’t educate a single student. Before he went to the geno hall, he said, ‘Fate will search the universe, and the sword will be given to the luckiest person.’ But no one has ever figured out who that luckiest person might be. Until now, no one has found any sign of the Eleventh Leader’s sword skills. But people always knew he left his sword around somewhere. Many people have searched for that treasure across the universe, but they always came up empty-handed,” Yun Changkong said. He stared at Han Yan’s jade box.\n\n“How do you know the jade box contains the Eleventh Leader’s sword skills?” the Sixth Elder asked with confusion.\n\nYun Changkong had a wry smile as he answered, “This jade box is made from Outer World Jade. It only exists in Sky Palace. It is so rare that no one else could have this much of it. Even if someone had some, they wouldn’t come here and drop their Outer World Jade in the Sky Pond. Aside from our leaders, who else could do this?”\n\n“There have been many leaders here over the years. How do you know this belongs to the Eleventh Leader?” the Sixth Elder asked. He was still confused.\n\nYun Changkong pointed at the white elephant who was fast asleep near the Sky Pond. “Don’t you remember what the Eleventh Leader’s mount was?”\n\n“I have heard it was a Hitting Sky Elephant… but I thought the Hitting Sky Elephant disappeared when the Eleventh Leader went to the geno hall.” When he realized what he was saying, the Sixth Elder trailed off in astonishment. His eyes opened wide as he looked at Han Yan’s jade box. He screamed, “Is that really the Eleventh Leader’s sword skill?”\n\n“We should open it and find out,” Sky Palace Leader said.\n\n“Let me open it,” the Sixth Elder said merrily. He walked close to Han Yan and tried to grab the box.\n\nBefore his hands could even touch the jade box, he felt a strong power come from behind. It sucked him backward.\n\nPang!\n\nThe Sixth Elder flew back through the air and slammed into the stone inscribed with the words Outer Sky. His face was almost crushed against the hard surface.\n\nThe white elephant near the pond had only moved his nose an inch. He didn’t open his eyes. He was still sleeping.\n\nWhen Yun Changkong saw the other elder’s shaken expression, he chuckled and said, “Brother Six, you are in too much of a rush. Think about the Eleventh Leader’s personality. He wouldn’t allow just anyone to open his box.”\n\nThe Sixth Elder stood up slowly, wincing in pain as he moved. He stared at the white elephant, but he didn’t make any aggressive moves.\n\nIf the white elephant was the Eleventh Leader’s mount, it would be stronger than a normal deified creature.\n\n“Han Yan, open the box,” Sky Palace Leader told Han Yan.\n\nHan Yan looked at Han Sen, and Han Sen nodded for her to do as she was told. Han Yan felt as if she had gotten quite lucky. This seemed to be a very rare opportunity that she had received, and maybe the Eleventh Leader had left behind great resources. If that was true, perhaps she wouldn’t have to struggle so much to level up.Han Yan held the jade box. It wasn’t locked, so she lifted the lid and opened the jade box. A shadow flew out. It was in the shape of a gentleman.\n\nHis age would be difficult to guess, but he appeared to be rather young. He gave off an aura of someone who carried a great burden, however.\n\n“It looks like you guys never thought I’d leave this behind at the bottom of Sky Pond. But don’t worry. After all, you guys are my descendants. I wouldn’t expect you to guess how my mind worked. Right now, whoever is in charge of Sky Palace needs to listen to me. The luckiest person, the person the white elephant selected, is the one who will receive my sword skills. Only that person can get what is inside this box. If anyone goes against this will of mine, bad luck will fall upon them. It is quite funny… I bet many creatures are looking all over the universe for this. I wonder which of the Sky was this lucky…” After saying that, the shadow disappeared. No one knew where it went.\n\nSky Palace Leader and the others looked strange. The legends said that the Eleventh Leader was a very heroic and smart man. They did not expect him to be such a… well, such a kid. It looked like he was quite the prankster.\n\n“Old Elder, you are so unreliable. The white elephant chose a person who wasn’t even one of the Sky. She is just a foreign student.” Sky Palace Leader felt so depressed that he didn’t know what to say.\n\nAccording to the Eleventh Leader’s words, the sword skills had to be given to Han Yan. The most secret skills of Sky Palace were about to be hers. If they didn’t give the skills to her, that would mean they were betraying the will and direction of the Eleventh Leader. That decision would reflect poorly upon them.\n\nThe most important thing, however, was the fact that the Eleventh Leader’s mount was still there. The white elephant was bound to intervene if they tried to take the knowledge away from Han Yan.\n\nAll the elders of Sky Palace looked confused. None of them said a word."
}