{
    "chapter": 2408,
    "title": "Furnace",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2408",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAlmost word for word, Dragon One said the same thing to the Dragon Kings.\n\nHan Sen didn’t know what they were planning, and neither did he want to know. He flew through space for around an hour before he found a lone core xenogeneic flying through the darkness.\n\nThat xenogeneic looked very unusual. It hung against the empty background of space like a burning smithy’s furnace. Its body looked to be made of steel, and its cogwheel-composed body was wrapped with countless chains. A fiery red core glowed on its top.\n\nHan Sen flew right up to the big furnace, but before he became within range, the furnace’s opening shot a geyser of fire at him. It looked like a volcano erupting. The enormous wave of flame spread as it came forward, and in one second, a few dozen miles were covered in that raging blaze.\n\nHan Sen felt as if his body was going to melt. Without hesitation, he summoned the purple and red laser gun and sent his power into it. He fired it at the big furnace.\n\nThe laser gun unleashed a beam of red and purple light. The purple and red light shot right through the fire area and struck the big furnace without even slowing down.\n\nPang!\n\nThe furnace’s body was ten meters wide. Han Sen’s beam of light punched through the furnace, then spread out from the puncture wound to consume the entire creature.\n\n“The Core Demon Bug Gun has a consuming power! Not bad, not bad at all… The only frustrating thing is that the consuming power works slowly, and the radius isn’t as large as the original creature’s consuming area…” Han Sen quite liked his new gun.\n\nThe big furnace heaved out fire as it turned to run. But it was full of holes after Han Sen riddled it with a few more shots. In the end, the creature exploded. The fire within the furnace went off like a firework as the creature detonated.\n\n“Core Xenogeneic King hunted: Smithy Furnace. Core xenogeneic gene found.”\n\nHan Sen flew around and grabbed the red claw that had fallen out of the creature. He placed the claw in his pocket and flew forward to find other things to slay.\n\nAfter flying for another half an hour or so, Han Sen found another one of those furnaces. He rushed over and blew the furnace up, receiving another core xenogeneic gene for his trouble.\n\nThis part of the core area seemed like a space dedicated to the furnaces. After ten hours of soaring, Han Sen had managed to kill a total of six furnaces.\n\nAlthough none of them gave him a beast soul, the mere ability to harvest xenogeneic genes was pleasing to Han Sen.\n\n“At this rate, I will become very rich.” Han Sen was very happy with the progress he had made thus far, and so he continued to fly forward.\n\nAfter another short while of travel, he found a place populated by many asteroids. He saw another flying furnace, too.\n\nAs Han Sen looked closer, he noticed that this furnace was different from all the other furnaces he had thus far encountered. The other furnaces were around a dozen meters tall, and they were made of a featureless black steel.\n\nThis furnace was only three or four meters tall, however. It was made of copper, and the core of the furnace and the fires inside were bronze. The weirdest thing about this one, though, was that there was a sword sticking out of it.\n\nThat sword was almost wholly swallowed by the flames. It was very red, and something about it was particularly eye-catching.\n\n“Is this another subspecies of the flying furnaces? There is a sword inside! This looks higher class than those black furnaces, but the power I sense from it doesn’t seem to be much stronger. The other furnaces were Kings of the first or second tier. But this guy has an area that is at the third or fourth tier at the most.” Han Sen had come to kill xenogeneics, so he didn’t put any more thought into it. He pulled out his gun and fired more of his red and purple beams at the furnace.\n\nThat furnace was sitting atop a giant asteroid. It was breathing, inhaling some sort of power from the universe. Every breath made the fire burn bright and hot. Han Sen’s red and purple beam of light landed on the copper furnace, blowing a big chunk blown out of the creature. The copper furnace tumbled away from its position, bouncing off other asteroids as it went.\n\nThe copper flame of the furnace also struck the asteroids, leaving behind trails of scorching fire.\n\nHan Sen was shocked. The Core Demon Bug Gun was a mutant King beast soul, but the shot was unable to cut all the way through the copper furnace. The beam of light had only dented the creature’s surface, and the consuming powers weren’t able to latch on.\n\nThe copper furnace righted itself before long, and it looked very angry. It spat out a long geyser of fire, venting its rage like some flaming demon.\n\nHan Sen didn’t feel sorry for the creature, though. He just fired his gun at it again. On the inside, he was thinking, “I need to strike as quickly as I can. The body of this copper furnace is nothing weak, but if I shoot it a few more times, I should be able to break it.”\n\nThe purple and red beam flew toward the furnace again, but the furnace released a red light that intercepted the beam. It looked like the burning red light had come from the sword inside the furnace.\n\nPang!\n\nTwo powers hit each other, and the collision produced a beautiful shower of sparks.\n\nThen, to Han Sen’s surprise, sparks began to spill from the sword inside the furnace. The sword didn’t break, though. The beam from the Core Demon Bug Gun was dispersed by the impact, and it spread harmlessly into the reaches of space.\n\nThe sword inside the furnace made sizzling noises. The fire inside the copper furnace popped and crackled like it was talking to the sword.\n\nA copper-colored flame area covered the entire galaxy, wrapping over both Han Sen and the furnace.\n\nBut Han Sen couldn’t feel the heat. It was like the copper flame area was some sort of mirage.\n\nThe copper flame area intensified, and the sword grew hotter and hotter. It turned a translucent gold, and strange symbols appeared across its length.\n\nHan Sen felt fear awaken inside him. He quickly raised and fired his gun a few more times. But the sword flew and danced, hitting every single projectile with its sword lights.\n\nThe copper fire area was still present, and the sword continued to absorb it. The body of the golden sword became a green crystal, and it burned with a copper fire. It looked both pretty and disturbing.\n\nHan Sen frowned. The sword seemed so powerful. Powerful enough to frighten him.\n\n“This is a strong xenogeneic. It is just third or fourth-tier, but its area power is boosting the sword inside the furnace to unbelievable levels. The sword’s power is at least half-deified, by this point. This is amazing!” Han Sen was shocked. But he didn’t want to back off now. He summoned Move Mountain Area, curious to see just how strong this special furnace xenogeneic really was.\n\nThe crystal sword was burning with a copper fire. The sword groaned as it broke the sky. It was teleporting toward Han Sen’s heart.\n\nHan Sen aimed a punch at the flying sword. His armor was imbued with Move Mountain Area, so his defense would be very strong. Han Sen didn’t have to be scared of the power wielded by the sword.\n\nPang!\n\nThe tip of the sword thudded into Han Sen’s fist. The sword carved a deep gash in the armored fist, and blood began to drip out."
}