{
    "chapter": 2281,
    "title": "Yisha Levels Up",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2281",
    "text": "The hell blood pulse blended into Yisha’s body. Suddenly, a plume of purple air burst out of Yisha. It solidified into a purple substance chain and wrapped around her, loop upon loop.\n\nEverything she had—her clothes, her accessories, her armor, and all sorts of other things—disintegrated into nothing but dust under the power of that substance chain. As the chain surrounded her, Yisha curled her long body into a ball, like a fetus in the womb.\n\nOnce Yisha was safely encased within the purple cocoon, all became quiet.\n\n…\n\nIn a giant palace, Fox Queen, Mister White, and Crime were traveling forward. Fox Queen suddenly stopped. She looked around her and said, “Mister White, is this the correct path? Why have we been walking for so long, and yet we are still in the same palace?”\n\nMister White slowly said, “This must be the fourth checkpoint for the treasure. We have to travel through here to get to where the treasure is.”\n\n“How do we get through here, then?” Fox Queen asked Mister White.\n\n“This palace seems to have a space power restriction. My powers are weak here, and so I am afraid I might not be able to break the restriction. Perhaps this is something you will have to do,” Mister White said after a think.\n\n“And how would I do something like that?” Fox Queen asked with a frown.\n\n“Judging from the calculations I have made, we can start right there.” Mister White pointed at a stone pillar as he spoke.\n\nFox Queen looked at the stone pillar and groaned. She didn’t move.\n\n…\n\nHan Sen stared at Yisha with a look of surprise. The whole process had gone far better than he expected.\n\nThe hell blood pulse activated the Hell King blood she had inside her body. They fused with Yisha’s already considerable strength. She had broken through and become deified with no trouble at all.\n\nWhen she emerged from her cocoon and ascended, Yisha was wearing a set of purple armor. Her regal presence blanketed everything around them as if she was the queen of the entire universe.\n\n“If you dare to tell anyone about what just happened, I will kill you.” Yisha stared daggers at Han Sen as she spoke.\n\n“My Queen, I didn’t see anything.” Han Sen blinked innocently. But deep inside, he was thinking to himself, “Women are weird. Moments ago, she was begging to be deified. And now, after becoming deified, she still isn’t happy! Does she really care about a small and inconsequential detail like being naked? Her naked body is quite nice. Why is she so upset?”\n\nYisha only stared at Han Sen in response. She turned silently and looked to the thirteen teleporters. Then, she said, “Which teleporter do you think we should use?”\n\nClearly, Yisha wasn’t very good when it came to this sort of maze. It seemed as if she had forced her way through the palaces by trial and error.\n\n“I’m not very good at figuring out the path, either. If I was to guess, though, I would assume they went through the teleporter at the end of the life and death cycle bridge. But even if we select the right one this time, we won’t know where to go next. We’d have to try every single one we come to.” Han Sen stopped to think for a moment, and then resumed talking. “My Queen, how did you come this far in the first place?”\n\nYisha thought and said, “I was with the Ice Blue Knights. While I was exploring a planet with a group of knights, we accidentally woke up a deified xenogeneic called Under Overbearing. I was swallowed by it.”\n\n“At first, I thought I was dead. I had been swallowed, and I knew that its stomach could digest anything. Even deified creatures would melt in there. Just when I lost all hope, I found a seam that allowed me to escape the stomach. I wiggled through the crack and got out. After traversing many caves and passing by a shattered statue, I ended up entering a palace. It must have been one of the palaces on Under Overbearing’s back.”\n\n“Wait a minute, are you saying that you aren’t the one who destroyed the floor in one of the palaces? And you didn’t break the Sacred Leader statue?” Han Sen asked Yisha with shock.\n\n“Of course not! My power wasn’t strong enough to destroy anything in the palace,” Yisha said.\n\n“If you didn’t break the palace, then that means someone else entered the palaces before you did. That crack in Under Overbearing stomach might have also been his work,” Han Sen mused quietly.\n\nYisha nodded. “It is certainly possible, and he might indeed be around here someplace.”\n\n“What makes you think that?” Han Sen asked curiously.\n\n“The crack in the Under Overbearing’s stomach couldn’t have been there for very long. With how quickly the beast heals, the wound must have been made less than a week before. After a week, the damaged stomach would have healed completely,” Yisha said slowly.\n\nHan Sen frowned. “Then he might really still be in these palaces. But how could he leave no trace in the palace? If he was here, he would have left behind some indication of his presence. But aside from that one ruined palace, the rest of the trail was left by you, yes?”\n\nYisha nodded and said, “Yes. And while I was exploring, I didn’t see any sign of someone else having entered.”\n\n“Plus, he broke the statue, but he didn’t take the bone needle inside. That’s just weird. Was he too careless to find out what it harbored? But then again, how could such a powerful elite be that careless? It doesn’t really make any sense,” Han Sen said.\n\nYisha sighed. “Maybe he just doesn’t care about the items in this place?”\n\nHan Sen was stunned by the suggestion, but as he considered the idea, it made sense. “That might indeed be possible! He must be a very powerful person to create a hole in Under Overbearing’s stomach. Maybe his real target is the final treasure of the Sacred Leader. If that is the case, then that doesn’t bode well for us.”\n\nHan Sen walked across the bridge of life and death. They arrived at the door of light and walked on through.\n\nThe teleporter deposited them into a palace, the same as usual. There was a main hall, two side halls, and a hall in the back. All in all, there were four different teleporters.\n\nHan Sen looked around and spoke to Yisha. “I think they left via the back hall.”\n\n“How do you know that?” Yisha asked in surprise.\n\n“I can see the auras left behind by their bodies,” Han Sen explained simply. He was suspicious too, though.\n\nThe more powerful a person was, the less of a trail they would leave behind. And that trail didn’t last forever. Mister White and the others had been gone for a long time by this point. Under ordinary circumstances, it should have been hard for Han Sen to detect the trace elements they had left behind.\n\nIn fact, Han Sen didn’t see any traces of Fox Queen or Crime. But he could see molecules that Mister White had left lingering in the air. That didn’t seem normal.\n\n“Perhaps Mister White made his trail visible on purpose?” Han Sen guessed to himself. “But how could he know that Yisha and I would survive? Why is he leaving me clues? Or is this all just a trap?”"
}