{
    "chapter": 2961,
    "title": "The Only Savior",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2961",
    "text": "Now, Han Sen had leveled up to true god class. He could try it again. Perhaps this time he could control the stone lantern.\n\nThe faces of the demon lady and the others did not look good. In the beginning, they did not make use of the race lanterns because of the primary race lantern Han Sen was holding at the time.\n\nThey thought about Han Sen not possessing a holy body and believed he could not activate the primary race lantern. That made them feel safer.\n\nIf the primary lantern was not activated, the four subordinate race lanterns would not be affected.\n\nHan Sen looked at the demon lady and Old Vulture. He then placed his power into the stone lantern. He wanted to activate the race lantern of Sacred.\n\nWhen Han Sen had put power into the stone lantern before, the stone lantern did not have a reaction. Now, he was trying it again. After all, Han Sen’s power was greater than it was while he was butterfly class.\n\nBzzt!\n\nThere was an incredible power being placed inside the stone lantern. It made the flame of the stone lantern turn very bright. The very small flame suddenly became as bright as a torch. The scary flame was brighter than the four subordinate race lanterns lit up together. It lit up everything around.\n\nThe demon lady, Old Vulture, eyeless beast, and Red Ghost were shocked. The primary lantern had been activated. The four subordinate race lanterns had a reaction. They were all shaking as the flames started to quiver. They were facing the stone lantern Han Sen possessed. It was like they were obeying his will.\n\nUpon seeing this scene, Sky Palace’s first seat was immeasurably happy. He had wanted to try this too. He had not expected that Han Sen was capable of activating Sacred’s primary race lantern.\n\nIn the next second, another buzzing noise was heard. The primary race lantern escaped from Han Sen’s clutch. It was headed into the holy hall.\n\nHan Sen’s hand was full of blood. He had clearly been hurt by the race lantern.\n\nThe happiness and sadness were reversed. The face of Sky Palace’s first seat changed. The demon lady and the other three were shocked and happy.\n\nHan Sen looked at his hand and frowned.\n\nWith his power, he had been unable to wield the stone lantern. It forced itself out of his hands. One easily sensed how strong the stone lantern power was because of its ability to do that.\n\nOnly Han Sen knew that when his power entered the stone lantern, it had not been activated for himself. It activated the power inside the stone lantern and started fighting.\n\nBoom!\n\nThe stone lantern landed on the holy palace’s roof. The five race lanterns, one primary and four subordinates, were shining. They lit up the darkness around. It was like daytime.\n\nHan Sen saw that there were space charms in the darkness. He also saw the fate monument in the distance. Nine Thousand King and the big and small goldfish were still there, looking in his direction.\n\nHan Sen thought Red Ghost returned because he had managed to kill Nine Thousand King and the others, but things hadn’t turned out that way. This situation was a bit negative, but at least they weren’t dead.\n\nBoom! Boom! Boom!\n\nThe lights of the holy palace flickered. It was not an illusion. It really was shaking. The roof of the giant palace was like a lotus flower opening. It showed many holy palace statues.\n\nThe stone lantern slowly went toward the main seat, which was Qin Xiu’s stone statue. It landed atop his stone statue.\n\nHan Sen remembered that Qin Xiu’s stone statue should have been holding his hands together. Now, the statue was reaching out a hand. It was clearly in a different position.\n\nHan Sen took a closer look. He did not think the statue was alive. He felt weird.\n\nThe stone lantern landed on Qin Xiu’s stone statue. It made the whole stone statue burn. It was like the stone lantern’s flame.\n\nBzzt! Bzzt! Bzzt!\n\nThe stone lanterns in the hands of the demon lady, eyeless beast, Red Ghost, and Old Vulture flew out. The four stone lanterns had forced their way beyond their control. They flew into the holy palace.\n\nSeeing four subordinate race lanterns descend and be distributed between a phoenix, ghost car, Nine-Life Cat, and the Holy Kirin’s head, the four holy beast stone statues were burning like Qin Xiu’s stone statue.\n\nThe five burning stone statues suddenly ignited the whole holy palace. The entire palace was within the holy flame. The 10 general’s stone statues were lit up too. The whole holy palace was like a burning city with holy flames. It looked very ethereal.\n\n“Ha-ha… Han Sen… No matter how strong you are, you do not have a holy body. You will not earn the approval of Sacred’s race lanterns. You cannot control the race lantern, and the primary lantern has left you. It has returned to the holy palace. Now, the holy lantern has been returned to where it belonged. The holy palace will open up again. All we require is Little Master to become true god, and then we will be back. He will control the holy palace and fight the skies full of god spirits.” Old Vulture was so excited that he screamed.\n\nThe eyeless big beast said, “Han Sen, you should now understand that Little Leader is the savior who was meant to be. He was meant to be the man in charge of the whole universe. Even if you are his father, you cannot stall his ascendance.”\n\n“Come on, Han Sen. Come with us and help Little Master break the rules imposed on us by the God Spirits. Become the true masters of the universe.” The demon lady laughed and invited Han Sen along for the ride.\n\nHan Sen ignored the demon lady and three others by her side. He looked at the holy palace, which was burning like a sun. There was one statue in the holy palace. He looked at the primary race lantern and Qin Xiu’s stone statue.\n\nOld Vulture laughed and said, “Han Sen, just sit and watch. Sacred’s glory will return thanks to Little Master. No one can stop it.”\n\nHan Sen looked at the knife in his hands as he slowly said, “I do not know if Sacred can obtain its past glory, and I do not know if Littleflower will become the prince of the entire universe. I do know that I am his father. You stole my child from me and got him to do the most dangerous thing in the entire universe.”\n\n“That was unavoidable. Little Master has these talents. He was a born savior. You should be proud of him.” Before the demon lady finished, Han Sen’s voice sounded.\n\n“Shut up!” Han Sen’s eyes looked icy. His voice was as cold as his knife. He sounded depressed as he said, “You guys keep talking about ignorant things. You keep doing things to harm people, believing you are so noble. What are you people? That is my son! Even I would not let him fulfill my regrets and my dreams. Yet, you guys made the decision to risk his life to become your savior. Save your mother! If you want to be saved, save your own f*cking self. Don’t just randomly force the dreams you cannot achieve on someone else and call him the only savior. How dare you say something so obscene and be so proud and cocky about it. That is just you being weak, useless cowards who are afraid to die. You only say it because you are scared.”\n\nHan Sen raised his head. His eyes were like blades as he looked at Qin Xiu’s statue. Word by word, he said, “The son of Han Sen will only live for himself. He will fight for his own dreams!”\n\nThe knife buzzed. Han Sen raised his knife high as he slashed toward the very bright holy palace.\n\n“F*ck you and your savior!”"
}