{
    "chapter": 2566,
    "title": "Scary Crocodile God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2566",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBoom!\n\nThat mysterious Very High Spell broke those new rules of gravity, and Exquisite’s body flashed far away into space until she was gone from sight.\n\nHan Sen was shocked. Exquisite’s power exploded with the strength of a deified. He had no idea how she had accomplished something like that.\n\n“How do I escape this?” Han Sen didn’t have time to contemplate how Exquisite might have unleashed the amount of power that she had. His escape took precedence.\n\nBut the strength of this Crocodile God was beyond his imagination. He didn’t think he had the power to fight against something that scary.\n\nPang!\n\nHan Sen hadn’t decided on how he should escape when he heard another loud noise. Exquisite had just used Space Teleportation to break free, but she fell out of it and landed back on the planet. She lay where she was, coughing up blood. Her expression didn’t look remote and untouchable now. She looked like she was in trouble.\n\nHan Sen was stunned. “Exquisite already used Space Teleportation. Why is she back? This is so scary.”\n\n“Third Sister,” Li Keer said hesitantly. It shook her to see Exquisite like that. She asked, “Third Sister, what happened?”\n\nExquisite was unable to speak. Blood was still gushing out of her mouth. She had used the Very High Spell to break the rules of gravity and escape. She traveled away from the planet for a time, but when the Very High Spell was exhausted, the terrifying power of the creature yanked her back down.\n\nIt was like a rubber band. The further away she got, the harder her descent was. Now, most of her organs had ruptured. This wouldn’t kill her, but with the pressure of the planet’s gravity, the pain was excruciating.\n\nIf she had met an ordinary primitive deified, she could have dealt with all of this. Exquisite was a ninth-tier King with the Very High’s geno arts, after all. But against that Crocodile God, without the Very High Spell, it was doubtful many of the Very High could survive. The level gap was way too big.\n\nAfter seeing the condition that Exquisite was now in, Li Keer knew that it was lucky that she had hesitated to use her Very High Spell. She merely looked at Exquisite, hoping the other woman’s recovery would be swift.\n\nAt that moment, the Crocodile God was only ten meters away from them. Its small crocodile eyes peered at them like it was toying with them.\n\nThe Crocodile God looked over them for a while. Its attention was mostly on Exquisite, though, and it climbed over to her slowly.\n\nHan Sen frowned. He didn’t know if he could escape this. He wasn’t even thinking about saving Exquisite, who had been unkind to him.\n\nBut Li Keer had taught him Space Teleportation. It didn’t seem appropriate to sit back and watch her die. Right now, the Crocodile God was focused on Exquisite. He could take Li Keer away.\n\nAs Han Sen hesitated, the Crocodile God slapped the ground, and the ground shook. The three of them were bounced away. Exquisite was closest to the Crocodile God, and so she flew the highest.\n\nThe Crocodile God swung its tail. It smacked Exquisite and sent her flying.\n\nHan Sen fell onto the ground hard. He watched Exquisite fly through the air. The blow hadn’t been as devastating as he thought it would be. When she landed, Han Sen watched her manage to get up.\n\nHan Sen wasn’t sure what to do, and the crocodile’s tail struck another two times. It sent Han Sen and Li Keer flying as well. It was like baseball—one tail swing per person as it hurled them through the air.\n\nThe Crocodile God’s tail was very powerful, but the creature was controlling its power very carefully. Han Sen didn’t feel as if much strength had been used to strike his body. It was more like he was just being tossed away. He landed next to Exquisite. Li Keer hit the ground beside them, as well.\n\nThe strangest thing was, this place looked similar to the rest of the planet. But the force of gravity on them had now been relieved.\n\nIt wasn’t just the Crocodile God’s rules of gravity that had been lifted, either. The planet’s weighty, natural gravity was gone, too.\n\nHan Sen and Li Keer stood up. They ambled around until they noticed the ground had turned from dark red to black. There was a hole nearby.\n\n“Could this be the Crocodile God’s cave? Why did it send us here? Is it going to save us for a snack?” Han Sen wondered to himself.\n\n“Third Sister, are you okay?” Li Keer was holding the injured Exquisite.\n\nExquisite shook her head. “It’s only my organs that have been damaged. I am fine. Don’t use Space Teleportation just yet. The Crocodile God’s area of gravity is too strong. Even if we teleport away, its powers are bound to pull us back down.”\n\nHan Sen agreed with that prediction, so he didn’t think about teleporting away to make an escape. His teleportation abilities were still new, too. He couldn’t do Space Teleportation yet.\n\nIf Exquisite couldn’t escape, then he couldn’t escape.\n\nThe Crocodile God swung its tail threateningly from side to side, but Han Sen wasn’t too afraid of it. If the Crocodile God wanted to kill them, it would have done so earlier. There was no need for it to send them over here.\n\nPerhaps the Crocodile God wanted to play a game of cat and mouse, but whatever the case ended up being, it didn’t seem as if their deaths were on the tablet just yet.\n\nAs Han Sen tried to guess what the Crocodile God wanted to do, he suddenly heard the sound of something crawling coming from the cave. He spun around in surprise, and he thought to himself, “Is there more than one Crocodile God?”\n\nExquisite and Li Keer heard the sound, as well. They turned to face the entrance of the cave. They quickly saw another crocodile emerge from the pit.\n\nThis crocodile was even smaller, no more than one foot long. Its body was pitch black, and its scales were very tight. They shone with a metallic luster. Due to the fact it was so small, it didn’t look very menacing. It actually looked rather cute. It was like a metal doll.\n\nBut its small eyes looked at them with scorn in exactly the same way that the Crocodile God had. The eyes were a sharp contrast with the creature’s cute body.\n\n“Is this the Crocodile God’s child?” Han Sen looked at the small crocodile with shock. It wasn’t just small, it also looked rather young. It looked like a baby.\n\nExquisite and Li Keer looked very surprised. To their knowledge, the core area’s xenogeneics came from the core hall. Few core xenogeneics ever gave birth. But this Crocodile God had produced an heir right here. It was such a rare thing to witness in the core area.\n\nAmidst their confusion, the small Crocodile God found them. Excitement washed over the creature’s face in an almost human expression.\n\nBoom!\n\nThe small Crocodile God was so excited that a black light began to shine from its body. Han Sen and the others were covered in the light, and then, the three of them dropped to the ground again. They were pinned down, their faces glued to the dirt.\n\n“How could it be… born deified…” Exquisite and Li Keer gasped, almost losing their voices. They looked at the little creature in disbelief."
}