{
    "chapter": 2727,
    "title": "I Am Not Convinced",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2727",
    "text": "Although the monkey wasn’t affected by the cold power, it wasn’t long until its eyes started to become heavy. Soon, it slumped down on a Star Fruit and fell into a deep sleep.\n\nHan Sen saw that it didn’t have a single flake of ice sticking to it. He had expected that the ice power might not work on the Six-Eared Macaque, but the sleeping powers that came with it were not something the Six-Eared Macaque could withstand.\n\nAs the creature slept deeply on top of the fruit, its arms and legs spread in an undignified sprawl, Han Sen wanted to kill the Six-Eared Macaque. But then he thought, “Right now, the Six-Eared Macaque is sleeping. I wonder if the Very High contract can work on it. This monkey’s power is so unique… If I can make a contract with it, it might be useful.”\n\nWith that thought, Han Sen activated the Very High contract skill. He didn’t have much hope of it working, but when he actually tried it, he felt the contract click into place.\n\n“I didn’t think it would actually work.” The Six-Eared Macaque was still sleeping, with the shadow of the snowlady hovering over it. Han Sen waited until the snowlady was gone.\n\nAlthough Han Sen had performed the snowlady attack himself, he couldn’t control it fully. It had a mind of its own. That was the biggest con of the deified geno core’s geno art.\n\nAfter a few hours, the shadow of the snowlady finally disappeared. Han Sen noticed that the Six-Eared Macaque was still fast asleep, so he gave it a swift kick in the butt, knocking it some distance away.\n\nThe Six-Eared Macaque was shocked by its rude awakening. It jumped up off the ground, gold substance chains rising around it. It squealed and moved forward to attack Han Sen.\n\nHan Sen used his mind, and the markings of the contract spell appeared on the Six-Eared Macaque’s forehead.\n\nPatong!\n\nThe Six-Eared Macaque fell back onto the Star Fruit. It placed its hands over its head and twitched repeatedly as if it was in agony.\n\nWhen he saw that a deified xenogeneic was in too much pain to use its powers, Han Sen was more than surprised by the effectiveness of the Very High contract skill.\n\n“Monkey, are you going to obey me?” Han Sen asked the monkey, shutting off the pain that the contract’s power was inflicting on the Six-Eared Macaque.\n\nThe monkey released a warbling shriek and leaped off the fruit. It blurred as it rushed toward Han Sen, gold light shining behind it. It suddenly teleported in front of Han Sen.\n\nHan Sen swallowed. Just as the Six-Eared Macaque was about to touch Han Sen, the beast grabbed its own head and fell backward. It bounced off a nearby branch, then a piece of Star Fruit, then it fell all the way to slam into the ground. It created a big hole in the ground when it landed.\n\n“Monkey! Are you going to obey me and adhere to my every command?” Han Sen asked again, stopping the flow of the contract’s power.\n\n“You used a trick to fool me. I’m not convinced. If you are this strong, then beat me for real.” This time, the Six-Eared Macaque didn’t jump forward with its fists swinging. It looked murderous, and it squealed at Han Sen fiercely.\n\n“Beating you wouldn’t be hard.” Han Sen laughed.\n\n“Huh? You couldn’t even beat that Star Beetle. I really don’t think you can beat me. If you hadn’t used a trick, I would have raised my hand and killed you.” The Six-Eared Macaque looked angry.\n\nHan Sen looked at the Six-Eared Macaque with surprise. “How did you know I fought the Star Beetles here?”\n\nThe Six-Eared Macaque didn’t attack. It looked at him with disdain and said, “I am a born-deified. I’m not like those other normal xenogeneics in the Star Fruits. I know many things when I am born. I know everything that happens here.”\n\n“Born deified?” Han Sen was more than shocked hearing this. That xenogeneic had a much higher chance of evolving all the way up to true god class.\n\n“If you didn’t use a trick, how could you beat me?” the Six-Eared Macaque continued, still talking in a cocky tone of voice.\n\n“Fine. I will give you a chance. I won’t use the contract’s power, and if you beat me, I will give you your freedom back. If you lose, then I will be your master. And then you must start listening to me, okay?” Han Sen smiled.\n\n“Sure. Why not?” the Six-Eared Macaque said quickly. Clearly, it was more than confident that it could defeat Han Sen. It was afraid Han Sen would regret his decision to do this.\n\nHan Sen’s Apollo Set was bursting with a god light again. The Apollo Wings spread, making him look like a god in the sky. He looked down on the Six-Eared Macaque and said, “Come on. Show me how powerful a born-deified xenogeneic really is.”\n\nThe Six-Eared Macaque didn’t speak. Its eyes flashed, and its body exploded with a golden light. It was like some elemental of gold fire rushing toward Han Sen.\n\nCountless claws of gold light surged toward Han Sen, looking like they could cut the sky and earth. Han Sen was covered in the claw light.\n\nHan Sen flapped his wings and dodged the attacks. But the next second, the Six-Eared Macaque appeared next to Han Sen. It attacked Han Sen’s penis like a monkey stealing a peach.\n\nThe Six-Eared Macaque thought his fake body and invisibility could hide his true self. But as a matter of fact, Han Sen could see every movement the beast made. Han Sen moved his body slightly and dodged the evil, peach-stealing monkey’s skill.\n\nHan Sen looked calm. He seemed to be calm with everything that he did. There was nothing special about a monkey going for the crown jewels. But that Six-Eared Macaque was now being put at a disadvantage.\n\nThe Six-Eared Macaque was terribly upset. When it fought Shale, Shale hadn’t been able to tell where its true body was. Even in the end, it had only been using one fake body, so Shale had a 50% chance of finding the true body. He was still unable to find its invisible self.\n\nIf the monkey had used all of its power, it could have defeated Shale. It was afraid of Li Chun Qiu, though.\n\nBut now that it was fighting against Han Sen, its invisibility and fake bodies weren’t working. Whether it used a fake body or went invisible, Han Sen could see everything. It was useless, and the creature began to collect injuries.\n\n“Not fair! Not fair!” the Six-Eared Macaque suddenly started screaming as it became desperate.\n\n“What isn’t fair?” Han Sen asked with a smile, pausing his attacks.\n\n“You don’t have the power! You just have treasures. Even if you beat me, it is the treasures’ power, not your own. I’m not convinced.” The Six-Eared Macaque looked scornful and said, “If you didn’t use treasure, I could defeat you with my pinkie.”\n\n“Fine. I will not use treasures, then. And if I don’t use treasures and you still lose, will you listen to my commands?” Han Sen remained smiling, and he didn’t move.\n\n“Ha! If you don’t use treasure, I will rip you to shreds,” the Six-Eared Macaque said.\n\n“Then let’s give it a try!’ Han Sen said. Then, he took off his Apollo armor.\n\nBefore Han Sen could say anything, the Six-Eared Macaque squealed loudly. It leaped at Han Sen, its eyes full of murderous intentions.\n\nWithout the buffs of the Apollo Set, Han Sen’s power and speed were worse than the Six-Eared Macaque’s. It would be very difficult to avoid its attacks, and he couldn’t fight it now.\n\nBut Han Sen didn’t try to avoid a strike. A gleam entered his eyes, and his face had a weird blush. The Blood-Pulse Sutra was running in reverse."
}