{
    "chapter": 1867,
    "title": "You Make This Difficult",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1867",
    "text": "The Moon God Festival had become boring. The young ones went to the Moon God Palace to accept their blessings, but they were only able to raise up to the thirty-six moons, individually.\n\nThis was supposed to be a number of extreme pride, but now it seemed rather pathetic. Once they had seen the true Moon God blessing, their own Moon God blessings seemed almost fake.\n\nThis wasn’t because they were neither good nor lucky; that had nothing to do with it. But without the Moon God appearing, no matter how lucky or strong you were, you did not possess the true blessing.\n\nHan Sen’s Jadeskin had its origins in the Frost Sutra. It had a connection to the Moon God, which was why he received the blessings he did. It didn’t actually have anything to do with Han Sen’s luck or strength.\n\nBefore long, the Moon God Festival came to an end. Han Sen, receiving the Marquise armor he had come for, was overwhelmed with sheer delight.\n\nThe festival had now finished, but Han Sen’s performance had swiftly become a hot topic. Everyone knew about what had transpired. Inside the meeting hall in the Full Moon Offices, a few of the elderly and the kings of Narrow Moon had assembled.\n\nFrowning and looking upset, Yisha said, “Why can’t we give Han Sen a spot in the Moon Garden? Is he not talented enough? Or is my student simply not qualified?”\n\nThe elders did not speak. Neither did they dare look directly at Yisha.\n\nNight River King said, “It is not because we do not want to, it’s simply because the Rebate’s law only permits the acceptance of a Rebate.”\n\n“I don’t recall the Moon Garden ever having such a rule. Didn’t they once accept an outsider, back in the era long ago?” Yisha said emotionlessly.\n\nAfter that, the faces of the elders and elites all changed.\n\nMoon Wheel King groaned and said, “Queen, you know what happened to the last outsider, don’t you? If he is not of the same race, he is different. It does not matter how talented or lucky he is, the fact remains that he will never be a Rebate.”\n\n“Yes. Haven’t you heard the story of the mother Rebate raising a baby wolf, only to be killed by her child once it had grown up?” Night River King said.\n\n“Queen, you should really understand what we are telling you. If your student was one of the Rebate, we’d give you as many slots as you are able to take.”\n\n“Exactly. You should take another student if you do not approve. We’ll give your next a slot, for sure.”\n\nThe elders and the elites tried convincing each other not to give Han Sen a spot in the Moon Garden. Yisha frowned. She was Knife Queen, yes, but she was not a dictator that could orchestrate every working of their society. Without the approval of the elders, she would be unable to provide a spot for Han Sen in the Moon Garden.\n\nMoon Garden was a training organization that belonged to the Rebate. Everyone who got in had the possibility of becoming a deified elite, or at least a champion.\n\nOf course, they hadn’t produced any deified elites in a while. But there were many general elites. Even Knife Queen herself had gone through the training offered there. Out of all the kings present, only Moon Wheel King that had secured such prestige without having first spent time in Moon Garden.\n\nEntering Moon Garden meant you’d be able to enjoy all the resources available to the Rebate. Making Han Sen a Duke would be difficult, but it was fortunate that with Yisha’s support, it wouldn’t be too problematic.\n\nIt was simply a shame that Han Sen was not one of the Rebate. She had tried to secure him a spot in Moon Garden, but no matter how she pleaded, his acceptance would not be approved.\n\nHan Sen returned to Planet Blade. He waited for half a day for Yisha to finally arrive and meet with him.\n\nYisha had just returned from Full Moon Office, and meeting with him now was her next order of business.\n\n“Queen, did you enjoy my performance?” Han Sen bowed.\n\nYisha sighed at Han Sen and said, “Han Sen, your performance puts me in a difficult situation.”\n\n“Why? Did I perform poorly?” Han Sen asked.\n\n“No! In fact, it was too good. Let me ask you, how did you get the Teeth power?” Yisha asked Han Sen.\n\n“It is because I practiced it. Teeth power is similar to the powers of Ghost Teeth Knife. I used Ghost Teeth Knife to practice every day, and somehow, through that, I happened to learn it.” Han Sen stayed very calm when she asked about this.\n\nNo one would be able to find out the truth, so he exerted confidence in his answers. Yisha didn’t look suspicious, either. She knew such things might be impossible to explain, anyway.\n\n“How is your practice with The Story of Genes coming along?” Yisha asked him.\n\n“It’s going rather slowly,” Han Sen answered.\n\nThis was true. When Han Sen leveled up his The Story of Genes, it had indeed gone very slow. He did not know how long it might take to make him a Viscount with that.\n\nYisha pulled out a bottle and gave it to Han Sen. “This bottle contains xenogeneic materials gathered from Viscount class xenogeneics. It is a geno fluid, and it should be good in leveling you up and bringing you up to the class of Viscount. Eat ten grams of this every ten days. And when you do, immediately cast The Story of Genes. Once you have finished, come along and get some more.”\n\n“Thank you very much!” Han Sen was so happy, and he thought to himself, “My performance really was good. Look at this, I’ve received some goodies already!”\n\n“Now, you get going. You’ve still got to develop Planet Eclipse, in addition to all the training you have before you.” Yisha waved and let Han Sen go.\n\nThe geno fluid, if it was used by a Baron, it could make him a Viscount. It could possibly make two Viscounts.\n\nBut when used on Han Sen, Yisha knew it probably wouldn’t be as effective. Instead, it would only help him inch his way closer to the threshold. It wouldn’t be enough for him to level up completely.\n\n“We will see how he behaves,” Yisha thought to herself in her heart.\n\nBack on Planet Eclipse, Han Sen was not in a rush to drink that geno fluid. In fact, he was keen to research the geno art he had learned while inside Moon God Palace first and foremost.\n\nJadeskin was a geno art from the sanctuaries. This was something that quite similar. It was like the geno universe counterpart of Jadeskin. They did not have a connection, but with Han Sen’s prior knowledge of Jadeskin, it should make practice of that geno art fairly easy.\n\nHan Sen did not plan on practicing it, though. He still wanted to focus on Jadeskin. He just wanted to absorb the essence of the other and assimilate it with Jadeskin, while he continued on with his original art.\n\nNow that Han Sen could unleash power, he had to be able to gather up spirit successfully. If he did that, he could evolve his xenogeneic bones and become an Earl.\n\nLike Earl Gao Ji: that man’s spirit had been a green dragon.\n\nJudging from the way that geno art was practiced, it must have had a special technique that allowed for the gathering of spirit. Absorbing light element treasures would allow for easier gatherings of spirit."
}