{
    "chapter": 2510,
    "title": "Thirty-Seven Videos",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2510",
    "text": "Han Sen and the others all had weird mushrooms on their heads. The saprophytes had assimilated to become parts of their bodies. If the mushrooms were damaged, their brains would be injured as well.\n\nThey had no idea what to do. No one was able to think of a way to get rid of the mushrooms on their heads. They all looked at each other, unsure of what to do.\n\nFortunately, other than the mushrooms that sprouted on their heads, nothing else happened.\n\n“Why did no mushrooms grow on Little Captain and the little red bird? Have they employed some sort of secret technique?” The pirates looked hopefully at Bao’er and the little red bird.\n\n“Their bodies are special,” Han Sen said simply. “They cannot be hosts to a parasite. They are not like us.”\n\nAll hope vanished when Han Sen said that, and the pirates looked very sad. They kept looking at the mushrooms on their heads and sighed with dismay.\n\n“Meow.”\n\nAs everyone was wallowing in their depression, they heard a familiar sound from somewhere else on the island.\n\nFar away, from deep within the mushroom forest, the white tiger looked at them with a rather cocky expression. Its face was surprisingly human, and it was cackling like an evil maniac. Its teeth were bared in a rictus grin, and it was laughing so hard that it seemed like it was about to cry.\n\nHan Sen had never seen a tiger laugh in such an ugly manner before. If the tiger knew about the mushrooms on their heads, then it must have been responsible in some way.\n\nThe little red bird flew angrily toward the tiger again. But when the little red bird approached, the white tiger drilled back underground and fled. The little red bird’s phoenix fire couldn’t damage the ground. No one knew what that ground was made of.\n\nHan Sen called the little red bird to return. They looked at the strange rocks all around them. The stone that made up the island was metallic but also like jade. No one could tell what sort of material the rocks were composed of.\n\n“You guys go and collect some mushrooms. Let’s see if we can eat them,” Han Sen said to the pirates.\n\n“Captain, there are already mushrooms on our heads. If we eat more, might they start growing all over our bodies?” one of the pirates pleaded through tears.\n\n“Stop talking crap and just go!” Han Sen glared at them moodily.\n\nThe pirates shifted from foot to foot unwillingly. They were afraid that if they went out, their bodies might become the hosts of even more mushrooms. And they were also afraid that the white tiger might show up and kill them. They walked half a step away, and that was it. They didn’t dare leave the safety of the white whale.\n\nThe little red bird spat some fire behind them, and they all jumped out of the white whale in sudden fear.\n\nThe pirates trembled with fear as they walked through the undergrowth of the mushroom realm. They didn’t walk too far, though. They collected a few mushrooms, and Han Sen asked the cook to fry them up.\n\nAfter the mushrooms were cooked, the pirates didn’t dare eat them. They looked down at the fried mushrooms in their bowls, then they all just looked at each other. None of them dared to take the plunge.\n\n“Why are you all frozen? Hurry up and eat.” Han Sen smiled at the pirates.\n\n“Captain, we aren’t hungry… We really aren’t hungry.” Inside, the pirates were thinking to themselves, “Why aren’t you eating, huh?”\n\n“We don’t know how long we’re going to be stuck here. With our food reserves, we might not last very long. From now on, you guys are going to have to eat these mushrooms to survive. Even if you don’t eat them today, there will come a time when you’ll be forced to eat them or starve. But don’t worry; these are just ordinary mushrooms. They won’t kill you.” Han Sen laughed.\n\nHan Sen expected that they wouldn’t be leaving that zone anytime soon.\n\n“Captain, we aren’t hungry just yet. Can we eat them when we grow hungry later?” a pirate asked quietly.\n\n“What do you think?” Han Sen smiled at the man.\n\nThe pirates understood that they had no choice in the matter. Something might happen after they ate the mushrooms, though. Getting hurt or dying was only one possibility, but it was a strong possibility. And if they didn’t eat the mushrooms now, Han Sen would likely deal with them personally.\n\nThe pirates gritted their teeth and picked up the mushroom slices. Trying to summon their bravery, they closed their eyes and put the mushrooms in their mouths.\n\nIn the beginning, they looked glum. But after chewing for a bit, they opened their eyes excitedly.\n\n“Captain, this is so good! They are actually very fresh!” A short while later, one of the pirates exclaimed his delight. Nothing bad happened after they ate the mushrooms, either. No more mushrooms sprouted upon their bodies. There was just that one mushroom still attached to each of their heads.\n\n“Slow down. Don’t eat so quickly. I’m afraid you will be eating these mushrooms for a long time to come,” Han Sen said sternly.\n\nHe already knew the mushrooms weren’t poisonous. If he hadn’t been certain that the mushrooms were harmless, he wouldn’t have permitted the pirates to eat them.\n\nThe mushrooms on their heads hadn’t appeared because of the mushrooms on the ground; they had come from the mushrooms that the white tiger had spat out. The spores inside of those mushroom attacks were the reason why Han Sen’s crew had developed the mushrooms. It was obviously the white tiger’s power, although Han Sen wasn’t sure what eventual effects the mushrooms on their heads might have.\n\nThe white tiger kept appearing now and again. It would growl at Han Sen to try to provoke him. It was probably afraid of the little red bird because it didn’t come near the white whale.\n\nHan Sen left the white whale and went to the broken ship that the white tiger had exited from. That battleship was very old, and the interior was very rusted. The things that were made of wood were all covered in mushrooms.\n\nNothing else was alive on the ship. Han Sen discovered torn bits of clothing of some kind, and the battleship was broken pretty badly. Judging from the damage, it might very well have been the white tiger’s work.\n\nHan Sen went to the battleship’s command deck. Fortunately, the black box wasn’t completely destroyed. He brought it back to the white whale with him and tried to replay the video content.\n\nIt did not take long for Han Sen to be disappointed. Although the discs looked fine, they must have been electrified at some point, or maybe they just sat in that ship too long to be functional. None of the discs would play, and the white whale couldn’t repair them.\n\nHan Sen tried every single disc, but not a single one would work.\n\nHan Sen had also found a very old communicator. He pulled out the memory card, and luckily, the white whale was able to read it. Han Sen was quite happy about this. He looked at the screen on the white whale and noticed that the card possessed thirty-seven video files. There was nothing else.\n\nThe video files were labeled, from one to thirty-seven. Those files were all connected and sequential. There were no spaces or missing files.\n\nSo, Han Sen opened the first video file. He watched it alone in his room. Whether the content was good or bad, but he didn’t want the others to know he had found these yet.\n\n“Mimi, come to Mama.” As soon as Han Sen started the video, he heard a woman’s voice. In the video, a white kitten was walking on shaky legs. Based on how unsteady it was, Han Sen assumed that it was a newborn.\n\nAnd the location in the video was the old ship’s command deck.\n\nClearly, the woman was the one holding the recorder to film the white cat. Upon hearing the woman’s voice, Han Sen noticed how familiar it was. He had heard that voice somewhere."
}