{
    "chapter": 2416,
    "title": "Jadeskin Levels Up to King Class",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2416",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen had realized almost instantly that Falling Leaf wasn’t an ordinary woman. She was very good at hiding her energy so that the average person would be unable to discern her level, but Han Sen had his Dongxuan Area. There was no way that Falling Leaf could hide her King class power from him.\n\nAlthough Han Sen couldn’t tell how many tiers she had unlocked, she had definitely surpassed the first couple of tiers.\n\n“Miss Mirror is very generous. Falling Leaf must be a ranking member in Spring Rain,” Han Sen thought, as he tried to come up with a way to make her leave.\n\nIf Han Sen made her leave himself, that would draw unwanted attention. It would also give Miss Mirror a clue to figuring out what he really wanted. So, Han Sen couldn’t take action himself. Instead of making her stay with them uncomfortable, and he would need to treat her nicely. Bao’er, however…\n\n“When it comes to making people miserable, Bao’er is a true artist,” Han Sen thought, looking at his smiling daughter.\n\n2“Sister Falling Leaf, can you play a game with me?” Bao’er was holding a doll in front of Falling Leaf. Her big eyes made it look as if she was desperately begging.\n\n“Of course I can,” Falling Leaf replied, a smile softening her cold face.\n\nFalling Leaf was quite famous in Spring Rain. She was known as “The Icy Femme Fatale.” Her calm, calculating mind made her an amazing assassin. When she worked, nothing could shake her up or throw her off her game.\n\nHer greatest fight took place on a deified-owned planet. She killed a half-deified elite, the son of a deified being, and they all backed off her.\n\nBut facing a sweet little girl, even Falling Leaf’s mood seemed a bit lighter.\n\nShe seemed happier than when she faced Han Sen, at least.\n\nFalling Leaf didn’t know Han Sen was a fake prince, but even believing that Han Sen was a real royal, she wasn’t interested in him. She would hate the thought of dating a prince.\n\nIf not for Miss Mirror’s order, she wouldn’t have accepted the mission that brought her here. She most certainly wouldn’t have agreed to serve Han Sen.\n\nHan Sen watched Bao’er play with Falling Leaf and felt some relief. He returned to his room to continue practicing,\n\nAfter many attempts to turn Jadeskin’s self-universe cogwheel, he was finally beginning to understand how it worked. He only needed to hit a breaking point for it to reach King class.\n\nJadeskin was different from the Dongxuan Sutra. Han Sen could actually see the Dongxuan Sutra’s self-cogwheel and all the other universal cogwheels around it.\n\nBut when he used Jadeskin, the universal cogwheels all appeared blurry. They weren’t as clear as they were with the Dongxuan Sutra.\n\nSo, Han Sen tried many different methods in the hope of turning the self-universe cogwheel. He had long since lost track of how many attempts he had made. The self-cogwheel refused to budge, however.\n\nHe only needed enough power to connect with the self-cogwheel. Anyone could push universal cogwheels, and the number of cogwheels they could push all boiled down to how much strength they had.\n\nBut ordinary Kings couldn’t actually see the universal cogwheels like Han Sen could. They could get a vague sense of what they needed to do, but they couldn’t tell it was actually a cogwheel they were pushing.\n\nAnd although Han Sen had initially thought that the number of cogwheels someone had to push was directly related to their strength, that wasn’t exactly true. There were some people who didn’t push many universal cogwheels, but even so, they became very powerful. Many such people existed.\n\nThe difficulty of reaching King class depended on the strength of the initial cogwheel. If the self-cogwheel was strong enough and you cast sufficient power, you could spin your self-cogwheel very quickly. In so doing, you could equal the power of people who spun many cogwheels just by spinning your single cogwheel at high velocity.\n\nMany Kings with one area power could unleash more power than Kings with many area powers. That was the theory.\n\nJadeskin was a geno art that was very simple in the way its power was used. The self-cogwheel didn’t have to push many neighboring universal cogwheels, but that didn’t mean the self-cogwheel was weak in itself.\n\nWhen Han Sen was ready to become King class, he started off with Dongxuan Area. With Dongxuan Area’s help, pushing other self-cogwheels was easier. The ability allowed Han Sen to see the Jadeskin cogwheel.\n\nJadeskin’s self-cogwheel wasn’t much smaller than the Dongxuan Sutra’s self-cogwheel. After all, they were the self-cogwheels that were based on Han Sen’s body, so there wouldn’t be many differences between them.\n\nBut the two cogwheels did look rather different. The Dongxuan Sutra’s cogwheel was black, while Jadeskin’s was some sort of translucent jade. It connected to seven universal cogwheels. That number was fairly ordinary for an average King. Compared to the Dongxuan Sutra, that was a tiny number of connected cogs.\n\nBut having a small number of connected cogs didn’t mean that Jadeskin’s power couldn’t spread. The self-cogwheel would still spin very quickly.\n\nUnder the Dongxuan Area, Han Sen slowly cast his Jadeskin, then began shoving against his self-cogwheel to spin it. The progress was now much easier than it had been when he was pushing the Dongxuan Sutra’s self-cogwheel.\n\nAfter all, Han Sen was King class now, so he had much more power that he could throw behind his efforts.\n\nKatcha! Katcha!\n\nThe translucent jade cogwheel slowly started to shift. As the self-cogwheel spun, a weird flower symbol appeared on its surface.\n\nThe flower symbol spread like a growing crystal, slowly sliding over the self-cogwheel. As the cogwheel spun, the symbol swelled more and more. A short time later, it had completely covered the cogwheel. Jadeskin’s self-cogwheel became an ice moon.\n\nJadeskin’s self-cogwheel pushed the other seven universal cogwheels that connected to it. As it did, the symbol glided over those universal cogwheels too. Then it spread further.\n\nThe icy, jade-looking area power spread through Han Sen, becoming a strange sealing area. But after spreading for a while, the power returned, heading back for Han Sen. His body absorbed all of the power.\n\nWhen the ice moon-like cogwheel spun, Han Sen’s entire body crystallized, and he glowed like a crystal. He was like a god wrapped up in holy light.\n\nBoom!\n\nThe cogwheel continued to spin as the universal core hall door opened. Han Sen’s body was sucked into it. He entered the universal core hall.\n\nHan Sen didn’t hesitate. He landed atop the cogwheels of the hall, and when the cogwheels moved, the hall’s door opened. Han Sen exited the hall, finding himself in a new place inside the core area. This wasn’t where he had been previously.\n\nOrdinarily, leaving the core area would set a spawn point for his return. He would be able to come back to the exact place he had previously left.\n\nBut now that Han Sen was entering with his Jadeskin cogwheel, it had taken him to a different location than where he would spawn with his Dongxuan Sutra cogwheel.\n\n“Does that mean I can go to different core areas with each skill? I just need to change the self-cogwheel to determine which place I access?” Han Sen realized joyfully.\n\n1"
}