{
    "chapter": 49,
    "title": "Starlight Arrows",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_49",
    "text": "The two gangs had marched more than half a month before they reached a mountain Han Sen had never been to.\n\nOn the way, Han Sen had truly understood there was strength in numbers. No creatures could block their path with the rain of arrows from the archers and the charge of the cavalry. Of course, the scouts would inform them if there were herds of strong creatures ahead of them and they would take a detour.\n\nAt the destination, Bullseye hid on a cliff and was ready to shoot the sacred-blood creature drawn out by Luo Tianyang’s team.\n\nThe rest went under the cliff and was ready to chase the creature.\n\nIn addition to Bullseye, Son of Heaven and his henchmen also stayed on the cliff. Han Sen knew they must also be good at archery because he had witnessed Son of God almost killing the bloody slayer with an arrow before he snatched its beast soul.\n\nSon of Heaven looked at Han Sen coldly as he had heard rumors about Han Sen being Qin Xuan’s boy toy, which annoyed him.\n\n\"Son of Heaven, where are the arrows you’ve agreed to offer?\" asked Yang Manli.\n\nIt was Bullseye that Son of Heaven really needed this time. As normal arrows wouldn’t harm a sacred-blood creature at all, and Z-steel arrows were too expensive, Son of Heaven had agreed to provide Bullseye with the arrows needed this time.\n\nSon of Heaven smiled and waved his hand. His henchmen then carried a box down from the back of a mount. They opened the box and it was filled with Starlight arrows, each worth more than a million. It was made by Starry Group with 1 percent Z-steel.\n\n\"Manli, here are a hundred Starlight arrows we agreed on. Would you distribute them among your best archers?\" Son of Heaven smiled.\n\nYang Manli turned around and started calling out names. She had good arrows herself; so did Liu Hongtao. Hence, she planned to pick five other members of Bullseye out to use the Starlight arrows.\n\nSoon she had four people picked out and with some thought, she looked at Han Sen, \"And you.\"\n\nHan Sen was slightly surprised, as he did not expect Yang Manli to choose himself. But this was a good thing, and Han Sen quickly stepped up and stood together with the other four.\n\nWhile Yang Manli was preparing to distribute the arrows among the five, Son of Heaven suddenly said grimly, \"Manli, are you sure about the archers?\"\n\n\"What is the problem?\" Yang Manli looked to Son of Heaven.\n\n\"How is someone like him qualified to use the Starlight arrows?\" asked Son of Heaven coldly, pointing to Han Sen.\n\n\"I chose him, and that’s why he’s qualified,\" replied Yang Manli.\n\nSon of Heaven looked at Han Sen disgustedly and said to Yang Manli, \"I am not questioning your decision, but this person just will not do. Please replace him.\"\n\nYang Manli frowned, but she knew this campaign was dominated by Son of Heaven, since he had provided everything. Bullseye was just here to help. So, she couldn’t refuse him.\n\n\"Zhao Hua, come here.\" Yang Manli had to let Han Sen return to the team, and called out another name.\n\nSon of Heaven continued to stare at Han Sen coldly.\n\n\"Sen, you are really unlucky. You had the opportunity to get 20 Starlight arrows and kill the sacred-blood creature. Now it’s all gone,\" said Su Xiaoqiao with regret.\n\nHan Sen shrugged. Although it was a shame he didn’t get the 20 Starlight arrows, he had an even stronger arrow in his quiver. He still had a chance.\n\nThe archers each took position on the cliff and prepared their bows and arrows, waiting for the sacred-blood creature to fly out from below.\n\nHan Sen and Su Xiaoqiao found a comfortable spot and Son of Heaven suddenly walked over and said, \"What are you useless scums doing here? Go away.\" Then, Son of Heaven’s henchmen shoved Han Sen and Su Xiaoqiao aside.\n\nSu Xiaoqiao fiercely stared at them with anger. Han Sen tugged on his arm and said, \"It doesn’t matter. Let’s go over there.\"\n\n\"They are pushing too far,\" said Su Xiaoqiao bitterly.\n\n\" Revenge is a dish best served cold. Just wait until you see Son of Heaven’s face when we kill the sacred-blood creature,\" smiled Han Sen while walking to the other side with Su Xiaoqiao.\n\n\"It’s not that easy. This cliff is wide and Son of Heaven’s men are waiting on the other side. If the sacred-blood creature went to their side, it would be too far from us. Even if it were only three hundred feet from us, we couldn’t even injure it without Starlight arrows. Basically, we are just a decoy, a distraction,\" Su Xiaoqiao smiled wryly.\n\n\"You have money. Why didn’t you buy a few Starlight arrows?\" Han Sen looked at Xiaoqiao puzzled. He remembered Su Xiaoqiao to be very rich. One million should be nothing for him.\n\n\"What do I need those for? It’s outrageously expensive and you may not even be able to recover it. One million each, and you probably need to shoot seven or eight before you could hit something. No guarantee of killing anything either. I’d rather spend the money purchasing mutant creature meat.\" Then Su Xiaqiao lowered his voice and said, \"Now Z-steel is extremely overvalued. As the young master of Starry Group, Son of Heaven owns mines and factories of Z-steel. So, he doesn’t need to spend much on these arrows, as the cost of each arrow is at most ten thousand.\"\n\n\"Such huge profits?\" Han Sen was surprised.\n\n\"Well, now Z-steel mines have been monopolized by a few groups. Also the manufacturing technologies are not ready for producing alpha alloy with more than 5 percent Z-steel. For some reason, the alpha alloy will become as brittle as glass if Z-steel content exceeds 5 percent.\" Su Xiaoqiao explained to the Han Sen.\n\nWhile the two were chatting, they suddenly heard a howling like dragon under the cliff. Grabbing their bows, they looked down from the cliff."
}