{
    "chapter": 2407,
    "title": "Entering the Core Area Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2407",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nFox Queen wanted to go to Planet Water Zone immediately to see if Han Sen had managed to get the Nine Spin Destiny Mirror from Destiny’s Tower.\n\nBut Bai Canglang had something he needed her to do, so she didn’t have time to go to Planet Water Zone yet. In order to protect her cover identity, she had to suppress her impatience for the time being.\n\nBut Fox Queen couldn’t stop thinking about how Han Sen had activated the Sacred Blood Statue, yet somehow managed to survive. She couldn’t figure out how he had pulled that off.\n\nLong ago, Sacred Leader used the Sacred Blood Statue to control subordinates. Even his deified soldiers were subject to it. And the Sacred Blood Statue on Han Sen’s back had been drawn in Ancient Blood Dragon Lady’s blood. That sort of Sacred Blood Statue was reserved for use against deifieds. Han Sen was just a Duke. He wasn’t even a King yet, so how could he survive?\n\nFox Queen was very confused, but it would be a while before she could travel to Planet Water Zone and find answers to her questions.\n\nAfter Han Sen returned to Underwater Town, he began researching the Nine Spin Destiny Mirror. He couldn’t discover anything unique about it. He put power into it, but he couldn’t seem to activate the item. His only option was to drip his blood onto the stone mirror in the hope that it would come to acknowledge him as its master further down the line.\n\nEvery time Han Sen placed his blood upon the stone mirror, it would light up with the shadow of the Nine-Tailed Fox. When the shadow disappeared, the blood would go with it.\n\nHan Sen was trying to use the same method he had with the Jade Drum, but it didn’t seem to be working.\n\n“Did King Bao put the Foxes’ Nine Spin Destiny Mirror in Destiny’s Tower and place it beneath that statue? If so, why would he do that?” Han Sen couldn’t come up with any answers to that question.\n\nThe stone mirror wasn’t making any progress, and for the moment, there didn’t seem to be anything Han Sen could do about that. The water fairy in the jade gourd was helping Han Sen grow stronger, though. She embodied the feelings of the Proud Bone Swordmind for him, and as a result, Han Sen felt as if his own swordmind was about to have a breakthrough.\n\nHan Sen didn’t copy Mad Sword’s swordmind, though. He used his own swordmind to fight with Mad Sword’s. At first the fights were entirely one-sided, but after a while, Han Sen started to develop some resistance.\n\nMad Sword’s swordmind wasn’t suitable for Han Sen, so he didn’t plan on using it directly. Instead, he used it as a grinding stone, sharpening his own swordmind against it.\n\n“It doesn’t matter how strong Mad Sword’s swordmind is; it isn’t my own. It would only belong to me if I could fully understand it.” Although improvements like this were much slower than if he were to simply copy Mad Sword’s swordmind, Han Sen wasn’t in any particular rush. He focused on each aspect of his swordmind, improving it a piece at a time.\n\nAlthough Han Sen had many King class core genes, and he had one hundred King class xenogeneic genes, he would need many more in the coming days. So, Han Sen still planned on going back to the core area to hunt for more core genes. It was always good to have more in the shed, after all.\n\nIf Han Sen’s guess was correct, one hundred King class xenogeneic genes might raise his King area by one tier.\n\nHan Sen pushed his self-cogwheel to enter the core area again. He returned to the location where he had left, which wasn’t too far from Planet Dark Zone.\n\nHan Sen wouldn’t dare visit Planet Dark Zone again. Until he had enough strength, provoking that weird insect would basically mean committing suicide. His super god body didn’t make him invincible, and the time limit was always a headache.\n\n“Once I become deified, will I be able to use an infinite amount of super god spirit body?” Han Sen wondered as he flew.\n\n“Dollar, what a coincidence. Are you interested in cooperating again?” Han Sen hadn’t been flying for long when a group of people approached him. It was Dragon One, Dragon Eight, and some other Dragons.\n\nBut Dragon One and Dragon Eight were the only Dragons who had survived their last venture. The Dragons accompanying them now were new.\n\nHan Sen didn’t answer. From another direction, a second group of people was swiftly approaching. The leader of that bunch was Dia Robber. As he flew closer, he said, “If you guys are cooperating, might it be okay if we join?”\n\nHan Sen was shocked. He had only just entered the core area, and these two had already found him. This couldn’t be a coincidence.\n\n“People, I am flattered. But I was hoping to venture out alone this time. Maybe another time?” Han Sen said, rejecting their offers politely. He didn’t know what they were after, and he didn’t want to fight with them.\n\nHan Sen turned to leave, but Dia Robber immediately said, “If you don’t wish to work with us, that’s fine. But I have a few mutant King class xenogeneics to go after. Are you interested in taking a look?”\n\nHan Sen stopped. It took time to find mutant xenogeneics, so being able to travel straight to them would be a great help for Han Sen’s leveling. If they were killing mutants, Han Sen could gain the xenogeneics’ talents without needing to practice them.\n\n“Not bad, not bad. I have a lead on a few mutant xenogeneics, as well. If you are interested, you know the rules and shares,” Dragon One then said.\n\nHan Sen was very tempted by both offers. If things really were as they said, killing a few mutant xenogeneics would be very beneficial for Han Sen. Plus, he would be getting fifty percent of the spoils from the entire fight, not just what he personally killed. And there would be no need to spend time seeking the xenogeneics out. Opportunities like this were hard to come by.\n\nAfter a brief period of silent thought, Han Sen still turned down both offers. If he chose a side now, he would only end up offending the other.\n\nHan Sen wasn’t worried about offending others, but in this case, it was unnecessary.\n\nSince Han Sen hadn’t agreed, they still wouldn’t be able to kill those mutant xenogeneics by themselves. They would need Han Sen’s help in the future, anyway. Perhaps he could receive more benefits like this later on.\n\nDragon One and Dia Robber seemed to expect Han Sen to turn them down, so they didn’t appear to be disappointed. They still spoke to Han Sen with glee and respect, hoping they could cooperate again in the near future.\n\n“Why are you so nice to him? Do you think the Destroyed need a King like him?” Barr asked once Han Sen had left.\n\nDia Robber was one of the few people that could make Barr listen. If Dia Robber wasn’t there, he would have fought Han Sen. It wasn’t that Barr didn’t like Han Sen; he just enjoyed fighting powerful people.\n\nDia Robber nodded with sincerity, and he said, “Yes, we really need someone like him.”\n\nSeeing Barr fall silent, Dia Robber sighed and said, “We need him because he is stronger than us. Sure, the deified members of our race are stronger than he is, but that matters little because they can’t enter the core area.”\n\n“If they cannot come, then they cannot come. What’s the big deal?” Barr grunted in annoyance.\n\nDia Robber smiled and said, “There is no big deal. But if we want to kill deified core xenogeneics in the core area, then we need him. Do you think our Destroyed Kings could escape a deified xenogeneic the way Dollar did?”\n\n“If they didn’t have an area power to restrict strength, an ordinary deified xenogeneic couldn’t kill me,” Barr said.\n\n“You are the best King we have, but hunting deified xenogeneics with just you and I would be an impossible task. We might succeed, but we would sacrifice a lot. With Dollar’s help, that can change. The success rate would be higher, and we wouldn’t sacrifice as much. What is the harm in that?” Dia Robber asked, shaking his head."
}