{
    "chapter": 2375,
    "title": "Killing the Siren Elder",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2375",
    "text": "“The Crystal God Conch became deified because of that Siren Bottle.” Han Sen looked at the Siren Elder. She didn’t look old anymore. It looked as if she had returned to being a young woman.\n\nThe Siren Elder swung her fishtail, and waves surged out behind her as she swam away from the blood altar and went toward Han Sen and Lan Haixin. She laughed haughtily. “As long as I possess the holy bottle, anything I desire is within my grasp.”\n\nAfter that, the Siren Elder waved her hand. A rainbow light fired at Han Sen and Lan Haixin. Her powers were now very different than her original abilities, and her attack was similar to the blurry rainbow lights that were visible inside the Siren Bottle.\n\nThe blurry rainbow lights came down, transforming into crystal bottles around Han Sen and the others to trap them.\n\nHan Sen had seen the Crystal God Conch use an almost identical power, and now he knew for sure that the power had come from the Siren Bottle.\n\nBut the Siren Elder was weaker than the Crystal God Conch had been. She generated a substance chain power, but it was very weak. It wasn’t solid like the Crystal God Conch’s substance chains.\n\n“It looks like she can’t really control the power of the Siren Bottle, but how did the Crystal God Conch wield the Siren Bottle’s power so well? It couldn’t have activated the Siren Bottle. And it didn’t have the Siren blood necessary to perform the sacrifice, either,” Han Sen thought to himself.\n\nLan Haixin’s power struck the crystal bottle, but the attempt was futile. Her attack struck the surface of the bottle with King class power, but it wasn’t enough to even rattle it on the spot.\n\n“Haha! It is useless! This is the Siren Bottle’s power… Allow me to take your blood so that I may use it on the Siren Bottle. When I control it in its entirety, I will achieve even more power, and then I can start my own race that will exist all across the universe. I will become an alpha!” A maniacal grin split the Siren Elder’s face, and the rainbow colors that enshrouded her became even brighter.\n\nThe glass bottle grew smaller as the Siren Elder applied pressure to it. She wanted to squash the people inside it.\n\n“Little red bird.” Han Sen understood how the Siren Elder was making use of the Siren Bottle, but he didn’t hesitate to summon the little red bird.\n\nThe little red bird fluttered over to Bao’er’s shoulder, then it hopped onto Han Sen’s finger and chirped at him.\n\n“We’re about done here. Get rid of this old hag, but leave her final few breaths to me. I want to finish her off myself,” Han Sen commanded the little red bird.\n\nThe Siren Elder looked as if she had heard a funny joke, and she laughed. “This isn’t the end yet, and you are already going crazy.”\n\nBoom!\n\nThe words had barely left the Siren Elder’s mouth when the little red bird took flight. Flames began to lick around her body as she rose from Han Sen’s finger. Suddenly, the little red bird turned into a gold fire phoenix.\n\nThe phoenix wings gave a couple of powerful beats, raising swathes of fire that charred the walls of the glass bottle. The substance chains that composed the crystal walls were like paper. The flames danced across them, and they were incinerated into ashes in a flash.\n\n“It looks like the Siren Elder’s power is far inferior to the Crystal God Conch’s. This is like a fake deified’s power,” Han Sen thought to himself.\n\n“Dei–deified xenogeneic… No… Impossible!” The Siren Elder’s eyes were wide, filled with utter disbelief at what she saw.\n\nLan Haixin couldn’t believe it, either. She stared in amazement at the little red bird that had turned into a fire phoenix.\n\nThe two Sirens were familiar with the little red bird already, as Bao’er played with the creature every day. And she especially liked to bully it. Lan Haixin sometimes felt sorry for the little thing, but it had never seemed to mind getting bullied by Bao’er. It continued to follow her at all times.\n\nThat little red bird was actually a deified xenogeneic. The thought was mind-boggling.\n\nBut the truth couldn’t be denied. The fire phoenix that the little red bird had turned into was now flying towards the old Siren woman. And when it reached her, it spat out a golden fireball.\n\nThe Siren Elder screamed, her voice thrumming weirdly around them. Her body was shining, and that light became a glass bottle that tried to encase the little red bird, but it turned to dust the instant it came close to those fires. The flames lashed wildly towards the Siren Elder.\n\nThe Siren Elder was unable to dodge. She gathered up her angelic god light to block the attacks with her hands, but when her hands touched the fire, they started to burn. And then, her whole body was aflame.\n\n“Argh, no! This is impossible! I want to be an alpha… I want to receive this holy bottle…” the Siren Elder screamed angrily as the cruel fire consumed her. Not long after, her burned body was turned to ash.\n\n“That wasn’t a real deified power, huh? It looks like her methods were riddled with flaws. Bai Yi and Lan Haixin’s blood have to be combined to control the Siren Bottle.” Han Sen pulled out his Ghost Teeth Knife. He walked forward and cut off the dying Siren Elder’s head.\n\n“Mutant Xenogeneic King hunted: Siren Lady. Mutant xenogeneic gene found.”\n\nAfter Han Sen killed the Siren Elder, the fire continued to burn. The Siren Elder’s body turned into ash. A blue gem that must have been her xenogeneic gene sat amidst the grey.\n\n“But I didn’t get her beast soul!” Han Sen grabbed the gem and held it in the palm of his hand.\n\nHan Sen placed the blue gem into his chest pocket, then approached the altar.\n\nPang!\n\nHan Sen tried going to the altar, but the blurry rainbow stopped him short.\n\nHan Sen frowned. He simulated the Siren Elder, but he still couldn’t access the altar.\n\nLan Haixin bit her lips and said, “It looks like you have wasted your efforts here. You won’t be able to get the holy bottle, after all.”\n\nHan Sen ignored her. She looked at the Siren Bottle for a while and suddenly said, “It is you, right? The Sirens’ final holy virgin, Bai Yi’s mom?”\n\n“You are a clever kid.” A woman’s voice came out of the Siren Bottle. The blurry rainbow in the bottle came into focus, turning into a beautiful Siren woman who hung at the entrance.\n\nShe had white ears and white scales. Her skin looked like jade, and it was even smoother than Han Sen’s Jadeskin.\n\nHer hair was long and black, and it reached down to her waist. Her eyes were like obsidian. Her face was very attractive, and a soft smile warmed her expression.\n\n“Ho… Holy Virgin…” Lan Haixin stared at the woman by the Siren Bottle in shock. She didn’t know how to compose herself at that moment.\n\nAll the things she thought could never happen had transpired in such an incredibly short time. Lan Haixin felt like her entire lifetime hadn’t contained as many unexpected twists as the last ten minutes."
}