{
    "chapter": 3073,
    "title": "Robbery?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3073",
    "text": "Feng Fei Fei looked at Han Sen with surprise. Rejecting the temptation of money was not difficult, but he should have considered it before rejecting Mister Jin.\n\nGong Shu Jin was the son of the Gong Shu Ban, who had the title of a genius. When he was young, he was already very famous in the jade wall city. He was not just very good at fighting since he had the talent of Mister Gong Shu’s land-pulse skill. He was not a very high-level officer of the Qin Kingdom, but his reputation was not something ordinary either. Mister Gong Shu was a big mister in the Qin Kingdom, which was rare. God only knew how many nobles wanted to establish a good relationship with him. They wanted to hire him and have him locate land pulses for them. He knew a lot of people in the Qin Kingdom.\n\nFeng Fei Fei did not really like Gong Shu Jin, but she did not want to offend him. The primary reason for this was because of the position of the Gong Shu misters in the Qin Kingdom.\n\nHan Sen had just rejected him. Unless he had some sort of background that could strike fear in Gong Shu Jin’s heart, with Gong Shu Jin’s personality, Han Sen was going to find himself in a spot of trouble.\n\nFeng Fei Fei knew everyone who had some level of authority in the jade wall, but she did not recognize Han Sen. This gave her a shock.\n\nHan Sen was quickly leaving. Just a second later, he was gone from Night Cry Valley. Gong Shu Jin’s eyes looked murderous, but it was just for one second. After that, his face was back to being pretty and soft. “I was going to do something for Miss Fei Fei, but I was unable to do it,” Gong Shu Jin said, as he walked before Feng Fei Fei. “I feel so sorrowful and ashamed.”\n\n“It is fine, Mister,” Feng Fei Fei coldly said. “I was just interested in a moment. I am not interested any longer.”\n\n“I will take you back.” Gong Shu Jin sat atop his unicorn and performed a requesting gesture. He wanted Feng Fei Fei to ride with him.\n\n“Mister, that is very kind of you, but I would still like to walk around by myself. I am not going to trouble you.” Feng Fei Fei bowed, flapped her wings of light, and flew out of the valley.\n\nFeng Fei Fei had obviously rejected him. Gong Shu Jin still needed to act like a gentleman, so he obliged her request and stop pursuing her. He looked at Feng Fei Fei leaving and was immeasurably angered. He said, “Feng Fei Fei, I am going to make you feel sorry in bed tonight.”\n\nAfter Han Sen left Night Cry Valley, he went to the teleporter.\n\nEarlier, when Gong Shu Jin asked him to name a price, he regretted it. If he knew there was a noob that was willing to deliver himself, he would not have turned the mutant eight sound bug into an egg.\n\nHe was going to sell it, anyway. It did not matter who he sold it to. If someone wanted to pay a high price, Han Sen was more than happy to sell it. It was a shame the mutant eight sound bug had been turned into an egg. He could not randomly sell that to people. Before Han Sen returned to the teleport place, he saw a shadow break space and arrive. Feng Fei Fei appeared in front of him.\n\n“What is it, Lady?” Han Sen asked. “If you are coming to the mutant eight sound bug, there is no need for us to talk.”\n\nFeng Fei Fei shook her head. “I am not here for the mutant eight sound bug. Do you know who that man was?”\n\n“No.” Han Sen shook his head.\n\n“I see.” Feng Fei Fei displayed a wry smile. “He is one of jade wall city’s geniuses. He is a true demon genius. He is Gong Shu Jin. His father is the famous Gong Shu Ban. You just disrespected him. You are going to be in a lot of trouble.”\n\nThis thing started with Feng Fei Fei, so Feng Fei Fei did not want others to get into trouble because of her. Therefore, she went to warn Han Sen.\n\n“Thank you for the heads up,” Han Sen said with a wave. “If there is nothing else, I will leave.”\n\n“Don’t you believe me?” Feng Fei Fei was startled by how calm Han Sen appeared. She thought he did not believe what she had told him.\n\nShe hesitated, but Feng Fei Fei took off her veil. She showed him her pretty face. She sighed and said, “I wouldn’t lie to you. We cannot play this nicely. If you believe me, I have an idea that can help you.”\n\n“Thanks, Lady, but there is no need for that.” Han Sen said thank you and left.\n\nFeng Fei Fei looked at Han Sen leave with shock. She did not know what she felt. She took off her veil to reveal her identity, but Han Sen did not react. She was surprised.\n\n“He doesn’t recognize me.” Feng Fei Fei looked at the space Han Sen left with a flurry of conflicted emotions. She did not, however, give chase.\n\nShe had done all she could. If Han Sen insisted on getting into trouble, it was no longer her concern.\n\nFeng Fei Fei was a very famous singer, and not just to the Qin people. Even people from the other six kingdoms knew her. Even if they hadn’t seen her in the flesh, they would have seen her performances online. It was rare for someone not to know her.\n\nFeng Fei Fei thought Han Sen might have been pretending not to know her and had another purpose, but Han Sen really did not know who Feng Fei Fei was. He had not been in this world for long, and he had not really paid attention to the celebrities.\n\nRegarding Feng Fei Fei’s reminder, Han Sen believed it. But it was just attributed to Gong Shu Jin. For that, he did not care.\n\n“Old Yang, how is the online shop going?” Han Sen returned to where he lived and asked Mister Yang for a status report.\n\n“I have done everything you asked of me.” Mister Yang looked at Han Sen weirdly as he asked. “You can hawk your wares whenever you want to, but are you sure you really want to use this name?”\n\n“Yes,” Han Sen said with a smile.\n\nHan Sen was not very good at naming things. His online shop was called “Shop.” From what Mister Yang saw, this name was not overbearing or particularly eye-catching. A shop’s name should have been impressive. Since that was the name Han Sen had selected, he did not say anything. “Old Yang, put these items on sale. The prospect of being able to eat hinges on the sale of these,” Han Sen said with excitement. He used to lead the world, but this was the first time he had opened a shop.\n\nMister Yang had a wry smile. He and Li Bing Yu felt the same. They did not think an online shop was a good idea.\n\nSeeing that Han Sen was so interested in it, they did not say anything disrespectful about it. He asked, “Mister, what are you planning to sell?”\n\nLi Bing Yu was nearby. She looked at Han Sen. She also wanted to know what Han Sen was hoping to sell.\n\n“I went to Planet Gu Ya and lucked out. I found some gene eggs. They are not high-level, but they should last a while. Old Yang, come have a look at these. How much should I sell these for?” Han Sen pulled out a gene egg to show Mister Yang Mister Yang did not expect Han Sen would have gene eggs on a two-day trip. He picked one of them up, looked at it, and said, “Mister, you are very lucky. This is a viscount class toxic gecko. It has the combined skill of Toxic Spray. Its power is quite high for a viscount. You could sell it for a few thousand dollars.”\n\n“What about this?” Han Sen took out a gene egg and showed it to Mister Yang.\n\n“This is… Eight sound bug gene egg… Mister, you are very lucky! Although eight sound bugs are viscount class gene eggs, the going price is far more lucrative than what the toxic gecko will get you. You could sell this for five digits. I will have to do some actual research for the blue book value.” Mister Yang was truly shocked.\n\n“You sell these for now.” Han Sen took out a dozen eight sound bug gene eggs and gave them to Mister Yang.\n\nMister Yang was frozen as he looked at the gene eggs. His eyes and mouth opened wide. He made no sound.\n\nAfter a while, Mister Yang managed to ask, “Mister, were you involved in a robbery?”"
}