{
    "chapter": 2775,
    "title": "Space Garden",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2775",
    "text": "That was especially true when he saw Xie Qing King piloting a ZT27 Ming King battleship to pick him up. Han Sen suddenly doubted that Xie Qing King had earned all this dough just by selling comics. The man had to be selling weapons on the black market or something.\n\nThat battleship had once belonged to the Extreme King. It was the type of battleship only their kings could use. Ordinarily, only princes, princesses, and other royals were allowed to pilot such powerful ships. Although it was a small battleship compared to what some races possessed, the equipment, tools, and weapons on-board were the best in the universe. That was especially true of its defenses. It could withstand the strikes of a primitive deified without even having its paint scratched. This wasn’t something you could buy in your average street market.\n\n“The Extreme King Prince Chrisman is a fan of my books. This was a gift he sent me, in exchange for the latest edition in my series.” Xie Qing King looked and sounded so proud when he saw Han Sen’s open-jawed astonishment.\n\n“You cow…” Han Sen gave him a thumbs up. He had nothing else to say. He really did admire his old friend’s success.\n\nThere were a lot of humans, spirits, and creatures who had crossed over from the sanctuary in recent times, but he was certain Xie Qing King had been the most successful. But the key for him reaching this monetary zenith was a vast amount of self-determination. He got there himself, and he hadn’t relied on anyone. Han Sen admired that.\n\nSnowball, who was sitting next to Xie Qing King, had received a complete makeover. It was wearing all sorts of fancy stuff. Even the dog tags on its neck were famous in the universe. It had a small, gentleman’s hat upon its head—which just so happened to be a high-class treasure.\n\nAside from the word “rich,” Han Sen didn’t know how to describe the pair.\n\n“Old Han, have you ever thought about making your own mountain?” Xie Qing King tossed an arm around Han Sen’s shoulders and passed him a cigarette.\n\n“What kind of mountain? We aren’t some sort of gang.” Han Sen rolled his eyes.\n\nXie Qing King’s eyes were serious. “That is precisely what I mean. Although my work is going well, the more I work, the more empty I feel. In this universe, I don’t have a true place to call home. I don’t have a territory. Everything within reach is controlled by others. And if I was ever to offend the wrong people, they could take away everything I own with a mere wave of their hands. That feeling sucks.”\n\n“Aren’t you rich? Can’t you just buy an abandoned system and build it up?” Han Sen said.\n\nXie Qing King drew a long breath through his cigar and puffed out some smoke rings, then he gnashed his teeth and said, “That won’t do sh*t. Without enough power to support us, having a territory is no different from having no territory.”\n\n“Then what are you suggesting?” Han Sen had actually been planning this for a long time. It had long been his goal to mark out territory for himself in the universe.\n\nBut there were many issues going on in the universe right now. Even if they were to take over a xenogeneic space, they might not be able to hold it.\n\nXie Qing King seemed to be prepared for that question. He turned on a hologram and revealed a map of the universe. He pointed at part of the map and said, “Would you like to join me in taking a gamble? If we win, this big place will belong to us.”\n\n“What if we lose?” Han Sen asked, looking at that place.\n\n“Then we will just end up bankrupt and have to start all over,” Xie Qing King said with a laugh.\n\n“Tell me about your plan.” Han Sen’s eyes were locked on that space.\n\nThe two words read “Space Garden.” It was a xenogeneic space in the universe that belonged to the Flower God race. The Flower Gods weren’t a high race, and Space Garden was just a medium-sized xenogeneic space.\n\nIn regards to their abilities, the Flower Gods didn’t have the power or resources that the high races did. The Flower God people were just good at making geno fluids, and making geno fluids had given them a higher stake in the greater universe. Even the top ten high races couldn’t replicate the geno fluids they made.\n\nIt wasn’t like their geno fluid skills were better than those of the higher races; Space Garden simply offered many nutritious genes. The resources that they used could only be obtained in the Space Garden.\n\nThe Space Garden wasn’t very big, but it had very special rules. As long as the Flower Gods held onto the Space Garden and didn’t leave, the three highest races couldn’t set foot there.\n\nWhile the Flower Gods made a lot of fantastic geno fluids, their combat powers were rather weak. They had been working hard to improve themselves for many years, and at this point, no one knew how many geno fluids they had produced and consumed. But there were no deified elites growing amongst them. They didn’t have the power to become one of the high races.\n\nBut the Flower Gods weren’t to blame for their weakness. Fighting wasn’t what their genes had been developed for. They just didn’t have the right genes for combat, so it didn’t matter how many geno fluids they consumed. No deified elites would rise amongst them.\n\nOn top of that, many factions were suppressing them. Again and again, they were stopped from trying to become one of the higher races.\n\nBecause the Flower Gods knew they couldn’t become stronger, they sought a lot of outside powers to bolster their own.\n\nNormally, if a race wanted to start a lantern war, all of their fighters had to share the same blood. If an outsider joined the fight, even if they beat the higher race, the lantern would refuse to light.\n\nBut the Flower Gods had recently developed an intriguing geno fluid. If one was to use that geno fluid, they could temporarily possess the blood of a Flower God.\n\nIf a deified elite used that geno fluid, they could be considered a Flower God for a while and help the Flower Gods earn a slot amidst the higher races. The adopted warrior could light the lantern on the Flower Gods’ behalf.\n\nBut such a powerful geno fluid could only be used once due to the resources it cost. Even the Flower Gods couldn’t keep producing that sort of concoction. Therefore, they were currently considering which deified elite would be willing to help them become a high race.\n\nPeople were evil. Even deified elites that had been friendly to the Flower Gods couldn’t be trusted now. Therefore, the Flower Gods were hesitating to make a decision. They couldn’t decide which elite to trust.\n\nThe gamble Xie Qing King was talking about was in regards to the Space Garden. He wanted to get the Space Garden for himself. That was Xie Qing King’s scheme.\n\nIf he was able to claim the Space Garden, then even if the three higher races came for him, it would be pointless. As long as the Space Garden was in their hands, no outsider could enter.\n\n“If the three high races cannot take the Space Garden, how can we claim it?” Han Sen looked at Xie Qing King and asked.\n\n“The Flower Gods aren’t talented fighters. They own the Space Garden, which is a nice place. They also have great technology that helps them produce geno fluid. Many of the higher races want it. They want to own the Flower Gods, but sadly, the Space Garden has its special rules. In all this time, none of the higher races have found a way to invade them.”\n\nAfter pausing, Xie Qing King went on to say, “The puppeteers in the shadows cannot enter the Space Garden, but they do not want the Flower Gods to become a higher race. They are afraid that if the fitness of the Flower Gods was improved, their race would become dangerous. So, they are trying to suppress the Flower Gods every way they can. Although the Flower Gods have the potential to become a high race, they are forced to remain a low race.”\n\n“That means that if the Flower Gods want to become a high race, they have to do more than just beat another high race,” Han Sen said with a frown.\n\n“You are right. Otherwise, looking for a deified elite that could help them wouldn’t take much time. But looking for one that could sort out all of their issues and not affect the reputation of the Flower Gods? That is hard. If the elite was too weak, there wouldn’t be enough power to help them become a high race. If the elite was too strong, the Flower Gods wouldn’t feel safe. Therefore, the Flower Gods have been unable to decide which elite can help them. Right now, the pickings are slim for the Flower Gods, but they are also offering a lot to the person they hire. If someone helps them become a high race, they will share the Space Garden with their new ally.” Xie Qing King pointed at the map with a look of excitement."
}