{
    "chapter": 2750,
    "title": "Powerful Slashing and Killing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2750",
    "text": "The part of it that Han Sen could see was only about the size of a kitchen table. Han Sen couldn’t tell what it was, but the creativity of humans could be rather amazing. Han Sen had already been thinking about the true god dragon, so when he saw the glowing object, his heart leaped. His brain flashed with an idea. “No matter which way you look at it, this thing looks like a giant dragon scale. This cannot be the body of the legendary true god class evil dragon, can it?”\n\nAfter the electric eel ate the blood coral, it continued to twist and convulse. Its body was growing redder and redder.\n\n“I’ll kill you while you are sick! This is a nifty opportunity.” Han Sen stopped hesitating. While the electric eel was still writhing in pain, Han Sen began to generate power using Ghost Teeth Knife. He teleported next to the electric eel, aimed at the beast’s belly, and unleashed his swing.\n\nThe electric eel was in too much pain, and it had no chance of protecting itself. Han Sen’s knife stabbed toward the creature’s belly, but the blade only left a small mark across the red scales. It didn’t harm the electric eel too much, but the eel was already thrashing so badly that it almost whacked Han Sen with its tail.\n\nHolding his shield up to protect himself, Han Sen stabbed the creature a few more times. He cut a small wound into its stomach. In response, the electric eel’s tail slapped Han Sen’s shield, sending him flying a few hundred meters.\n\nWhen Han Sen teleported back, the wounds he had inflicted were being healed. They were healing so fast that he watched them seal back up.\n\n“Ghost Teeth Knife really is useless now. I really have to find myself a deified knife at some point. The Buddha stole my knife blank, and I heard a while back that it got refined into a deified treasure. If I have the chance, I’m going to get my knife blank back,” Han Sen thought to himself. Now that Ghost Teeth Knife was no longer useful for combat, he would have to rectify this situation sooner or later.\n\nNow that the electric eel had consumed the blood coral, its body had grown stronger. Its healing power had also intensified. Even Ghost Teeth Knife’s ripping power couldn’t stop the wounds from healing. It was a very strong foe to contend with.\n\nBut at this time, the electric eel was also in incredible duress. It continued to writhe around on the sea bed, and it didn’t have time to deal with Han Sen.\n\n“If I let it continue to change without killing it, I won’t stand a chance later,” Han Sen thought to himself. He made up his mind, and a weird shockwave of power emerged from his body.\n\nHan Sen’s body changed fast. Ordinarily, the Dongxuan Armor and his Spell armor couldn’t be used at the same time. However, when Han Sen and Spell combined to become a xenogeneic together, their powers were fused into one. Not just those two powers, either. The Blood-Pulse Sutra and Jadeskin were also a part of the furious mix.\n\nThe four powers combined in a special way, making fundamental changes throughout Han Sen’s body. He was now releasing a presence like a xenogeneic. His body looked like the dark form of some ruthless demon.\n\nIt combined coldness and passion, holiness and evil, weirdness and beauty. It was a disturbing, chaotic scene. It was completely different from how Han Sen usually operated.\n\nAt that moment, Han Sen no longer looked like a human. He looked like a cold and heartless xenogeneic demon king.\n\nHan Sen looked impassively at the electric eel that was twitching with pain. In his hand, he clutched Ghost Teeth Knife. It seemed to have been infected by his weird power. The purple and black colors of the knife became a pitch-black flame. Even the knife air darkened to black.\n\nHan Sen lifted his Ghost Teeth Knife, and he could feel that the energy within him was now incredibly strong. Four types of battle bodies had merged into one, forming a xenogeneic battle body. Han Sen’s battle power had become an inferno.\n\n“I wonder if this xenogeneic battle body’s power is enough to kill the electric eel now. If it can’t, that would be rather annoying,” Han Sen thought idly. He slashed toward the electric eel that was writhing around in pain.\n\nWith that xenogeneic battle body’s boon of power, Ghost Teeth Knife’s black flame roared to insane heights. It carried a scary knife air to slash across the electric eel’s belly.\n\nKatcha!\n\nThe diamond-like scales and hardened flesh of the electric eel were ripped open by Ghost Teeth Knife. Han Sen’s knife sank inside the beast, all the way to the hilt.\n\nHan Sen was delighted by this result. He lifted his knife and slashed the foe again. He cut the creature’s belly open from one end to the other. The blood and internal organs spilled out all over the sea floor.\n\n“Xenogeneic transmutation deified killed: Space Electric Eel. Deified xenogeneic gene found. Obtained Space Electric Eel beast soul.”\n\nHan Sen had never expected to kill the electric eel with such ease. He looked at the Ghost Teeth Knife in his hand in shock.\n\nWhen he shook off his shock, Han Sen was crazily happy. His xenogeneic battle body was far more powerful than he thought it could be. He had killed a transmutation deified xenogeneic with ease.\n\n“I didn’t expect my xenogeneic battle body to be so strong. Such a scary power. I’m afraid it might be as strong as when I use super god spirit body.” Han Sen was filled with unfiltered joy at the thought.\n\nHan Sen retreated a little, allowing the blood to drain out of the electric eel’s carcass for a while. Once the blood had drained, he could get a better look inside the electric eel’s belly. In addition to the creature’s organs, the weird blood coral was still inside the eel.\n\nHan Sen’s mind might have been playing tricks on him, but the weird blood coral now looked even more like a dragon. The details were more defined than they had been. As he examined, Han Sen halfway expected the thing to open its eyes and fly away.\n\nPatterns were etched across the coral now, although Han Sen had no idea how they had gotten there. Perhaps the stomach acid of the electric eel had made them. Regardless, the patterns made the coral look even more like a dragon scale.\n\n“This thing looks a bit evil. If the electric eel hadn’t eaten this thing, I would have killed it so easily.” As Han Sen examined the blood coral, he started to feel that something was wrong.\n\nThe blood of a deified creature wouldn’t blend into the sea water. It should sink to the bottom and pool there. However, Han Sen saw no blood pooling on the sea floor around him. Even the organs that fell out of the carcass were now clean, devoid of even a speck of blood.\n\n“Where did all the god blood go?” Han Sen stared at the blood coral that looked like a real dragon. The red light was growing brighter and brighter.\n\n“This thing can’t be alive, can it?” Han Sen watched the blood coral warily, but it sank to the bottom without showing much of a reaction.\n\nHe watched it for a while, but the chunk of blood coral didn’t move. Then, Han Sen gathered up his power and grabbed the blood coral. He thought it would react when he touched it, but he picked the item up with ease. It was like an ordinary, living chunk of coral.\n\nHe examined it thoroughly, but it continued to sit silently in his palms, just as he would expect from an ordinary chunk of coral. He put it aside and swam into the hole it had made in the sea floor.\n\n“If the evil dragon’s body is really down here, I’m going to be mega-rich,” Han Sen thought to himself as he descended into the hole."
}