{
    "chapter": 1841,
    "title": "Jadeskin Breakthrough",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1841",
    "text": "The women knew that if they wanted to live, they would have to work. So, they decided to listen to Han Sen and bring the kids who were old enough to work with them. They did things like housework and cooking.\n\nThe Barons weren’t like that, of course. Many of them simply decided to observe, whereas others decided to leave the base. For what purposes, they weren’t sure.\n\nGu Qingcheng took the opportunity to visit the warehouse. When there, she laughed and said, “Aren’t you afraid of those guys not sharing their resources with you? With the flesh they hunt, they can survive out there for as long as they want.”\n\nHan Sen smiled and said, “Those guys are just people, at the end of the day. They need entertainment, don’t they? If they merely eat flesh and hunt for food all day, they’ll go mad in less than three months. By the way, do you know if any of the women can dance or sing? You should find some pretty ones and open up a club. There, we can sell cigarettes and food. Or perhaps, if there are enough people, we can even open up a casino, so they can all have fun when they come back. I don’t believe they are all honorable.”\n\n“This is too cruel. You’ll be pushing the women into this wicked fire.” Gu Qingcheng looked upset.\n\n“In this era, they are lucky to be alive. And it’s not like I am forcing them to do anything, aside from sing and dance. If anyone touches them, mark my words: I will kill them. In this base, I make the calls. Unless the women are willing to do something more, of course. Then, things are different.” Han Sen laughed.\n\n“They might be willing to?” Little Angel asked.\n\n“Little Angel, this world is a complicated place. You still have a lot to learn. We are all beings with emotions.” Han Sen laughed.\n\nLittle Angel seemed as if she did understand, but she didn’t say anything.\n\nAfter the women and kids were done with their work, they could eat. None of the Barons and Viscounts came to join them, though. Even if they did come, it’d only be to ask if the women had earned their points. They had stormed off in anger, after all.\n\nOver the next few days, not a single Viscount or Baron showed up. It seemed as if they were indeed going against Han Sen.\n\nThere were xenogeneics all about in the wild, so it wasn’t as if they would go hungry.\n\nHan Sen chose to ignore their behavior, and he allowed them to do whatever they wished to. They couldn’t do anything in the base, anyway.\n\nHan Sen was not worried about the prospect they could make use of the xenogeneic genes. They couldn’t eat the mutated materials, and Han Sen didn’t need the ordinary flesh anyway. The xenogeneic genes were what he needed.\n\nBut there were not enough people, so Han Sen let Little Angel and Zero stay with the women. And in the meantime, he got to practicing with Jadeskin.\n\nHan Sen practiced quite a few geno arts. The Story of Genes was the most complete, and he could turn it into a deified mode.\n\nThe Dongxuan Sutra had come quite a long way, too. He wasn’t sure if he could take it to a deified mode yet, though.\n\nThere was only one part to the Blood-Pulse Sutra. After generating the geno armor, there wasn’t anything more to it. So, Han Sen did not have to concern himself with it right now. Once he reached Viscount, that would change.\n\nJadeskin didn’t even have its geno armor yet. There hadn’t been a breakthrough on the three previous geno arts. So, he wanted to practice with Jadeskin. It shouldn’t have been too difficult to study the second part of Jadeskin, to generate the armor he wished to.\n\nAside from learning Jadeskin, he went to learn knife skills from Yisha. He wanted to learn more about Teeth Knife, so he could use it in combat.\n\nThe Barons broke down faster than Han Sen thought, as well. In half a month, someone snuck into the base and cashed in their points. And with the points, they decided to buy cigarettes, food, and water. Mirror Lake’s water was drinkable, but it didn’t taste good. So, more people were willing to purchase water than they were food.\n\nWhen they first came to Planet Eclipse, they didn’t dare walk too far. They hunted the creatures that were nearby and collected much xenogeneic food.\n\nEven so, some people were injured. And they had to cash-in materials for medicine. Some of them had not even bothered killing anything, and they still ended up injured. For those instances, the wounded would have to pay with their own money.\n\nThe Barons usually stayed together in a large group, and yet, hunting Baron foes would see them injured. Hunting there was a difficult task.\n\nHan Sen didn’t care about that, however. All he wanted to do was practice with Jadeskin, right now.\n\nGu Qingcheng and Xie Qing King were out and about hunting.\n\nGu Qingcheng always went solo, and she never co-operated with anyone else. Xie Qing King, on the other hand, had gotten close with the Barons. Han Sen noticed this because Xie Qing King’s armor was special. That made him popular with the others by default.\n\nAfter a month, the Barons and Viscounts gave up fighting out in the wild. They collected the xenogeneic materials and cashed them all in for points. Although everything they had collected so far came from Baron xenogeneics, it was a good start.\n\nHan Sen finally achieved the breakthrough he was looking for, too. Jadeskin made a movement, as his body generated a mystic substance. Han Sen generated a geno armor that looked like ice.\n\nThe ice melted and became a geno fluid that went into his body. Han Sen felt a chill when it melted and entered his body. But he felt a power welling in his bones, and changes began to occur.\n\nHis body became semi-transparent. You could see the flesh and muscles inside, even the organs. He was like an iceman.\n\nAfter half an hour, his body returned to normal. With his body looking like a normal human being again, he felt much relief. If his body was crystallized, and he was stuck in that state, it’d be pretty scary.\n\nHan Sen tried out the xenogeneic Jadeskin. It was different from the Blood-Pulse Sutra. Activating Blood-Pulse left him looking human, but using Jadeskin transformed his body into jade. His body would toughen up, and his speed and strength would be greater.\n\n“It’s time to take a look outside the base.” Han Sen planned to test out his new abilities.\n\nHan Sen had a bunch of maps to go out with. That was something else the Barons had cashed-in for. He had never been out before this, but he now had a firm understanding of the geography.\n\nHe picked a place to visit, and then set-out alongside Little Silver. Then, they disappeared along the west side of Mirror Lake.\n\nHan Sen was going to a mountain in the west. Supposedly, a group of xenogeneics resided there. There were six of the creatures, but they were said to all have different powers. A dozen Barons had tried hunting the group of xenogeneics, but their attack had not killed a single creature. One Baron had even lost his life, and the others limped off with injuries."
}