{
    "chapter": 2167,
    "title": "Rebate Alpha",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2167",
    "text": "Han Sen returned to Narrow Moon, where he was kept busy for the next few days. When all that was sorted out, he went back to Planet Eclipse.\n\nThe base was as he had left it, with Zero, Han Ling’er, Little Angel, and Yisha looking after the place. Consequently, Planet Eclipse was doing fine on the whole, as well.\n\nWhile Han Sen had been gone, Zero, Little Angel, and Han Ling’er were able to level up to Marquise. That was largely due to the abundance of rich resources Planet Eclipse offered.\n\nThere were many xenogeneics on Planet Eclipse, but the highest ranked were only Dukes. And there weren’t many of those around. It’d be difficult for them to become Dukes themselves with so few xenogeneics to hunt.\n\n“I only have Planet Eclipse. It has proven more than enough for early development, but if I want to go any further, this planet isn’t going be to enough.” Han Sen was troubled, thinking of the limitations posed by the finite resources.\n\nIt wasn’t just Han Sen that needed resources. Everyone else did, too. And if there weren’t any more resources available, he couldn’t bring anyone else from the sanctuary.\n\nBut most of the planets in the geno universe were taken by someone or other, and the relationships between the factions were very complex. When someone claimed a territory, they could draw the attention of many factions.\n\nGoing to the barren system wouldn’t be easy, either. Anyone who wasn’t escorted by powerful elites could be attacked by the scary creatures of such a place.\n\nEven if he successfully claimed a place there, it could be taken away by force if he didn’t have the protection of a big faction.\n\nHan Sen was in an awkward position, right about now. He couldn’t get a hold of any more resources, and the resources available to him on Planet Eclipse were not enough.\n\nHan Sen mulled over this for a while, but he failed to come up with a viable solution.\n\nHan Sen leaned back from his computer and rubbed his head. Seeing the ocean stone bug playing with Bao’er, Han Sen suddenly remembered that he had wanted to experiment with it.\n\nHe took the stone bug and Bao’er to a nearby volcano.\n\nThe ocean stone bug’s attack power was practically non-existent. Keeping it with him would be pointless, so when Han Sen entered the volcanic zone, he set the bug down near the lava.\n\nThe stone bug saw the lava, and when it did, its eyes brightened as it immediately rolled forward.\n\nSplash!\n\nThe stone bug fell into the lava, and not long after, it was covered in a layer of lava. After a while, the lava cooled and turned into stone.\n\nWhen the stone turned black, the stone bug rolled into the lava again. It kept repeating this until it was a plump ball that was around the size of a hand.\n\nHan Sen wasn’t in the mood to watch much longer, though. At that speed, God knew how long it might take the bug to create another ocean mountain.\n\n“I’ll wait until it grows bigger before taking the ocean stone.” Han Sen left the stone bug there and returned to the base with Bao’er.\n\nWhen he arrived at the base, Han Sen was shocked to find Yisha sitting in the plaza. All the creatures were there waiting on either side of the plaza as if a queen was visiting.\n\n“My Queen.” Han Sen bowed. His mind raced through possible explanations for why she had come to visit him on Planet Eclipse.\n\nYisha looked at Bao’er, who was holding Han Sen’s hand, and stood up. “Take a walk with me. I want to see how much you have learned over the past few years.”\n\nHan Sen thought to himself, “I haven’t been around here for the past two years. You know Planet Eclipse better than I do, so it’s not like you need to inspect what I’ve done with the place.”\n\nHan Sen might have thought those things, but he would never dare to speak them out loud. He led her on a short tour of the base and its surroundings.\n\nThey approached Mirror Lake, and while Han Sen was describing that place to her, Yisha suddenly interrupted him. “Han Sen, have you heard stories of the Rebate Alpha?”\n\n“I have only heard a little,” Han Sen answered after a brief moment of thought. He wasn’t interested in the Rebate, and so he hadn’t spent much time exploring their history.\n\nBut during his time in Narrow Moon, he had indeed heard some stories about the Rebate Alpha. After all, an alpha was the pride and identity of any race.\n\nYisha kept walking, and she said, “The Rebate are a higher race, but compared to the long stretch of history, we are also a fairly new race. We cannot compete with the older high races. It was incredible luck that we gained an alpha such as that, who was able to lead us to where we are today. Do you not know about her history?”\n\n“I have heard she possessed the blood of an even more ancient race,” Han Sen answered.\n\nYisha laughed. “That’s just the story that other races tell. Over time, we have come to start believing it ourselves.” After a pause, Yisha went on to say, “Our alpha was a slave. Our race used to be a primal society, and we couldn’t even get off a single planet. We didn’t know anything about fighting or practicing geno arts. Then, a higher race descended on our planet and took us away to be slaves. Sometime after, our alpha started to travel around the galaxy, collecting skills and strength. After many great trials and difficulties, we were able to light the lantern and become one of the higher races that many cannot help but envy. But do you know what she did, then?”\n\n“She must have been really talented. And she accomplished all that through her own efforts?” Han Sen thought a little boot-licking on his part would be appropriate here.\n\nYisha smiled and said, “Back then, the Rebate were just another race. And our alpha was just an ordinary being, as well. When she started practicing, she only had geno armor. And then, she managed to claim a xenogeneic fruit that let her ascend and become a Baron. This kind of talent is very common in the universe. There are probably millions of people like this out there.”\n\n“If that is the case, then your alpha must have been a very patient person. She had more intelligence and patience than ordinary people,” Han Sen told her.\n\nYisha shook her head. “She might have been smart, but she was not fond of suffering. She liked to sleep, and she liked long baths. She created Teeth power because she was lazy. She liked to finish things with one hit, without needing to attack again.”\n\nHan Sen did not know what to say, because the Rebate Alpha was now being portrayed as a very normal woman. But for a normal woman like that to have escaped a slave planet and led her race to light a lantern… That was incredible.\n\n“Are you curious why our alpha gained such talent with that personality? How such a lazy person managed to raise her race up to loftier heights and bring the Rebate into the geno hall?” Yisha smiled at Han Sen.\n\n“I am curious,” Han Sen answered honestly.\n\nYisha’s expression looked conflicted. “My Alpha didn’t get that far on her methods and talents alone. She depended on the Extreme King.”"
}