{
    "chapter": 2731,
    "title": "God Body Evolved",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2731",
    "text": "But after another half hour, Han Sen still hadn’t emerged from the Good Fortune Pool. Now, even Li Chun Qiu’s face looked stunned.\n\n“It has been an hour, and he still isn’t out yet… This should be what a primitive deified can achieve, right?” Shale said with shock.\n\nLi Chun Qiu nodded and said, “According to our best theory, half-deifieds can only last half an hour at the most. Unless they manage to trigger a vision, that is. Then, they can last more than an hour. A primitive deified can last one hour…” Li Chun Qiu trailed off. He was wondering why Han Sen was taking so long, and why he had yet to come out.\n\nLittle did they knew, Han Sen himself was just as confused as they were. He had already consumed more power than his body had previously contained, but he wasn’t stopping there. He felt like he could still absorb more and more. It was like his nervous system was impaired, and he didn’t know when to feel full.\n\n“Deified gene +1. Deified progress: 30/100”\n\nSuddenly, a voice sounded inside Han Sen’s ears. It shocked him. When he heard what it said, he was so happy.\n\n“Holy sh*t! The water inside the Good Fortune Pool can increase my tally of deified genes. Is it just like the Very High predicted? Are these waters here because the deified genes melded with the water itself…” Han Sen was floored. It had been so long since he had earned a deified gene. He couldn’t believe he could get them here.\n\nHan Sen had tried to consume deified genes before, but he hadn’t been able to digest them. These mutated deified genes, however, were being absorbed without issue.\n\nRight now, Han Sen didn’t care how long he had to stay underwater. This was a fantastic opportunity, so he wasn’t going to stop until he was stuffed to the gills.\n\n“Deified gene +1. Deified progress: 40/100…”\n\nNot long later, Han Sen’s brain played a similar announcement.\n\nAfter hearing the announcement again, Han Sen tried even harder to absorb the power of the Good Fortune Water. His body was sinking lower, driving him deeper and deeper into the pool. And the further he went, the stronger the gene power became.\n\nHan Sen floated inside the Good Fortune Pool, continuing to absorb what he could. Shale and Li Chun Qiu were still on the outside, looking pretty freaked out. They had been waiting for two hours by this point, and they saw no sign of Han Sen coming back to the surface.\n\nThat itself was a big problem. Shale was a deified when he entered the Good Fortune Pool, and he had even triggered a vision, but he only lasted two hours.\n\nNow, Han Sen had been in there almost as long as Shale, and he yet to show a sign of coming back out. This was so strange.\n\n“Han Sen’s body should still be half-deified. He must have taken in so much gene power. Even if it was all somehow beneficial for him, it should have filled his body to overflowing by now. How can he still be down there?” Shale asked in a whisper.\n\nLi Chun Qiu looked into the water but didn’t speak. He was trying to guess what might have happened to Han Sen. He considered many possibilities, but he didn’t think any of them made sense. In short, unless Han Sen had become deified, the Good Fortune Pool’s gene power should have blown him up by now.\n\nIf Han Sen was becoming deified inside the Good Fortune Pool, there should have been a big movement on the surface to let them know what had happened. They would have noticed something like that. The pool shouldn’t have been as quiet as it was right now.\n\nBut it didn’t seem possible that Han Sen was dying down there, either. Creatures had died in the pool before, overloaded by the power that they had taken in. But as they died, their powers would explode rather violently. Shale and Li Chun Qiu would sense it if that happened.\n\n“What is he doing under there?” Li Chun Qiu couldn’t contain his curiosity. Although he was in charge of the Good Fortune Pool, he couldn’t just hop in and check.\n\nThe Good Fortune Pool had incredible gene powers, but the ingredients that composed it were too complicated. Once someone reached the maximum level of harmful gene powers they could tolerate and left the pool, they could begin to slowly purge those destructive powers. However, their core genes would be forever affected. They would live with side effects from then on.\n\nThese side effects didn’t affect one’s body and practice, but if that person wanted to enter the Good Fortune Pool again, the rate at which they accumulated harmful gene powers would be greatly increased. Entering the water again could be very dangerous for them.\n\nSo, ordinary people could only earn benefits the first time they entered the Good Fortune Pool. Entering the Good Fortune Pool again would make these side effects get worse. After a few times, most people couldn’t even touch the water anymore.\n\nThat was the situation that Li Chun Qiu found himself in. He wanted to dive into the pool and take a look, but he simply couldn’t.\n\nShale had only just entered the Good Fortune Pool, so he couldn’t go in again either. The two of them had no choice but to watch from the edge of the pool. They hoped that Han Sen would come back out, so they could learn what he had managed to accomplish down there.\n\n“Deified gene +1. Deified progress: 56/100”\n\nHan Sen was still frantically pulling in the gene powers of the Good Fortune Water. His deified progress was moving steadily forward.\n\n“Am I going to become deified?” Han Sen was so excited. If he could become deified here, then in the eyes of the universe, he would have the basic authority to start his own race. That meant he could represent humans and start a war for a lantern in the Geno Hall. Humans could become a high race.\n\nFighting the Extreme King or a big race like the Sky wouldn’t be realistic. He would have to find some higher races that only had a couple deifieds, or maybe none at all. If that happened, Han Sen would be confident in his ability to pick on them.\n\nOf course, every high race had connections. He couldn’t just start a war with whoever he wanted. Just like the Rebate. If anyone tried to start a lantern war with them, they would have to think about how Sky Palace would react.\n\nHan Sen wasn’t worried about it too much, though. He just had to find a high race that was allied with the Extreme King, and then snuff out their lantern. There was no love lost between him and the Extreme King anyway, so battling them was going to happen some day regardless.\n\n“Deified gene +1. Deified progress: 98/100”\n\nAs time went by, Han Sen’s deified progress went higher and higher. Han Sen could feel the power collecting inside of him. There were changes occurring in his body that felt like they could flip the sky and the earth.\n\nThese changes weren’t connected to any of his four geno arts. It was his body itself that was changing. It was a process that he couldn’t have begun to describe. His flesh, his bones, his organs, and every cell in his body was changing.\n\n“Deified gene +1. Deified progress: 100/100… God body evolving…”\n\nWhen his deified progress reached 100, Han Sen felt like his body was a flower, and the petals were falling away one by one. He felt like a serpent, peeling off its skin. The feeling was beyond anything that Han Sen had previously imagined, and although it was incredibly strange, it also felt amazingly good."
}