{
    "chapter": 2674,
    "title": "One Fighting Four",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2674",
    "text": "“It looks like Han Sen is stronger than I thought. Even if I was half-deified, I don’t think I would be able to suppress him with my current power,” Shale said thoughtfully.\n\nHan Sen looked down on the bloodied-but-not-yet dead Gru. He was going to finish him with a final shot. He wasn’t on good terms with the Extreme King, and someone like Gru would definitely be used against him. It would only lead to trouble further down the line. He knew he would need to finish the man off then and there.\n\nBut before Han Sen could do anything, a shadow appeared next to the heavily wounded Gru. The man looked at Han Sen, grabbed Gru, and disappeared, teleporting away from the battlefield.\n\nHan Sen didn’t need to guess. He knew that the Very High who had taken Gru away was the same man who had signed a contract with him.\n\n“What a shame,” Han Sen thought to himself.\n\n“Han Sen really is a legendary dude. The power of one bullet was enough to harm Gru like so. To be honest, it should make us feel embarrassed,” said an approaching figure.\n\nWhen Han Sen turned around, though, he saw more than one person. There were three people following the speaker.\n\n“What do you guys want?” Han Sen asked, looking at the four people. He had seen them in the information booklet he had been given. The leader of the crew was from the Extreme King. Of the remaining three, one was Extreme King, and the other two belonged to other races. If they had been taken on as silkworms, though, then it was obvious they weren’t foes that Han Sen could take lightly.\n\n“You are strong, but we want to get a good ranking. So, we will have to ask you to leave the valley,” the leading Extreme King man said.\n\nAfter that, the four silkworms surrounded Han Sen.\n\nAlthough the Very High never suggested that silkworms should team up, cooperative fights weren’t forbidden, and there were no rules stating that silkworms should fight one on one. If things had to be one-on-one at all times, there would have been no reason to stick all twelve silkworms in a single valley.\n\nThe Very High didn’t only want to learn from the fighting experience of their silkworms. They wanted to learn what would happen to the mind during heated exchanges, so they could determine which effects were useful and which were not. It would help the Very High determine how to conduct themselves in the future.\n\n“Are you going to leave with your head held high, or are we going to have to send you home in a body bag?” a mantis-man asked Han Sen snidely.\n\nHan Sen laughed and said, “You think you can bully me because you outnumber me?”\n\n“Han Sen, are you naive enough to believe we will fight you one-on-one?” the mantis-man said with a disdainful look on his face.\n\nHe and Han Sen were both from small races. Despite that commonality, Han Sen was a famous fellow all across the universe. Even amongst the Very High, he was considered a figure of much prestige.\n\nThe mantis-man’s background was similar to Han Sen’s, but he had never spent time in the limelight. That lack of fame led to him hating Han Sen quite a lot.\n\n“It isn’t like that. I’m just giving you a little advice. If you want to bully me, four of you won’t be enough. You should go and enlist a few others before you push your luck,” Han Sen said quietly.\n\n“What idiocy. Come on, then. Show us! Show us how good you believe you are,” the mantis-man grunted coldly, as a purple and red mantis arm suddenly broke through the fabric of space. It slashed forward, hurtling down on Han Sen.\n\nThe mantis-man had space power. Wherever the mantis-man’s arm went, a long mark was left in its wake.\n\nHan Sen fell back, but he felt as if the space his body occupied had become distorted. Although he had moved nearly a thousand meters, the mantis-man was no farther away from him.\n\nHan Sen frowned. He looked to the side, and he saw an Extreme King person unleashing a weird area power. He thought it must have been the area power that was distorting the dimensions around him.\n\nAs the mantis-arm came down, Han Sen used Spell’s two pistols to take aim at the mantis scythe.\n\nDong!\n\nIt shouldn’t have been difficult to counter the mantis’ arm with Han Sen’s power, but when they struck each other, Han Sen felt a surprising amount of power coming against him. He stumbled back a few steps, and his hands ached. He almost lost the tight grip he was keeping on those two pistols.\n\nHan Sen’s eyes flicked back to the mantis. A weird, gold light was covering the mantis arm. That gold light was shining on all four half-deified, actually. One of the Extreme King was glowing especially brightly. That was undoubtedly his area power.\n\nBefore Han Sen could react, there was an arrow headed toward him. It was a half-deified from the Aichi. The Aichi were born archers, so their talents with a bow were exemplary.\n\nHan Sen was fighting four people alone, which put him at a considerable disadvantage. The four half-deified fighters were all using their special powers in conjunction.\n\nThe mantis-man had a rare space power that could break space with a scythe that was practically indestructible. One of the Extreme King fighters could manipulate space, whereas the other could buff the bodies of his companions. They restricted Han Sen’s movements while also making their bodies stronger.\n\nThe Aichi archer was the icing on the cake. He had a scary proficiency with the bow. He kept harassing Han Sen from afar, and his area could buff the speed of the other three.\n\nBecause space was sometimes shortened or lengthened, the distance Han Sen kept between himself and his enemies was no longer reliable. The attacks that he could evade were now no longer avoidable. The distances at which he could attack the enemy were made longer, keeping him from touching them.\n\n“Although Han Sen is strong, the other silkworms are very strong, too. He is fighting four people all alone. Even I, a Very High, cannot do that. He is just one Han Sen,” Liyu Zhen coldly said.\n\nLi Keer and Exquisite weren’t too worried because they could sense Han Sen’s heart. Although it seemed that Han Sen was being oppressed and restrained at every turn, they could feel that Han Sen’s heart was like a quiet well. There was a lot of confidence inside him.\n\nAlthough they hadn’t yet figured out where Han Sen’s coincidence came from, they knew Han Sen’s situation wasn’t as dire as it seemed.\n\nAn arrow was flying right toward Han Sen’s face, and a sword light was coming at Han Sen’s waist. The mantis arm and Spell’s pistol collided, sending Han Sen back a few hundred meters. Every second of the engagement put Han Sen in a new life-and-death situation. It seemed that if the mantis-man and the others worked just a little harder, they could defeat Han Sen.\n\nThe battle raged furiously. Han Sen was attacked by many areas, knife lights, and sword shadows, and despite it all, he kept blocking everything that was thrown at him. He was countering the attacks of four people.\n\nIn the beginning, those Han Sen’s four attackers had the advantage, but as time passed, they realized with shock that their restraints on Han Sen were becoming weaker and weaker. They could no longer keep him contained within their areas.\n\nIn the end, Han Sen was easily engaging all four of them at the same time. He was able to attack and defend as he pleased.\n\n“This guy’s battle talents are too scary,” the Fox woman said. She was watching Han Sen fight, stunned. Each of the four silkworms was just as strong as she was, but Han Sen could fight all four of them with stability. And he was only a ninth-tier King."
}