{
    "chapter": 2864,
    "title": "Sky Armor God Jail",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2864",
    "text": "“That should not be Deep Abyss Knight.” Although ordinary creatures did not know Sky Armor God, they started to wonder after seeing that power.\n\nDeep Abyss Knight was a dark element deified xenogeneic. No matter how powerful they were, they should not have had the power of a god.\n\nSky Armor God was damaged by the Extreme King. Now, he was damaged by Han Sen. He was furious. He activated his god personality to try and kill Han Sen.\n\nWhen the god personality raged, Sky Armor God used his power to the max. Han Sen clearly saw the universe had a universal cogwheel. The light Sky Armor God’s outside skeleton armor was dyed purple. It had the same color as the skeleton armor. All of the universal cogwheels that connected to the substance chains were being affected. Han Sen tried to use his Dongxuan Area to control the purple universal cogwheels, but he noticed he was unable to do anything about them. It was like the universal cogwheels formed an independent operation mode. It was like they were not getting affected by the Dongxuan Area.\n\nBzzt!\n\nSky Armor God continued his approach. The flickering, purple lights of the universal cogwheels made them spin faster. It made the substance chains move faster.\n\n“Destiny’s knife armor bone is like jail. God’s sky armor.” Sky Armor God’s voice boomed like thunder. The purple light was spreading in front of his chest. It became a purple light knife. It suddenly trapped Han Sen’s body inside it.\n\nHan Sen’s Sky Radish God Lance exploded with a scary green light. It swept across the purple light knife, but the Sky Radish God Lance touched the purple light knife. The purple light knife did not break. It was not shaken away. It stuck to the Sky Radish God Lance.\n\nKa-ka… ka-ka…\n\nHan Sen saw the purple light knife sticking to the Sky Radish God Lance and realized it was a layer of purple bones. The purple bones were stuck to the Sky Radish God Lance. It was like Sky Radish God Lance had a bone lock shell, and every bone was stuck to it. Han Sen felt the Sky Radish God Lance become heavier. In the blink of an eye, Han Sen was almost unable to hold the Sky Radish God Lance.\n\nAt the same time, the purple light knife was shining at Han Sen from all angles. Han Sen dragged the Sky Radish God Lance, wanting to use his Space Teleportation to leave. He noticed that the universal cogwheels around him were cut-off by the purple universal cogwheels. Unless he could break the purple universal cogwheels, he could not use Space Teleportation to escape.\n\nHan Sen had to swing his fist to fight. He wanted to shake away the purple light knife. When the purple light knife touched his fist, it became a bone slice.\n\nWithin a moment, Han Sen’s body was covered in bone slices. The Sky Radish God Lance had them too. Han Sen’s entire body was hanging in space. He was like a statue that wore bone armor.\n\nWith the suppression of the bone slices, Han Sen’s power could not move an inch. All the power in his body exploded like crazy. He could barely stand. He did not get crushed by the bone slices. “So, what if you have a god personality armament? A low-life creature is a low-life creature. It does not matter what you have. In front of a god, you are just a worthless piece of trash.” Sky Armor God coldly looked at Han Sen. His eyes looked scary and murderous. With the things he said, the bone slices on Han Sen started to go straight and turn into weapons. They were going to cut into Han Sen’s flesh, riddling his skin with thousands and thousands of cuts.\n\nThe bone slices were incredibly sharp. They pierced into Han Sen’s flesh. Even though Han Sen’s body was like a true god body, he could not block the cuts dealt by those bone slices. The scariest thing about it was that the bone slice suppression prevented his power from leaking beyond them. Han Sen was unable to move.\n\n“This is what you get for committing blasphemous acts upon a god spirit. The Sky Armor Bone Jail will strip you of your flesh. It will have you pay for your crimes.” Sky Armor God looked very excited.\n\n“Game over. Now Dollar cannot even concede.” Li Keer turned pale. She was worried about Dollar.\n\n“It is a shame that the god personality armament looks like it was not Dollar himself that went to the geno hall to get the god personality armament.” Bai King shook his head.\n\n“He has a god personality armament but still cannot kill a god.” In Sky Palace, the woman looked disappointed. “Dollar is only butterfly class,” Sky Palace leader said with a sigh and a look of great shame. “His flesh is still better than a true god. He can fight a true god but not a god spirit. If he can level up to true god, I would say he stands a very good chance. What a shame. I am afraid he will not have another chance at this.”\n\nTang Zhenliu looked into the space battleground. He was shouting, “Keep going! Don’t just stand there!”\n\nWang Yuhang and the others all looked a bit pale. Ning Yue looked scared while holding Bao’er’s arm. Little Angel and Zero were watching Han Sen with eyes full of worry. It seemed as if the creatures of the universe forgot to breathe. They nervously looked at the bone slices cutting into Han Sen’s flesh. They were thinking of the cruel scene that was going to happen. Han Sen, who had countless bone slices piercing into his flesh, finally spoke. “You are Sky Armor God, right?” “I did not expect you to know my god title,” Sky Armor God coldly said. “Are you really a god?” Han Sen asked. “Not bad, but it is too late to beg,” Sky Armor God confidently said. “Performing a blasphemous act against a god spirit is something that cannot be forgiven.” Han Sen looked at Sky Armor God and coldly said, “Unforgiveable is used well. My blasphemy to a god spirit should have me cut up thousands of times without forgiveness. You forced your way into another creature’s body and also killed people. What is a crime like that worth?”\n\nSky Armor God laughed and said, “I am God. Gods control the universe. I have not sinned. Even if I have sinned, everyone should suffer. Who can judge me? I am God.”\n\n“Me,” Han Sen calmly said. “What did you say?” Sky Armor God thought that was funny. He looked at Han Sen like he was a funny clown. “If no one can judge you, then I will judge you.” Han Sen was still calmly looking at Sky Armor God. “Do you think you can judge me, God? I am right here. How are you going to judge me?” Sky Armor God looked at Han Sen like he was smiling, but he wasn’t smiling. His words were smothered in a joking tone of voice. Han Sen’s body was going to get cut, yet he could still talk like that. From Sky Armor God’s perspective, he was a lunatic.\n\nIt was not just Sky Armor God thinking that. Most creatures in the universe started to wonder if Han Sen was crazy. In a time like that, he could still talk that way.\n\n“So, Sky Armor God, allow me to judge you.” Han Sen looked at Sky Armor God as he slowly spoke each word.\n\nWhile Han Sen spoke, his left eye, which had the black and white color, was flashing. Suddenly, the eye no longer looked human. It looked like a cold, mechanical eye."
}