{
    "chapter": 2377,
    "title": "Destiny’s Tower",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2377",
    "text": "Back in Underwater Town, Han Sen decided to leave Bao’er in the company of Lan Haixin, in case the Siren tried to do something that would give him a headache later on.\n\nA commoner could die, and no trouble would be caused, but if a princess died, that could have dire repercussions for Planet Water Zone. King Bai and many others would take the event quite seriously. So, Han Sen needed to keep an eye on Lan Haixin.\n\nFortunately, with Bao’er by the woman’s side, he wasn’t worried about her doing anything to rock the boat.\n\n“Brother Sixteen, have you considered my proposal?” Bai Ling Shuang’s video suddenly appeared on his phone.\n\n“We can talk about this later. I’m not certain I will be able to reach the peak of Rot Bone Mountain. If I make this agreement and subsequently fail, I will only let you down,” Han Sen said.\n\n“That is okay. As long as you try your best, I won’t attempt to exact vengeance, even if you fail. And I will still give you your rewards,” Bai Ling Shuang said.\n\n“Are you sure you can promise that?” Han Sen looked hesitant.\n\n“Brother Sixteen, tell me what you want. I will not be stingy in what I offer. If you want Cher, Big Sister is happy to give her to you.” Bai Ling Shuang smiled.\n\n“You’re really willing to give me Cher?” Han Sen sounded desperately hopeful, as if he was smitten in the throes of love.\n\nBai Ling Shuang smiled. “Brother Sixteen, the Foxes cannot be trusted. You don’t really want a Fox as a guard, do you?”\n\n“You don’t want to let her go, Sister Ten?” Han Sen sounded sad.\n\nBai Ling Shuang shook her head. “Men have no resistance when it comes to Foxes. It isn’t that I want to keep her from you; I’m just afraid that something bad might happen if I don’t.”\n\n“If you don’t want to let Cher go, Sister Ten, then give me one hundred King class xenogeneic genes.” Han Sen looked annoyed as he made this request.\n\nHan Sen didn’t actually want Cher, of course. He had only requested her so he could suggest the bounty of xenogeneic genes as an alternative.\n\nOne hundred King class xenogeneic genes was a lot to ask for. Even Bai Ling Shuang would feel a loss of that magnitude.\n\nOf course, if Bai Ling Shuang gave Cher to him instead, Han Sen would take her. If he had control of Cher, he might be able to use her against Fox Queen. It would be perfect for him.\n\nBai Ling Shuang frowned. One hundred King class xenogeneic genes was too much. Even with her wealth, she couldn’t accept such an offer easily.\n\nShe fell silent for a while. Then she looked back at Han Sen. “How about this, Brother Sixteen? I will give you fifty King class xenogeneic genes. If you help me reach the top of Rot Bone Mountain, I will give you another fifty. If you are unable to reach the top of the mountain, you can keep that first fifty just for putting in the effort. What do you think of that?”\n\n“Sure.” Han Sen accepted the suggested bargain immediately. Getting fifty King class genes would be perfect for Han Sen, regardless of the circumstances.\n\n“Will you come to Night Charm Town, or do you want me to send them to you?” Bai Ling Shuang asked in a level voice, fixing her hair as she spoke.\n\n“Let me come to Night Charm Town. I miss Cher. You wouldn’t be too stingy to let her spend a night with me, would you, Sister Ten?” Han Sen asked greedily.\n\nBai Ling Shuang wasn’t fond of Han Sen’s avarice, but she still agreed.\n\nBao’er and the little red bird were in Underwater Town, so Han Sen wasn’t afraid that something ill would befall Lan Haixin and Lilly.\n\nThings went smoothly. Han Sen stayed with Cher for a night, but instead of doing what Bai Ling Shuang thought they would be, they laid on the bed and shared information.\n\nHan Sen brought the fifty King class xenogeneic genes home with him, but he couldn’t make use of them yet. When he reached King class, Duke genes would be useless to him, so he needed to focus on obtaining Duke genes for now. Using the King class genes while he was still a Duke would be a waste.\n\nHan Sen put the King class xenogeneic genes in storage and went to King’s Garden. There, he absorbed a lot of king air to increase his Duke gene tally.\n\nBai Yi was now considered one of the most powerful royal children. The fact that Han Sen was no longer provoking the ire of the real royal children was an indication of his strength. And getting a primary root king dragon was not difficult.\n\nBecause he had access to the richest king air, Han Sen could gain many Duke genes in a single day. He unlocked three gene locks in each of his four geno arts, and he still had some time before the big exam.\n\nJadeskin’s element could fortify the body and provide ice-sealing powers. Mutant Blood had the element of blood and a genetic power. The Blood-Pulse Sutra was slightly different, in that it had the element of time and space. And as for the Dongxuan Sutra, Han Sen had no idea what category it belonged to.\n\nThe Story of Genes’ element was Eternity. It was able to freeze things. As he gained control of different elements, the power of Eternity would change and adapt. If he could use it well, it would become very powerful.\n\nAfter The Story of Genes opened its third gene lock, Han Sen noticed a change when he used The Story of Genes. A strange connection was forged with the black crystal armor. Although the connection was weak, Han Sen could feel that the black crystal armor had a lifeforce and will.\n\n“Is the black crystal armor a living thing? Is there something residing within the black crystal armor?” Han Sen didn’t understand.\n\nThe connection was too weak, though, and it came and went. Whenever he could feel it, the connection seemed blurry, like it was distorted by static.\n\n“After Spell levels up to King class, I should try to learn more about the black crystal armor. Maybe I will find out what it is,” Han Sen guessed to himself.\n\nKing’s Garden was very peaceful. The royal children were preparing for their annual exams, and no one wanted to cause any trouble before the exams were underway.\n\nHan Sen left King’s Garden and returned to Underwater Town. Right after he left King’s Garden, he felt a strange energy in his ship. It was coming from behind him.\n\nHe looked over his shoulder and found Fox Queen sitting there.\n\n“Why are you here?” Han Sen turned back to the controls of his ship.\n\nFox Queen remained sitting and smiled. “I am here because of Destiny’s Tower.”\n\n“My good Big Sister, many people have grown suspicious of me. It is so difficult for me to protect myself. What do you want?” Han Sen said.\n\n“There is an opportunity sitting right before you, and it is virtually devoid of risk. If you can rank among the top three in the exam, you will gain access to Destiny’s Tower,” Fox Queen said.\n\n“I can enter Destiny’s Tower if I make it to the top three?” Han Sen was shocked. If he had this chance, he would definitely like to go to Destiny’s Tower.\n\n“Yes, but you need to be in the top three,” Fox Queen nodded with surety.\n\n“Then I have no chance. There are two deified royal children, and there are many half-deified. There are too many for me to beat.” Han Sen shook his head.\n\nFox Queen smiled. “Be in the top three, or I will tell everyone that you murdered Bai Yi. The choice is yours.”\n\n“Why are you demanding something I cannot do? Can’t you be a touch more reasonable?” Han Sen didn’t hear Fox Queen respond. He looked back and saw that she was gone."
}