{
    "chapter": 1271,
    "title": "God’s Retribution",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1271",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe man had found Han Sen, so there was no use in hiding any further. When Han Sen emerged from the bushes, he did so drenched in water.\n\n“Friend, what are you talking about? What fruit?” Han Sen played dumb.\n\n“Human?” The man’s intimidating look turned to one of legitimate surprise.\n\n“We’re of the same kind, are we not? My name is Han Sen. What is your name, friend?” Han Sen thought this was the perfect opportunity to gather the information he wanted.\n\nThe man answered, “I’m not your friend, buddy. And I have never been a friend of humans, so don’t have the audacity to declare us one and the same.”\n\n“You say that like you’re not a human,” Han Sen said.\n\nThe man said, “Don’t mistake me for one of you mud-blooded low-lives. Pah, you talk too much. I was going to let you live, but now…”\n\nAfter that, the man immediately threw a punch in Han Sen’s direction.\n\nHan Sen did not expect his eagerness to fight, and he didn’t think the man would have a disdain for humans and believe himself to be so different.\n\nBut Han Sen was certain the man was a human.\n\nAs much as he would have loved to mull the situation some more, he didn’t have the time to think. The fist was in front of his face, and he had little time to react.\n\nHan Sen opened the nine gene locks of his Blood-Pulse Sutra.\n\nPang!\n\nHan Sen felt like he had tried to deflect an oncoming train, and the force sent him staggering backwards a number of steps. Han Sen came to a stop after planting his feet and creating a pair of hundred-meter-long skidmarks in defiance of the force.\n\nHan Sen’s bones had cracked, and his arms had been utterly broken.\n\n“So strong!” Han Sen was in shock, particularly so given that the man’s punch was one derived of pure, raw strength. There was no element associated with the hit.\n\n“The Blood-Pulse Sutra? Are you from Blood Legion?” The man was visibly surprised.\n\n“You are?” Han Sen asked. Earlier, the man had said he was a member of the Blueblood Special Forces. Now, was he suggesting he was a member of Blood Legion?\n\nThe man smiled and said, “I was afraid there weren’t any more true descendants in this day and age, but if you practice the Blood-Pulse Sutra, you must be a genuine disciple of Blood Legion. You must have heard the tale of the thirteen members, then? I was one of them; I was God’s Retribution.”\n\nThe man went on to say, “Who is your master? And why is your Blood-Pulse Sutra so weak?”\n\nHan Sen took a chance and said, “I am a student of Qin Huaizhen. He taught me this before he died, so I do not know too much about the legion.”\n\n“Qin Huaizhen?” The man paused, as if in thought. Then he said, “Is Blood Legion doing that poorly? Are they teaching… outsiders now?”\n\nHan Sen did not respond. If he spoke, he knew he’d have to choose his words carefully. He did not want to incite the ire of this man any further, as a mistake in what he said could result in his death.\n\nThe man said, “It is difficult to find someone who can learn this, and you must be the first of your lineage to carry this skill. You should use a title, but you are far too weak right now and thus cannot. Down the line, a few generations ahead of you, when your descendants become Blueblood, they can bear a title.”\n\nHan Sen suddenly understood a lot more.\n\nBlood-Pulse Sutra was used to strengthen your genes for those further down in your lineage. Each generation would be stronger than the last. The Xuan Men successor said the Blood-Pulse Sutra was a frightful thing, and that their fitness was far above everyone else’s.\n\nAnd now, this man had just told him that each new generation in a lineage would be stronger than the last. And what’s more, their blood would become blue. In turn, that meant every true member of Blood Legion should have blue blood.\n\nTime was what strengthened the Blood-Pulse Sutra above all else. Vigorous practice of its teachings did not allow for much in the grander scheme of things.\n\nThe best thing about the Blood-Pulse Sutra was the evolution of genes from generation to generation. Many generations down the line, family members would become incredibly strong.\n\nIts ineffectiveness for the first generation was why Han Sen, despite his vigorous study of the Blood-Pulse Sutra, had yet to become much stronger than a super creature.\n\nPeople like God’s Retribution were the elite of the elite when it came to Blood Legion.\n\nHan Sen thought to himself, “If the thirteen members were the ones who were born from families whose lineage reached back into ancient times, Han Jinzhi must have been one.”\n\nBut Baby Ghost told Han Sen he had been kidnapped. If this new learning was true, why would he have been kidnapped? And the Qin family’s blood was red and not blue, too.\n\nHan Sen’s mind was drowning in a vat of questions.\n\nBut if Han Jinzhi was not one of the thirteen members, he could not have been Han Sen’s great-grandfather.\n\nNo one in the Han family had practiced the Blood-Pulse Sutra, that was true, but it’d take a few generations for the strength and potency of a Blood Legion lineage to lessen. Han Sen should have still had some amount of blue blood.\n\nHis father should have most certainly had some, for sure. Han Sen knew his family had nothing to do with the blue-blooded, and he knew he couldn’t have been a part of Blood Legion.\n\nIf the Han family had nothing to do with Han Jinzhi, though, why would he possess the nine-life cat item?\n\nThe man suddenly said, “The two Aqua Fruit you possess can be kept. Consider them a gift, from one member to another.”\n\nAfter that, the man turned to leave."
}