{
    "chapter": 1696,
    "title": "God’s Organization’s Assault",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1696",
    "text": "On Planet Roca, seven creatures dressed in black were hovering in the air above Han Sen’s house. They were watching.\n\n“Yake, you are being too careful. It is only the Han family, and we aren’t even certain they are descended from Han Jinzhi. Even if they were, you wouldn’t need me and Rudy here. And here we are, alongside Buck,” Gugia said to Yake.\n\nYake’s gaze was directed at Han Manor. He saw Ji Yanran, Zero, Bao’er, and Stay Up Late all eating food together in the garden.\n\n“Be careful. Snake Witch, Black Tiger, and Lou Jia all died. Maybe Han Jinzhi is still protecting them. Our opponent is not Han Sen, after all. It is Han Jinzhi.” After Yake said this, he talked to a man with white hair. “New Community Leader, how are you doing?”\n\nHan Yufei, who had become the New Community Leader, calmly said, “The New Community has cut off all connections between Planet Roca and the galaxy outside. For the next two days, no one in the Alliance will be able to help this planet. I am not sure about the Ji family, but they won’t receive word of any suspicious activity for at least three hours. We have cordoned off the area, as well, not allowing any other human to approach the airspace.”\n\n“Good. Thank you,” Yake said coldly. Then he turned to Buck and another three creatures. “Do it. Handle the Han family. Han Sen and his son must be taken alive, but do with the others as you deem necessary. Me, Rudy, and Gugia will deal with Han Jinzhi or any other elites that show up. You will go in unopposed and undisturbed.”\n\n“Yes.” Buck and the other creatures heard what was said, and then flew down into the garden.\n\nThey were all members of God’s Organization, but there was a hierarchy and tiering between them. The geno armors that God’s Organization possessed all had limitations. The members had to be approved and authorized to make use of an armor before donning one. Yake, Rudy, and Gugia were of a higher tier.\n\nBuck and the others were still in training after becoming gods. They did not have self-geno armor, and they could not be approved. So, their tier was lower. But the creatures that could level up to reach the Alliance were very powerful, of course. And they were very proud of their accomplishments.\n\nIf Han Jinzhi was there, or any other geno armor elites, they would be afraid.\n\nBut in the garden, all they could see were a bunch of youngsters. They did not think they’d have much trouble dealing with them. After all, they had been in the top of the Fourth God’s Sanctuary in their time there. Some referred to them as actual Gods.\n\nLuo Lan was having food with the family at the table. Golden Growler, who looked like a lion-dog, suddenly stood up and roared to the sky.\n\nHan Sen and Ji Yanran knew Golden Growler wouldn’t just randomly bark or howl, so they looked up.\n\nA fiery dragon came swooping down. It was over a hundred meters long, carried by swathes of red and blue flame. When it got in close, it brightened everything.\n\nTo the left of the dragon was a monster with four wings. It had black scales. It was not as large as the dragon, but it was still ten meters long. On the right of it was an icy eagle. The wings of the creature were twenty meters long, and it came down shrouded in a snowstorm of its own creation.\n\nThe three creatures covered the entire city. The building where the Han family lived suffered the brunt of that frightening aura.\n\nLuo Lan and Ji Yanran’s faces paled slightly. These attackers were stronger than demi-gods, so needless to say, they were scared quite a bit.\n\nBuck and the others hadn’t been approved to wear geno armor, and neither did they have their own self geno armor. But still, they had been in the Alliance for many years. Their fitness was far better than the top demi-gods.\n\nHumans did not have many top-ranking demi-gods. Aside from Luo Haitang, the others were just gemstone class. And that was still a ways from Buck’s strength.\n\nAmidst Luo Lan’s fear, she heard a loud noise. Golden Growler’s body was expanding, and immediately, he went flying up towards Buck and the others.\n\nHe was getting bigger in the air, like a mountain. And on top of that, he was wearing a gold set of armor. The fire dragon Buck looked like a lizard in front of the giant Golden Growler. The other two were tinier than that.\n\nGolden Growler brought his gaping maw towards Buck as the dragon swung its talons defensively. But Golden Growler’s teeth came down on his neck and broke it. Blood cascaded down like a waterfall.\n\nGolden Growler was using a geno armor to bully the would-be assaulters coming down from the sky. He ripped the three God-class creatures apart in no time. They were bleeding all over, shocking all who witnessed the act.\n\nLuo Lan and Ji Yanran were stunned by the sight, as they hadn’t expected Golden Growler to be that strong.\n\nStay Up Late observed Golden Growler’s geno armor and squinted in thought.\n\nYake, Rudy, and Gugia were shocked, too. They were waiting for other elites to back the family up, and they never suspected the dog-looking creature at the table was the one they feared. Golden Growler had managed to kill Buck and severely damage the other two creatures in no time at all.\n\n“That’s so wrong! An elite with geno armor pretending to be a simple pet dog. Oh, I am going to kill it!” Gugia roared. He flew in front of Golden Growler and stopped him from finishing off the other two.\n\nGugia looked like a human, but he had a third eye in his forehead. He was wearing white geno armor when he swooped down to go against Golden Growler.\n\nBoom!\n\nGolden Growler slapped Gugia, and he was sent rolling a few thousand miles. His face looked glum, and he immediately acknowledged that he was no match for Golden Growler’s strength."
}