{
    "chapter": 1219,
    "title": "Xuan Men’s Successor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1219",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAs Han Sen wondered whether or not he should escape, the man spoke with eyes fixed on him in observation. “I cannot believe Xuan Men still exists.”\n\nThe repeated shocks of this entire scenario had rattled Han Sen’s nerves, but he responded to the man and asked, “You are of Xuan Men?”\n\nHan Sen only knew one other person of Xuan Men, and that was Dongxuan Zi. It surprised Han Sen to hear the man suggest he was of Xuan Men.\n\n“Is this someone else who managed to break through the vacuum?” Han Sen wondered to himself, thinking the situation to be almost unreal.\n\nIf breaking through the vacuum was easy to do, there’d be far more people like Dongxuan Zi. This man looked incredibly powerful, though, especially with the black skeleton by his side.\n\nThe man smiled and said, “You know a technique belonging to Xuan Men, don’t you? There is only one Xuan Men.”\n\nHan Sen bowed respectfully and said, “I am Han Sen. I am very grateful and fortunate to have learned a skill that belonged to Xuan Men. May I ask what your name is?”\n\nThe man sighed and did not answer. Instead, he said, “People of Xuan Men studied hard, but ever since the Dongxuan Master, all anyone ever did was seek to break through the vacuum. The integrity and philosophy of the group did not matter to anyone much, after that. And with everyone else failing to break through the vacuum, I had thought only I remained.”\n\n“Did you? Did you break through the vacuum?” Han Sen asked.\n\n“If I did, I’d be in heaven,” the man said.\n\nHan Sen guessed that the man was someone from the Alliance, and a true heir of Xuan Men.\n\nPeople from Xuan Men thought Dongxuan Zi went to heaven, but they had no idea the place he had broken into was actually the sanctuary. There, in the first sanctuary, he died.\n\nDongxuan Zi had practiced hard his entire life and was a figure of great admiration, but compared to the average power of people in this day and age, he could be regarded as little more than a common weakling. It was no trouble for anyone to survive the First God’s Sanctuary, anymore.\n\nHan Sen thought the technological advancements of humanity had yielded great results, but he never thought it would have been so difficult for them to break through the vacuum.\n\nThe man then asked, “Han Sen, right? Where did you learn Xuan Men?”\n\n“I was fortunate enough to stumble across an ancient scroll in an antique shop. There was no name on it, so I had no idea who wrote it,” Han Sen provided his curated answer.\n\nIf Han Sen told him he had received it from Dongxuan Zi, heaven knew what the man might do.\n\nHan Sen didn’t know if the teachings he had been given were illicit or forbidden, so he wasn’t going to be honest.\n\nThe man nodded and just said, “It must be very difficult for you, to make progress without the guiding hand of a teacher.”\n\nThe man walked towards the tower, looking at the sky. There, he said, “Perhaps I spent more time with Xuan Men than was good for me. Feelings and emotions are almost a foreign concept, now. I am… numb. Dulled like an old blade. I am afraid Xuan Men is in its twilight years, and no true successor will trumpet its name and carry its torch onwards.”\n\nThe man went on to say, “Perhaps it was fate for you and I to meet here on this mountaintop.”\n\nThe man then pulled out an item and threw it to Han Sen.\n\nHan Sen caught the item and noticed it was a memory card.\n\nThe man said, “Consider that a compendium of my knowledge regarding all things about Xuan Men, skills included.”\n\nHan Sen was delighted to receive this, so he wholeheartedly thanked him. “Thank you so very much. I am honored to receive this. Would it be boorish of me to request to become a student of yours?”\n\nHan Sen had studied many ancient languages, but the Dongxuan Sutra was still too difficult, even for him.\n\nNow that he had met a member of Xuan Men, he figured he could ask him for elucidations.\n\nThe man replied, saying, “I must decline. I don’t want to teach, and time is preciously short.”\n\nThe man continued staring into the sky and said, “I might not have the talent my master had, but I practiced for two hundred years. I can break the door.”\n\nHan Sen was shocked, hearing this, and he said, “Are you talking about the door? The door which will allow you to become a demi-god?”\n\nThe man smiled and said, “You know about the doors, do you? Men can become demi-gods through the Evolution Pool, but through the practices of Xuan Men, we can use the doors.”\n\nThe man then told Han Sen, “I cannot be certain if we will meet again. But if you have a question you wish to ask me, ask me now.”\n\nHan Sen asked the man about every word he did not know, and he received an answer for each.\n\nNow, Han Sen understood everything in the Dongxuan Sutra he had not known before. His mind envisioned a dam blocking a river, and his new learnings had blown it up, releasing the flow of knowledge.\n\nWhen Han Sen asked his first questions, though, the man frowned. He said, “Your Xuan Men is different than the one I have. It almost seems as if your Xuan Men does not come from a true member. The card I gave you possesses the real stuff.”\n\nHan Sen only nodded. Dongxuan Zi had created the Dongxuan Sutra himself before he died. It was only natural for it to be somewhat different. Han Sen took advantage of this encounter to ask more about the nature of the Dongxuan Sutra, too.\n\nThe sun rose before long, though, and it prompted the man to hurry things along, saying, “You can ask me one more question.”\n\nHan Sen devised his final question and asked, “Back in the day, aside from Xuan Men, were there any other large factions?”\n\nThe man did not expect Han Sen to ask this, so he said, “Back then, there weren’t any sanctuaries. Even if there had been, new stuff to learn included, the practices of their ways and methods would be difficult. Aside from us, there is only one more I can think of.”\n\n“Which one would that be?” Han Sen asked.\n\n“Blood Legion. If you meet any of its successors, watch yourself! Their skills can be passed on to others completely, so they must be very powerful,” the man said."
}