{
    "chapter": 323,
    "title": "An Invite From the Queen",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_323",
    "text": "\"Thank you for the chance.\" Han Sen smiled and threw a punch at the young man.\n\nThe young man looked at Han Sen's fist, curled his lips, smiled contemptuously, and countered Han Sen's strike with his fist.\n\nWith his fitness level as an evolver, he was much stronger than a normal unevolved person. He could bully his opponents as he wanted using his advantage in fitness, the satisfaction of which made him linger in the unevolved section.\n\nAs long as they did not use those hyper geno arts that only evolvers could practice, there was no way for anyone to tell they were evolvers. People would only think that they were strong unevolved persons.\n\nSeeing the two fists were about to clash, the young man was even more excited. Fist against fist, he could break all the bones in his opponent's fingers, and sometimes even the entire arm.\n\nAs the two fists were about to bump, Han Sen turned his fist into a claw, twisted the young man's wrist, and dislocated it. The young man's arm was twisted back and had to turn his back to Han Sen.\n\nTwisting his arm, Han Sen kicked the young man in the knee pits and made him kneel. With one arm controlled by Han Sen, the young man could not even stand up, otherwise his entire arm would be wasted.\n\nAs an evolver, the young man did have some remarkable abilities. He quickly hit back and tried to get rid of Han Sen's hand.\n\nHowever, Han Sen had improved his grappling skills tremendously since his combat with Xu Zhu. An evolver with a fitness index just above 20 was not comparable to Han Sen at all.\n\nHan Sen released the young man's arm and followed the young man. Putting his arm around the young man's neck, Han Sen threw his opponent in the air head down.\n\nAs his opponent was falling, Han Sen's fists hit the young man's body as fast as lightning bolts, from the face to the stomach. When the young man was about to touch the ground, Han Sen kicked him in the chest with a knee, throwing him into the air again.\n\nSweeping up and down, Han Sen's legs became a blur, kicking the young man as if he were a punching sack. Before the young man landed, his health value was burned up. His body exploded in the air, and he was eliminated.\n\nHis friend, the tall, slim guy became dumbstruck, unable to believe that the young man would be kicked to the point of explosion by a military school student.\n\nEven though the students did not know that they were evolvers, he knew very well that it was impossible for his friend to lose.\n\nThe students started to cheer and welcomed Han Sen back to the stands as if they were receiving a hero.\n\nHan Sen stared at the tall, slim young man and asked, \"Do you want to fight me as well?\"\n\n\"No need… No need…\" The tall and slim guy became pale, he was not even as good as his friend. Since his friend exploded, of course he did not have the nerve to fight Han Sen himself.\n\n\"Why? Didn't you enjoy this game very much?\" Han Sen said calmly.\n\nFeeling nervous, the tall and slim guy exclaimed, \"We are out of form today. Doesn't mean we won't win next time.\"\n\n\"Will you use your evolver's identity to fight next time, or the unevolved?\" Han Sen asked.\n\nHearing Han Sen's words, the students were dazed.\n\n\"Han Sen, you're saying that they are evolvers?\" Shi Zhikang looked at the two young men incredulously.\n\n\"You are evolvers?\" All the students were mad at them. Bullying others using false identities was simply contemptible.\n\n\"Who is an evolver? Don't talk crap here…\" The two young men of course chose to deny being evolvers, otherwise they would be in trouble.\n\n\"Indeed, you have not evolved much,\" said Han Sen casually.\n\nThe two did not speak any more and chose to leave Gladiator.\n\n\"Han Sen, were they evolvers or not?\" The students were puzzled.\n\n\"When I went to observe in the evolver section, I have seen them before. But I'm not so sure if they are actually evolvers.\" Han Sen shrugged and made up an excuse.\n\n\"I think they are evolvers, but the scum type. Otherwise they would not have pretended to be an unevolved person to bully others.\"\n\n\"Garbage.\"\n\n\"Shameless.\"\n\n\"Genius, your movements were awesome, especially the last round of kicks. You need to teach us when you have time. All the students were impressed by Han Sen. Even scum evolvers were evolvers. It was still difficult for an unevolved person to beat them.\n\nAfter fighting the students a few rounds and giving them some suggestion, Han Sen entered the evolver section, because he was not the least interested in the unevolved opponents.\n\nAs soon as possible he did, he received an invite to fight.\n\nHan Sen thought it was those who had lost to him, but was dumbstruck by the ID name.\n\nThe ID looked very familiar, but it was not the two persons that he had beaten before.\n\nIt was a one-word ID: Queen.\n\nHan Sen had never seen such an ID, but he remembered this name.\n\nA while back, Huangfu Pingqing had taken him to a restaurant named Queen Restaurant once, which was the property of Ares Martial Hall. Han Sen saw an evolver with the nickname Queen there in the restaurant, who destroyed an evolver opponent momentarily with incredible skills and power.\n\n\"Is this the same Queen?\" With some doubt, Han Sen clicked yes and entered a fighting scene."
}