{
    "chapter": 1278,
    "title": "Coming Close",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1278",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nXue Yucheng still thought Han Sen was joking, but seeing him walk forward unrelentingly, he quickly followed after him.\n\n“What are you thinking, man?” Xue Yucheng’s face was looking grimmer by the second. He was now writhing in his disbelief, which made him bleed even more.\n\n“I am going to take the shelter. Didn’t I already tell you that?” Han Sen said.\n\n“Did the Xue family really ask you to come here?” Xue Yucheng was looking confused now.\n\nOne man, accompanied by a little fox and a baby for backup, was going to waltz up and attempt to conquer a heavily-fortified castle. He thought Han Sen must have had a death wish, or at least an ardent desire to feel the insides of a creature’s stomach.\n\nThis was a king class shelter, so it seemed unfathomable for a young man to so simply proclaim he was “going to take it.”\n\nXue Yucheng had been stuck in that shelter for a long time, so it was no surprise he had no idea who Han Sen was and what he had accomplished. Therefore, Han Sen thought it best if he showed the man what he was capable of, rather than wasting time explaining.\n\n“Don’t follow me. I don’t want you to get involved, and I’d rather not have the master of this place think you betrayed him,” Han Sen said. Then, he quickened his pace.\n\nXue Yucheng was shocked, seeing how fast Han Sen and his allies were now going.\n\n“But this is a king spirit’s shelter! Even if he is able to defeat the creatures, there’s no way he can defeat the spirits that reside here,” Xue Yucheng thought to himself, as he tried to keep his eyes on the speeding Han Sen.\n\nHe didn’t think Han Sen would be able to get close. Even in the waters of the river that served as a wide moat for the shelter, there resided a large super creature. The old man thought it’d gobble Han Sen up before he crossed.\n\nHan Sen did not hide his lifeforce, though. He wasn’t planning on assassinating Blood River King and being stealthy with his approach. With the silver fox by his side, Han Sen had complete confidence in being able to tackle the shelter. He walked with a swagger, his body moving as if to say, “Come and get some.”\n\nBlood River Shelter only had four super creatures left, so Han Sen planned to kill them all at once and earn four Life Geno Essences. If he managed to get those, he believed he’d be fully maxed out.\n\nUnless he encountered a being that had opened ten gene locks, Han Sen did not believe he’d fight anything stronger than him, after that.\n\nBut when Han Sen came close to the shelter, the creatures started running off before he even had a chance to breach the walls. It was as if Han Sen was carrying a wretched disease or something.\n\nThe tentacle monster that resided in the river seemed to have disappeared as well.\n\n“Why are they all gone?” After thinking this, Han Sen looked at the silver fox on his shoulders and remembered something. “I remember now; when you’re around, everyone runs.” Han Sen was recalling their times in the Second God’s Sanctuary.\n\nThe silver fox was a berserk super creature now, so not even super creatures would stay to challenge him.\n\nXue Yucheng was watching Han Sen as he went, and he was in utter shock. He thought everything would come out to attack the young man, but rather than do that, they all ran off in fear.\n\nXue Yucheng, seeing them run, could hardly believe what his eyes were telling him.\n\nHan Sen reached the main island without trouble. The monster with tentacles was a complete no-show.\n\n“Did that super creature fall asleep or something?” Xue Yucheng was amazed.\n\nAs strong as Han Sen was, however, the creatures were mainly just afraid of the silver fox.\n\nSeeing them all run off, Han Sen pulled out his swords and sprinted after them. He had to nab them all before they disappeared.\n\nXue Chen was watering the trees as this transpired. An alarm sounded, indicating something was attacking the shelter.\n\n“Who in the sanctuaries would attack this place?” Xue Chen said, with genuine curiosity. But he couldn’t disobey his orders to check it out.\n\nStrangely, the creatures Blood River King owned were shivering. Perhaps it was because they were forced to go to the shelter’s defense. Xue Chen saw the super creatures behaving in a similar manner, too, though. And this made him start to worry over his wellbeing.\n\nIf the sacred-blood creatures were that scared, the enemy had to be incredibly fearsome. If so, they’d be merciless. And to Xue Chen, that meant he’d not likely survive such a siege.\n\n“I still need to deliver that item, though. I can’t die yet!” Death was also guaranteed if Xue Chen disobeyed his orders, though. The spirit would surely kill him if he abandoned his post.\n\nNo matter how slowly Xue Chen walked, reaching the gate was only a matter of time, anyway.\n\nXue Chen then caught sight of Blood River King and his other spirits approaching. Strangely, they did not look afraid.\n\nXue Chen saw three super creatures looking very annoyed.\n\n“What kind of enemy can incite such a reaction within them?” Xue Chen looked over to the Blood River then, and he saw a young man approaching. He had a fox and a little girl on his shoulders."
}