{
    "chapter": 2428,
    "title": "Sleeping Place",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2428",
    "text": "Night Wind obeyed the command and deployed his substance chains to clear the rubble behind the screen. The three of them hauled their junkie Duke along with them, moving around the screen and proceeding forward.\n\nBlood came from every orifice of the Duke’s body. He wasn’t dead yet, but his prospects weren’t looking good. That was especially true of his eyes; they had turned entirely red, and even the whites of his eyes had been consumed by the new color.\n\nNight Wind focused his attention on clearing the road ahead. After he cleared the path for some distance in front of them, he suddenly stopped. He looked at Miss Mirror and said, “Miss Mirror, should we change the direction of our travel?”\n\n“Why?” Miss Mirror asked Night Wind.\n\nHan Sen was curious about this, too. He had no clue why Night Wind had made this suggestion.\n\nNight Wind sighed and said, “The third picture predicts that we will reach a tree. But comparing the height of the figures to the height of the tree in the picture, it suggests that the tree is very large. It would be a hundred meters tall, at least. Moving a tree like that out of our path could be difficult.”\n\nHan Sen understood Night Wind’s rationale now. The fourth picture seemed to indicate that they’d encounter a tree, and that tree couldn’t be moved. If they changed course ahead of time to avoid the tree, though, the prediction would be incorrect. If they avoided the tree successfully, that would suggest that it really had been someone messing with them.\n\n“Let’s switch directions, then.” Miss Mirror nodded.\n\nWith Miss Mirror’s approval, Night Wind changed direction and resumed digging.\n\nIf someone was trying to trick them, it would be easy for that person to guess their course since they were digging in the direction that the power was drawing them. The source of that power was their destination, after all. The mysterious trickster might have seen them, known where they would go, and then carved the pictures accordingly.\n\nIf someone was rattled by those pictures, they would probably find some sense of security in following the road they had already intended to travel. And if they encountered that tree, they would be terrified. The trickster’s plans would come together rather neatly in that case.\n\nNight Wind made this suggestion to keep that from happening. If the trickster tried to move the tree to intercept them, he was bound to leave behind some evidence of what he had done. The trickster’s plan would fail.\n\nNight Wind moved quickly, digging at a very fast pace. After ten minutes, they had followed Night Wind down a trench that was a few hundred meters long.\n\nBut Night Wind suddenly came to a standstill. The rigidity in his back made it obvious that he had frozen midstep, not just stopped for a breather. He stood there, staring ahead as if he had seen a ghost. He didn’t even lower his raised arms.\n\n“What happened?” Han Sen followed Night Wind’s gaze. He saw that Night Wind had cleared half of the rocks, and a small object was now peeking out of the rubble.\n\nWhen Han Sen saw what it was, his face paled as well. A twig was rising from the rocks, and several green leaves had sprouted from it. It looked like it belonged to a willow tree.\n\n“How?” Han Sen asked uncomfortably. He peered more closely at the twigs and leaves, and they looked like the ones in the picture.\n\nNight Wind silently used his dark substance chains to remove all the nearby rocks. More twigs appeared as the rubble was tossed away. A few minutes later, a mass of twigs and branches was showing—the whole tree had been unearthed.\n\nIt was exactly the same as it appeared in the picture. It was a hundred meters tall, and it looked like a willow tree. The flexible branches hung low, and the tree was covered with countless green leaves.\n\nThe three of them stared glumly up at the tree. They had changed course in a way that should have been unpredictable, but they had found the tree anyway. It was way too weird.\n\nHan Sen inspected the roots of the tree. It was nestled in a flowerbed made of stone, and rich soil covered its roots.\n\n“It doesn’t look as if someone moved it here,” Miss Mirror said while looking at the flower bed.\n\n“Maybe there are many trees like this. If that is the case, then we were bound to encounter at least one of them. This plaza is probably walled with trees. We would have found one no matter where we chose to dig,” Han Sen said after a moment of thought.\n\n“Right,” Night Wind replied seriously, and he moved his substance chains to dig elsewhere. He wanted to see if another tree could be found in a different direction.\n\n“Stop digging! There will not be another one of these trees.” Miss Mirror waved her hands to stop him.\n\nNight Wind wasn’t going to question Miss Mirror, but he did look at her with confusion. He was waiting for her to explain that declaration.\n\nMiss Mirror looked at the tree and said, “I think this is a requiem tree.”\n\n“A requiem tree!” When Night Wind heard that, he paled slightly. He looked at the tree with an expression of disbelief.\n\nHan Sen looked at Miss Mirror and Night Wind with confusion. He had never heard of a “requiem tree” before.\n\nMiss Mirror knew what Han Sen was wondering, and before he had a chance to ask, she explained, “When I visited the Ancient God, I saw a requiem tree once. The Ancient God say that these requiem trees are where their people go for their final slumber. The legends say that the Ancient God need to be buried next to them so that their souls can find eternal rest.”\n\n“If you’ve seen a tree like this amongst the Ancient God, and now there is another one here, it doesn’t sound like these things are terribly rare. Why would you say that there won’t be another one of these trees around here somewhere?” Han Sen asked, his brow furrowed. He was obviously missing something.\n\n“I don’t know how many requiem trees there are in the universe, but the one I saw before was only two feet tall,” Miss Mirror said. “The master of that requiem tree said they only grow to a height of about three feet, anyway. Then, they stop growing. If an Ancient God dies and is buried beneath the requiem tree, it will absorb the Ancient God’s body. The tree will then grow one more foot, no more and no less. Do the math. If this tree has grown so high, how many Ancient God bodies were here? Do you think there will be multiple trees that have reached this height?”\n\n“This is really a requiem tree?” Han Sen stared up at the tree, suddenly seeing its prodigious height in a whole new light.\n\nAncient Water God’s body had moisturized a few systems, bringing life to many planets and even making primitive races level up.\n\nIf Miss Mirror was speaking the truth, then that requiem tree must have absorbed a few hundred Ancient God bodies, at the least. It must have taken in an unbelievable amount of energy. It was hard to imagine how strong the tree must be. But Han Sen couldn’t feel the appalling lifeforce that should have been radiating from the tree. To him, it was little more than an ordinary plant.\n\n“It is easy to determine whether or not it is a genuine requiem tree. If it is a requiem tree, the tree will have a requiem tree hole that holds Ancient God powers.” Miss Mirror walked around the tree, and it wasn’t long before she came to a stop. She stared at one specific location on the trunk.\n\nHan Sen and Night Wind walked over to Miss Mirror. They followed Miss Mirror’s gaze and found her looking at a tree hole that was the size of a man’s fist. The interior of the hole was jet black, and Han Sen’s eyesight wasn’t good enough to pierce the gloom and see if anything was inside.\n\n“That is it! This is a requiem tree hole. I can’t tell if a requiem tree egg is there, though,” Miss Mirror murmured to herself as she looked at the tree hole."
}