{
    "chapter": 2524,
    "title": "You Lose",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2524",
    "text": "“In that case, I will give it a shot.” Han Sen had passed his years of always wanting to win. He wasn’t fond of Yellow Clothes’ personality, at all. If he didn’t have to hunt a core bronze tripod alongside her, that was more than fine with him.\n\n“I can use whatever geno art I desire?” Han Sen asked for confirmation.\n\n“Yes. You can use any geno art you want,” Yellow Clothes answered with complete certainty as she turned away from Han Sen. She closed her eyes.\n\n“Okay. I am going to start now.” Han Sen smiled.\n\n“Please,” Yellow Clothes said.\n\nBut after she said spoke, she didn’t hear Han Sen make a move. After a while of not hearing anything, Yellow Clothes felt strange. She then heard Han Sen say, “Alright, please guess what kind of geno art I used, lady.”\n\nYellow Clothes smiled coldly. She turned around, looked at Han Sen, and said, “You didn’t move. I guess that can be considered a geno art, too.”\n\nShe was pretty sure Han Sen hadn’t moved or used a geno art.\n\nHan Sen smiled. “I think you have guessed incorrectly this time. According to the terms of our deal, I can leave now, right?”\n\n“I’m never wrong.” Yellow Clothes was very sure of that. The Very High Sense could sense everything. She could even sense the sneaky skills of some deified elites. Han Sen was just King class, so she was confident she would be able to feel anything that he did.\n\n“You say that you can’t be wrong, but you won’t tell me what geno art I used. You are being rather obstinate,” Han Sen said in annoyance.\n\n“You didn’t use a geno art and you didn’t move,” Yellow Clothes said to Han Sen while looking at him. Her tone was held high by sheer confidence.\n\n“I did move. And I did use a geno art. It isn’t my problem if you are unable to guess what I used.” Han Sen spread out both of his hands.\n\nYellow Clothes peered at Han Sen without speaking. After a while, she looked disappointed and she said, “In that case, you can go. I lose.”\n\n“Thank you very much for the convenience,” Han Sen said. He took the bronze furnace with him and departed without another word.\n\nSeeing Han Sen leave, Yellow Clothes looked let down. She spoke to herself, “Playing tricks over such a small matter? It doesn’t matter how talented he thinks he is; he didn’t notice what he missed by playing this trick.”\n\nYellow Clothes was certain her feelings hadn’t been wrong. Han Sen hadn’t moved or used a geno art. He was a complete con man. He had made such a bad impression that Yellow Clothes no longer wanted to deal with him.\n\nEvery member of the Very High was allowed to select a silkworm to grow. They had to choose carefully and go for the best of the best.\n\nDollar had powerful talents, but his behavior had disappointed Yellow Clothes. She didn’t want to argue with him any further.\n\n“He has talent, but his personality and heart are terrible. What a shame.” Putting the whole matter out of her mind, Yellow Clothes also turned to leave.\n\nSeeing Yellow Clothes return, Little Butterfly immediately came running out. She asked Yellow Clothes with proper surprise, “My Lady, you let Dollar go that fast?”\n\nYellow Clothes had spent a lot of effort to get all the others that were waiting for Han Sen to leave. That was why she had been able to encounter Dollar alone. But right after she met Dollar, Yellow Clothes had hastily returned. Little Butterfly was surprised by this. She thought she would be gone at least three or four days before she came back.\n\n“He is not the silkworm I require,” Yellow Clothes grumbled.\n\n“Why don’t you take one more look? Dollar is very strong. He was able to take down the Gold Armor General by himself. I don’t think even Yu Shanxin could do that. It would be a shame to let this opportunity go by,” Little Butterfly tried to convince her.\n\nYellow Clothes poured a cup of tea, took a sip, and said, “His talent and power are strong, but the geno universe is home to many geniuses like that. They just can’t reach that perfect threshold. Plus, Dollar has a major flaw.”\n\n“What kind of flaw would that be?” Little Butterfly asked with curiosity.\n\n“His personality is bad. I don’t like how his mind works,” Yellow Clothes said while putting down her teacup.\n\n“No way. How long has it been, and you can already tell his personality is poor?” Little Butterfly looked at her in disbelief.\n\nYellow Clothes told her what happened with Han Sen, and then Little Butterfly nodded, and said, “My Lady’s Very High Sense is never incorrect, and that means Dollar’s personality isn’t that good. How dare he lie right before you? With a personality like that, he really cannot be your silkworm. But he does have talent and power. He is strong.”\n\n“It doesn’t matter. A person like that won’t be able to achieve the final step. Li Keer’s silkworm must be the silkworm that can become a butterfly. There cannot be any flaws,” Li Keer said in a hard voice.\n\n“That Dollar, why would he try to play a trick on you? If he knew that little trick had cost him so much, he would probably cry himself to death.” Littler Butterfly sighed.\n\n“Most people are stupid that way. Few can truly rise above the rest. You can’t hold it against him. If everyone could be perfect, then that final step would not be so difficult,” Li Keer said casually. She didn’t seem too affected.\n\n“You are right, but I do think your standards are too high. All the other princes have selected a silkworm, and only you are left. You have visited many geniuses that you do not like. What kind of person will you consider acceptable?” Little Butterfly was worried about Li Keer.\n\nLi Keer wasn’t in a rush, though. “I would rather lack one than pick the wrong one. If I cannot find a suitable silkworm, I would rather go without.”\n\n“How can that happen? If you don’t choose, then you will lose your opportunity to become a leader.” Little Butterfly was even more worried upon hearing that.\n\n“I was just complaining; I didn’t actually mean it. I need to choose someone. Otherwise, things will be too easy for the other princes. I am going to choose, but I’ll choose someone I like.” Li Keer laughed.\n\nLittle Butterfly let out a long sigh and stroked her chest, “Oh, you scared me.”\n\n“Alright, now come and give me a massage. I have just moved a little and already my shoulders feel bad.” Li Keer had another sip of tea.\n\nLittle Butterfly went behind Li Keer. She reached out to begin massaging Li Keer, but her hands stopped still in the air. She didn’t touch her, but her mouth opened with shock. “My lady, you… your back has words.”\n\n“Words? What words?” Li Keer was shocked.\n\n“You… lose…” Little Butterfly slowly read the words planted upon Li Keer’s back.\n\nLi Keer’s face turned red. She gnashed her teeth and reached out her hand. She summoned a mirror so that she could view her own back. There, she saw the two words written down upon her back. They were around the size of a fist. There was even an exclamation mark.\n\n“You lose!”"
}