{
    "chapter": 1850,
    "title": "Purple Copper Palace",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1850",
    "text": "A group of people followed Deep Blue Viscount as he led the way to the palace. Suddenly, Han Sen felt as if something on his back was moving.\n\nHan Sen pretended to fetch some water, so he could reach around and feel his back. It was the box with the steel feather inside. It was moving.\n\nHan Sen hadn’t told Captain Wood he had found a steel feather on Wind Viscount’s body. He had put it in his backpack, worried that it might cause trouble back in the base if he left it unattended. Since it was now moving around for no reason, it appeared that his worry had been valid.\n\nThe further they walked, the shakier the box became. Luckily, there was a bag covering it, so no one had noticed it yet.\n\nWalking through a number of stone halls, they soon arrived at a plaza. Scattered around it were a number of crumpled skeletons with their skulls blown wide open. There was also a big black egg there, too.\n\nDeep Blue Viscount was scared of the big black egg. His legs went soft as he stood right outside the plaza.\n\nCaptain Wood, on the other hand, looked delighted. He commanded the Nobles to go forward. Even Deep Blue Viscount, whose resolve had dissolved, was pulled forward by the Marquise.\n\nOne of the Marquise threatened Han Sen, trying to get him to move across the plaza. Together, they all approached the big black egg.\n\nHan Sen did not think that the egg was the reason for the feather’s shaking. When he got closer to the big black egg, the steel feather did not have a stronger reaction. It only grew stronger when he moved forward.\n\n“What is this steel feather? Is it a feather of a Raven, perhaps? Or is it one of their crafted treasures?” Han Sen guessed to himself.\n\n“If you’ve found the source, then go ahead and break it,” Han Sen said.\n\nCaptain Wood coldly looked at Han Sen and said, “Break it? How about you go ahead and give it a try?”\n\nHan Sen pulled out Ghost Teeth Knife and gave the egg a firm whack. A metallic noise rang out, amidst a flurry of sparks dashed across the shell of the egg. Even so, no mark was left.\n\nHan Sen was shocked, and he said, “This egg is that hard?”\n\nHe could not use Ghost Teeth Knife’s full power. But with the sharpness, he should still have been able to leave a mark on Earl geno armaments.\n\nIt was just an egg. There was no mark at all, though. It was a testament to the shell’s sturdiness.\n\n“Captain Wood, can you destroy it?” Black Steel asked.\n\n“Little Master, while I am a Duke, I cannot destroy it. The only way to do this is to move the item back to the palace,” Captain Wood said politely.\n\n“You think your lie will fool the kid?” Xie Qing King smiled.\n\nCaptain Wood’s expression hardened as Black Steel immediately asked, “Captain Wood, why did my father send you here? For what purpose?” Black Steel was not stupid. He knew Black-Moon King wouldn’t have sent a Duke all this way just to save Han Sen.\n\nCaptain Wood quietly said, “Little Master, I am only here to carry out my orders. I don’t know anything more.”\n\nBlack Steel stopped asking because he knew he would not learn anything from Captain Wood. He walked up to Han Sen and said, “I apologize. I cannot believe my presence here has brought you harm instead of aid.”\n\n“That’s not entirely true. Without you being here, we wouldn’t be standing where we are.” Han Sen smiled, looking as if he did not mind.\n\nBlack Steel looked at Han Sen solemnly. “Do not worry. For as long as I am alive, I will not allow any harm to come to you. The only way you’ll suffer is over my dead body.”\n\nBlack Steel spoke to Han Sen, but he also said this as an indirect warning for Captain Wood.\n\nCaptain Wood heard what was said, and so he smiled and said, “Little Master, you worry too much! Han Sen is Knife Queen’s student. I wouldn’t dare hurt him. We are here to finish the mission, not bring harm to anyone.”\n\nCaptain Wood’s voice then turned cold, and he went on to say, “But if someone does try to stop us from fulfilling our task, we will not show mercy.”\n\nCaptain Wood then told a few of the Barons to help carry the egg towards the palace. Deep Blue Viscount’s legs were shaking, and he was almost too scared to point out the next few directions.\n\n“Black Steel, what do you know about the Raven?” Han Sen talked to Black Steel as they continued walking. He earnestly believed Black Steel had nothing to do with Captain Wood’s plans.\n\nA man like Black Steel wouldn’t do such a thing.\n\nBlack Steel briefly dropped into thought before saying, “The Rebate have ruled Narrow Moon for a billion years. I don’t think anyone knows exactly what happened when we conquered it. All that I know is the general stuff you learn in history books. They glorify our race, however, so it’s easy to see that some of it is fabricated.”\n\n“What about the Raven? Are there any legends surrounding them?” Han Sen asked.\n\n“No. The history books don’t really share much about the shape of the Ravens. All we know is that they were similar to birds. I scoured the information we have about the Ravens, and I learned where the mark of an egg came from. As for the Ravens themselves, there is next to nothing in our records. Or at least, out of what we know concerning their presence in the Rebate system.” Black Steel shook his head.\n\n“That’s weird. Such a powerful xenogeneic race was wiped out by the Rebate. Why is there such scant information? The writers of your history books could have at least made them out as villains. The truth seems to be the opposite, though. You guys don’t even know what they look like,” Han Sen said with a frown.\n\n“It is weird.” Black Steel nodded.\n\nCaptain Wood heard every word they said, but he didn’t stop them from discussing the matter. He merely hastened everyone along.\n\nPerhaps it was because Chiron Earl had activated all the traps before their coming, but there was no danger inhibiting their way as they moved forward. It was a surprisingly smooth trip.\n\nThe steel feather started to shake faster and faster, and Han Sen was unsure if that was a good thing. He also had a question.\n\n“We still haven’t found any sign of Wind Viscount’s passage. Where did he actually get infected?”\n\nAfter walking for half a day, they eventually found themselves standing before a palace. This palace looked different from the other palaces. The others were made of stone, but this one was built from purple copper. It looked very mysterious.\n\nOutside the palace, glazed across the walls, were paintings. They mostly depicted a number of creatures with human bodies and bunny ears. They were obviously the Rebate.\n\nIn those paintings, the Rebate were not standing in positions of honor. Rather, they were pulling a strange cart that looked like a carriage. They were doing manual labor, like beasts of burden."
}