{
    "chapter": 1298,
    "title": "Fighting No God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1298",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen ran towards the battleground, but he felt something was amiss.\n\nThe plaza looked bigger than it had earlier, and the illusion of a greater size seemed to expand until the cobbled ground stretched on for a distance that could only be assumed to be infinite.\n\n“Has the battle twisted the dimension this much? It is no wonder I couldn’t feel the shockwaves earlier.” Han Sen saw No God approaching Lotus Empress, each step a cruel and merciless stride.\n\nHan Sen hadn’t opened his tenth gene lock, so unless he used super king spirit mode and combined with Little Angel, he didn’t think he stood much of a chance.\n\nHan Sen didn’t go right up to No God Emperor yet, though. First, he approached the wounded beast with a stealthy run. When he neared it, he whispered, “I’m here to help.”\n\nLotus Empress thought Han Sen was using the creature for cover and merely hiding. She thought that was a futile and silly endeavor.\n\nHan Sen summoned Disloyal Knight next. The halo appeared, imbuing its boons upon Lotus Empress, the drum beast, and the green vines. Lotus Empress was delighted to see him chip-in.\n\nHan Sen allowed Disloyal Knight to remain behind the creature, but he was surprised he had not weakened No God Emperor.\n\n“It looks like he’s immune to the halo,” Han Sen realized. “Great…”\n\nStill, it was better to have the halo active than not. Disloyal Knight would still be supporting Han Sen and his allies, and that was better than not having him out.\n\nHan Sen, however, knew this fight was truly being waged between No God and Lotus Empress. Without Lotus Empress there, the drum beast and its vines would have been killed in no time.\n\nHan Sen felt that, even if he did have ten gene locks active, he wouldn’t be able to defeat No God Emperor. There was a frightening aura of menace around that spirit.\n\nNo God was almost indestructible, and every move it made was lethal.\n\nHe thought it’d only take a disapproving look from No God Emperor to take down even the mightiest of super creatures.\n\nWhere such power came from intrigued Han Sen. And further, he wondered what element No God Emperor was attuned to; which element fueled such gross amounts of strength?\n\nBut amidst all this, Han Sen could tell Lotus Empress was not an unworthy opponent. Her delicate grace belied the truth of her power, and she was special in more ways than one. No matter how much power No God Emperor applied to his strikes, he could not damage Lotus Empress in the least.\n\nWhile the lotuses she created for protection were destroyed, replacements were created with just as much ease. The drum beast and green vines were hiding behind the lotus shields, however, hardly even attempting to attack their foe.\n\nThe lotus flowers also seemed to be applying strain to the dimension they inhabited, as well, and the twisting dimension wasn’t entirely the work of No God Emperor. It made Han Sen think to himself, “If I open ten gene locks, will I be as powerful as them?”\n\nAs Han Sen imagined himself carrying such power, he saw No God Emperor reach a hand up to his head.\n\n“Strange. What in the sanctuaries is he doing? It’d be nice if he wanted to kill himself.” Han Sen watched him in curious confusion.\n\nLotus Empress seemed to understand what he sought to do, though. And when she saw him lift his hand up, her face turned grim as she and her subordinates took a step back.\n\nNo God Emperor unsheathed a sword. Out of his head.\n\nThe sword was dull, sullen, and almost unremarkable to look at it with its lack of sheen and reflection. It was as if it chewed up all the light that sought to rest on it. When the sword was fully drawn, a new power seemed to manifest inside No God Emperor. It made Han Sen feel queasy when he tried to comprehend it.\n\nIf what had just transpired was the image of a calm sea, now it was one in a typhoon of epic proportions.\n\nHan Sen now knew he had made a mistake by trying to join in. Looking back, he thought it’d be obvious that No God wouldn’t show all his cards and reveal the true extent of his power at the beginning. But now he was, and Han Sen knew they were all in peril.\n\nNo God Emperor swung his sword towards the drum beast.\n\nMore accurately, it was aimed at Han Sen who was still crouched behind it.\n\nHan Sen saw this attack, but he could not sense any power in its weight. If anything, that just added to his concern.\n\nSuddenly, the creeping of pain began to overwhelm his shoulder from behind. The pauldron of his armor was cut-off. Han Sen then saw what had happened to the drum beast: it had been cut in two. It died.\n\nBut strangely, even after understanding the extent of such power that had been unleashed from that one strike, Han Sen could not feel it.\n\n“I can’t believe he killed a ten gene lock super creature with one strike.” Han Sen was in utter disbelief.\n\n“Go!” Lotus Empress grabbed Han Sen and placed him on her lotus platform and then took off in flight, abandoning Evil Lotus Shelter.\n\nBefore Han Sen could understand what had happened, he woke up as if he had been restored to consciousness. He was in the mountains someplace.\n\nHan Sen saw Lotus Empress and asked, “Was it okay to just leave like that? Can’t he take your spirit stone?”\n\nLotus Empress responded by saying, “It’s not my shelter. It is a copy of my mother’s shelter that I occupy for show.”\n\nHan Sen felt relief, knowing they had gotten away. He didn’t want Lotus Empress to get killed on his behalf.\n\n“I wanted to help you, but I just made it worse,” Han Sen told her.\n\nLotus Empress comforted him and brought ease to these thoughts, saying, “It wasn’t your fault he wanted all the fruit for himself. I wouldn’t have allowed him to take it, anyway, and a battle such as that was bound to take place, no matter what.”\n\n“All that poor fruit,” Han Sen said.\n\n“That’s fine. No one can eat more than nine, anyway. After that, your body doesn’t receive any benefits,” Lotus Empress explained.\n\nHan Sen patted the silver fox, telling him, “I might not have been able to eat them, but this guy could.”\n\nAs they spoke, the space before them cracked. Like a vortex that had just opened in the fabric of the dimension, No God Emperor came stomping out."
}