{
    "chapter": 2345,
    "title": "Mirror Spirit Eye",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2345",
    "text": "Chu Nan locked the door to Han Sen and the blood kirin’s jail cell, and he was just about to leave when someone else walked up. It was Prince Swordstar.\n\n“My Prince.” Chu Nan and his servant bowed courteously.\n\n“Good work, Mister Chu,” Prince Swordstar said. He walked in front of the prison’s erected Bai Sema. He looked at Han Sen through the Bai Sema and grinned. “Brother Sixteen, how are you feeling?”\n\n“This place is quite comfy. I get free food, free rent, and I like the mellow vibes. I’m not sure I ever want to leave,” Han Sen replied, while lying on the bed.\n\nPrince Swordstar laughed menacingly. “Bai Yi, you really think that no one will touch you because you’re a prince? Do you really think you can wash away the crime upon the blood kirin?”\n\n“What if I do?” Han Sen continued to lie casually on his back. The bed was a little hard, but for someone who was used to roughing it, it wasn’t a big deal.\n\nPrince Swordstar wasn’t a fan of Han Sen’s attitude. He mocked him by saying, “Brother Sixteen, you are so naive and cute. The Sentence Court is not someplace where you can do whatever you want. You are just a prince. During our long history, even a few crown princes have been locked up in prison.”\n\n“I know. There are laws, and this is how things should be.” Han Sen maintained his position on the bed, acting as if he didn’t care.\n\nPrince Swordstar was there to rile Han Sen up with a display of his victory, but seeing Han Sen behave like this, he no longer felt like a winner. He actually felt annoyed.\n\nHan Sen didn’t want to stay in prison. Luckily, he had discovered through Fox Queen that Miss Mirror was in the middle of investigating him. He knew he wouldn’t be in jail for long, because Miss Mirror would be unable to investigate him if he was actually given a ten-year sentence.\n\nPrince Swordstar didn’t know that Miss Mirror was investigating Han Sen. As he looked at Han Sen, he noticed the blood kirin. He frowned and asked Chu Nan, “Mister Chu, my Brother Sixteen is a noble. Can’t he have a cell all to himself?”\n\n“It’s fine. I am happy like this,” Han Sen said carefully before Chu Nan returned.\n\nAfter all, he had personally asked Chu Nan to let the blood kirin stay with him. He had to say something.\n\nChu Nan said, “He is only in lock-up for now. Keeping them both here will make things easier until the trial.”\n\nPrince Swordstar lifted his lips in a snarl and quietly told Han Sen, “Bai Yi, are you naive enough to think that nothing will happen if you take the fall? I am telling you right now, you will really go to jail. And the blood kirin will die. You cannot do anything about it. This is the consequence of challenging me.”\n\n“Wow, you are so powerful. I admire you.” Han Sen was still lying on the bed, and he clapped his hands in the most uncaring way possible.\n\n“You…” Prince Swordstar was so angry. He shouted at the worker and said, “Get the blood kirin out! Separate the two and treat them well.”\n\nChu Nan looked hesitant, but he still allowed the servant to proceed and open the gate.\n\nHe hesitated because Prince Swordstar didn’t have any authority in the Sentence Court, but the captain was Prince Swordstar’s uncle. Things could go badly for him if he didn’t listen to the prince.\n\n“Since when did the Sentence Court become a prince’s manor?” The voice of a powerful woman bellowed from the outside.\n\nWhen Prince Swordstar and Chu Nan heard it, their faces paled. They turned around and saw Miss Mirror approaching them, clad in royal garb.\n\nChu Nan was incredibly frustrated. The Sentence Court for the Extreme King was supposed to be a hellhole. When ordinary nobles heard about it, they would do their best to avoid it. Today, it was more like a bar where anyone could come and go as they pleased.\n\nBut Chu Nan wouldn’t dare to provoke the woman before him. He bowed and said, “Greetings, Miss Mirror.”\n\nPrince Swordstar quickly bowed as well. There were many people in the Extreme King that they couldn’t provoke, and Miss Mirror was in the top three. Prince Swordstar would rather upset King Bai than this one.\n\nPrince Swordstar was King Bai’s son. Even if King Bai was angry, he wouldn’t do anything to him. It was difficult to tell how things would turn out with Miss Mirror, though. She was famous for having grand mood swings and being very cruel. Many powerful people with great ambitions in the Extreme King had been destroyed under the thumb of Miss Mirror.\n\n“Mister Chu, why is Prince Sixteen here?” Miss Mirror looked at the jail cell that held Han Sen.\n\n“Auntie Princess, in the King’s Garden, Brother Sixteen allowed his guard…” Prince Swordstar came up to her to explain.\n\n“Swordstar, what is your position in the Sentence Court?” Miss Mirror turned hard eyes on Prince Swordstar.\n\nPrince Swordstar was struck with a chill, and he suddenly found himself unable to speak.\n\n“Miss Mirror, there is an investigation that requires Prince Sixteen’s cooperation.” Chu Nan had heard Miss Mirror’s tone, and he knew right away that this was bad. He refrained from telling her the truth.\n\n“There is something I need from Bai Yi, too. I will be taking him back with me for now,” Miss Mirror said. Someone had already walked in and brought Han Sen and the blood kirin out of their cell.\n\n“Miss Mirror, this…” Chu Nan felt as if he had two paths to choose from. He could either let it go or not let it go.\n\n“Auntie Princess, killing in the King’s Garden is an important crime,” Prince Swordstar said in a rush. He ran in front of Miss Mirror in his plight.\n\nAs this occurred, Chu Nan’s phone rang. He looked at the number and accepted the call. He turned off his phone and spoke to Miss Mirror, “Miss Mirror has already discussed this with the captain. Why did you not tell me this? What are you guys doing here? Move! Do not stop Miss Mirror from attending to her business.”\n\nMiss Mirror didn’t even look at Prince Swordstar. She walked right past him.\n\n“Little Brother, I don’t have time to watch you play. If you want to put on a show in the future, please call me first. I will make sure I allocate the time.” Han Sen walked in front of Prince Swordstar, speaking to him while he fixed his sleeves. Then, he brought the blood kirin with him as he walked away.\n\n“That a**hole!” Prince Swordstar was so mad, it looked like he was going to breathe fire. His face was in a wretched contortion.\n\n“What? You aren’t going to thank me for saving you?” Miss Mirror said to Han Sen as they entered the car she had brought.\n\n“Auntie Princess, I think you have work reasons for freeing me. I will still have to go back later. I don’t know if I should be thanking you yet,” Han Sen answered, looking directly at Miss Mirror as he spoke.\n\nMiss Mirror’s face was impassive, and her gaze was frosty as she looked at Han Sen. “Han Sen, how dare you? You killed a prince, and you dare to disguise yourself as him! You really don’t understand the danger you are in.”\n\nWhen Han Sen heard what she said, his heart jumped. He acted cool and said, “Auntie Princess, what do you mean? I do not understand.”\n\nMiss Mirror didn’t move. She pointed at the ring on Han Sen’s finger. “Han Sen, where did you get this ring from?”\n\n“This is Han Sen’s item. I got it when I took his body,” Han Sen said.\n\nMiss Mirror laughed darkly. “Are you aware that this ring is called Mirror Spirit Eye? It can reflect a person’s soul. If you are Bai Yi, take a look at yourself in the Mirror Spirit Eye. It will see whether your soul is Han Sen’s or Bai Yi’s.”"
}