{
    "chapter": 3040,
    "title": "Digging Egg",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3040",
    "text": "A giant king class gene race overbearing bug was blown up by Han Sen in one punch. The shattered shell was scattered everywhere. It dyed the whole of the god temple red and scared everybody.\n\nIn the plaza, not even the birds dared to tweet. Everyone’s eyes opened wide, and their mouths became circular shapes. They were all petrified as they looked at Han Sen, who was inside the god temple.\n\nThe overbearing bug was a king, which meant it had gone through duke, marquis, earl, viscount, and baron gene race levels. It was the highest-class gene race. Even if the overbearing bug had not grown up yet, its power was still stronger than most gene races.\n\nYet, such a powerful gene race was blown up by a super powerful punch.\n\nSuddenly, everyone strangely looked at Han Sen. They looked at him as they were looking at a monster.\n\nIf they had not seen it for themselves, none of them would have believed this had truly happened.\n\nShibo looked very weird at first, but then rage consumed him. He felt anger, hatred, and annoyance. He wanted nothing more than to kill Han Sen. Amidst all those emotions, he also felt fear. It was an emotion that came from deep within his heart.\n\nHan Sen had not used a God Spirit Blood-Pulse either. He had used a punch to kill a king class gene race. He had never seen anything like this happen before. Shibo never dreamed such a thing was possible before.\n\nSeeing Han Sen walk forward, Shibo instinctively retreated. His forehead produced a drop of cold sweat. He fell back and asked, “What do you want?”\n\nHan Sen looked at him and ignored him. He walked right past him. The people in the plaza parted to form a path for him. They were quick to shuffle away. They were quicker to part than if they had seen agents from the hygiene department.\n\nHan Sen always dealt with big scenes like this. He didn’t really care. Everybody looked at Han Sen as if they were seeing a ghost. He just walked away without any more trouble.\n\nMister Yang gritted his teeth and followed.\n\nNo one dared to stop them, not even Shibo or the city’s soldiers. The nobles did not say anything negative.\n\nThis was no joke. There really was a character capable of destroying an overbearing bug with one punch. Who dared put their lives in jeopardy trying to stop him? Looking at the broken bits of shell and flesh from the overbearing bug on the wall, it just made their legs feel soft.\n\n“Interesting. Without using a gene race, he can blow up a juvenile overbearing bug with one punch. Does that mean he was born with a bloodline?” Peaceful was very far away. She looked strange.\n\nAside from a human that had trace amounts of Blood-Pulses when they were born, Peaceful could not think of a reason as to why someone could be this scary and powerful without even using a gene race.\n\n“Ancient God City has a born Blood-Pulse. This is so weird. I must report this.” Seeing Han Sen’s back disappearing down the street, Peaceful flashed away to depart the plaza.\n\nMister Yang was feeling pretty joyful. Fortunately, Han Sen had not punched Shibo into dust. That would not have been good.\n\nThe current situation still wasn’t great. The overbearing bug was a rare gene race. There were only a few in Ancient God City, and Han Sen had killed one. It was not something the city’s leader was likely to let be forgotten.\n\nHe told Han Sen about his worries, but Han Sen just laughed and said, “That’s fine. If they want to come, let them come.”\n\nHan Sen was not afraid of the leader. His body was suppressed by the power of the world. He could not use all of his strength, but he was still far stronger than the leader.\n\nHan Sen looked at Mister Yang and asked with genuine curiosity, “By the way, Mister Yang, where can I get a gene race? How do I use gene races?”\n\n“Gene races come from hatched gene eggs, and gene eggs usually come from someplace underground,” Mister Yang said. “Anyone can have a gene race, but only humans that receive a God Spirit Blood-Pulse can combine with the Blood-Pulse of a gene race.”\n\n“How do I combine Blood-Pulses?” Han Sen was even more intrigued.\n\nMister Yang had a wry smile. He shook his head and said, “I do not have a God Spirit Blood-Pulse. I cannot show you. Combining Blood-Pulses is to combine with gene races so you can use a gene race power. The stronger the God Spirit Blood-Pulse, the more successful the combined gene race will be. There can then be even more for you to combine with.”\n\n“Like Evil Lotus God Destroyed class God Spirit? If you get his God Spirit Blood-Pulse, you can easily combine with baron class and viscount class gene races. If you want to combine with higher-level gene races, it would be difficult. The soul power of a high-class gene race is strong. They don’t concede so easily. If you have a higher-level God Spirit Blood-Pulse, things can be much easier for you.”\n\nHan Sen now understood. He understood the purpose of a God Spirit Blood-Pulse. He thought, “The so-called God Spirit Blood-Pulses are actually a mental suppression.”\n\n“If you are good at looking for special areas, then take me with you. I’d like to dig up some gene eggs for you.” Han Sen wanted to figure out what the world’s power was like. More importantly, though, was that he wanted to know if he could use the world’s power.\n\nMister Yang looked strange as he asked, “Mister, can you use a gene race?” He thought Han Sen was a gene race. He had never heard of a gene race being combined with another gene race.\n\n“We need to give it a go,” Han Sen coldly said. If he knew the answer, he would not have asked Mister Yang to help him dig up a gene egg. “Do I need to give it a go?” Mister Yang complained, but he didn’t say anything. He took Han Sen to exit Ancient God City.\n\nMister Yang agreed quickly due to being afraid. He was scared of Shibo bringing elites around to look for Han Sen. Therefore, he thought abandoning the city and hiding in the wild would be the safer course of action.\n\nIf he did not want to hide for Han Sen, he would not have agreed to take Han Sen out to dig up gene eggs. Although he was not able to use gene races, he could find where they were hidden. He had a past of digging up many gene eggs. There were no high-class ones, but he had a few low-class ones at home. He could at least give Han Sen one or two.\n\nThe two of them left Ancient God City, but Mister Yang did not take Han Sen to Ancient Big God Mountain. They went to the other side that had a grass field.\n\n“The ground’s pulse is also called a god pulse. Everything has a god. The god pulse is where everything gathers up together. Only a place like this can compose a gene egg,” Mister Yang explained as he continued to walk.\n\n“What is a god?” Han Sen asked.\n\nMister Yang was silent a moment before replying, “That is hard to explain. Think of it like atmosphere. Think of it as a cloud in the sky. It all flows when the sky and the earth changes. It does not remain without motion. So, looking for the ground pulses and digging up gene eggs is a study. You cannot dig randomly.”\n\n“Do you see that small hill? There is a sensation building up in the atmosphere there. There will be a gene egg gathering there, but the atmosphere is weak. The gene egg’s level will not be high.” Mister Yang pointed at a small hill that was seven to 24 feet high."
}