{
    "chapter": 2654,
    "title": "An Accurate Kill That Is Like a Surgical Incision",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2654",
    "text": "Han Sen spent several long minutes in observation before he finally flew forward to strike that bug. When he was close enough to it, he suddenly disappeared. When he reappeared, he was already above the bug’s shell.\n\n“God’s Wander?” Exquisite was shocked to see this. She was intimately familiar with the teleporting method he had used. Although he was only teleporting a short distance, the move was still impressive for a beginner. It was strange, though, considering she had only given him God’s Wander a short while ago. If Han Sen had become this proficient with it already, he was more than brilliant. His talents really were out-of-this-world.\n\n“Does he really have an eleven armor talent?” Exquisite couldn’t help but wonder. Han Sen’s body was unique. If the God Spirit Touch’s result was genuine, it was nuts.\n\nHan Sen teleported behind the star beetle, but the star beetle didn’t react. And then, Han Sen pointed a finger at its brain.\n\nDing!\n\nThere was a small ringing noise, like a steel needle striking bone. It was barely even audible. And right after, Han Sen pulled his finger away. The star beetle didn’t struggle at all after the strike. It simply gave a tiny shiver. The beetle grew still again as if nothing had happened, but its lifeforce was waning fast. It didn’t take long for its flame to fully extinguish.\n\nThe star beetle was in the same position as before. It was lying atop the branch, but if one looked closely, one could see a very small hole in its head that led down to the creature’s brain.\n\n“Xenogeneic King hunted: Star Beetle. Xenogeneic gene found.”\n\nA hunting announcement rang in Han Sen’s head.\n\n“What excellent powers of observation. That was a very strong ability. His body is evolving fairly well. Exquisite, I think you found yourself a decent silkworm,” the old man said. He looked at Han Sen with a genuine sense of appreciation for the young man’s performance.\n\nHan Sen’s attack had been very good. What the elder admired most about the scene was that Han Sen had taken the time to observe the creature before committing to action. He wasn’t a reckless man whose body operated faster than his brain.\n\nRecklessness wasn’t always a bad thing. If a warrior fought someone of the same tier, the fight was usually a matter of life or death for both combatants. Neither fighter would have the opportunity to spend time deliberating their actions. The body’s first response was usually the most useful.\n\nBut taking care of those bugs didn’t require those instantaneous reactions. Han Sen had no idea what the star beetles were before this day. He had only observed them for a moment before killing one in a single hit. He had managed to sever the star beetle’s nervous system. It couldn’t even react before it died. So, the damage dealt to the star tree was minimized. That was why the old man really admired Han Sen.\n\nLiyu Zhen had known all about the star beetles before he even began this test, but his methods of attack were still obscenely rough. He wasn’t dealing much damage to the star tree, but compared to Han Sen, he was leaving a lot of wreckage in his wake.\n\nHan Sen started to attack more of the star beetles. He teleported and used his Under the Sky knife skills. The knife silks he controlled were as accurate as a surgical blade. His strikes would pierce through the beetles’ shells and sever their major nerve pathways. Under such precise attacks, each star beetle died without the chance to fight back.\n\nStar beetles were falling to Han Sen one after another. Han Sen was like a skilled surgeon. Each cut he made had the precision of a razor. He was able to kill a hundred star beetles without missing once. None of the beetles stood a chance of resisting.\n\nThe old man was shocked. Exquisite’s eyes were glued to the video. Her mind was also connected to Han Sen’s mind, and it was as if she was with Han Sen, killing those star beetles right then and there.\n\nThat was the benefit of having a silkworm. She could share a bond and feel the same things as her silkworm did, thereby learning and experiencing something that she wasn’t familiar with. It was a learning experience for her, too.\n\nAs Han Sen went from King class to deified or even further, Exquisite wouldn’t level up with him. However, she would feel his evolution process as if it was happening to her. So, when she became deified, she would have all that experience. It was like she was being reborn, and there was no need for her to worry about going along the wrong path.\n\nThe King class star beetles were nothing compared to Exquisite; she could kill them with ease. Being as accurate as Han Sen and obliterating a beetle’s nerves so that it couldn’t even struggle—in addition to the fact he was killing so many star beetles without making a mistake—Exquisite couldn’t have done the same.\n\nExquisite could feel Han Sen’s reactions, and that was what shocked her the most.\n\nHan Sen’s simple finger attack looked easy. But before he did it, he used a lot of predictive powers. He calculated everything that could happen while he was performing the strike.\n\nEven a straight strike had many potential ramifications depending on its speed and power. If Exquisite hadn’t been able to feel what Han Sen was thinking, she never would have guessed that there were so many complicated calculations running through his mind.\n\n“This guy’s power is so strong. It is something you rarely see. Even those of us with the Very High Sense aren’t capable of insanity like this.” Exquisite’s emotions were quite conflicted.\n\nThe more she studied Han Sen, the more she believed him to be a scary person.\n\nHan Sen no longer looked like he was fighting. It was more like he was finishing work that was supposed to have already been finished. He didn’t have to worry about much because everything was under his control.\n\nSharing Han Sen’s mind allowed Exquisite to learn a lot, but it also made her feel even more conflicted with facing Han Sen now.\n\nThe Very High were quite full of themselves, and that carried through strongly in how they treated their silkworms. The masters often acted high and mighty. Right now, Exquisite was feeling the complete opposite.\n\nThe more she learned about Han Sen, the more she thought Han Sen was scarier than she was.\n\n“Xenogeneic King hunted: Star Beetle. Xenogeneic gene found. Obtained Star Beetle beast soul.”\n\nAfter Han Sen killed a hundred star beetles, he earned a star beetle beast soul. He looked into his Sea of Soul, and he immediately noticed that the star beetle beast soul was an armor-type.That didn’t surprise Han Sen. He had guessed that the star beetles would drop armor beast souls as soon as he saw them.\n\n“Armor beast souls aren’t bad. When I take control of the Constellation Sea, I can build a human army. At that point, beast souls like this will definitely prove their worth.” Han Sen thought about a human army decked out in beast soul armor. It would be a shocking sight.\n\n“It would be great if there was a deified class star beetle beast soul up for grabs,” Han Sen thought to himself.\n\nThis was merely a random thought, of course. He didn’t think he would actually have to fight a deified star beetle because the old man said he wouldn’t be allowed to use geno treasures. He didn’t have enough power to kill a deified xenogeneic on his own yet.\n\nHan Sen flew around the tree, searching for more star beetles to slay. He eventually heard a buzzing noise in his ear.\n\nThe sound seemed to be coming from above. Han Sen raised his head and glanced through the gaps between the leaves. There, he saw a whole bunch of star beetles descending from the sky. They were all coming to the star tree.\n\nThe leader of the star beetles had a body that looked like icy jade. It glowed with a blue light, which was a beautiful sight. The scary presence proved its identity, as well. It was a deified star beetle."
}