{
    "chapter": 2203,
    "title": "Shadow Toxic Bee Enclave",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2203",
    "text": "Han Sen took Huangfu Jing back with him to Planet Eclipse. She had just earned her own Jade Drum, and since she was worried about being ambushed while out-and-about, she wanted to stay there for some time. She would wait until things settled down before moving on.\n\nSonic Butterfly King had learned where Han Sen came from, but it would be pointless to go after Han Sen when he was already so far behind. He managed to get in touch with people to block Han Sen’s way, but they were unable to find him, either. So, eventually, Sonic Butterfly King decided to give up.\n\nAfter all, they couldn’t go into Narrow Moon to find him. They couldn’t risk offending the Rebate.\n\nOn his way back, Han Sen dropped a few droplets of his own blood onto the Blood Scorpion Jade Drum. He hoped to earn the Jade Drum’s approval gradually.\n\nIn Planet Eclipse’s base, people were in the middle of practice when a sudden report was received. Someone came running in, telling them of an army of xenogeneics converging on their position.\n\nHan Meng’er, Zero, Little Angel, and Han Yan went out to take a look. There, they found a mountain that was swarmed with what appeared to be red clouds. The clouds were heading toward the base so quickly that they’d arrive in only a little while.\n\nThe red clouds weren’t clouds, of course. They were swarms of red bees that were each the size of a dog. They were very powerful, and the sight made Han Yan frown. “When did Planet Eclipse come to possess xenogeneics such as this? I have never seen them before.”\n\nAs this occurred, Night River King was watching Planet Eclipse’s base. His expression looked venomous, and he said, “Shadow Queen Bees are special xenogeneics that come from Planet Queen Bee. They are only Dukes, but they sure breed quickly. If there’s enough food, she can make lower-level Shadow Bees. But that primary Shadow Queen a mutant Duke xenogeneic. Aside from being able to produce Shadow Bees like the rest, the mutant Shadow Queen Bee can also produce Duke Shadow Bees. The Queen didn’t have much time, and it has only produced two thus far, but that should be enough to deal with Han Sen’s base.”\n\n“Shadow Queen Bees eat the flesh of enemies and place their eggs inside the carcasses. Ah, when Han Sen returns and sees all this, the look on his face will be so sweet…” Night River King gritted his teeth.\n\nNight River King wasn’t worried about the consequences. A Shadow Queen Bee was one of the xenogeneics that escaped from the cargo ship. It would look like an accident, and no one would know that it was his fault.\n\nEven if Han Sen believed it was him, there was nothing he could do but make wild accusations. Night River King wanted this, though. He wanted Han Sen to hate him. It would be painful for Han Sen to know he couldn’t do anything about that seething hatred.\n\n“This is the beginning of making me your enemy,” Night River King spat. He really loathed Han Sen.\n\nThe Shadow Bees appeared like wisps of red clouds under the command of the two Dukes in charge of the army. They raced towards the base. Night River King was prepared to enjoy the fight, but a blue shield suddenly appeared. It enveloped the entire base and shielded it.\n\nThe red clouds of Shadow Bees came down like a barrage against the blue shields, but a mere touch sent them blasting back. Even the two Duke Shadow Bees up front were unable to get through.\n\nNight River King’s jaw tightened. He felt a little frustrated about the result, as he hadn’t expected Han Sen to leave his blue shield treasure in the base.\n\nNight River King thought Han Sen would carry a defensive item such as that everywhere he went. If he knew Han Sen hadn’t taken it with him, he wouldn’t have concocted the grand scheme to attack Planet Eclipse. If Han Sen didn’t have the shield, fighting him one-on-one would be far easier.\n\nThere was no point in wasting time on regret, though. The Shadow Bees were unable to break the shield.\n\nThe Shadow Bees fired a toxic substance from their nasty stingers. They were like red lights as they splashed across the blue shield. They did nothing to harm the composition of the shield, though.\n\nAlthough the shield was weakened by the fact that it had to protect the entire base, it would still be very difficult for Marquises and Dukes to break it down.\n\nAs Night River King wrestled with various ideas, the blue shield suddenly disappeared. The bees outside came racing in.\n\n“Did it fail because the shield’s user didn’t have enough strength?” Night River King wondered. “Could the user not keep the shield raised?”\n\nSoon after, Night River King realized that his assumption hadn’t been quite right. When a fair number of those Shadow Bees came racing in, the shield was raised once more. Most of the Shadow Bees were still on the outside, but a decent chunk had made it in.\n\nWhoosh! Whoosh! Whoosh!\n\nBlack arrows began flying beneath the shield. Not long after, a dozen of the Shadow Bees on the inside were slain.\n\nAnd then, a group of Kate appeared. They began gathering the bodies of the Shadow Bees inside the base.\n\nNight River King’s eyes began to twitch. His plan hadn’t worked, and he had just given Planet Eclipse a massive number of free xenogeneics. He wished he could go in there himself and destroy what Han Sen had built.\n\nWhen the Kate kids brought the Shadow Bee bodies back into the base, the shield disappeared again. It reappeared a millisecond later, shutting off another section of the Shadow Bee army.\n\nNight River King laughed. One of the Shadow Bees inside was a Duke. The others were just Marquises. No matter how strong they were, no one there could slay a Duke Shadow Bee.\n\nNight River King was already imagining how the Duke Shadow Bee would slaughter them all when suddenly, a black arrow came at the Duke Shadow Bee.\n\nThe Duke Shadow Bee reacted quickly, far more quickly than any Marquise Shadow Bee could have managed. As the black arrow rose toward it, the bee’s stinger lit up and fired a toxic squirt at the arrow.\n\nThe toxic juice sprayed toward the arrow, and the arrow suddenly sank. It adjusted its course to duck under the toxic juice, then it rose against and punched through Duke Shadow Bee’s body with great speed.\n\nThe Shadow Bee was shining red. When the arrow pierced its body, the arrow came to a stop.\n\n“It isn’t easy to kill a Duke Shadow Bee.” Night River King laughed mockingly.\n\nBoom!\n\nWhen the arrow entered the Shadow Bee’s body, it was trapped inside. But then, a scary explosion occurred within the Duke Shadow Bee’s body.\n\nThe red light shattered, and a gaping hole was torn in its side. It was heavily injured, and it fell to struggle on the ground.\n\nBoom!\n\nAnother arrow was fired at it. It pierced through the Shadow Bee via the already-dealt wound. The creature’s head then blew up, bringing a swift end to the Duke Shadow Bee.\n\nWhile that happened, the rest of the Marquise Shadow Bees were dealt with by Han Yan.\n\n“How is this possible? That woman is just a Marquise, and yet she can so simply kill a Duke Shadow Bee? This is impossible! She is Han Sen’s blood, but since when have crystallizers ever been that strong?” Night River King was incredibly angry, and he couldn’t believe his eyes."
}