{
    "chapter": 1287,
    "title": "Dirty Saint Fan",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1287",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen Han Sen saw Saint Fan absorb every living being in the shelter, he was taken aback. He was going to grab the spirit stone while the silver fox kept it busy, but that didn’t seem a likely possibility now.\n\n“All right, we’ll do this the old-fashioned way.” Han Sen drew Taia and his Phoenix Sword.\n\nThe silver fox and Purple Emperor flew up high, ready to swoop. Serpent Throne had taken on the form of the chef, straight from Hell’s Kitchen. She was ready to slice and dice whichever foe came her way, like Satan’s personal butcher.\n\nLittle Angel, Disloyal Knight, Xie Qing King, Dry Bone King, Qing Xun King, Thorn Queen, Blue Dinosaur, Metal Eater, and even Moment Queen now rushed forward like the light brigade. They were to be a merciless wave of death and destruction.\n\nSaint Fan had absorbed a ludicrous number of creatures, spirits, and other lifeforms, but against the wrath of three emperors, not even he was sure he could triumph. The tides had turned on him.\n\nThe silver fox gathered up a large charge of lightning, and tried to fry Saint Fan’s body with it. Purple Emperor lopped off a large chunk of Saint Fan’s fleshy, bulbous body. The strike was so clean, it could not regenerate. The chef’s cleaver peeled fine slices of the spirit’s wretched biomass off, like strips of beef, ready to be thrown into a hotpot.\n\nHan Sen didn’t do half as much as he was expected to, and he was more-or-less like an onlooker, observing Saint Fan’s beating.\n\nBut suddenly, Saint Fan’s original form began to take shape. He spoke, stern and sullen, to say, “Han Sen, are you really going to kill me?”\n\n“You are already dead,” Han Sen said.\n\nSaint Fan laughed and proclaimed, “Sure, you can kill me. That much is obvious by now. But by killing me, you doom the lives of all the others, too.”\n\nSaint Fan gestured, and then a number of humans were revealed as being a part of the ugly, horrendous mush that formed the spirit’s mutated body.\n\nHan Sen frowned, never imaging Saint Fan would use humans. And he thought it even sicker that Saint Fan would use them as a negotiating chip.\n\n“So, do you want this to continue? Killing me means killing them. Their blood will, I assure you, stain your hands. Can you really tolerate their deaths on your conscience?” Saint Fan said with a callous tone.\n\nSaint Fan could read the minds of the humans he had absorbed, and he knew this hostage trick would work. It wouldn’t work on spirits, but it most certainly worked on the humans.\n\nHan Sen didn’t relent. He frowned at the nagging of his conscience, but he still allowed the attack to continue.\n\nHe had to kill Saint Fan. There was no question there. For as long as he lived, the humans that joined his shelter were already as good as dead. But still, it hurt Han Sen to even fathom having to be the direct result of a human’s death.\n\nRodman was surprised, more than anything. The human was such a threat to Saint Fan that the spirit had to use such a dirty trick.\n\nRodman didn’t think he could become any more disgusted with Saint Fan’s behavior, and more than anything, he wanted the spirit to pay. With his now hideous, grotesque face, he managed to yell out, “Kill him! Pay us no heed.”\n\nThe other humans also began to speak out with their pained, distorted voices. It was like a chant, in which they urged Han Sen to go forward with what he had planned to do and not look back. They wanted him to bring an end to Saint Fan.\n\n“Yes, kill the pig!”\n\n“We have endured far too much as it is. Our lives, for the most part, have been good. We will thank you and send you our warmest wishes from the afterlife.”\n\n“Please! End our torment and slay this horrid spirit. Free us!”\n\n…\n\nRodman and the others all told Han Sen to kill the spirit and not think about saving them.\n\nSaint Fan merely watched. Saint Fan had allowed them to speak this way. If he had wanted them silent, he would have shut them up.\n\nSaint Fan thought if they did this, it would lighten Han Sen’s resolve to free them, rather than harden it. He thought it would give Han Sen cold feet, and he’d not proceed with what he had come to the shelter to do.\n\nHan Sen frowned. He acknowledged saving them would be impossible.\n\nKilling Saint Fan would result in the deaths of them all, but if the monstrous spirit wasn’t killed, they’d all remain as slaves.\n\nIt was impossible to get Saint Fan to free them, too. And Saint Fan knew that the humans were the best hope he had of survival, at this point.\n\nHan Sen thought Saint Fan Shelter couldn’t be moved, but then, the spirit absorbed the entire construct into him. If Saint Fan got away, carrying the shelter with him, Han Sen might never find him again.\n\nSaint Fan did not know Han Sen would come here with another two emperors.\n\nAnd neither did he expect Han Sen to have so many troops, with enough power to blow up the lake. As he mulled all this, his belief Han Sen would let him go began to wane. He wanted to get out of there before the attacks resumed.\n\n“Kill him!” Rodman exclaimed.\n\nSaint Fan smiled. Saint Fan’s mind changed again, thinking now, after a long pause, Han Sen might not be able to do it.\n\nHan Sen was incredibly angry. He knew he could kill Saint Fan with ease, but he couldn’t just kill the humans.\n\nLittle Silver knew Han Sen was hesitating, and he knew the reasons why. If it wasn’t for the humans, even the furry fox knew Saint Fan would be dead now.\n\n“I am so sorry, guys.” Han Sen gritted his teeth, and after a deep breath, issued his final command. “Take him down.”\n\nHis companions heard the order and then moved in to attack.\n\nSaint Fan was shocked, and so then he took over the minds of the humans.\n\n“Please save us!”\n\n“You murderer! You’re actually going to do this?!”\n\n“You were the Chosen One! You were supposed to destroy the spirits, not humans! You were supposed to bring balance to the sanctuary, not leave it in darkness.”\n\n“I’m so young. I’m not ready to die!”\n\n“What about my wife and kids? You can’t do this. Please, help me!”\n\n“I’m begging you, don’t do this!”\n\nThe silver fox doubted the legitimacy of these cries. He suspected it was Saint Fan controlling their minds, but still, even Little Silver was feeling bad about moving in to fulfill the command he had been issued.\n\nSuddenly, though, a red beam hit Saint Fan’s eyebrow."
}