{
    "chapter": 2508,
    "title": "Very Cute",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2508",
    "text": "For more than one hundred hours, Han Sen flew the white whale forward across an endless sea cloaked in mist. Still, he couldn’t find an escape route.\n\nThe space powers within the creature’s stomach were layered like a giant space maze. Through various space folds and faults, they couldn’t find a way out.\n\nThe scariest thing was that the cracks in space could do serious damage to the hull of the white whale, leaving large scratches across it despite its incredible resilience.\n\nFortunately, Han Sen had his Dongxuan Area and the Purple-Eye Butterfly. He was able to avoid the space cracks. If he hadn’t been able to, the white whale would have been torn apart, and they all would have died in short order.\n\nEven so, Han Sen still had to face the crisis that had literally swallowed them. The silver lining in all this, however, was the fact that the white whale was repairing itself more quickly than the corrosion was eating it away.\n\nStill, the ship’s recovery processes cost material and energy. If the energy was depleted, then death was the only thing that awaited them. The ship and its crew were depressed. The uncertain fate left everyone feeling nervous. Aside from Bao’er, who was trying her best to make Ning Yue happy, none of the others could raise a smile.\n\nHan Sen was under a lot of pressure to resolve this. He wasn’t worried about his safety, as he could always hop back to the sanctuaries. But if he did that, Ning Yue and Fang Qing Yu would be left to die.\n\n“Brother Fang, can you call the Treasure Identifier Elder? Can you see if he can help us?” Han Sen asked Fang Qing Yu hopefully.\n\nFang Qing Yu pulled out his Wanjie Rubix Cube. The Rubix cube’s squares were all grey and lifeless. It wasn’t picking up any signals.\n\n“I tried already. The Wanjie Rubix Cube can’t function in this place. The Wanjie Rubix Cube is a space treasure, but the Black Hole Spider is also a space xenogeneic. Their powers affect each other.” Fang Qing Yu smiled ruefully.\n\nHan Sen didn’t say anything. He continued to guide the white whale forward. There was nothing he could do right now, so he would just have to wait and see what happened next.\n\nThe pirates seemed to be in shock. If it wasn’t for Han Sen, whose lofty power they held in the highest esteem, they would have already had complete mental breakdowns. Without him, God knew what they would have done.\n\nNing Yue didn’t require pressure to break. If Bao’er even teased her, that would get the waterworks flowing. She’d sob like a madwoman.\n\nBut in the eyes of the pirates, she was something else entirely.\n\nThey had watched Ning Yue become a man and kill someone terrifying. Ning Yue might be a vulnerable person that they could push around right now, but no one dared to do it. They didn’t want to incite that slumbering wrath.\n\nNo one spoke, but all of a sudden, Han Sen saw a black shadow in the mist. He couldn’t see what it was, but it seemed to be something very large on the black sea.\n\nHan Sen frowned, but he drove the white whale toward it. Nothing could be worse than what they were currently going through. This might have been a worthwhile opportunity.\n\n“What is this?” When the white whale drew closer to the shadow, some of the other crew members finally noticed it.\n\n“Land… there is land!” When they were finally able to see what it was, they laughed in delighted relief.\n\nAn unbelievable scene appeared from the black sea. There was a large stretch of dark red land before them. Han Sen could see the crimson sea stacks and reefs surrounding it.\n\nEven from afar, Han Sen could see some weird plants decorating the place.\n\nThese plants were the normal trees or grass or vines that one might expect to find on an island. Instead, they were some mushrooms in many different shapes and sizes.\n\nThe big mushrooms were like Ferris Wheels. Others were the size of a room. A few were as small as beans. The place was colorful, and they all looked very lovely.\n\nPlus, many of the mushrooms glowed. They lit up the black mist and sea.\n\nHan Sen and the others looked at that mushroom land as if they were staring at a fairytale come to life. They looked very surprised.\n\n“If there is land, does that mean we aren’t inside the stomach of the Black Hole Spider?” Ning Yue looked at the mushroom land, and happiness returned to drive away her tears.\n\nHan Sen wasn’t quite as cheery, though. He had seen many xenogeneic bodies that featured landmasses and palaces. The Black Hole Spider was so huge, having a landmass inside it was not too surprising.\n\nNo matter what, if that land had plants, then it was suitable for life. Plus, the mist didn’t seem to obscure the mushroom land. That would at least keep the white whale’s hull from being further corroded. This was a good thing.\n\nAs he flew the white whale to the land of mushrooms, Han Sen wasn’t in a hurry to land. First, he flew around the mushroom landmass. As he circled it, his eyebrows furrowed.\n\nThe land of mushrooms was very pretty, and the mushrooms covered it in rainbows and splashes of color. But aside from the mushrooms, there was nothing else around.\n\nThere weren’t any xenogeneics, and there weren’t any other types of plants. There were only mushrooms.\n\nFrom Han Sen’s prior experiences, the prettier a mushroom was, the more poisonous it was. Those mushrooms were extraordinarily pretty, so he imagined they were also extremely deadly.\n\n“What is that?” Fang Qing Yu asked, pointing at the forest of mushrooms.\n\nHan Sen looked to where he was pointing, and he saw that inside the mushroom forest was a stone mountain. The stone mountain was very circular, and it was shaped something like a bun.\n\nNext to the small mountain, a small ship was parked. It looked old and broken, so there was no way of knowing who it belonged to.\n\n“Creatures are living here!” the pirates said excitedly.\n\nHan Sen drove the white whale closer to the downed battleship. Before they got any nearer, though, a door opened and a creature climbed out.\n\nWhen Han Sen saw the creature, he felt his eyes open wide.\n\nHe had seen many strange people in his time, but that creature that had just come out of the ship looked odd, even to him. The creature was snow-white, and its body was two meters tall. It was like an angry tiger, but there was a little pink mushroom glowing on its head. It made the tiger’s angry face look rather cute.\n\n“What a cute little tiger!” Ning Yue looked at the tiger and clutched her chest. Her eyes were full of stars.\n\nThe white tiger with the little pink mushroom on its head looked at the white whale in the sky. It opened its mouth, walked around, and then let loose a loud, “Meow!”\n\nHan Sen and the others all swapped glances. Ning Yue, in particular, looked as if she was melting. She looked at the white tiger through the white whale’s screen and passionately said, “It’s so cute!”\n\nBoom!\n\nBefore anyone could say anything more, the white tiger jumped, landing on the white whale’s back. The white whale suddenly lurched. An enormous dent formed in the spine of the white whale, and it was pushed down into the canopy of mushrooms."
}