{
    "chapter": 1312,
    "title": "Fighting With Full Power",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1312",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nGold General landed in front of Xie Qing King’s battered and bloodied body. With each step, cracks formed on the ground, as an extra to his intimidating approach.\n\n“Yes.” Gold General laughed and threw a wretched punch towards Xie Qing King.\n\nXie Qing King blazed his silver light as he quickly summoned the fumes of power that resided within him and punched back at the wicked foe that had beaten him.\n\nHe used every last ounce of power he could muster, going into this strike with the belief it could be his last. With great anger for the misdeed done upon him and what could possibly happen to everyone else in the shelter, he gave it his all.\n\n“Alu-Alu-Alu-Alu!”\n\nThat complete release of strength led to a most magnificent display, as it leveled the palace and ruined everything around the two spirits that stood before each other.\n\nXie Qing King would never throw in the towel, even if the reaper had come knocking. Even if he was to stumble and fall, he’d do what he could to get the last laugh.\n\nGold General continued to smile as he broke the silver light that came for him. Then he broke it again, as Xie Qing King punched and punched with lesser strength each time.\n\nThere was a big difference between nine and ten gene locks, and that was the difference that separated the two. It was to be expected, though; after all, Gold General was Cup Demon’s most favored subordinate. He was highly cherished and well looked after.\n\nXie Qing King had not opened his tenth gene lock, and despite fully acknowledging the power gap between the two, he did not concede. He wasn’t going to, and he never would. Even with his body broken, he wasn’t going to stop.\n\n“End this pathetic display!” Cup Demon shouted, as he flew down towards the silver fox.\n\nCup Demon had come to realize Little Silver was the strongest out of all the creatures and spirits that populated the shelter.\n\nAnd what’s more, the ten gene lock emperor that had been going up against the furry blighter was now on the rails. The silver fox, with the repeated heals it kept on receiving, was still as fit as a fiddle.\n\n“It’s over…” Moment Queen sighed, wondering whether or not she should try to escape now before it was too late.\n\nMoving Star Shelter had no spirit stone, so there was nothing tying anyone there. And neither did anyone have to worry a conquering of the shelter would result in Han Sen dying through the loss of a spirit stone.\n\nRegardless of what could happen next, death would be the prevailing factor. It was an uphill battle against a force containing several times their strength and numbers. They had lost well before it began. Staying there could only lead to one thing, and that was them dying a fruitless death.\n\nDeath could come for her even if she did try to escape, but it was better that than the 100% certainty she would be killed by remaining.\n\nIf Moment Queen was the master of the shelter, she would command those defending there to flee. And if anything happened to the silver fox right now, she didn’t think Han Sen would show much mercy to her or anyone else.\n\nBut Moment Queen was out of ideas on how she could remedy the situation or at the very least save the fox under fire.\n\nNo matter how strong Little Silver was, there was no way he could fight an emperor with ten gene locks open and the third Son of God at the same time.\n\nBut just as she saw Cup Demon approach the silver fox, something else appeared to stop the leading spirit.\n\nMoment Queen was unable to fathom who might have come to their aid so suddenly.\n\nIt was a little girl Moment Queen saw, one with a purple horn, purple hair, and amethyst eyes. In her hands was her signature weapon, the Bone Dagger. She looked like the human girl that always used to accompany Han Sen and rarely spoke.\n\nMoment Queen had never seen her like this before, and she couldn’t be sure it was Zero due to her lifeforce being rather different.\n\nBut even if it was, she didn’t think it mattered too much. She didn’t think Zero was all that powerful, even in this new form she was taking on. There was no way she could hope to stop Cup Demon Emperor’s approach, she thought. The little girl must just want to do her part, or something like that. If now was the end, it was now or never, anyway.\n\nAs Moment Queen pondered this peculiarity, she saw Cup Demon Emperor frown, commanding a legion of bugs to intercept her.\n\nHis command to the bugs was fast, almost panicked, yet in the face of all those insects, the little girl’s resolve did not change. It was almost creepy, seeing how emotionless she was in the field of battle. She lifted her dagger as a red light began to gleam across it.\n\nThe light pierced through the host of bugs before her, with its ultimate target lying past them, in the region of Cup Demon Emperor’s forehead.\n\nCup Demon Emperor evaded the red light that came for him, but somehow he hadn’t. It was perplexing for Moment Queen herself to see. She had seen the spirit dodge, but somehow, the red light had still gotten him.\n\nThe mantra that said the Falsified-Sky power never missed was as accurate as ever.\n\n“No way.” Moment Queen was audibly amazed by what she saw. Never in her wildest dreams could she expect or even believe what her very own eyes were telling her; the quiet little girl that followed Han Sen around was able to one-hit kill an emperor such as that.\n\nWith one blink-and-you’ll-miss-it hit, Cup Demon Emperor’s lid had been peeled.\n\nPang!\n\nCup Demon Emperor exploded before everyone, which led to all the bugs vanishing with him.\n\nNot long after, though, another crowd of bugs appeared. And out of that crowd came Cup Demon Emperor once more.\n\n“You are strong, but you cannot kill me!” The newborn Cup Demon summoned a host of bugs once more.\n\nThis time, he watched her dagger closely. He hadn’t been sure of what killed him earlier, so now he wanted to see.\n\nZero’s expressionless face looked as unconcerned as ever, and so she simply raised the dagger up and lobbed it towards him.\n\n…\n\nGold General accepted the order and flashed with a gold light, ready to finish off Xie Qing King.\n\nPang! Pang! Pang!\n\nGold General punched Xie Qing King a few times, breaking most of the bones in his body.\n\nXie Qing King could no longer stand, as he had been damaged too much.\n\nHe wanted to stand and fight for the security of the shelter, but he was bleeding profusely and the lights in his eyes were starting to dim.\n\nGold General jumped up, ready to land his feet on Xie Qing King’s head and break it open like a pinata.\n\nUnable to dodge or do anything to repel this foe, Xie Qing King just watched the feet descend."
}