{
    "chapter": 1881,
    "title": "Killing Hell",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1881",
    "text": "“If we can get back to Purgatory Heaven, maybe I can try,” Guna said.\n\n“How?” everyone asked at the same time.\n\n“It is too late for me to spend time explaining here. Let us return first. Right now, Purgatory Heaven is not under the control of anyone, but the power is increasing over time. Soon, more and more Purgatory Beasts will be showing up. It is difficult to tell if we can reach the Goddess’ statue before then. So, let’s get there first.” Guna stood up and gestured for Guya to follow her.\n\nHan Sen knew that time was tight and they could not afford any delays. Wang Yuhang and the others followed, too.\n\nGuna and Guya went together. While the pool of light was brighter, it still had a very limited reach. Han Sen and the others had to stay as close as they could to them.\n\nHan Meng’er and Spell kept firing at the Purgatory Beasts that tried coming for them. It surprised Han Sen a lot to learn that Han Meng’er could shoot and kill the Purgatory Beasts.\n\nHan Meng’er’s powers were special, there was no doubt about that. Her genes originated in those of a god and a destructive goddess. A part of it was Han Sen, too. The death destructive power that she had gained was very unique.\n\n“If Meng’er can kill Purgatory Beasts, that means Purgatory Beasts and Purgatory Heaven are somehow connected to Death powers,” Han Sen thought.\n\nHan Sen could guess the element of the Purgatory Beasts, but with the elements that could be used to counter them, it looked like something Spell could do, too.\n\nIt was a shame that Spell was only Baron class. She could still do battle now, but when Purgatory Heaven became stronger, Baron class skills might not be of much help.\n\nThe only skill he had at Viscount level was Jadeskin. It did not work on Purgatory Beasts, and that made him depressed.\n\nIcebird Duke followed Han Sen and looked rather shy. She had the highest rank, but she was one of the most useless people there. She could only follow.\n\nGuna and Guya were surprised with Han Sen’s Spell geno armament and Han Meng’er’s power. It was rare to encounter any that could kill the fiends they were up against.\n\nThey entered the city, and then their greatest worry appeared. They heard a cow, bellowing like thunder. And then, heavy footsteps trotted toward them from the dark.\n\nHan Sen’s eyes couldn’t see in the dark, so he could only hear the scary Purgatory Beast heading for them.\n\n“Be careful! A high-level Purgatory Beast has emerged,” Guna warned them.\n\nThere was no need for such warning, though. Spell and Han Meng’er had their weapons drawn and aimed at whatever was coming. They could not dodge, and they could not leave. Without Guna and Guya by their side, the arms would claim them as soon the dark reached them.\n\nMoo!\n\nA cow’s bellow came echoing out of the sky, rocking the darkness around them. A black Hell Cow emerged from the blur, churning its legs to sprint towards them.\n\nSpell and Han Meng’er struck at the same time, with a fusion of black arrows and white bullets.\n\nDong!\n\nA black arrow hit the black Hell Cow. It was dealt minor wounds, but none of the hits were able to break its flesh. The bullets lodged inside the skin, but that was where their flights ended.\n\n“Get out of the way!” Han Sen saw that the cow was still coming. Spell and Han Meng’er would be unable to block it. He pushed Guna towards Wang Yuhang and Dragon Lady.\n\nHan Sen held onto Guya and pulled her and Han Meng’er back.\n\nIcebird Duke could not deal damage to the latest hellish beast, but she reacted quickly to the commands barked by Han Sen.\n\nEveryone split up, just as the cow came rushing down the middle of their swift parting. It didn’t hit any of them, but the near-miss had most certainly given them a cold sweat.\n\nHan Meng’er and Spell kept shooting at the cow, but it wasn’t accomplishing much. They were only Barons, so it made sense that they could not damage the black Hell Cow all that much.\n\nThe black Hell Cow decided on a new target, and that person was Wang Yuhang.\n\n“Little Uncle! Catch!” Han Sen threw his Marquise armor to him.\n\nOut of everyone there, the person in the most danger was certainly Wang Yuhang. Wang Yuhang knew the Purgatory Beast would end up going for him.\n\nWang Yuhang caught the armor and put it on with haste. The black Hell Cow was quick to start chasing after him.\n\nPang!\n\nWang Yuhang was unable to dodge in time. He took a nasty hit, but the Marquise armor was strong. The plating had prevented the cow from piercing the armor with its strike.\n\nThe force knocked him to the ground, though. Guna’s light was weak, and it only worked for a proximity of two steps.\n\nWang Yuhang fell down next to the ghoulish arms on the ground.\n\nHan Sen started attacking the arms next to Wang Yuhang, trying to slice the arms that came for him. No matter how sturdy the Marquise armor was, it couldn’t stop the things from pulling Wang Yuhang into a hole.\n\nGhost Teeth Knife and Teeth power were useless under these circumstances. Han Sen found himself tightly gripping another knife, and he managed to hew down a few of the arms when he tried with that one. He was surprised by the result.\n\nHan Sen noticed it was the Knife Blank from Planet Knife Grave. The Knife Blank was like a steel rod. It did not possess the edge of a blade, but even so, he was able to slice through the arms that not even a Duke’s power could cut down.\n\nOf course, there was no time to mull this over right now. So, Han Sen got back to work by swinging the Knife Blank. He cut every arm that had grabbed on to Wang Yuhang and pulled the man out of the ground.\n\nGuya and Guna were unable to close their mouths. If someone could kill Purgatory Beasts, then that meant they were strong. But the arms were the energy of Purgatory Heaven. Not even King class folks could kill those arms. So, how was the stick-like item Han Sen wielded able to cut them down with such ease?\n\nA few seconds later, the black Hell Cow came speeding over to Wang Yuhang again.\n\n“Old Han, help!” Wang Yuhang was shaking, and he did not dare run. If he moved, he’d fall into the arms. That was just as bad as getting run over by the cow.\n\nSeeing the black Hell Cow almost reach Wang Yuhang, Han Sen pushed him over to Guna and swiped at the cow with his Knife Blank.\n\nA black cow’s head barreled through the sky.\n\nBoom!\n\nThe headless cow’s body ran for a while before coming to an end atop the arms. They both became black smoke and disappeared.\n\nGuya and Guna’s eyes were open wide. They peered at Han Sen, thinking how unbelievable the entire thing had been."
}