{
    "chapter": 2760,
    "title": "Super Space Slash",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2760",
    "text": "When the Old Blood Dragon Lady became blood coral again, her battle presence disappeared. It was like the first time Han Sen had seen a powerful enemy and thought that he lacked the strength to fight back.\n\nThe blood shadow demon stared at the blood coral for a while, looking very confused. Its intelligence wasn’t very impressive. Once it realized that it was no longer able to feel the presence of the blood coral, it turned away from the motionless item. With that enemy gone, it refocused its attention on Han Sen.\n\nHan Sen’s stomach sank. He had thought a magical savior had come to help him and get rid of God’s Knife. But this was the measly result he had received.\n\nThe appearance of Old Blood Dragon Lady hadn’t been entirely useless, though.\n\nAt least Old Blood Dragon Lady had confirmed Han Sen’s suspicions about God’s Knife. It was just a xenogeneic. It was different from the beings that called themselves gods. This was just a creature that, with enough trial and error, could be beaten.\n\n“Those gods cannot fight in the geno universe, but God’s Knife can. So, it isn’t the same thing as its masters. But for some reason, those gods have instructed Gu Wan’er to raise this frightening xenogeneic… That must mean that the creature isn’t fully grown yet. I still have a chance of defeating it,” Han Sen thought to himself. He wanted to figure out how to get rid of God’s Knife.\n\nEven Old Blood Dragon Lady’s power wasn’t enough to destroy the knife. The material of the blade was very unique, and its weird powers kept Han Sen from dodging its attacks.\n\n“If it wasn’t a strangely powerful being, a god wouldn’t want to raise it. But Old Blood Dragon Lady already gave me a hint. Its knife light isn’t entirely invincible. There is a way to break it.”\n\nAs Han Sen thought this through, the blood shadow demon lost its self-control and attacked again. A red mist flashed through the sky to teleport in front of Han Sen.\n\nHan Sen used teleport again to dodge. Just like the last time, he successfully avoided the knife light. Even so, when the knife light reached the place he had been standing moments before, a wound was opened in his chest again.\n\n“That’s it! This must be right. What he uses is a geno art that is a combination of time and space powers.” Han Sen had made that guess as he studied the fight between God’s Knife and Old Blood Dragon Lady. Now that he had experienced it again himself, he could turn those guesses into facts that could help him.\n\nThe blood shadow demon was holding a sharp knife. It sent a crazy storm of blazing knife lights to attack Han Sen.\n\nHan Sen cast his four geno arts to the max. His xenogeneic battle body exploded with scary power. His teleportation and movements combined, but in the end, he still couldn’t avoid that knife.\n\nSeeing another knife wound on his chest, Han Sen wasn’t shocked. On the contrary, he was happy. That knife should have hit his head. But now, it had only struck his chest. That proved that his guess had been right, and his attempt to test that guess had been successful. He just hadn’t yet gotten the timing spot-on.\n\n“A geno art that can combine time and space. Its power can go through time and space. It slashed my body, where it was in the past. Because it will always know where I was standing in the past, attempting to dodge it will be futile. It will get me wherever I go, and it won’t even have to chase after me to do so. As long as it can attack my past, I won’t have to touch my actual body. It is a scary geno art, a super space slash.” Han Sen could see through the secrets that fueled God’s Knife power.\n\nBut seeing through it was one thing. Being able to break it was another thing entirely.\n\nHan Sen knew that this attack had many limitations. It could only slash the area of space and time shortly in the past, but Han Sen only managed to dodge it a few times, and God’s Knife only missed by a shave. He could not completely dodge the Super Space Slash.\n\nIf it wasn’t for the Immortal Dragon that kept on healing Han Sen’s body, he would have been slashed to pieces long ago.\n\n“No… It still won’t work…” This was the hardest fight Han Sen had ever had to endure. He knew what his opponent’s power was, but he couldn’t break it. His body continued to accumulate injuries.\n\nFortunately, Han Sen was able to dodge the most harmful blows, and the Immortal Dragon had sick healing power. God’s Knife wouldn’t kill him anytime soon.\n\n“Stop fighting! You need to go. You can’t beat him, and he is going to kill you. You cannot die here!” Gu Wan’er was waiting faraway near the carriage. She was crying as she yelled at Han Sen.\n\nHan Sen wanted to flee, as well. But he couldn’t leave that planet, so there was no point in trying to escape. He needed to deal with the trouble in front of him.\n\n“Ha!” Han Sen let out a raging roar. Countless knives and swords appeared in the air. The knife stream looked like a river in the sky as it poured down toward the blood shadow demon.\n\nHan Sen didn’t think the knife stream could destroy God’s Knife. He just hoped it could imitate the Old Blood Dragon Lady’s attack and disrupt the knife’s power long enough to buy Han Sen some time.\n\nBut Han Sen underestimated God’s Knife. The demon’s knife light flashed, breaking the sky full of knife lights, and it continued toward Han Sen.\n\nBlergh!\n\nThe knife sank into the muscle of Han Sen’s neck. It cut open his throat and blood spewed out.\n\nHan Sen had lost count of how many injuries he had sustained. Every spot in his body had been attacked by the knife. Han Sen had tried many different ways to evade God’s Knife’s Super Space Slash. But none had worked.\n\nHan Sen had even tried to make use of the Xuan Yellow Sutra. He wanted to lower God’s Knife’s level, but it didn’t work. The geno art couldn’t touch the sharp knife’s body. After Han Sen summoned the Xuan Yellow Sutra power, the God’s Knife continued to slash his past self. It wouldn’t connect with the power he had now.\n\nThe Immortal Dragon kept healing Han Sen without looking tired. Han Sen was depending entirely on the Immortal Dragon’s powerful healing abilities to keep him in the fight.\n\n“Wan’er, follow me!” Han Sen teleported next to Wan’er and summoned the Four Sheep Cube. He was going to use the Four Sheep Cube to escape that place and take Wan’er to the Very High.\n\nEven though that place was a jail, it was better than becoming food for a weird knife.\n\n“I cannot go. You should leave here quickly.” Gu Wan’er shook her head. Her voice sounded certain.\n\nHan Sen wanted to ask why, but he was hit again. He screamed as he flew away.\n\nThe blood shadow demon tried to chase after Han Sen, but Gu Wan’er threw herself before the blood shadow demon. Han Sen looked on in shock.\n\nFortunately, the blood shadow demon’s knife light didn’t cut her down. It didn’t want to kill Wan’er. It spun sideways through the air, trying to bypass Wan’er and reach Han Sen.\n\nBut Wan’er stayed between them. She clutched the God’s Knife’s blade, and the blood on her hands dyed the blade red. Blood poured out of the wounds in her hands. Within a second, Wan’er’s face became as pale as a piece of paper.\n\n“Leave now… It still needs me… It will not kill me… Plus, I have an immortal body… I won’t die… but you will die if you stay here…” Wan’er tightened her grip on the sharp knife as she shouted. She was clearly determined not to let it escape."
}