{
    "chapter": 1129,
    "title": "Han Sen’s Guess",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1129",
    "text": "Seeing Uncle Bug’s murderous look, Han Sen could now see how cruel of a person he must have really been.\n\nHan Sen sighed, unsure whether or not he’d be able to pluck more information from him. Thinking this, he decided to tell him, “Uncle Bug, I was in that valley the other night.”\n\nUncle Bug’s grimace turned to visible shock as he stared at Han Sen.\n\n“That was your son, wasn’t it? I think I can help.” This was Han Sen’s one and only trump card. If he wanted the information he sought, this was the only way.\n\nUncle Bug still looked to be fuming with anger, but he asked, “How do you know Sunset?”\n\n“I met her.” Han Sen proceeded to tell Uncle Bug about his encounter with her, inside the crystallizer ruins.\n\nUncle Bug, after hearing what he was told, had a complex look fall across his face. He said, “She still decided on living forever young.”\n\n“So, were you really a member of the Seventh Team? What happened?” Han Sen asked.\n\nUncle Bug said, “It is none of your business. If you pursue this matter any further, it’ll only lead to ruin. Don’t get yourself killed over all this.”\n\n“If that is so, do you need me to remind you about your son? Do you want him to remain in such a condition? I can help him.” Han Sen knew the man would still be a little too stubborn to elucidate.\n\nUncle Bug shook his head, saying, “Just go. And don’t breathe a word about this to anyone else. If you do, you’re dead.”\n\nHan Sen didn’t move, though. He remained and told Uncle Bug, “You are very strong, but even you cannot deal with the creature in the shadow.”\n\n“No one can deal with it,” Uncle Bug said with a wry smile.\n\n“I can,” Han Sen said.\n\nHan Sen knew it was a powerful super creature, but he still believed he could defeat it with the aid of Disloyal Knight.\n\nThe only thing Han Sen did not know was the relationship between the man and the creature. He had to learn more about that.\n\nWith another wry smile, Uncle Bug said, “You have no idea what that thing is.”\n\n“It is only a super creature; it is not some elaborate secret,” Han Sen dourly said.\n\nUncle Bug responded, “No single human can beat super creatures in the Third God’s Sanctuary.”\n\n“I’m not just anyone,” Han Sen said.\n\nUncle Bug wished to say something more, but suddenly, Han Sen’s back was blazing with a bright fire. Wings were outstretched, transforming him into a big fiery bird.\n\n“Is that a super shapeshifting beast soul?” Uncle Bug gasped with surprise.\n\nHan Sen returned to his human form and said, “So, what do you think? Do I have what it takes?”\n\nUncle Bug looked at Han Sen and said, “You are special; I’ll give you that. But shapeshifting beast souls can be draining, and you don’t have an infinite amount of time to use it.”\n\n“Well, what about with this guy by my side?” Han Sen then summoned Disloyal Knight.\n\n“A super pet beast soul with battle mode?!” Uncle Bug was incredibly shocked by this.\n\n“Even if I was unable to defeat the creature, I could bring your son everlasting peace,” Han Sen said, peering into Uncle Bug’s emotional reaction.\n\nUncle Bug bore a complicated look, one that was a mixture of excitement and confusion. His lips trembled when he asked, “What do you want from me?”\n\n“I want to know what transpired in that other dimension: the one spoken of by Sunset. And I want to know why everyone keeps saying Han Jinzhi could not have had an heir,” Han Sen gave his terms.\n\nTo this, Uncle Bug said, “If you can help Little Yan, I will tell you everything.”\n\n“Then it is settled. But it would be best if you tell me what happened to your son, first, and tell me exactly what I’m dealing with here. I will do my best to kill the creature without harming your son, if such a thing is possible,” Han Sen kindly said.\n\nUncle Bug looked touched upon hearing this, and he said, “Little Yan’s mother bore the same sickness. He has what she had. There was no cure, and his mother passed away. The same fate was to soon befall Little Yan.”\n\nUncle Bug told him most of the story. Han Sen was able to fill in the blank spots himself.\n\nUncle Bug said that he had learned of a way in which he could save his son. It was a method in which you could sign a contract and bind your life to that of a creature. They could live together, sharing energy.\n\nUncle Bug convinced his son to sign such a contract, and his son did indeed live. But unfortunately, his son was too weak to share his life with the creature, and now, he was being entirely controlled by it.\n\nLittle Yan was in a vegetative state, only waking up once a month. What Han Sen had witnessed was him traveling to the valley to absorb scorpion poison and feed the super creature that lived inside him.\n\nIf Uncle Bug did not take him to the valley, he’d be in even more agony than that which he suffered at the stings of the scorpions. His fate truly was worse than death.\n\nAlthough he had avoided death, he was most certainly not living. He was hardly human, and he had suffered this fate for one hundred years.\n\nHan Sen felt a shiver run down his spine when he imagined what it must have felt like to exist in such a state.\n\nHan Sen had never heard of such a method being employed before, though, and he believed it might have had some connection to the Seventh Team accessing the dimension that Sunset had told him about.\n\nHe had been able to come to the Third God’s Sanctuary and sign a contract with a super creature; no ordinary human could do such a thing, not through ordinary means.\n\nBut these were just guesses and thoughts Han Sen had, and he wasn’t sure if they were correct.\n\nQin Huaizhen, Sunset, and Uncle Bug all claimed to have seen a figure that proclaimed itself to be God in that dimension.\n\nPerhaps that God was a being that said it could fulfill their wishes.\n\nQin Huaizhen may have wished to live forever, so he was frozen in place. But still that only led to death and did not make him immortal.\n\nPerhaps Sunset wanted to be young forever, so she was placed inside that vase to remain like so. When she was exposed to the elements outside that sturdy vase, that age caught up with her and she died.\n\nUncle Bug’s wish may not have applied to himself. It could have been to save his son, but even those results turned sour.\n\nIf Han Sen’s hypothesis was correct, and that really was God, Han Sen thought He was an *sshole.\n\n“Don’t worry; I’ll do my best to take down that super creature,” Han Sen said."
}