{
    "chapter": 3031,
    "title": "Exposed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3031",
    "text": "Katcha!\n\nThe pillars of the geno hall were broken. The door was broken too. One was able to see the door had flames waving. All the race lanterns were becoming bright and dark like they were going to be put out by a raging storm.\n\nWhen the geno hall fell, all the god temples were shaken away by the god light. It seemed as if the god temples and universe were dead. Aside from hopeless cries, there were no other sounds.\n\nEven the sky full of God Spirits went silent. There were only the sounds of breaking.\n\n“Such a disaster. I wonder how many creatures in the universe can survive all this.” Sky Palace Leader’s face was cold like ice. There were even all sorts of disasters in Sky Palace.\n\nThe White Jade Jing Tower and Jade City were revealed. A holy air came out from there. The holy air of the White Jade Jing was headed for Sky Palace. It made the people of Sky Palace cry. If there had been no elites and the support of the holy gourd vine, Sky Palace would have been broken by the holy air.\n\nOuter Sky was not faring any better. The ground cracked. Loads of holy air pillars came out like volcanic eruptions, making the ground leak. Xenogeneics were running around like mad. All law and order was broken.\n\nSky Palace and Outer Sky were like that too. Other xenogeneic spaces and normal planets were like that as well.\n\n“The universe is going to end.” A hopeless fear was in every creature’s heart. No one knew if they would survive this disaster.\n\nWah! Wah! In a stream, a Kate baby was floating. There was a sad crying sound. In the flood’s roaring, it sounded quiet.\n\nIn a volcanic eruption, many cities and villages were destroyed. Some planets were even hit by asteroids and blew up.\n\n“Open it for me!” Qin Xiu’s eyes looked very passionate. With blood flame suppression, he crushed the geno hall’s door. Shattered rocks were strewn everywhere.\n\nGod’s body was crushed. He slipped into the geno hall. He stopped before the 10,000 lanterns. Behind him, many of the race lanterns were out.\n\nWhen each race lantern was put out, one of the high races was heavily damaged. It made the races that were already suffering disasters fare even worse.\n\nGod looked at Qin Xiu and said, “One person is making a billion races extinct. Is this really worth it?”\n\nQin Xiu coldly said, “When I was in my most hopeless time, there was only one person next to me. To me, this world only consists of this one person. There are billions of creatures, but they mean nothing to me. I do not need to care about them.”\n\nAfter that, Qin Xiu kept pushing forward to suppress the geno hall. Each step Qin Xiu took resulted in God taking one step back. He was going to strike the 10,000 race lanterns behind him.\n\nAll the races knew that if the race lanterns were snuffed out, the geno hall would be done for. But no one was able to stop Qin Xiu. Even the strongest god could not prohibit Qin Xiu’s march on the geno hall.\n\nQin Xiu wanted to walk forward even more. He wanted to destroy the geno hall, but he suddenly stopped. His gaze was frozen. He turned around and looked into space.\n\nThe hearts of the many hopeless races jumped. They did not know what happened. Why would Qin Xiu stop walking? It made them have a slight glimmer of hope.\n\n“At this time, what in the universe could make Qin Xiu care?” Many elites were feeling both confused and nervous.\n\nMost of the high races were already there. Under the suppression of Qin Xiu, even a true god elite had dropped out of deified class. No creatures were able to combat Qin Xiu.\n\nThey were hoping and praying for a miracle to strike, but they knew the chance of a miracle was far too small.\n\nThey still looked in the direction Qin Xiu was looking. They were hoping for something, but they did not spy any strong presence from that direction.\n\nQin Xiu looked in that direction and said to himself, “What is going on? Is this just my imagination? Why do I feel restless?” He was feeling a strong sense of nervousness.\n\nSuddenly, the elites saw a white shadow slowly appear from that direction. It was not fast or have a powerful presence. It was like a morning sun rising into the sky. It walked into the geno hall’s area.\n\nSky Palace Leader’s eyes were the strongest. He saw the white shadow clearly, so he screamed aloud, “It’s Han Sen! He is still alive!”\n\nMany elites saw it clearly thereafter. It was Han Sen who had walked into the geno hall\n\narea.\n\nHan Sen was different from how he had been before. His body did not have the red fire. His body had a white color and was half-transparent. He did not look like a creature from the universe. He looked like a God Spirit.\n\nQin Xiu saw Han Sen step forward. His expression immediately changed. He stared at Han Sen as if he had seen something unbelievable.\n\n“Impossible. The testing of super genes was not successful. How could a power like this exist… It cannot be the perfect super gene… It should have flaws like Wan’er does.” Qin Xiu was talking to himself.\n\nHan Sen stopped a short distance away. His Super God Spirit mode was still affected by Wan’er’s proximity. Han Sen looked at Qin Xiu and said, “Qin Xiu, leave Littleflower’s body. This is your last chance.”\n\nQin Xiu coldly said, “I clearly underestimated you if your genes were able to evolve to this level. Even if you are so close to the super gene, you are still useless. Failure is failure. In front of Wan’er, who is even closer to super gene, your power will be suppressed.” “Really?” Han Sen coldly asked. The Story of Genes was running in his body. When The Story of Genes ran, Han Sen’s body was in xenogeneic mode.\n\nXenogeneic mode and Super God Spirit mode were activated on Han Sen’s body. It made his presence appear a bit strange. “Dollar… Han Sen is Dollar…” All the creatures of the universe were suddenly frozen. They thought it was weird for Han Sen to be using Super God Spirit body. Now, he had a xenogeneic battle body. It was clear to them now. Anyone was able to tell that Han Sen and Dollar were the same person. “Han Sen and Dollar are the same person,” Yisha said. She looked very conflicted. She could not believe it. Her eyes opened wide. She thought about the past and looked even more complicated. Her face turned green, and her face turned white and red. She did not know how to think or feel.\n\nOn Empty Mountain, the green-haired growler’s mouth opened wide. He did not close it. Now, he understood why Golden Growler gave Dollar first place and adhered to what he told it.\n\n“Oh, my God! Godfather Han and Dollar are the same person.”\n\n“This… This is unbelievable…”\n\nAt the end of the world, many creatures were frozen. They could not believe their eyes.\n\n“This guy. He has finally exposed himself.” Wang Yuhang shrugged with his shoulders. He knew this would happen.\n\nThe people in Space Garden were not so surprised. Han Sen never told them anything, but most of them had figured it out."
}