{
    "chapter": 440,
    "title": "Fighting a Sacred-Blood Creature",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_440",
    "text": "Han Sen almost jumped on the back of golden rock worm king without thinking, rising in the air on the back of his pet.\n\nLooking down, he saw a giant snow spider coming out of the ice cliff. It was so big in size that it could probably swallow a man with one bite.\n\nHan Sen did not know whether the huge spider was a mutant creature or a sacred-blood creature. He would not be afraid of a mutant creature, but a sacred-blood creature might pose a challenge.\n\nWhen Han Sen was observing the giant snow spider, it suddenly opened its mouth. A white rope as thick as a baby’s arm flew at Han Sen and the golden rock worm king.\n\n\"Dammit! Run.\" Han Sen wanted to order the golden rock worm king to fly higher, but it was too late already. The white robe had already caught one of the golden rock worm king’s claws. The golden rock worm king quickly tried to cut the rope with its other claws. However, its sharp claws turned out to be glued together by the white rope.\n\nThe snow spider tugged on the white robe hard. Although it was quickly flapping its four wings, the golden rock worm king could not resist the strength of the spider and was pulled down toward the spider by the white robe.\n\n\"Sacred-blood creature!\" Han Sen was shocked. He did not have the ability to kill a sacred-blood creature yet. It was unnecessary to risk his life.\n\nSeeing that he was about to be dragged toward the spider together with the golden rock worm king, Han Sen no longer dared to hesitate and summoned the desert bird and cursed wolf dagger.\n\nThe desert bird flapped its wings and turned into a red and golden fire bird, hovering over Han Sen’s head, giving the cursed wolf dagger and golden rock worm king a golden red glow.\n\nWith the effect of the aura from the desert bird, the golden rock worm king’s wings became stronger. Flapping its wings hard, it was trying to get rid of the spider’s tugging.\n\nHowever, strength like that was obviously not enough. The golden rock worm king was still dragged toward the mouth of the spider, only at a lower speed.\n\nHan Sen was standing on the back of the golden rock worm king and quickly shapeshifted into the fairy queen. Using Heresy Mantra and Overload at the same time, his entire body was filled with incredible strength all of a sudden, his muscles shaking and heart pounding.\n\n\"Cut!\" Han Sen slashed the cursed wolf dagger at the white rope.\n\nHe felt that the dagger was stuck in something stiff and sticky, but he could not let go at this point. So, he had to make the slash even harder.\n\nThe white robe was deformed significantly and broke eventually. The broken rope bounced back to the mouth of the giant snow spider.\n\nHan Sen quickly took back the golden rock worm king that had just regained its freedom, landed on the snow, and quickly ran away.\n\nSacred-blood creatures should have a fitness index at least above eighty. Many sacred-blood creatures even had a fitness level above 100. This giant snow spider clearly had surpassed eighty Han Sen did not want to take the risks himself. Even if he wanted to kill it, he should wait for Zero to come.\n\nSeeing Han Sen was running away, the giant snow spider opened its mouth again, and another white shadow came at Han Sen.\n\nHan Sen was nimble enough to dodge the white rope and quickly ran forward.\n\nSnow spiders chased after him like an avalanche. The giant snow spider was especially fast, coming forward a hundred feet with each move. Han Sen could not outrun it with all he got.\n\nIn addition, the giant snow spider was constantly spitting spider silk at him, which Han Sen had to dodge as well. When stuck, He would be in trouble.\n\nGradually, the primitive snow spiders could no longer catch up with them. Only the giant snow spider was still chasing after Han Sen.\n\n\"Didn’t they say there were only an aristocrat spirit and a dozen mutant creatures in the spirit shelter? How come there is a sacred-blood spider?\" Han Sen felt quite upset.\n\nHowever, it was normal when he thought about it. The aristocrat spirit couldn’t not control a sacred-blood creature, so it was only natural that the giant snow spider was running wild.\n\nHan Sen could not get rid of the giant snow spider. After running for a while, there was no way to go anymore. Cliffs were everywhere.\n\nHan Sen wanted to summon the golden rock worm king to carry him over, but he suddenly heard a shrill bird song from under the cliff. With sounds of flapping, a giant black-feathered bird as dark as ink flew up from the cliff, its wings a hundred feet across.\n\n\"S*#t! God, you don’t need to play with me like this. Can we be friends or not?\" Birds were the type of creatures that Han Sen feared the most.\n\nBack in the days, he was almost killed by a silver bird and had to escape by jumping into a River. Running into a huge bird again, Han Sen felt ominous.\n\nIndeed, the black bird immediately threw itself at Han Sen after coming up.\n\nIt speed was like a black tornado, fast and fierce and scary.\n\nEven if he were thinking with his butts, Han Sen would know this was a sacred-blood creature, given the bird dared to snatch food from the giant snow spider.\n\nJudging by the speed of the black birds, Han Sen knew it was must be something extraordinary.\n\nLamenting his bad luck, Han Sen had no way to go with the giant snow spider chasing him in the back and the black bird blocking the road in the front.\n\nIf he were to summon the golden rock worm king to carry him into the air at this point, he would be feeding himself to the blackbird.\n\nNo matter how fast the golden rock worm king was, there was no way it could be faster than this sacred-blood creature.\n\nHan Sen decided not to escape. After shapeshifting into the fairy queen, his golden pupils started to sparkle, taking in every move of the giant snow spider and black bird.\n\nThe moment when the blackbird dashed down, Han Sen quickly moved away from its claws. As the spider silk was thrown at Han Sen, he managed to dodge it as well.\n\nHan Sen did not go back but moved forward at the giant snow spider.\n\nThe eight sickle-like spider legs quickly crisscrossed, trying to split Han Sen who was under the spider’s belly apart.\n\nHan Sen was calm, his heart pounding and legs unleashing unbelievable strength, moving up and down the eight spider legs, dodging all the attacks.\n\nThe black bird tweeted and clawed at Han Sen again.\n\nWith the spider and bird hunting Han Sen together, he had no way to escape."
}