{
    "chapter": 988,
    "title": "Place of Sacrifice",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_988",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Are they creatures or spirits?” Han Sen wondered, as he examined the eyeless angels with confusion.\n\nHan Sen summoned Thorn Baron to hear her input. “Thorn, do you have any idea what these are?”\n\nThorn did not immediately respond, and she went to examine them as if she had never seen them before. This was confirmed when she told Han Sen, “No, I haven’t. They seem to be some sort of creature.”\n\n“Are you sure they’re creatures?” Han Sen asked.\n\n“Yes,” Thorn Baron answered, assuredly.\n\nHan Sen frowned, thinking it to be an awful waste. Who would slay so many creatures and not even consume a single morsel?\n\nSince she couldn’t help, he returned Thorn Baron and summoned Moment Queen to ask her.\n\nImmediately, she looked upset. She had been in the midst of a hunt herself, and with the yank of a metaphysical chain, she had been brought over like a slave.\n\nWhen Moment Queen saw the eyeless angels pinned on the vines, though, her irritation vanished. She looked shocked and exclaimed, “Who has established a sacrificial ritual here?”\n\n“Come again?” Han Sen asked.\n\nMoment Queen looked at Han Sen with grave seriousness, and shouted, “Who did this? Who did this!?”\n\n“I haven’t a clue; I just stumbled upon it.” Han Sen explained the events that led him to the discovery.\n\nWhen Moment Queen heard what he had to say, she looked upon the bodies of the angels. She walked towards the vine they hung from and looked at the earth below. Then she punched a deep hole through the soil.\n\nDong!\n\nA loud metal noise emanated from beneath the dirt.\n\nMoment Queen punched the ground again and started to dig, turning up soil that was dark red.\n\nThe soil looked coarse and dry, and the further she dug, the deeper the red hue became. It eventually looked as if the earth had been wholly dyed red.\n\nIt got even stranger when jewelry started to turn up in the churned soil she was pulling out of the ground. They seemed to show up in a specific order.\n\n“It really is a site of sacrifice.” Moment Queen looked ill.\n\n“Can you please explain to me what’s going on?” Han Sen frowned.\n\nMoment Queen eventually answered, saying, “This is a festival for the deceased; something done by spirits.”\n\n“This is in worship of spirits?” Han Sen found it difficult to believe. If what Moment Queen was saying was true, how was Thorn Baron unable to identity what this ceremony? After all, she was a spirit, too.\n\nMoment Queen replied, “Spirits have spirit stones; when they die, they don’t necessarily die. The only spirits that require a sacrificial ritual are those who have failed to ascend to the Fourth God’s Sanctuary. Their spirit stones penetrate their own bodies, killing them.”\n\n“Keep going.” Han Sen didn’t quite understand, but he was glad she was being somewhat forthwith.\n\n“Think of it as a ritual of resurrection. If their bodies are not destroyed, they can use this ritual as a manner of reviving themselves.” Moment Queen paused for a second, and then went on to say, “This is a place of sacrifice. These beings were the sacrifice, and their lifeforce was wholly sucked dry. They provide their lifeforce to the spirit that requires resurrection, and the more powerful the spirit was, the more lifeforce they’d need. These thirteen creatures are Wind Angel super creatures.”\n\nHan Sen felt a chill run down his spine, as he gulped and asked, “Thirteen super creatures? Was it a king spirit that did this?”\n\n“Whatever did this was far stronger than a king spirit. Not even I can tell what manner of spirit would require thirteen super creatures for a resurrection. My best guess would be an emperor.” Moment Queen frowned as she stopped speaking.\n\n“How do you grow the angels?” Han Sen noticed a fluctuation in her tone, when she mentioned the super creatures earlier.\n\nTo this, Moment Queen hummed and said, “You’re asking how you get thirteen of the same super creatures, yes? Well, they grow from a tree. And of course, any person who has managed to grow such a tree is undoubtedly an emperor.”\n\nHan Sen was shocked, hearing that an emperor was resurrecting another emperor that had failed its ascension to the Fourth God’s Sanctuary.\n\n“Can we still eat these Wind Angels?” Han Sen asked.\n\nMoment Queen looked at him and said, “Their lifeforce has been sucked dry. It’s nothing but compost now.”\n\nHan Sen shrugged. He didn’t want to eat the remains himself, but he thought it might have been a fine treat for the Disloyal Knight.\n\nSince his retrieval of the fiend, Han Sen had fed the Disloyal Knight pet pills and waterdrops for its growth. But when the pet would be able to fight, he could not tell.\n\nHe thought the thirteen Wind Angels might have been enough to enable its battle mode.\n\n“Did he get resurrected, then?” Han Sen asked.\n\nMoment Queen shook her head and said, “I don’t know. This is where the ritual is prepared. The real place of sacrifice is where the spirit’s body lies. It’s probably further ahead.”\n\nHan Sen looked in the direction Moment Queen gestured, and realized it was the way Yaksha had gone. He frowned and said, “What is Yaksha doing there?”\n\n“That’s the person you saw in the ding, yes? He was the one who went this way?” Moment Queen’s face warped into an expression of horror.\n\n“I am pretty sure, yes.” Han Sen nodded.\n\n“We should follow.” Moment Queen walked forward in a bit of a rush.\n\n“For what?” Han Sen commanded her to stop, not wanting to risk Bao’er’s life by going after Yaksha."
}