{
    "chapter": 2970,
    "title": "Light Well",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2970",
    "text": "The energy holes had deified xenogeneic plants inside them, which were called Light Well Lotuses. The legends claimed that the Extreme King had been growing those Light Well Lotuses. It was unknown how many years it had been, but there must have been a lot of Light Well Lotuses.\n\nBecause the Light Well Lotuses did not initially belong to the Extreme King, and it was the Extreme King that destroyed another race to claim them, what happened with the Light Wells was something many people knew about.\n\nAfter the Extreme King took over, they blocked that place. They stationed many soldiers there to guard it. Supposedly, there was one extremely strong deified elite sitting there, so ordinary races did not dare do anything to the Light Well.\n\nHan Sen did not care about that too much. He was going to attack the Light Well.\n\nWhile Han Sen was resting, he saw the universe’s true god creatures challenge the God Spirits. Most of them failed. There were only three combatants that had proved successful in their bouts. One of them was Ghost Car.\n\nOut of the three of them, only one chose to replace the god flag and God Spirit’s position to become a new God Spirit.\n\nThey had only challenged a Destruction class God Spirit. Moment God was an Annihilation class God Spirit, so nobody dared to challenge her.\n\nAlthough Annihilation class God Spirits were stronger, even Disaster class God Spirits were not something other people or creatures wanted to challenge.\n\nThe Extreme King’s army that guarded the Light Well was always the same. They were in a space fortress scanning the space around to prevent an intrusion or possible invasion.\n\nAfter all those years, no xenogeneic had dared attempt an invasion. In their hearts, they were no longer on constant alert.\n\nA worker who was in charge of observation said, “Huh, it looks like something has reached the entrance of the Light Well.”\n\n“Are you joking? Can something reach the Light Well’s entrance? Do you think our Extreme King space fortress’ satellite and battleships are broken?” Another worker laughed and looked disdained.\n\nThey were the last defense of the Light Well. The defensive line in front had no movement. They did not think anything had reached where the worker claimed.\n\n“There really is something. Huh… It is wearing black armor. Hang on… That is… That is Dollar…” After the worker enlarged the camera’s video feed, he saw a person standing at the entrance of the Light Well. After he saw him clearly, he screamed.\n\n“Dollar? What Dollar?” His coworker was confused and could not react.\n\nThe worker earlier immediately replied. “What other Dollar could it be? He was inside the god list fight. Golden Growler gave Dollar the first-place position.”\n\nAll the workers looked at the videotape. They saw a man wearing armor. He was standing at the entrance of the Light Well.\n\nBefore they could see things clearly, the person had already punched the entrance to the fortress of the Light Well. He broke open the entire fortress, revealing the inside of the Light Well.\n\nHan Sen scanned the Light Well. He saw that in the large place in space, there were no stars. He was able to see an asteroid of an inverted cone shape. It was hanging in space.\n\nUpon making that discovery, he noticed that this asteroid was much larger than the average planet. There was a circular hole on n the asteroid’s platform. Inside the hole, there was a lot of light. It was like a spotlight had been switched on.\n\nIn some energy hole, there were Light Well Lotus flowers that were 30,000 feet long. Under the shining light of the hole, it looked crystallized. It was like a crystal flower from some dream.\n\nThe Light Well had a lot of energy in it. Since it was like a well, it was hard to calculate how much. Most of the lights were very dim and colorless. It looked like all the energy had been used.\n\nOnly a small amount of the Light Well was bright. Only that small part of the energy still had Light Well Lotus flowers.\n\nThere was a giant energy well that looked like a sky hole in the center of the Light Well. After looking inside, he saw there was a Light Well Lotus. It was the size of a space fortress.\n\nHan Sen felt an extreme and scary lifeforce stemming from the Light Well Lotus. He felt happy. “True god class plant xenogeneics.”\n\nHan Sen thought it would be great if he could get some transmutation or larvae Light Well Lotuses. He did not expect there to be a big guy there that was true god class.\n\n“Who dares come to the Light Well?” an old voice asked. It was coming from the Light Well.\n\nHan Sen turned around. He saw an Extreme King elder sitting on a lotus platform on the Light Well Lotus. His whole body was doused in the lotus light. Half of him was just light. He did not seem real.\n\n“Do you not know me?” Han Sen was surprised by the fact the old man in the lotus did not recognize who he was. Not many people in the Extreme King did not know who he was by now.\n\n“Why would I know who you are?” the old man coldly asked.\n\n“It does not matter if you know me or not. You just need to know that the Light Well belongs to me, Dollar.” After speaking, Han Sen summoned his Sky Vince Radish God Lance.\n\n“A god personality armament!” The Extreme King old man’s face changed, but he did not emerge from the giant lotus well. He reached out his hand and picked up a giant, green, metal umbrella. The green metal umbrella’s light protected the whole lotus flower.\n\nHan Sen did not mind that. He thrust the lance at the Extreme King elder. Not even a top-class true god xenogeneic was able to block Han Sen’s power with the Sky Radish God Lance.\n\nThe Extreme King elder did not dodge or flash away. He forced the green metal umbrella to block the light.\n\nDong!\n\nUnder Han Sen’s lance, the green metal umbrella’s light was messed up, but it was unable to pierce through the metal umbrella. The giant Light Well Lotus below shivered and shook. It looked a little bit dimmer.\n\nHan Sen suddenly frowned. He stared at the metal umbrella the old man was holding and the giant Light Well Lotus. It was like he had noticed something.\n\nThe elder coldly said, “My Process Umbrella is already a part of this Light Well Lotus. If you are forced to break the Process Umbrella, the Light Well Lotus will be destroyed with it. I advise you to take the Light Well Lotus and leave. Otherwise, you aren’t getting anything out of it.”"
}