{
    "chapter": 1167,
    "title": "Interracial Love",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1167",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nZhang Yuchen kicked them away, and before Han Sen could even ask what was going on, the door was slammed in their faces.\n\n“Tiger, what’s going on? Is there a grudge between the two?” Han Sen asked Cheng Hu.\n\nTiger was his nickname. It wasn’t because of his name, but because he practiced a hyper geno art called Killer Tiger. It borrowed the momentum of a tiger, so in battle, he could pounce upon foes with the ferocity of a great cat.\n\nCheng Hu sighed and said, “It’s a long story, but the reason Brother Zhang has been down here for so long is all because of Qiu Ping.”\n\n“We’re all humans and in this together, aren’t we? Why would Qiu Ping make things harder for someone else?” Han Sen asked, frowning.\n\nCheng Hu gave a wry smile, saying, “You can’t exactly blame Qiu Ping and call him the bad guy, as much as you can say Brother Zhang didn’t do anything wrong here. For them to both spawn here was a big mistake.”\n\nCheng Hu told their story to Han Sen, and Han Sen sighed after hearing it all.\n\nThey both spawned in the same shelter in the previous sanctuary. And when they spawned again in Immortal Shelter, they became even closer. It was like fate, for them to remain together.\n\nThey were closer than brothers, to start off with.\n\nQiu Ping was a surpasser with maxed out sacred-geno points. He even had hyper geno arts that were far stronger than Zhang Yuchen’s, but neither of them minded this. They always worked together and they always worked hard.\n\nZhang Yuchen knew he wasn’t as strong as Qiu Ping, so he worked extra hard to keep up. But woe befell their relationship, and it was torn into tatters by a woman who came between them.\n\nIt was a female spirit. Men have needs, and in this place that was especially true, given the fact that there were no women.\n\nSpirits were different than humans, and spirits merely cherished the companionship of someone who could talk to them. Qiu Ping met a female spirit while he was working, and they both swiftly fell in love.\n\nBut one day, when Qiu Ping returned home, he saw Zhang Yuchen naked.\n\nThe spirit was struggling beneath him, and when Qiu Ping appeared, she called out for his help. She claimed he had been doing awful things to her, and that Zhang Yuchen thought such actions were fine because he told her she was “just a spirit.”\n\nBut Zhang Yuchen claimed he never did such a thing or said such evil words. He told Qiu Ping she was framing him, and so Zhang Yuchen killed her.\n\nSince then, with the truth of the matter obscured, they had been enemies. And when the female spirit respawned, she returned to see Qiu Ping. She claimed he could not protect her, and she broke up with him.\n\nHan Sen frowned and said, “This must have been going on for many years. And it still is?”\n\nCheng Hu replied, “No one can say for sure what really happened. Qiu Ping is very powerful amongst the circle of this shelter’s top humans. He proclaims that any who seek to help Brother Zhang will be considered his enemy. Brother Zhang does not wish to burden people with this, so he tries not to associate himself with others too closely. It really has been going on for years.”\n\nZhang Yuchen’s fitness was low, but he had been there for twenty years and should have at least amassed a large sum of ordinary points by now. Han Sen knew there had to be a reason why he did not want to level up.\n\n“Did you just say Qiu Ping has returned?” Han Sen double-checked.\n\nCheng Hu quietly said, “Yes. He broke up with the spirit, but she has been helping him a lot. He is much stronger than the other humans who are here, so he took a job upstairs and never came down. But now, he says he is coming back down to put the business with Brother Zhang to bed. Permanently.”\n\n“He’s going to end all this? How?” Han Sen frowned.\n\n“I don’t know. What I do know is that he has opened eight gene locks. If he seeks to kill Brother Zhang, he’ll be able to do so easily,” Cheng Hu.\n\n“What is the level of this spirit?” Han Sen asked.\n\n“All I know is that the spirit is a servant of a king spirit. The only reason why Qiu Ping was able to sign a contract with the king spirit and manage to open eight gene locks was through her help. Royal spirits are usually the highest level that humans can sign contracts with, so Qiu Ping must really trust her,” Cheng Hu said.\n\nHan Sen thought there must be something wrong with that spirit. It may have been a knight-class spirit or something. But servants such as that could not help Qiu Ping as much as Cheng Hu was telling him she had.\n\nIf she was a high-level spirit, their relationship was akin to the poor farmhand being with the kingdom’s princess. It was like a twisted fairytale, wrought of strange and rare circumstances. It was even weirder, to acknowledge they were both of a different species.\n\nThey were both talking near Brother Zhang’s house, and suddenly, Cheng Hu looked shocked. He moved and pulled Han Sen into the alley with him.\n\n“What is it?” Han Sen saw a middle-aged man approaching, clad in armor.\n\n“That is Qiu Ping!” Cheng Hu said.\n\nHan Sen watched Qiu Ping march directly into the house.\n\n“Zhang Yuchen, get out. I have received an Immortal Order. We need to end this today,” Qiu Ping coldly said.\n\n“What’s an Immortal Order?” Han Sen asked.\n\nCheng Hu answered, “Immortal Emperor forbids killing of your own volition. Murder must be sanctioned, or come through an order directly from Immortal Emperor. By joining the Immortal Army, though, you may murder as you see fit. I cannot believe he has finally received it.”\n\nCheng Hu stopped talking after that, but Han Sen got the idea."
}