{
    "chapter": 2445,
    "title": "Tianxia System",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2445",
    "text": "“Mister Quin, why are we not going to the White River System? We seem to be headed for Tianxia System instead.” An Extreme King knight looked Bao Quin with confusion.\n\n“The White River System is currently in turmoil. Interstellar pirates are everywhere there. It might seem easy for Han Sen to slip through the chaos, but it is a very populated place. Han Sen has a bold personality, so it most likely compelled him to go to the Tianxia System,” Bao Quin deduced tonelessly.\n\n“But he is just a King. Tianxia System isn’t a feasible route for someone of his level,” the knight said after a moment of thought.\n\n“Before he was exposed, no one would have believed he had the gall to disguise himself as a prince of the Extreme King,” Bao Quin responded, his eyes hard.\n\n…\n\n“Slow down!” Bao’er was pushing the white whale through the clouds at an insane speed. Although their transport could move very quickly, it was supposed to be a whale, not a fighter jet. Ning Yue was lying on the floor, clutching a chair while bawling her eyes out. Her face was covered in tears and snot.\n\nHan Sen peered out at the endless clouds, and he couldn’t help but frown.\n\nAlthough he already knew that the Tianxia System was dangerous, seeing the system with his own eyes had still taken him aback.\n\nTianxia System’s clouds extended in all directions like an ocean, making it hard for Han Sen to keep his sense of direction. The endless clouds were colorful, as if the white whale was surrounded by countless fluffy rainbows. The clouds were opaque enough that it was difficult to see beyond the closest layer.\n\nNow, Han Sen and his companions were traveling through blue clouds. They were endless, and they were scarier than the depths of the sea. In between the moving clouds, Han Sen could occasionally see cloud beasts dancing.\n\nThose crane-like cloud beasts were in flocks of several thousand. They flew together like a cloud of their own, all moving quickly in tandem.\n\nInside the blue clouds, they would sometimes see the flash of magnetic storms. Typically, tools and gadgets were rendered useless by such storms. But fortunately, the big white whale of the crystallizers wasn’t affected by powerful magnetic interference. The turbulence of the storm’s had no effect on the white whale, which was why Han Sen wasn’t afraid to go through the Tianxia System.\n\nThe white whale was like a deified creature, but it had no lifeforce. Because of that, it didn’t send out a lifeforce for others to sniff out. Ordinary xenogeneics wouldn’t attack it, and Han Sen had indeed seen many xenogeneics along the way. But most of them completely ignored the white whale. Some of the meaner ones tried to attack the white whale, but they couldn’t really damage the hull of the ship.\n\nAside from the cloud beasts, they rarely saw other elites in the system. Even those of the higher races rarely came to hunt here. It was way too dangerous, and it was almost never worth the risk.\n\nPang!\n\nAs the white whale blazed along, an explosion sounded off to the side. The clouds rumbled and rolled, sort of like a tsunami. It felt as if some terrifying creatures were in the middle of a war somewhere in the fog.\n\nHan Sen told Bao’er to go past whatever it was. After all, they were running for their lives, not going on a safari. It was best not to attract the attention of anything, and so they should focus on getting through the fog as fast as possible.\n\nBut before Bao’er turned the white whale, a few people flew out of the big clouds. Terror was written across their faces, and they appeared to be running for their lives.\n\nTheir worries meant nothing to Han Sen. He didn’t have time to worry about people who were running for their lives. But when he got close enough to see their faces, Han Sen jerked back in surprise.\n\nAmidst the shadows, there were two pretty women that looked like twins. One was Gu Qingcheng, and the other was Elysian Moon.\n\nHan Sen couldn’t just ignore them. He had Bao’er drive the white whale over to Gu Qingcheng.\n\nWhen the people saw the white whale heading toward them, they turned in another direction, trying desperately to get away from this new threat as well. But soon after, they saw the mouth of the white whale open. Someone emerged through the gap.\n\n“Qingcheng, why are you here?” Han Sen asked, looking at Gu Qingcheng and Elysian Moon.\n\nGu Qingcheng saw Han Sen, and so she flew towards him with Elysian Moon. When the others saw that Gu Qingcheng and Han Sen seemed to know each other, they looked relieved. They flew over to the white whale, as well.\n\n“There are deified creatures ahead. We should leave this place,” Gu Qingcheng said to Han Sen after flying over there.\n\n“Follow me.” Han Sen led the way. He invited Gu Qingcheng and Elysian Moon into the white whale. The other people followed Gu Qingcheng, entering the white whale as well.\n\nSeeing that Gu Qingcheng knew them, Han Sen made no effort to stop their entry.\n\n“This is a battleship? And it can sail through the Tianxia System? This is so weird,” said a twenty-year-old man. He was one of the Demon, and he had deep purple horns. He looked around the big white whale with great curiosity.\n\nHan Sen told Bao’er to drive the white whale away from the deified creatures. Then he looked at the people who had followed Gu Qingcheng aboard and asked, “Who are they?”\n\nThere were a dozen of them, and they were all from different races. They were mostly Dukes and Kings. Gu Qingcheng pointed at one of the young Feather men.\n\n“He hired Elysian Moon and me to protect him inside Tianxia System.”\n\nHan Sen looked at the Feather man. The man seemed very young, and his lifeforce wasn’t that strong. He was a Marquise or Duke, at best.\n\n“My name is Qing Yu. Thank you for saving me. What is your name?” the Feather man asked politely.\n\n“Han Sen.” Han Sen had no plans of hiding his identity.\n\n“You are the student of the newly deified Knife Queen? I have heard your name before,” Fang Qing Yu said, glancing curiously over Han Sen.\n\nSurprisingly, Fang Qing Yu wasn’t like the other Feathers. All of the rest of the Feathers hated Han Sen.\n\nWhen Han Sen saw that they had no reaction to his name, he figured that they hadn’t heard that he was wanted by the Extreme King.\n\nIt made sense. Equipment didn’t work inside the Tianxia System, so contacting the outside world would have been impossible. They didn’t know what had happened out there.\n\nHan Sen looked outside and noticed there were no more crazy clouds. They must be far away from the deified xenogeneic now.\n\n“This place should be safe. You can leave,” Han Sen said, turning to Fang Qing Yu.\n\nFang Qing Yu quietly responded, “Brother Han, I would like you to take me all the way through the Tianxia System. What would require in trade for such a request?”\n\n“Sorry, I’m not here to play games, and I’m not interested in a business deal. Please get off my ship,” Han Sen said firmly.\n\nHe was on the lam. He wasn’t interested in spending any more time with these people. He had only saved them because Gu Qingcheng was there.\n\n“Brother Han, please consider it. Tell me how much you want, and I will gladly play you,” Fang Qing Yu said.\n\n“Sorry, I am a little busy. I cannot take you guys,” Han Sen said.\n\n“Listen, buddy! You’re going to end up embarrassing yourself.” One of the Destroyed stepped forward from behind Fang Qing Yu. He glared at Han Sen as he spoke.\n\nOther Dukes and Kings slowly surrounded them, too."
}