{
    "chapter": 2989,
    "title": "Copied Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2989",
    "text": "Dong!\n\nThe young man’s hand almost touched Han Sen’s neck when a knife light suddenly blocked it. The knife light and hand light hit each other. It left a bloody mark on the young man’s hand.\n\n“Sky Palace’s Under the Sky Knife skill is quite amazing.” The young man looked at the bloody mark on his hand and smiled even harder. He swung his hand. The wound on his hand was gone.\n\nHan Sen dove into Under the Sky mind. He did not move. He just looked at the young man. His knife went down.\n\n“I want to see how much you can endure.” The young man’s hand changed. Time and space also changed.\n\nHan Sen’s knife was slower. His place was swapped. The time and space power was similar to the legendary holy body.\n\nBack when Littleflower joined the geno being scroll fight, he had displayed this power.\n\nHan Sen’s body’s time and space kept twisting, but the young man could not break Han Sen’s knife skill. He already dodged Han Sen’s attack. He made Han Sen slower, but he could not hurt Han Sen.\n\nHan Sen’s place was changed, but he was not afraid. He still slashed toward an area where there was no one.\n\nWhen the young man wanted to attack Han Sen’s weak spot, a knife light appeared in space and stopped his hand.\n\nThe young man’s face looked more terrible. He noticed there was something wrong. The space around Han Sen was twisted, but Han Sen had already cast knife lights to stop his attacks. He was being stopped by Han Sen’s knife lights.\n\n“It looks like your holy body is just like that, yet you want to exceed Qin Xiu. Pah!” Han Sen waved his knife as he spoke.\n\nHan Sen was actually confused. The demon lady and the others said that only Littleflower practiced talents of the holy body, but there were obviously others who had practiced Qin Xiu’s holy body. The holy body was not as rare as the demon lady led him to believe.\n\nThat was why Han Sen used words to offend the young man. He hoped the young man would accidentally spill the beans on some of the holy body’s secrets.\n\n“That is just the beginning.” The young man looked mad. His eyes turned a weird blue color. Nothing but blue was visible in his eyes.\n\nHis body’s blood vessels were showing. Even the very small blood vessels were like small dragonflies and little snakes around his snake. His blood was starting to show.\n\n“Blue blood.” Han Sen was a bit shocked by this, so he looked right at the young man.\n\nAs the blood changed, the young man’s presence grew scarier. It was like an angry ghost that would eat everything as fuel for its power was coming out from hell.\n\n“Yes. I am a blue blood. Qin Xiu used his genes for a blueprint and combined it with better genes. That is why I am here. Although he did not admit it, it is a truth that can never be denied. I am greater than he was. I should be the real Qin Xiu. I should be the real Sacred Leader.” The young man’s eyes looked a little insane.\n\nHan Sen suddenly understood a lot. Back then, Qin Xiu, tried to copy people but gave up for some reason.\n\nHan Sen thought this young man must have been the failed test subjects that Qin Xiu abandoned. Despite what was done to them, they betrayed Sacred.\n\nHe looked at the young man’s face and noted how much he looked like Qin Xiu. He was very similar.\n\nAlthough they looked alike, because Qin Xiu’s presence was so special, the young man did not possess the presence that Qin Xiu had. Thus, Han Sen had not noticed how similar they\n\nwere.\n\nBoom!\n\nWhile Han Sen was checking him out, the young man’s flames turned solid. His whole body was like a transparent crystal.\n\n“That is… That is a God Spirit’s presence.” Han Sen frowned as he looked at the young man. What came out from him was the special presence only given off by God Spirits.\n\n“Yes. I have Qin Xiu’s genes, and I have an Annihilation class God Spirit’s genes. I am stronger than Qin Xiu. I am the real leader of this world.” The young man’s body was becoming stronger. The armor he had was vaporized by his presence. His naked body was revealed.\n\nHis body was like a crystal. One was able to see the blue blood coursing through his body. The blue-blood power and God Spirit mixed together made his presence very strange. It was like he was a human but not a human. It was like he was a god but not a god.\n\n“If you are so good, why did not rule the universe after Qin Xiu was killed?” Han Sen deliberately looked at him with disdain.\n\n“That is Qin Xiu’s fault,” the young man crazily said. “If he had given me the gene prototype, I would have ruled the world. Those from Sacred and the God Spirits would be crying before my feet.”\n\nHan Sen thought the young man was very stable and perhaps end up leaking a secret or two. He quickly asked, “So, what is the gene prototype?” “It is… It is Qin Xiu’s fault…” The young man crazily spoke. His eyes were full of energy. He raised his head and roared to the sky. His scary power was like a volcano erupting.\n\nThe body only had blue blood. In a moment, the blue blood seemed like it was burning. It made the whole body a transparent blue. The flames on the body were blue too.\n\nHan Sen frowned. He was a little bit worried. He was afraid Littleflower might turn out like this young man.\n\nHe had used all the power he had in the Alliance to search for Littleflower inside the sanctuaries, but there had yet to be any news of him. That made him very worried. “Qin Xiu! Qin Xiu! What are you doing?” Han Sen thought Qin Xiu was scarier than these God Spirits. At least God Spirits had their rules and principles to follow. Qin Xiu had just done what he pleased. He had not concerned himself with the consequences of his actions. No one was able to stop him. He had no moral compass.\n\nTo be without rules was a very scary thing, and Qin Xiu was the scariest demon in the deep abyss of not having any rules.\n\nKilling God Spirits, using gene technology to mix races… Even the holy beasts he grew had their horns taken and souls claimed. The genes were used to replicate people. He went against nature.\n\nQin Xiu had done many scary things. It was much scarier than what a God Spirit did.\n\nThe young man, who looked like a blue crystal God Spirit, stared at Han Sen. “Anything related to Qin Xiu should die.” He slowly spoke each word. When he was done, he reached out his hand and continued looking at Han Sen. Suddenly, the blue light was released. It twisted all of space.\n\nHan Sen felt like his body was going left and right in the time and space power. Somehow, he was in front of the young man. The young man’s hand grabbed him by the neck.\n\n“Die!” The young man’s face looked murderous and full of rage. His hand was full of power. The blue light was spilling. He was going to break Han Sen’s neck."
}