{
    "chapter": 1150,
    "title": "Blacklist",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1150",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen believed there to be many super creatures residing in that underground realm, and he believed he’d have an easy time venturing in to slay them whenever he desired. It’d be an efficient way for him to become stronger.\n\nBut Han Sen, after returning there, was unable to find one after a few days of subterranean travel.\n\nThere were no average-but-strong creatures, either. There were only ordinary rock rats, toads, and crickets to be found.\n\n“This can’t be right. Why aren’t there any decent creatures for me to slay?” Han Sen frowned.\n\nQueen observed the surroundings and said, “These creatures are smarter than we gave them credit. They are watching us, observing our every move.”\n\nBut down there, they had no other efficient way to track the creatures they sought. They couldn’t avoid being watched, as the rats were everywhere.\n\nThe super creatures had placed Han Sen on their blacklist, so they avoided him at all costs.\n\nHan Sen thought he could easily nab some Life Geno Essences and super beast souls by venturing down there, but like usual, events didn’t quite turn out as planned.\n\n“I am getting tired of this damp, god-forsaken hole.” Han Sen sat his bum down on a rock as he spoke.\n\nQueen looked at Han Sen, wondering what had happened the day Blue Dinosaur carried her away from the region that contained the tree. She did not know why Han Sen remained or what he had done when out of sight. The fact that they were afraid of Han Sen and evaded him at all costs aroused her suspicion.\n\n“Fine. We’ll go to the spirit shelter; it’s not like a spirit shelter can run off, too.” Han Sen, in his depression, decided to conquer a shelter.\n\nThe Blue Dinosaur then carried them both to the spirit shelter. There, they saw Liu Yunhui again.\n\nIt did not seem like a coincidence, but Liu Yunhui approached them first, asking, “Why have you come back here? If the spirit sees us, we will be killed!”\n\n“That’s okay. We’re going to conquer this shelter, if you don’t mind. Not that your minding will sway my resolve. Run along and tell Wu Tian and the others to duck and take cover.” Han Sen did not beat around the bush.\n\nLiu Yunhui looked at Han Sen as if he was a madman. “And just how exactly are you going to do that?”\n\nEveryone knew Han Sen was injured, and for him to proclaim he was going to take down a shelter, he thought he must have been having a laugh.\n\nHan Sen patted Blue Dinosaur and simply said, “This is a good boy. He has what it takes to get the job done.”\n\nLiu Yunhui gave a wry smile and said, “Even if your pet is very good, there’s only one of him. There must be at least twenty sacred-blood creatures in this place, and that’s not to mention all the royal spirits!”\n\nLiu Yunhui would not care if it was someone else planning a futile attack on the shelter.\n\nBut as a surpasser of Starry Group, he had been ordered to maintain a good relationship with Han Sen. That was why he was being nice and showing so much concern.\n\nHe didn’t understand why Han Sen was the son-in-law of the president, though, with a blood relation to Luo Haitang. Regardless, that family had given up on Han Sen ever since they learned his body had been damaged. Liu Yunhui wasn’t sure why he and others of the Starry Group still had to please the young invalid.\n\nBut orders were orders, and he was still going to do as he was bidden.\n\nHe thought the Blue Dinosaur was nothing more than a sacred-blood creature. When the sacred-blood creatures of the shelter attacked, Han Sen would be nothing more than a midday snack.\n\n“I thought there might be. Well, run off and go tell the others now.” Han Sen did not fancy explaining much of anything.\n\nLiu Yunhui shook his head and ran off. He didn’t want to sacrifice any of his people in what he believed to be a futile fight.\n\nLiu Yunhui told Wu Tian what was going on, to which Wu Tian replied, “Even if his pet was strong, that’s ridiculous. Does he really expect to take down this shelter with some half-decent pet and a woman?! Pah!”\n\n“Let’s just find someplace to hide. We shouldn’t be a part of this,” Liu Yunhui said.\n\nThey gathered the other humans and found an excuse to leave the shelter for a time.\n\nHan Sen set the time of the assault and then brought his Blue Dinosaur there.\n\nBefore the Blue Dinosaur went in to deliver its first strike, though, Queen was already running ahead into battle to slay what she could.\n\nLiu Yunhui, in the meantime, had run far away from the shelter.\n\n“Old Liu, do you think maybe Han Sen has healed?” an elder surpasser asked.\n\n“I doubt it. The demi-gods and top doctors said nothing could be done for him and he’d never be healed. Not even Luo Haitang could help,” Liu Yunhui said.\n\nWhile they discussed, they suddenly felt the contracts binding them break.\n\nThey were all in absolute shock, and they looked incredibly happy.\n\nWu Tian screamed in joy, shouting, “How?! How did Han Sen take on that shelter?”\n\n“Let’s go back and take a look!” Liu Yunhui said.\n\nThey ran back to see nothing but the charred remnants of destruction. The ruined bodies of dead creatures lay littered everywhere. Han Sen and Queen were walking away as they arrived.\n\nHan Sen’s clothes had not even been wrinkled, whereas the woman beside him looked as if she had just taken a bath in a sea of blood. Her gold scimitar was caked in blood and fleshy bits.\n\nWhat was even more shocking was the master of the shelter, Dark Prince, was now following Han Sen like a slave. He was willingly obeying Han Sen."
}