{
    "chapter": 112,
    "title": "The Archer",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_112",
    "text": "Han Sen ignored her urging and drew the string of Doomsday at the black-tailed monkeys sweeping across the slope, screaming.\n\nThe youths thought Han Sen was out of his mind. How many of the monkeys could he possibly kill? Once he was besieged by them, one scratch would mean death.\n\nWhile they were still anxious, they heard the string sounded once again and it did not stop.\n\nA black shadow flashed and instantly shot through a black-tailed monkey's head. The next moment, the arrow went back to the hands of Han Sen and was driven through another monkey’s head.\n\nThere was no extra movement or any deviation. The bow and arrow were almost integrated into one, with a mysterious beauty.\n\nString, arrow, death—everything was so natural and smooth, as if this was the way it should be.\n\nXu Xiangqian and the other youths were stunned and stopped running. They could not believe the black-tailed monkeys’ heads were penetrated just like this.\n\nMore than half of the twenty-some black-tailed monkeys were shot dead by Han Sen before they could make it to the foot of the mountain, and the few survivors screamed and fled back to the mountains.\n\nThe youths were still frozen and looked Han Sen up and down as if they had seen a ghost.\n\nSuddenly, they heard a screech of anger from the mountains and soon saw a black-tailed monkey more than twice the size of the normal ones reaching the foot of the mountain in an instant like a whirl of wind.\n\n\"A mutant black-tailed monkey!\" Li Xiaogu was shocked.\n\nFollowing her cry, an arrow flew across with a firm sound of string.\n\nWhoosh!\n\nThe mutant black-tailed monkey was suddenly shot in the head, with its whole body carried away and nailed on a tree behind it by an arrow.\n\nLi Xiaogu and the rest were looking at the monkey nailed on the tree astonished. And when they looked to Han Sen in a few seconds, he had put the bow back on his back as if he just did something quite trivial.\n\nOn the day of the ranking rounds of the contest, almost everyone was watching the matches, the match that they were most looking forward to being Dollar versus Lin Feng.\n\nBut until the start of the match, Dollar was still nowhere to be seen.\n\nBecause a total-point system was used in the ranking rounds, every contestant must fight all nine others. Whoever won the most matches would have higher ranking.\n\nSo in the beginning, when it had not been Dollar’s turn yet, the viewers were still hopeful that he might show up later. However, Dollar did not even show up at his own rounds and ended up losing by default.\n\nThere was an uproar among the viewers, as they were very disappointed in Dollar’s absence after waiting for such a long time. All kinds of speculations and gossips began trending.\n\nSome said Dollar was injured when hunting a sacred-blood creature and thus could not make it.\n\nSome said Dollar was an active duty soldier and was executing orders on the battlefield, so he could not participate in the contest.\n\nOf course, some said Dollar was afraid of Lin Feng, and did not dare to come.\n\nHowever, this argument was relatively unpopular. After all, Dollar’s strength had been recognized by the vast majority in his fight against Yi Dongmu.\n\nWith all kinds of speculations in the Alliance, people first thought of Fang Mingquan and Contest Center and wished that Fang would have a satisfactory answer to why Dollar did not show up at the ranking rounds.\n\nNaturally, Fang Mingquan had no way of knowing that. So he simply wrote an article \"You Are My Uncrowned King\" to indicate the Dollar was his only king and champion forever no matter which place he ended up having.\n\nGetting no answer from Fang Mingquan, people were still curious. But there was no one who knew the reason why Dollar did not show up no matter how many analyses there were.\n\nUntil the end of the contest, Dollar still did not make his appearance. He was considered lost by forfeit in all his matches and ranked number 10 in the end.\n\nBut no one doubted the strength of Dollar. At least he would not be number 10.\n\nAnd the champion was highly predictable. Lin Feng still allowed all his opponents to perform wonderfully before defeating them. It was the same in every match of his.\n\nThe focus of the ranking rounds was not the ranking. There was not even much discussion on who the champion would be. The hottest debate was if Dollar had come, who would the champion be.\n\nIn an interview with Lin Feng, a female reporter asked him, \"Did Dollar choose not to come because he fears you?\"\n\nLin Feng replied casually, \"Just like I will never be afraid of any opponent, neither will he.\"\n\nHe then ignored all other interviews.\n\nUnable to reach Lin Feng, reporters then turned to chase his buddy Tang Zhenliu.\n\nThis made Tang really depressed. He was the runner-up this year, which was the best ranking he had so far and no one cared about that. They might congratulate him on that in the beginning, which was always followed by questions about Dollar.\n\n\"Tang Zhenliu, if Dollar were in the matches, who do you think would be the champion, Dollar or Lin Feng?\"\n\n\"Tang Zhenliu, why do you think Dollar was absent?\"\n\n\"Dollar and Lin Feng, who would be more likely to win?\"\n\n\"Do Dollar and Lin Feng know each other?\"\n\n\"Are you and Dollar friends?\"\n\nAll kinds of questions made Tang dizzy and he ended up hiding at home so that the journalists could not besiege him.\n\nThe Skynet was also flooded with posts discussing these questions. Some were praising Dollar and some criticizing. The debates lasted for about a month after the contest was over.\n\nIt took Han Sen and the youths more than half a month to reach Glory Shelter.\n\nThe youths told Han Sen it would take a month, which was an estimate according to their own speed, considering they had to bypass large groups of creatures. With Han Sen on the team, they did not need to take detours any more, as the archer could clear the path.\n\nAs long as the creatures were not in too large a group, Han Sen could always keep them at least 30 feet away, making the youths realize the benefits a great archer could bring.\n\nBecause of the performance of Han Sen, some of them had changed their focus to archery.\n\nAfter Han Sen reached Glory Shelter, he found that he could not claim the reward for the Chosen there and had to claim it at the sacred stele in Steel Armor Shelter where he registered in the contest."
}