{
    "chapter": 2249,
    "title": "Ghost Bone Mask",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2249",
    "text": "Using powers that were beyond his control didn’t sound like a very good idea, and the last thing Han Sen wanted to do was take more risks.\n\n“Do not worry; I can teach you Ghost Bone Techniques. As a Duke, you should be able to control these Ghost Bone Masks.” Fox Queen went silent for a moment, then said, “But those techniques are some of the strongest skills created by Ghost Bone. They are very difficult to practice. I don’t know if you will be able to finish practicing a Ghost Bone Technique before the xenogeneic grows too powerful to beat. If you take too long, it might very well end up as a half-deified creature. Fighting it then would be pointless, even if you did have the Ghost Bone Techniques. While the masks are also half-deified, they’d be far inferior to that monster. After all, the creature is a scion of White Bone Hell itself. It is not a normal being.”\n\n“So the Ghost Bone Techniques can be practiced by people who are not Bone themselves?” Han Sen asked with a frown.\n\n“Any race with bones inside their bodies are able to practice these techniques. After they turn their bones into ghost bones, their powers will grow. Furthermore, they develop resistance to dark elements. But…” Fox Queen trailed off.\n\n“But what?” Han Sen asked.\n\n“But when the practitioner’s bones become ghost bones, their light element gene powers erode.” Fox Queen shook her head slowly. “But you have no choice. If you do not wish to die, then this is the only thing you can do. Any problem that it causes with holy powers is a concern for later.”\n\nHan Sen eyed the Ghost Bone Masks, but he did not speak. He hesitated for a minute, then grabbed one of the Ghost Bone Masks.\n\n“Don’t touch it!” Fox Queen said, but she didn’t actually move to stop him.\n\nHan Sen ignored her as he gathered up power. He grabbed the Ghost Bone Mask and felt a cold power emanating from the thing. A sudden force sent Han Sen flying. He slammed into the wall behind him, and the impact was so powerful that he found himself wheezing.\n\n“I did tell you not to touch it. Until you practice Ghost Bone Techniques, there is no chance that the Ghost Bone Masks will give you their approval. You are lucky that it did not kill you outright,” Fox Queen muttered grumpily.\n\n“These things are obscenely strong.” Han Sen got back to his feet and looked back at the Ghost Bone Mask with new respect.\n\n“Of course. The masks with poor performance were broken long ago. The ones that remain here are the best of the best.” Fox Queen sighed and said, “I hope you can gain the approval of at least one Ghost Bone Mask before that xenogeneic takes any serious steps toward becoming deified. If you don’t, then ready yourself to die here with me.”\n\n“I can try,” Han Sen said quietly.\n\nWhen Han Sen agreed, Fox Queen began teaching him a Ghost Bone Technique. She was General Ghost Bone’s wife, so she was well-versed in his techniques. She had watched him use the techniques for eons, and although she hadn’t practiced them herself, she was familiar enough with them to teach Han Sen.\n\nHan Sen wasn’t in a rush to practice the new techniques, though. After Fox Queen explained the skill to him, he spent some time investigating it on his own.\n\nHe didn’t entirely trust Fox Queen, and he was worried that practicing the Ghost Bone Techniques might pose dangers that she hadn’t told him about.\n\nAs Han Sen researched the skill, he learned that it really would weaken his resistance to light powers. But that was the only risk involved with learning the skill, and it really did make the body much stronger. It wasn’t difficult to see why General Ghost Bone created the skills and kept them a secret.\n\nHan Sen didn’t think the skill would be dangerous for him, but even so, he didn’t plan on practicing it. Instead, he had thought of another way to subjugate the Ghost Bone Masks.\n\nThe power of the masks aligned with the power of the Ghost Bone Techniques. If Han Sen could use the Dongxuan Aura to simulate the power of the Ghost Bone Masks, he might be able to trick the masks into believing that he had a Ghost Bone Technique.\n\nGaining the masks’ approval in such a roundabout way might protect him from Fox Queen. If she was planning to use the Ghost Bone Technique against him in some way, then using the Dongxuan Aura to simulate the technique should leave him less vulnerable.\n\nHan Sen remained in the side hall and pretended to practice the Ghost Bone Technique in the way she had instructed. But in reality, he was using the Dongxuan Aura and the Purple-Eye Butterfly to watch the Ghost Bone Masks.\n\nAs Han Sen examined the powers of the Ghost Bone Masks, he considered how he might tame that blood kirin. He wanted to own it for himself.\n\nIf Fox Queen was telling him the truth, then taming the blood kirin should be easy once he obtained the power of the Ghost Bone Masks. So, Han Sen was in no immediate rush.\n\nThe key that unlocked the gate to White Bone Hell was around Fox Queen’s neck. Unless she opened the gate personally, no one else could enter.\n\n…\n\nIn the base of the Ice Blue Knights, Edward looked gloomy.\n\nHan Sen had disappeared right in front of him. Edward tried to locate Han Sen using every method he could think of, but nothing had worked. For him, this was a major failure.\n\n“He is just a Marquise. Even if he became a Duke, his chances of surviving the wilds of Planet Ice Blue are slim. Perhaps he was killed by a xenogeneic?” an Ice Blue Knight suggested with a frown.\n\nEdward shook his head. “No. If he was eaten by a xenogeneic, it would have left behind evidence that I could pick up. Ice Blue Knight King used the full might of the Ice Blue Knights to search for him, but Han Sen eluded them all. There’s more to this guy than we thought.”\n\n“Is there no other way to find him?” the Ice Blue Knight asked, quite worried about how things were going.\n\n“Perhaps…” Edward tapped his lower lip and spoke slowly. “If Mister White joined the pursuit, perhaps he could find Han Sen.”\n\n“His power is restricted, isn’t it? He can only use his strength ten times throughout his entire lifetime, and he has already used his abilities eight times. Only two uses remain. You think he would spend one of those to search for a mere Marquise?” The Ice Blue Knight looked at Edward skeptically.\n\n“He wants the same thing that we do. Otherwise, he wouldn’t have come to the systems of chaos in the first place.”\n\n“But if we tell Mister White what we’re after, things will become even more complicated.”\n\n“You think he doesn’t already know? When Ice Blue Knight King tried to catch Han Sen, Mr. White must have realized our objective immediately. He just didn’t say anything,” Edward responded contemptuously.\n\n“Do you think he will try to find Han Sen on his own?” The Ice Blue Knight was shocked.\n\n“He would go alone if he could, but his power isn’t well-suited for combat. He can’t do much, and thus, he has to depend on Crime. Even if he knew where Han Sen was, he’d still need Ice Blue Knight King or us to fight for him.” Edward moaned and said, “We can wait. Ice Blue Knight King will lose his patience eventually, and he will go to Mister White. When that time comes, we just have to follow them.”\n\n…\n\nInside the palace, Han Sen was looking increasingly ghostly. His flesh had become a bit transparent, and his skeleton had blackened.\n\nBzzt!\n\nAs Han Sen was practicing, he heard the wall tremble and shake. He raised his head and saw a Ghost Bone Mask shivering in small, violent bursts.\n\n“You are better than I thought you would be. It’s been less than a month, and you have already gained proficiency with Ghost Bone powers. And furthermore, you have activated the approval process of a Ghost Bone Mask.” Fox Queen looked upon Han Sen with some measure of shock."
}