{
    "chapter": 1171,
    "title": "Dry Bone",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1171",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe news about Han Sen going to the fifth floor had spread. As he approached to take the test, though, the guard asked that Han Sen wait a day.\n\nKing spirits and super creatures were unable to guard there every day, so the top-dogs upstairs would have to hold a discussion and see who would best supervise the test.\n\nUnfortunately, there was nothing Han Sen could do about that. So, he had no choice but to wait an entire day.\n\nThe spirits, creatures, and humans on the fourth floor were curious about what was going on.\n\nGoing to the fifth floor was quite the event, as it was a challenge beyond comprehension. What made it so remarkable was that a human was attempting to ascend. Humans were small and not worthy of much recognition in that shelter or anywhere else in the sanctuary, so learning the species of the challenger sparked the interest of everyone and everything there.\n\n“Old Zhao, is Han Sen human?”\n\n“I asked Cheng Hu and yep; he most certainly is!”\n\n“Wow. Do you think humans can actually reach the fifth floor?”\n\n“I don’t know, but Qiu Ping said he was unable to kill him.”\n\n“It would be great if he managed to succeed.”\n\n…\n\nIn the palace on the fifth floor, three spirits and seven creatures sat before a table in deep discussion.\n\n“Dry Bone, it should be your turn this time.”\n\n“Why me? Why don’t you go?”\n\n“I am afraid I would kill the boy in one hit. It would be a shame to simply terminate someone who has managed to come this far,” Baby Ghost said.\n\n“You are much weaker than me; you actually think I’d be unable to defeat him?”\n\n“What are you talking about? We both know I am far stronger than you.”\n\n“You? Stronger? I’m going to beat the sh*t out of you!”\n\n“Sure. Bring it, you dry, crusty sack of bones!”\n\n“Shut up; both of you!” a female king spirit commanded. Immediately, Dry Bone and Baby Ghost went quiet and remained in their seats.\n\nThe seven creatures that were watching the discussion now turned to look at the female spirit. Their expressions were full of serious concern for the matters they were supposed to discuss.\n\n“This should be decided by Mister Immortal, but he’s practicing right now, so we can’t disturb him. Should I make the decision, then?” The king spirit looked into the eyes of each.\n\nThe super creatures were fine with her making the decision, and Dry Bone and Baby Ghost said, “Qing Jun? Yes, you should be the one to decide.”\n\nQing Jun panned the room until her eyes fell on Dry Bone. She told him, “Dry Bone, it is you who should go this time. Do your best and do not relent. Show us the true extent of your strength if you wish to share the Sky Fruit.”\n\nDry Bone King said, “Okay.”\n\n“Everyone, prepare yourselves. We will go to another Sky Fruit in two days,” Qing Jun said.\n\nThe super creatures promptly left, leaving only Dry Bone and Baby Ghost behind.\n\n“Dry Bone, you aren’t going to kill him, are you?” Baby Ghost asked.\n\nDry Bone answered, “Mister Immortal needs people. If that human is this strong, killing him means I am working against Mister Immortal. Of course I won’t kill him.”\n\n“What about Qing Jun? It sounds like she wants you to kill him,” Ghost Baby said.\n\nDry Bone said, “It has been twenty years. She is still unable to get over that business with the humans. I won’t adhere to her command. And besides, if the human really is king-class in strength, I wouldn’t be against having him sit on this same table as us.”\n\n“And if he is not as strong as we have been led to believe?” Baby Ghost asked.\n\nDry Bone laughed until his bones creaked, and then he said, “Then I don’t mind helping the mistress out.”\n\nHan Sen waited in the shelter overnight. Eventually, a king spirit came to see him and bid that he go to the nearest Martial Hall.\n\nMany creatures and spirits had gathered there already. They all looked on Han Sen with grand curiosity, eager to see whether or not a human might actually be able to reach the fifth floor.\n\nA giant skeleton, clad in bone armor, stood inside the arena awaiting his combatant. He was four meters tall and looked frightening. His eyes were like red gemstones that were alive with an evil flame.\n\nHan Sen entered the arena and observed his opponent. It was a skeleton, but not creamy and dusty like the average one. Its bones looked to be composed of jade, and they glowed.\n\nThe bones of the skeleton had no gaps in between the joints, and it looked like a fire-forged warrior, straight from the pits of hell.\n\n“You are the human who wants to enter the fifth floor.” Dry Bone examined the human before him, wondering whether or not he had the king-class power he was expecting.\n\nAs the red eyes peered at Han Sen, their brightness faded to indicate disappointment. His eyes were able to read Han Sen’s fitness level.\n\nHan Sen had the strongest fitness he had ever seen a human possess, and he was leagues ahead of every other human.\n\nBut it still wasn’t in the realm of strength a king-class spirit possessed.\n\n“With a fitness level like that, I doubt he’s of the strength Mister Immortal is looking for. I suppose I’ll just have to do Qing Jun a favor,” Dry Bone King thought to himself.\n\n“Yes,” Han Sen answered.\n\nDry Bone King wasn’t going to waste any more time on Han Sen than he had to. He clicked his fingers and said, “If you can last half an hour, you pass the test.”\n\nAfter that, Dry Bone threw a punch towards Han Sen. The shockwaves it unleashed gave the punch the feeling it could sunder a mountain."
}