{
    "chapter": 2938,
    "title": "Sacred Leader That Cannot Be Replaced",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2938",
    "text": "Han Sen looked at Nine Thousand King and did not say anything. If Sacred really did have such a place, even a scary fight like that could not be held at bay. If so, Sacred would not have disappeared down the river of time.\n\nNine Thousand King had an expression that implied he understood what Han Sen was thinking. He coldly laughed. “This place is where the Sacred people lived. Even God Spirits cannot access that place. For Sacred to rule the whole world and kill countless God Spirits and remain standing for billions of years, it was all because of that palace. Even God Spirits could do nothing more than look at it. If the elites in Sacred were still there back then, they would be in that palace even now.”\n\n“The race called Sacred, aside from Sacred Leader and his sister, who else is still there?” Han Sen asked.\n\n“I have answered your questions,” Nine Thousand King said.\n\n“You still have not told me where this Sacred palace is, so you have not answered me,” Han Sen said.\n\n“Right now, Sacred is already like this. It is already messed up. How am I supposed to know where the palace is?” Nine Thousand King coldly grunted.\n\n“That means you did not really answer all of my questions, so it does not matter if you answered any of them.” Han Sen frowned.\n\n“Do you want to break your promise to me?” Nine Thousand King’s face grew dim.\n\n“Indeed, I am. You don’t know if the flesh is truly Holy Kirin’s. You don’t know the name of Sacred Leader’s sister, and you don’t know where the race palace is. What is the point of you giving me useless answers?” Han Sen and Nine Thousand King had a staring contest. Neither of them relented.\n\n“It looks like you weren’t committed to upholding the promise whatsoever.” Nine Thousand King was a bit angry. The eye of the dark green armor was starting to open. The outline of the eye was glowing with a weird green light.\n\n“It is not like that. The answers you gave me are useless. I am sure you are aware of that. How about this? If you answer a question about Sacred, then this is yours.” Han Sen pointed at the pavilion while he spoke.\n\nNine Thousand King’s eyes were flickering. He looked murderous. He stared at Han Sen for a while and coldly said, “If I answer this question and you’re still yanking my chain, even at the risk of destroying this garden, I am going to mop the floor with you!”\n\n“We crystallizers keep our promises,” Han Sen said. “All you have to do is answer me.”\n\n“The Sacred race only has Sacred Leader. There was nobody else. Are you happy now?” Nine Thousand King walked toward the pavilion.\n\n“Hang on. That’s not right,” Han Sen said as he stopped Nine Thousand King’s advance. “Sacred Leader had a little sister. How can the Sacred race only have one person? Your answer is hilariously fake.”\n\n“Who said Sacred Leader’s little sister was from the Sacred race?” Nine Thousand King coldly laughed before saying,” Sacred Leader is a unique existence in this universe. The sole being of his kind. Another does not exist that can be considered a part of the Sacred race.”\n\n“What you say is very contradicting. Is that lady not Sacred Leader’s biological sister?” Han Sen frowned. He looked at Nine Thousand King’s face, but it did not seem as if he was lying.\n\nIf he was going to lie, he could easily lie about how many people were in Sacred. He could have made up names and numbers because Han Sen had no way of verifying the information. Instead, he had given Han Sen that strange answer.\n\n“She was his biological sister, but the Sacred race only had Sacred Leader. That is all I know, believe it or not.” Nine Thousand King did not say anything more. He approached the stone pavilion. If Han Sen was going to stop him, he was just going to fight.\n\n“I will keep my word. The thing in the pavilion is now yours.” Han Sen picked up Bao’er and left the stone pavilion.\n\nThe nine-eyed sword was broken. The power affecting the eyes of the big and small goldfish and Yang Yun Sheng was now gone. They were no longer damaged, but Yang Yun Sheng’s eyes, which had exploded, could not be recovered.\n\nHan Sen was not an enemy of Yang Yun Sheng. Since he had a grudge against the Extreme King, he was not going to fix him. They left the pavilion and watched Nine Thousand King enter it.\n\nHan Sen wasn’t leaving the pavilion because he wanted to keep his promise. It was because the stone pot was too weird. He and Bao’er had eaten all the meat inside it, but more meat had appeared.\n\nHan Sen’s deified genes had increased for a time, but that progress had been removed. It was hard to believe. So Han Sen wanted to see how Nine Thousand King dealt with it. At that point, maybe he could fight him.\n\nHan Sen only said he would let Nine Thousand King take the treasure. He never made a promise not to rob him.\n\nUpon seeing Han Sen leave, Nine Thousand King looked happy. He did not want to fight Han Sen. It was good for them to avoid a battle.\n\nNine Thousand King walked in front of the stone pot and reached out his hand. A chunk of meat from the pot went flying out of the water and into his hands.\n\n“It really is the flesh of the Holy Kirin.” Nine Thousand King examined it. He excitedly swallowed it.\n\nAfter he ate it, Nine Thousand King’s eyes turned bright. It looked as if he had received some benefits from it. Suddenly, Nine Thousand King opened his mouth. He faced the stone pot. The meat and soup in the stone pot all went flying into his fat gob. Nine Thousand King ate it all within a few seconds.\n\n“Ha! Ha! The Holy Kirin’s blood really is legendary.” Nine Thousand King was cackling. Clearly, that pot of meat had provided him many benefits.\n\nHan Sen was just watching. He did not see anything strange. Nine Thousand King had eaten it all the same way he did. He had merely just done it faster.\n\n“You guys, since you kept your promise, are okay. I will let you go for now.” Nine Thousand King left the pavilion. He was going toward the holy garden’s back door. He was going to explore the holy garden.\n\nThey watched Nine Thousand King reach the back door. He opened it and left the place. Han Sen ignored Nine Thousand King and looked at the stone pot on the table. He wanted to see if the meat in the pot appeared again.\n\nHan Sen heard suddenly some footsteps from the holy garden’s gate. He frowned and asked, “Who is coming now?”\n\nWhen Han Sen turned his head to take a look, he was frozen. The person who emerged from the holy garden’s gate was Nine Thousand King, who had just left via the back door.\n\n“Why are you back again?” Han Sen asked with confusion. The back door and front door should not have been connected. It was unknown how he had come back so soon.\n\nNine Thousand King was confused too. “Weird. I left through the back door. Why have I come in from the front door?”\n\nHan Sen was shocked by his words. He went to look at the stone pot. He immediately had goosebumps. Within the blink of an eye, the meat and soup that Nine Thousand King just ate had returned.\n\nHe saw the pot was boiling with the meat inside. It smelled really good. That scene was supposed to be a delicious one, but Han Sen only felt an icy chill.\n\n“What is going on here?” Han Sen was confused."
}