{
    "chapter": 2207,
    "title": "Test Results",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2207",
    "text": "The final test was the geno tree. Han Sen stood before it and cut his finger. He let a droplet of blood fall onto the geno tree.\n\nAs everyone watched Han Sen’s blood fall onto the geno tree, Night River King stared at Han Sen intently. He wanted to make sure that Han Sen didn’t try to cheat his way through this too.\n\nThe geno tree could accurately gauge one’s geno power. It was very precise. If Han Sen let his own blood fall onto the geno tree, it would bloom with a number of flowers that was equal to his strength.\n\nHan Sen had spent some time researching the geno tree, and he had discovered some interesting things.\n\nThe operation of the geno tree turned out to be quite simple. The geno tree was like a gasoline-operated generator, and the genes in a person’s blood were like gas. The more gene power a person’s blood possessed, the more electricity the geno tree could generate. In the case of the tree, there’d be more flowers.\n\nHan Sen’s geno power was much stronger than the average Marquise’s. Ordinary Marquises could generate up to a hundred thousand flowers.\n\nHan Sen believed his own power would easily open a few hundred thousand flowers.\n\nIf Han Sen wanted to be disqualified, he would have to reduce the number of flowers that bloomed. This was a task that no ordinary creature could accomplish because success wouldn’t depend on strength.\n\nEven deified elites couldn’t change their own genes. Or at least, if people like that did exist, there were very few of them. When the deified Buddha called Burning Lamp Alpha had turned Han Sen into an ant, he had demonstrated a rare gene-changing power.\n\nHan Sen’s Blood-Pulse Sutra could change the messaging of genes, but Burning Lamp Alpha’s geno art was quite different. The Blood-Pulse Sutra primarily controlled its own genes. It couldn’t change the genes of another creature, like Burning Lamp Alpha’s shapeshifting technique.\n\nIt wasn’t difficult for Han Sen to use the Blood-Pulse Sutra to control the genes in his own blood. He had tried doing this once before.\n\nNight River King watched Han Sen’s drop of blood fall onto the tree. And when that occurred, life crept over the barren tree as flowers began to bloom.\n\nAs the flowers grew, it was like watching a wind rustle through a meadow of a few thousand flowers.\n\nBut when the flowers stopped blooming, Night River King’s eyes opened wide. He screamed, “A mere ten thousand flowers? Impossible!”\n\nThere was no way that Han Sen’s blood would only produce ten thousand blooms. Even the weakest Marquise could earn ten thousand flowers, but everyone knew that not even the strongest Rebate Marquises could defeat Han Sen in combat.\n\nIce Blue Knight King didn’t look surprised. After all, the results aligned with the results of the other tests.\n\nIce Blue Knight King thought Knife Queen must have taken Han Sen as a student because of his work ethic, but his talents and powers were still poor, no matter which way you cut it.\n\nThe sole purpose of the Ice Blue Knights was to fight. They were not a school, so Ice Blue Knight King gave up on the prospect of hiring Han Sen. If Han Sen lacked power, then it didn’t matter if he was Knife Queen’s student. The Knight King wouldn’t allow any talentless person to join the Ice Blue Knights.\n\nIt would be irresponsible to the other knights he commanded, and on top of that, it could put Han Sen himself in danger.\n\nSeeing Han Sen walk away from the testing platform, Night River King looked sick. He firmly believed Han Sen had cheated. Even so, he watched Han Sen’s blood fall on the tree with his own eyes. He knew there should have been no way for Han Sen to cheat. His face turned red in frustration as he thought furiously of ways that he might stop Han Sen.\n\nHe didn’t dare to declare that Han Sen was cheating, though. Saying something like that would draw too much attention. If he asked for Han Sen to be tested again, and Han Sen was able to do the same trick that “proved” he wasn’t cheating, then Night River King would be showing disrespect to Ice Blue Knight King.\n\nMoon Wheel King was shocked, too. He didn’t know how Han Sen had deceived the geno tree.\n\nHan Sen, meanwhile, acted depressed. He looked up to the skies and let out an elongated sigh. He left the platform with slumped shoulders and returned to Planet Eclipse. On the way, he thought with satisfaction, “Now I don’t need to go to the Extreme King.”\n\nThe final tests of the day ended. In the end, only two of the Rebate had managed to pass. But Ice Blue Knight King wasn’t happy about this. After perusing the day’s reports, he sighed.\n\n“Why do you sigh?” Mister White asked Ice Blue Knight King with a smile.\n\nIce Blue Knight King displayed a wry smile. “I can barely believe that a person like Knife Queen was willing to take a student like that. So ends the lineage of Teeth Knife. I will never watch that incredible knife skill get used again.”\n\nMister White smiled and said, “If you’re feeling sad about that, there is no need.”\n\n“What do you mean?” Ice Blue Knight King asked in confusion.\n\nMister White smiled and said, “That is because Knife Queen has an excellent student. He might one day surpass the woman herself.”\n\nIce Blue Knight King stared at Mister White blankly. Surely Mister White couldn’t have been complimenting Han Sen on the terrible exhibition they had both just witnessed.\n\n“You mean, she has another student?” Ice Blue Knight King asked, grasping for an explanation.\n\n“Come and take a look at this.” Mister White gestured to a monitor that was scrolling through data.\n\nAs Ice Blue Knight King looked at the screen, the expression on his face slowly morphed. After a while, he raised his head and squinted his eyes at Mister White. “I got played.”\n\nHan Sen had trained in Sky Palace, fought the greatest Marquise there, and been labeled the knife and sword master; there was no way he only possessed ten thousand flowers of strength.\n\nSky Palace could never have gained such fame if it produced students as weak as that.\n\nMister White thought for a moment and said, “Maybe he has his own troubles that are keeping him from coming along with us freely.”\n\n“I don’t care what his reasons are. He is mine,” Ice Blue Knight King grunted. But after a while, he smiled and said, “This guy is good. He had me completely fooled. His personality is different than Knife’s, that’s for sure. I am surprised she selected a student such as that.”\n\n“Let’s find out why he doesn’t want to join the Ice Blue Knights first,” Mister White said.\n\n“That’s simple. We’ll just ask him,” Ice Blue Knight King said with a shrug.\n\nTogether, Ice Blue Knight King and Mister White snuck onto Planet Eclipse. There, they found Han Sen hosting a barbecue in the company of many ladies and beasts. He was talking and laughing with those around him, and he didn’t look sad at all. It looked like a party."
}