{
    "chapter": 2330,
    "title": "Understanding the Statue",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2330",
    "text": "Because King Bai was still around, his statue was sealed. Treasure seekers would have to wait until he had passed away before his statue was revealed in the Pavilion.\n\nThe statue wasn’t being shown right then to avoid giving his children the opportunity to crack the statue. Why that would have been a bad thing, the stone didn’t say. As a result, Han Sen didn’t understand.\n\nThe last king before King Bai was called King Bao. Not much was written about him, just a few words that looked like default-text instead. He had beaten a race and expanded the breadth of the Extreme King’s domain, but the name of the race he had beaten wasn’t even listed.\n\nThe expanse controlled by the Extreme King had been maximized during the reign of King Bao, so there wasn’t much room left for them to develop nowadays unless they could defeat the Very High or Ancient God. There was nothing else King Bai could do.\n\nIn fact, the twenty kings before King Bao were all fairly boring. They maintained the Extreme King’s power and developed fairly slowly.\n\nBut those other king statues had all been claimed. This boring and normal king statue hadn’t been cracked, though.\n\nAlthough the King Bao statue was the latest to show up, not many had attempted to understand it. Its plain look might have been why, even though King Bai was known to have some genius kids, like Bai Wuchang and Bai Ling Shuang. They were geniuses with a vast array of talents. Bai Wei was talented, as well, but she lacked fame. There were many royal children of greatness, just hidden away like that. If they didn’t have what it took to claim the King Bao statue, then it had to be special.\n\nHan Sen looked at the three statues. He was unable to use his Purple-Eye Butterfly to get a close-up examination of them. He would need to use his own senses. Plus, no matter how many Pavilion Passes a prince got ahold of, they could never come back once they claimed a statue.\n\nBai Wuchang had tried to open the alpha statue before, and he wasn’t the only prince that had tried.\n\nHan Sen turned toward the strange face of the alpha statue. “I’ll give this one a try.”\n\nEach statue had a different atmosphere, but Han Sen felt his attention being snared by the gourd that the alpha king was holding. Han Sen couldn’t tell if that was a good thing or a bad thing.\n\nPerhaps because of Bao’er, Han Sen cared a lot about things that resembled a gourd.\n\nKing Bao’s name had a Bao in it, but he didn’t have any weapons or interesting items in his hands. He looked so poor, and so that wasn’t what Han Sen wanted.\n\nKing Wen didn’t suit Han Sen’s style. Only the alpha king interested Han Sen.\n\nHan Sen sat down before the alpha king statue and looked up into the man’s eyes.\n\nFor some reason, the oppressive aura of the statue felt different when he was sitting down.\n\nIf Han Sen looked at the statue while he was on his feet, the statue appeared beautiful and intricately carved. When he sat on the floor, however, it seemed as if the statue was truly coming alive. It was like a living king was standing in front of him, looking at Han Sen with what appeared to be a smile. The emotions it inspired were completely different.\n\nHan Sen was shocked. He moved a little on the stone and looked at the statue again. The statue was back to normal. It didn’t look alive anymore.\n\nHan Sen changed spots a few times, but the results were the same. He could only see the statue’s living-type aura when he sat directly in front of it.\n\nHan Sen ran to King Wen and King Bao’s statues. They were all the same. Only sitting on the stone allowed him to detect the feel of the statues.\n\n“These king statues are amazing. I wonder how they do that.” Han Sen sighed. He returned to his seat in front of the alpha king’s statue and analyzed the feelings inspired by the statue.\n\nWhen he looked at the alpha, a strange feeling settled over Han Sen. King Wen and King Bao’s statues gave Han Sen the feeling that he was sitting before a god and a devil, respectively. They thrummed with strength that could rattle the whole universe, and the things they knew were very mysterious. It was like even the folds of their sleeves were jam-packed full of knowledge.\n\nThe alpha king was different, though. He was holding a gourd, and it looked as if he was smiling. He looked like an elderly neighbor who would sit outside the door smoking. He didn’t look like an all-powerful tyrant. Han Sen didn’t know if his mind was playing tricks on him, but Han Sen thought the old man’s eyes looked rather horny.\n\n“This alpha king is very interesting,” Han Sen thought curiously. He carefully inspected the whole body, not willing to overlook a single part.\n\nBut no matter where he looked, Han Sen couldn’t discern anything meaningful from it. The statue had a spirit, but there was no sense of godly might. It was just very plain.\n\nKing Wen and King Bai’s statues elicited feelings that were scary to experience. Alpha king’s feelings were very weak by comparison. It was difficult to understand.\n\nHan Sen sat in front of the statue for a whole day, but he was unable to learn a single thing. He frowned. He didn’t know if he should give up on the alpha king, as King Wen and King Bao had enticing amounts of power.\n\nBut Han Sen really cared about the gourd. He hesitated and stopped looking at the alpha king. He turned his attention to focus on the gourd instead.\n\nHan Sen looked at it for a while, and he soon felt something weird.\n\nBefore, when Han Sen looked at a statue, he had focused on the king himself. The gourd was just an accessory, so there was nothing special to glean from looking at it.\n\nBut if he changed his perspective to center on the gourd as the primary aspect of the statue, then the king was actually the accessory, and things looked very different.\n\nThe children of the Extreme King were full of pride. They carried pride in every part of their lives, but it centered on their ancestors. They always showed them a great deal of respect. No one would even consider that the alpha king was just an accessory or a slave to the gourd.\n\nHan Sen was an outsider. He wasn’t one of the Extreme King, so he didn’t share their thought processes. He really took the gourd seriously. He looked at it as if it was far more than a trinket, and by doing so, the entire statue took on a different meaning. It was as if he was stepping through a gate into a new world.\n\nAs Han Sen channeled his focus into the gourd instead of the king, his emotions changed entirely.\n\nRealization slowly dawned on his face. The more he watched the gourd, the more familiar he thought it was. It looked like Bao’er before she was born.\n\n“No way! The Extreme King alpha is holding a gourd, and the gourd is a statue of Bao’er before she was born?” Han Sen thought in complete shock.\n\nHan Sen determined that the gourd was indeed Bao’er. The meaning of the gourd became clearer. A mysterious air began to spread, and it looked as if it was wrapping Han Sen up inside it.\n\n“This gourd statue, it cannot be Bao’er who created it, surely.” Han Sen continued to stare at the statue, his expression cycling rapidly through emotions."
}