{
    "chapter": 1002,
    "title": "Mystic Valley",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1002",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBao’er sat upon a branch of the tree with a fruit in her hands. Then, she took a big bite. A lot of juice flowed out of the fruit, and it emitted a pleasant fragrance.\n\nBao’er ate the fruit whole in a few more bites. Then she licked her lips and immediately went for another.\n\nShe climbed further up the tree and collected as many as she could carry. She stuffed her face with the fruit, all the while saying, “Daddy, come and eat the fruit!”\n\nDismally, Han Sen thought to himself, “If only I could be so carefree. Unfortunately for me, I have monkeys to deal with first.”\n\nHan Sen was not currently in the mood to eat, and there were at least a thousand monkeys with their eyes fixed upon Bao’er as she munched their food.\n\nThe monkey king made an appearance, and after it noticed her, and it yelled at her in its simian tongue. All the monkeys began hopping and jumping about in excitement.\n\nThe monkey king was glowing blue, and it jumped towards Bao’er.\n\nHan Sen immediately grabbed Bao’er away from the tree and activated his Dongxuan Aura. But this time, the monkey king seemed immune to the seventh sense-stifling effects. It came directly towards Han Sen, without pause or confusion.\n\nNeeding an extra kick, Han Sen activated Jade-Sun Force and Long Live to speed up and evade the incoming attack.\n\nThe monkey king was incredibly powerful, and if Han Sen didn’t use his super king spirit mode, he wasn’t sure if he’d emerge victorious.\n\nHan Sen was far slower than the ape, as had already been established. But he was fortunate to have the geno trees all around. They were basically sacred to the monkeys, and the last thing the monkey king wanted to do was destroy those trees in a rampage. Acknowledging this, Han Sen was able to use the trees for protection.\n\nBao’er swallowed the last morsel of fruit she had collected, and she looked bloated. She reclined in Han Sen’s arms, satisfied, without concern for the horde of furious monkeys.\n\nDucking and weaving, Han Sen was getting chased all over the place by the monkey king.\n\nThey ran across the valley for a long time, but then, Han Sen stumbled across a wine jug that had been crafted from jade.\n\nHalf of the pot was in the soil, and only its rim and lid were exposed above the earth.\n\nThe reason it stood out to Han Sen, and why the wine jug was most curious, was the fact that it was ten meters tall. He could not fathom what sort of being would use it to pour wine for themselves.\n\n“Do humans or spirits reside here, I wonder?” If he had to take a guess, Han Sen thought it would most likely belong to a spirit. He didn’t think humans could make use of a ten-meter-tall wine jug.\n\nBefore he could admire it more, though, the monkey king was closing in. In the nick of time, Han Sen evaded the attack. But when he did so, he took notice of a giant stone bowl in the ground.\n\nThis shocked Han Sen, as well. They were curious items, and yet, they were all half-sunk into the ground.\n\nThere was a forty-meter-tall cauldron in the area, too. It was all rusted, but there were several dings in the area, also.\n\nIt was strange. Everything in the area was significantly larger than they should have been, and even the smallest cup was a few meters tall.\n\nHan Sen wondered how long they had been here, but signs pointed to it being a long time. All the wares there were caked in dust.\n\nThe items had also been crafted either out of jade or copper. And whereas the jade items were doing perfectly fine with the advance of time, the copper wasn’t faring so well. The copper wares had rusted, and were clearly in a state of decay.\n\nHan Sen ran the length of the valley, from end to end. He could not detect the presence of a single human or spirit there, but now, he had been trapped. He had backed himself into a corner, which proved to be a dead end, and he had no way out.\n\nThe monkey king was still in pursuit, and it was drawing near. It came for Han Sen with blistering speed, gleaming with a blue light all the while.\n\nHan Sen jumped into the air, wishing to fly up and above the rabid ape.\n\nBut the monkey king jumped and tried to attack Han Sen. Fortunately for Han Sen, he was adept with airborne maneuvers, and he was able to sidestep in the air to evade the monkey’s fist. As he did so, he called out to the monkey, “Haha, Chunky Kong! I can fly; I bet you can’t do that.”\n\nThe monkey king did not look angry, though. It looked happy, and a grin formed on its face. It seemed as if it was the monkey was now laughing at Han Sen.\n\nThere was clearly something amiss, and Han Sen felt it. But even with his Dongxuan Aura active, he could not sense what had brought on the aura of unease.\n\nHaving almost exited the valley in flight, Han Sen felt as if he hit a wall. Brought to a sudden stop, he fell back down with Bao’er.\n\nHe reactivated his flight and dodged the monkey king, who had come over for a follow-up attack.\n\nHan Sen maintained his position, but could not see what had brought his earlier flight to a sudden stop.\n\nLooking up, there was no wall or fogged-object that he might have accidentally bumped into.\n\nHan Sen flew up to where he hit something solid, but this time, he went slowly. He felt as if he was coming into contact with an invisible wall, and when he reached out to touch it, it bounced him away.\n\n“What sort of power has created this invisible, skyborne hurdle?” Han Sen tried exiting the valley from another portion of the sky, but he was met with the same results there.\n\nAll the while, the monkey king continued attacking while Han Sen dodged. It had been going on for some time now, though, and he knew he could not keep it up much longer.\n\nHan Sen decided to fall back to the tunnel he had entered the valley from, but strangely, it had disappeared.\n\nHe punched where he believed the cave had once been, and the power of his strike was deflected back into him. There was a lot of power in that fist, and Han Sen ended up making himself bleed.\n\n“Holy sh*t! Where the h*ll have I ended up? What is this place?!”"
}