{
    "chapter": 1250,
    "title": "Too Powerful",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1250",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBao’er sat on the grass drinking milk. She was a few years old by now, but her appearance hadn’t changed at all.\n\nHan Sen did not know whether she was simply slow to develop, or if she’d be like this forever. Regardless of what her circumstances were, he was determined to take care of her.\n\nHan Sen was going to wait until dark. If the two people he expected to see did not arrive, he’d attempt to sneak into the shelter with the Night Cloak.\n\nWithin the hour, though, Han Sen noticed a ship approaching the shore from across the river. He stood up to take a better look. It was white, and it moved incredibly quickly.\n\nWhen the ship neared, though, Han Sen’s face changed and he looked ill.\n\nThe ship was made out of bone. It had a bone mast, and the sails had been crafted from animal hides. Of course, such a ghastly ship wouldn’t scare Han Sen. He had encountered far more nerve-wracking horrors in his time.\n\nWhat most rattled Han Sen about this scene, however, was the presence of a human at the front of the ship. At the bow of the ship stood a cross, and there was a man crucified upon it.\n\nThe man seemed to be of old age, although his treatment had undoubtedly made him seem more withered than he might have actually been. He had been stripped naked and pinned to the cross.\n\nHe was fastened to the cross by thick, crude nails that had also been forged from bone. They had been driven deep into his arms and feet. The old man looked to be great agony, but he knew moving would only incite more pain. Thus, he moaned softly, but he remained still.\n\nBlood ran down his body and the cross like monstrous veins. Han Sen thought he was having a sneak peek at the gallows in hell.\n\nHan Sen knew many humans were suffering in the Third God’s Sanctuary, and their numbers might even outweigh the amount of those who were happy and in good condition. But this was a cold reminder of reality. This savagery had become just a simple fact of existence there, and now it had been reinvigorated and put on display in front of Han Sen. It made him angry, and it was fanned by the flames of frustration, knowing there was nothing he could do right now to help the man.\n\nHan Sen gritted his teeth and swallowed the bitter pill of knowing he could not be of aid.\n\nHe couldn’t risk exposing his presence there, and even if he did try to save the old man, any enemies that might have been on-board could kill the man and prevent Han Sen from getting what he wanted.\n\nFurthermore, if Han Sen was unable to remove the contract that bound the man, even after a successful rescue, he’d be killed before Han Sen could return him to the Alliance.\n\nThe old man then saw Han Sen, and after, the boat steered in his direction. It was as if the boat was obeying some manner of mind-control.\n\nThe old man looked to be in pain and said, “Young Man, do you hail from another shelter?!”\n\n“Yes,” Han Sen said.\n\nThe old man looked happy, and the faint presence of a smile crept courageously back onto his face. He asked, “Are you free? Can you return to the Alliance?”\n\nHan Sen nodded and said, “Yes, I can go back. What is your name?”\n\nSeeing that old man, Han Sen was really reminded of how lucky he was to be free in the Third God’s Sanctuary.\n\nThe old man replied, “My name is Xue Yucheng; can you take a message to the Xue family for me?”\n\n“Okay,” Han Sen answered.\n\n“Please, tell them to hurry here quickly.” Xue Yucheng still looked to be in a lot of pain, and his words trembled out of his lips as he spoke.\n\nXue Yucheng went on to say, “Xue Chen is still trapped in Blood River Shelter. They need to find him, because our stuff is in his hands.”\n\nHan Sen thought he had been asked to save two family members, but with what he had just been told, it seemed as if there was an important item the family wanted to have returned.\n\n“Okay, and what is all this? Why have you been… put on display like this?” Han Sen asked.\n\nXue Yucheng said, “This boat can patrol the river. In order to operate, it requires a driver. I am its captain.”\n\n“You drive it like this?” Han Sen frowned.\n\nXue Yucheng sighed and answered, “A powerful spirit or people who have been given the authority are the only ones who can drive it. I am a weak human, lacking the trust of spirits. This is the only way I am able to drive it. I am doing this in the hopes I can send a message home.”\n\nHan Sen felt so angry, learning that the spirits did not trust him. Because of that, the man had to operate the boat in constant agony.\n\nHan Sen knew humans were the weakest in the Third God’s Sanctuary, but he was still mad over their unfair mistreatment at every corner.\n\n“You have to take this message home. The Xue family will reward you handsomely. Now go. Go before the creatures notice you.” Xue Yucheng steered the boat around, ready to leave.\n\n“Hang on; can you tell me how many king spirits and super creatures reside in that shelter?” Han Sen asked.\n\nXue Yucheng responded, “There are two king spirits. One is Blood River King, the other is Yaksha. There are seven super creatures residing there, also. Tell my family to come, reclaim the stuff, and go.”\n\nHan Sen was shocked. The last time he saw Yaksha had been during Xiang Yin’s ascension.\n\n“Nice. That’s one loose-end that needed tying up a long time ago. I can only hope his spirit stone is here, as well,” Han Sen thought to himself.\n\n“Do you know how powerful they are?” Han Sen asked.\n\nXue Yucheng replied, “It does not matter. Fighting them would be a futile endeavor.”\n\nAfter that, Xue Yucheng drove the boat away. As he sailed across the red water, Han Sen heard him whimpering and moaning in pain."
}