{
    "chapter": 2447,
    "title": "Fang Qing Yu",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2447",
    "text": "The pirates all stood in a line, still chilled and shivering. They stood meekly before Bao’er, listening attentively as she scolded them.\n\n“From now on, you guys are the deckhands of the white whale. You’ll be a cleaner… And you, a servant…” Bao’er gave them jobs, and the pirates all nodded as they were given assignments. They had been tamed, and none of them dared to refuse to do as they were told.\n\nTheir eyes sometimes wandered to the little red bird sitting atop Bao’er’s shoulder, and the sight of it would send another involuntary shiver through them.\n\nTen minutes before, the little bird had burned a sixth-tier Destroyed King to nothing more than charcoal. There was too little of him left to even be considered cooked meat.\n\n“Brother Fang, you should really leave now. Following me will only put you in more danger,” Han Sen said to Fang Qing Yu.\n\nFang Qing Yu shook his head. “Brother Han, the Tianxia System isn’t a place a Marquise can make a living. How long do you think I could survive out there?”\n\nAfter that, Fang Qing Yu pulled something out of his pocket. He set it down in front of Han Sen. With a slight smile, he said, “Brother Han, do you remember this?”\n\nAfter Han Sen got a good look at what Fang Qing Yu was holding, he was confused. He didn’t recognize the item.\n\nThe item looked like a common, three-by-three, six-sided Rubix cube. Nine squares occupied each face.\n\nBut unlike a normal Rubix cube, each square on this cube contained a strange image. Each image was like a small painting of a place that Han Sen had never been before. Some of them showed starscapes, whereas others showed mountains and rivers. Others simply showed off rooms or palatial halls.\n\nWhen Fang Qing Yu looked at Han Sen’s face, he realized that Han Sen didn’t recognize it. He smiled and said, “This is the Wanjie Rubix Cube; it is a xenogeneic treasure from the Thousand Treasures. Everyone who has a Wanjie Rubix Cube can contact others with a Wanjie Rubix Cube. You can even use video. To simplify this for you, the Wanjie Rubix Cube is like a phone. But it is a xenogeneic treasure, so you don’t need a signal. You can communicate through space without being affected by magnetic storms.”\n\n“This is a powerful tool. If you have a treasure like this, you can ask your family or friends to come pick you up, right?” Han Sen said.\n\nFang Qing Yu smiled wryly. “Brother Han, I’m not showing this to you so that I can leave. I am a member of the Thousand Treasures Alliance. Although the Alliance isn’t considered a part of the Thousand Treasures race, we have the same level of authority as the Thousand Treasures. My Wanjie Rubix Cube can connect to other members of the Thousand Treasures. They can see everything I see.”\n\n“What does that mean?” Han Sen frowned.\n\nFang Qing Yu quickly waved his hand and said, “Don’t misunderstand me, Brother Han. The Wanjie Rubix Cubes need to be activated for others to see my image. Right now, it is not open and so no one will know anything about what is going on here.”\n\nAfter pausing, Fang Qing Yu went on to say, “Your battleship is incredible—it can even travel through the Tianxia System unimpeded. The Thousand Treasures want every treasure, including rare items in dangerous places like the Tianxia System. There are so many items in this system that most people couldn’t tell what is valuable and what isn’t, but with the Wanjie Rubix Cube, we could send images back to the Thousand Treasures. They could identify what is worth taking and what isn’t. If they see something that they want, they will pay a high price for the items you bring back to them.”\n\nHan Sen smiled and said, “Brother Fang, I’m afraid you don’t know my situation.”\n\n“I know you are Knife Queen’s student.” Fang Qing Yu looked at Han Sen with a modicum of confusion.\n\nHan Sen waved his hand to interrupt him. He smiled and said, “You can use your Wanjie Rubix Cube to contact your Thousand Treasures friends, and perhaps, they might let you know a thing or two about me, as well.”\n\nFang Qing Yu looked confused, and so he turned on his Wanjie Rubix Cube. In one of the squares, another member of the Thousand Treasures appeared. Fang Qing Yu spoke to him, and his expression became increasingly apprehensive as the conversation went on.\n\nWhen the conversation was over, Fang Qing Yue turned and stared toward Han Sen for a long moment. A while later, he muttered, “Brother Han, are you not afraid that I will expose your location?”\n\n“What is there to be afraid of? The Extreme King must already be in the Tianxia System by now, so it doesn’t really matter,” Han Sen said with a shrug. “Now you should understand why I don’t want to bring you along. I cannot do the things you want me to, like stopping and collecting treasures along the way.”\n\nFang Qing Yu’s eyes brightened as he looked at Han Sen. “If that is true, you should definitely take me with you.”\n\n“Why?” Han Sen asked in surprise.\n\n“Brother Han, I know you only want me off the ship so I don’t get pulled into this, which was a kind thought. Also, I’m carrying a Wanjie Rubix Cube. You probably think that if I go with you, I might expose your location, and the Extreme King might have an easier time following you,” Fang Qing Yu said.\n\n“I’m glad that you understand,” Han Sen said.\n\nFang Qing Yu shook his head. “But I also think you are wrong.”\n\n“How so?” Han Sen looked at Fang Qing Yu with interest.\n\n“My presence might expose information about your escape, but that sort of exposure isn’t necessarily a bad thing,” Fang Qing Yu said seriously. There was no humor in his expression.\n\n“What does that mean? I really don’t understand,” Han Sen replied.\n\nFang Qing Yu set the Wanjie Rubix Cube in front of Han Sen. “You can take the Wanjie Rubix Cube, and you can decide whether you want to turn it on or off. Or you could just throw me off the ship. But I must tell you that if you allow me to stay, I will expose your location with the Wanjie Rubix Cube. And I will take loads of photos.”\n\n“Fang Qing Yu, are you tired of living? Others might be afraid of the Thousand Treasures, but do you think a guy who disguised himself as a prince of the Extreme King would care about the life of some snot-nosed Thousand Treasures member?” Elysian Moon snorted in derision.\n\n“Keep talking,” Han Sen remained focused on Fang Qing Yu, and he didn’t seem upset.\n\n“Calm down, Elysian Moon. What I have said makes sense. I’m not selling Brother Han out.” Fang Qing Yu paused. He looked at Han Sen and said, “Brother Han, you are escaping to Sky Palace, yes?”\n\n“Yes,” Han Sen answered immediately. He had never planned to hide the fact that Sky Palace was his destination. Otherwise, he wouldn’t have let Miss Mirror know where he was going.\n\nIn fact, he wanted everyone to know he was going to Sky Palace.\n\n“If I’m understanding the situation correctly, Brother Han, you are going through the Tianxia System to reach the systems of chaos in order to get to Sky Palace?” Fang Qing Yu asked.\n\n“That is correct.” Han Sen nodded.\n\n“In that case, you should let me film this. And do it in HD quality.” Fang Qing Yu sounded really excited."
}