{
    "chapter": 187,
    "title": "A Cave",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_187",
    "text": "Once he had shapeshifted into a fairy queen, Han Sen felt the world had slowed down. All the mutant black-feathered beasts seemed to act in slow motion.\n\nSeeing the first mutant beast approaching, Han Sen held his hands down on it and jumped over its head, his dagger cutting its throat.\n\n\"Mutant black-feathered beast killed. Beast soul of mutant black-feathered beast gained. Eat its meat to gain zero to ten primitive geno points.\"\n\nHan Sen was not moved at all by the voice. Without a pause, he stepped on a mutant beast and sent it down to the ground.\n\nWith this step, Han Sen instantly reached another mutant beast. beheading it with his dagger, he turned to push another beast to jump up and dodge the blow from two other beasts.\n\nHuangfu was shocked by Han Sen’s ghostly move in the air.\n\nHis smooth movements and killing made it hard to believe that he was human. At least Huangfu had never seen anyone who could accomplish this in First God’s Sanctuary.\n\n\"I have never heard of such a person in Steel Armor Shelter.\" Huangfu thought Han Sen must be one of the Chosen, but he was not even in the final rounds.\n\nBut then she thought that although Han Sen was impressive, it was Dollar who represented Steel Armor Shelter this year. This way, it was understandable that Han Sen never became the champion of his shelter.\n\nIn the middle of her thoughts, Huangfu suddenly saw Han Sen jumped from the back of a mutant beast and summoned his horn bow, shooting an arrow and followed it to throw himself at the sacred-blood beast king that was commanding the beasts’ attacks.\n\nThis time Han Sen was really close to it. The beast king screeched and simply flew higher, flapping its giant red wings, making Han Sen miss.\n\nHan Sen stayed calm and shook the thread in his hand. Once again he drew the string and shot the arrow which carried him to the beast king.\n\nNow he was even closer. He slashed at the beast king’s throat with the dagger.\n\nSeeing it was too late to fly away, the beast king roared and grabbed the dagger with its red paw, blocking it from moving further.\n\nAnd its other paw clawed at Han Sen’s face like a red lightning bolt.\n\nHan Sen let go of the dagger and grabbed its arm with both hands. Like a snake, he coiled around the beast king’s body using Ghosthaunt. With a twist, he broke one of its fingers.\n\n\"Roar!\" screamed the sacred-blood black-feathered beast king, flapping its wings and rolling around, wanting to get Han Sen off its back.\n\nNo matter how it rolled, Han Sen stuck to its back and could not be touched.\n\nHearing the screams of the beast king, the black-feathered beasts returned to save it. Suddenly, all beasts surrounding Wang Mengmeng and Huangfu Pingqing went to save their king and rushed to Han Sen.\n\n\"Sister, let’s go!\" called Wang Mengmeng on the back of her big white bear, disappearing in the direction of the desert’s border.\n\n\"You won’t wait for him?\" Huangfu looked at Wang Mengmeng, feeling odd. Han Sen went there to save Wang, and she would just leave.\n\nWang Mengmeng said calmly, \"Others might not be able to do this, but Brother Han is. I would only become a burden to him if I were to stay. When I get somewhere safe, he will come to me.\"\n\nHuangfu paused. Although Han Sen was indeed very strong, Wang Mengmeng’s trust seemed a bit too much. It was a group of beasts with a sacred-blood king. Huangfu did not believe Han Sen could easily make it back.\n\n\"Sister, we should go,\" Wang Mengmeng said and urged her white bear to accelerate.\n\nGlancing at the beasts in the sky rolling like clouds, Huangfu followed Wang Mengmeng with complex feelings.\n\nSeeing the girls had left, Han Sen was relieved. He shapeshifted back to himself and put on the black beetle armor. Still on the sacred-blood beast king’s back, he repeatedly punched at the back of its head.\n\nThe sacred-blood beast king was quite tough. With the geno points Han Sen had at this point, his strength was considerable. However, the beast king was only bruised after taking a dozen punches from him. Screeching in pain, it buried itself in a dune below.\n\nHan Sen thought, \"Has it lost its mind?\"\n\nHolding the beast king with his arms, Han Sen planned to take its life when it was in the sand.\n\nHowever, the place where they landed was full of shifting sand. Both the beast king and Han Sen fell in deep.\n\nUnder the protection of the sacred-blood armor, Han Sen did not suffer from too much impact.\n\nThump!\n\nHan Sen and the sacred-blood beast king fell on the rocks. Bearing the pain, Han Sen looked up and was surprised to find them in a huge underground cave.\n\nHan Sen could not tell how large the cave was. Stalactites were so tall that they were like skyscrapers. Many unknown vines were wrapped on the rocks, and there was an underground river.\n\nAnd on the surrounding rocks and vines, blue lights that looked like stars were everywhere. They lit up the dark cave and with Han Sen’s good vision, he could see everything clearly."
}