{
    "chapter": 2472,
    "title": "Dark Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2472",
    "text": "Han Sen followed Lando through the sea of clouds. They encountered many elites who had come in search of Han Sen, but whenever those elites saw Lando, they gave him a wide berth. No one would dare to go against Lando—especially face to face.\n\nBut Han Sen could still feel the weight of many eyes resting on him. And that sensation gradually increased as time went by. Technological gadgets were of no use in the Tianxia System, but that didn’t mean that the various bounty hunters had no way of tracking him. Many people with eyes and video powers, especially the Kings with such talents, could watch Lando and Han Sen from tens of thousands of miles away.\n\nLando simply flew forward, but he eventually came to a sudden stop.\n\nHan Sen could sense something odd ahead of them. As he looked forward, some shadows started to emerge from behind the green clouds.\n\nThe figures all looked the same. Butterfly wings adorned with luscious patterns spread from their backs. Their bald heads each had two antennae dangling from them, and their bodies were clad in a black bug armor.\n\nThere were six of these people. They flapped their wings and flew over to Lando.\n\nHan Sen observed the six of them, but he couldn’t distinguish one from another. They all looked the same, and in their identical armor, they looked like sextuplets.\n\nHan Sen wasn’t foolish enough to underestimate them based on their odd appearance, however. They were all eighth or ninth-tier Kings. Some of them might have even been half-deified.\n\nIt was made obvious that they were uniquely powerful by the way they dared to stand in front of Lando. Ordinary Kings wouldn’t dare bar his path.\n\n“Lando, please do a favor for the six brothers. We would appreciate it,” said the strange man leading them.\n\n“Who are you guys?” Lando asked lazily, not raising his eyes.\n\n“You…” the strange man in front hissed in anger. “Fine, fine, fine, Lando. We were going to show respect to the king of the Destroyed, but if you really have a death wish, the Butterfly Fairy Six Kings can help you fulfill it.”\n\nAfter that, the six strange people flapped their wings and flew toward Lando.\n\n“You find a safe place and sit tight. Wait for me there a little,” Lando said calmly.\n\nHan Sen heard the order, and so he flew far away from that portion of the sea of clouds.\n\nThe Butterfly Fairy Six Kings watched Han Sen leave, but they didn’t give chase because Lando was watching them. So, they decided to surround Lando and deal with him before going after Han Sen.\n\nHan Sen kept flying without looking back. The Butterfly Fairy Six Kings used an area, and the butterfly wings on their backs glowed with six different colors. When the six areas and six colors came together across them all, it became a six-color area. It locked Lando within its radius.\n\nPang!\n\nLando punched the six-color area, but his blow had no effect.\n\nHan Sen was shocked as he glanced over his shoulder. All six of the butterfly fairies were half-deified, there was no longer any doubt about that. Now that the six of them had combined their areas into one, the potency of their individual areas must have multiplied by that number, as well. If Lando’s power wasn’t enough to break that area, it was no wonder they had dared to threaten him to capture Han Sen for themselves.\n\nFrom afar, Han Sen heard one of the butterfly fairies say, “Lando, it doesn’t matter how strong you are; you have fallen into our Butterfly Fairy Six King Six Fairy Area. It will stop you from moving in any direction.”\n\nLando ignored their words and just started throwing punches around himself. The Six Fairy Area trembled a little, but it didn’t buckle and break.\n\nUpon seeing the situation, Han Sen turned and flew even faster. He was thinking to himself, “It looks like Lando might not be able to kill those guys for some time. This is the perfect chance for me to escape. Wait for you? I’m too smart to sit around and wait for you to recapture me.”\n\nIgnoring the situation behind him, Han Sen focused on trying to escape. He wanted to get as far away from Lando as possible.\n\nHe had followed Lando for long enough to grasp where he was in the system. Although he could not determine exactly where Bao’er was, he had a rough idea of which direction she had probably headed.\n\nHan Sen didn’t head straight in Bao’er’s direction, though. He took the scenic route and went the long way around. He wanted to shake the beings that he knew were lurking in the clouds, watching his every move.\n\nBut despite traveling so fast and so far, Han Sen wasn’t stopped by anyone. He switched directions a few times as he made his escape, but still, no one tried to stop him.\n\n“Weird. Why is no one coming after me?” Han Sen wondered to himself. Then he finally figured it out.\n\nThe people watching him were still scared of Lando. Because of that, they weren’t going to capture Han Sen until he had escaped far enough from Lando.\n\nUpon this realization, Han Sen stopped trying to throw off his tails. Heading in a straight line, he sped up to leave Lando’s region.\n\nOf course, when Han Sen had gotten a fair distance from Lando, there were some creatures that just couldn’t resist the temptation of jumping out to ambush him.\n\nThere were a few dozen Kings that hailed from several different races. They were a very disorganized and eclectic group. None of them thought that they could defeat Han Sen individually, so they had formed a temporary alliance.\n\nHan Sen looked at them, and he noticed they weren’t the same Kings he encountered earlier. The group of Kings from earlier were just a few yahoos. They just had numbers—around a hundred—and nothing else.\n\nThere were only twenty or thirty people in this group. Three of them were half-deified, and it seemed as if they were the leaders of the temporary alliance.\n\n“Han Sen, you should just surrender yourself. Don’t make us hurt you,” one of the half-deified leaders said to Han Sen.\n\nHan Sen didn’t say a word. Instead, he replied by sending a quick punch toward them. He was thinking to himself, “Who do you think you are? F*cking Lando? You’re afraid you might hurt me? First, you need to have what it takes to hurt me.”\n\nSeeing Han Sen move, the half-deified suddenly shouted, “Boss, there you go!”\n\nHan Sen felt weird. He didn’t know what the guy meant. He stopped moving and looked at another half-deified.\n\nThis half-deified looked like a black tiger. He heard the call and roared, unleashing a black area. It looked to be attuned with the element of water.\n\nHan Sen wasn’t afraid of a water element area due to the fact he had the Original Water King Body. He could use the water to his advantage. The water wouldn’t hurt him.\n\nBefore Han Sen’s punch reached the half-deified’s face, the black area settled around him. The other thirty Kings used their own areas, as well. They had all kinds of areas, but when they overlapped the black tiger’s area, the black area consumed them. The black area grew darker, and it suddenly made Han Sen feel as if he had fallen into an endless pit. He reached out with his hands, but he could no longer see his fingers.\n\n“Not a water area?” Han Sen was surprised.\n\nThe dark area consumed the areas of the other Kings, and then, it became a giant black object that looked like an egg. When the black tiger gathered up its power, that black object shrank, growing smaller and smaller. The darkness within it became thicker and thicker, however.\n\nThe darkness started to feel like a liquid as it pressed against Han Sen. His body could move through it, but when the darkness became deeper, something started to resist his motion. It was like he was inside cement that was becoming solid. Soon after, his body was stuck and he could no longer move."
}