{
    "chapter": 2881,
    "title": "Fixing the Altar",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2881",
    "text": "Han Sen thought, “Tai Yi? Is that the white-haired Tai Yi Bao’er met, or is it the Tai Yi from the scroll? Is it the one that killed a god?”\n\nTai Yi turned his head. He walked into the metal temple and headed for the metal altar.\n\nTai Yi was looking at the altar as he coldly said, “Since you are here, why bother hiding?”\n\nHan Sen was shocked. He did not expect to be discovered so soon. Suddenly, someone flashed. He saw another shadow appear next to the altar.\n\n“King Jun?” When Han Sen saw the person’s shape, he was given a fright. He did not expect to see Sky God King Jun there.\n\n“Is this metal temple King Jun’s temple? No way. King Jun is a fire element God Spirit. He does not really associate himself with metal. Plus, the altar is broken. I do not think anything good happened to the God Spirit that once resided here.” Han Sen was thinking about many things. “Tai Yi, I never thought you would make it back alive,” King Jun coldly said. Tai Yi looked at King Jun and replied, “I do not care if I live or if I die, but you? You care for your life so much, yet you risk entry into the universe. Are you not afraid of being able to return to your own temple?” King Jun looked at him with disdain and asked, “Do you think you are still in the Sacred era? The people in the universe are lucky to keep themselves alive. Why would they come and seek trouble from me?”\n\n“At this time, no matter how bad things become, there are still god sadnesses, right?” Tai Yi asked with a laugh.\n\nKing Jun’s expression was cold. He grunted. “Tai Yi, Nine Night God was murdered inside a temple, and that thing was stolen. Was it you?”\n\n“I was just taking back what belonged to me,” Tai Yi icily replied.\n\n“Did you not know that thing was so important to me?” King Jun angrily asked.\n\n“I know it is.” Tai Yi nodded.\n\n“Why would you take it if you knew?” King Jun harshly asked.\n\nTai Yi calmly looked at King Jun said, “It does not matter to me if it is important to you.” “Fine. Fine. Fine. Tai Yi, are you really going to make yourself my enemy?” It looked as if King Jun’s face was turning green. He was so angry that he laughed.\n\n“When you become Sky God King Jun, you and I will not be friends. There will be no favors owed between us, so there will be no breaking up.” Tai Yi looked like he did not care.\n\n“Fine. Fine. Fine. If you ever find yourself in trouble, I will sit back and watch.” King Jun was furious. He waved his sleeves and left. He instantly disappeared.\n\nTai Yi remained in front of the altar, but he did not speak. After a while, he said, “It must be uncomfortable hiding there. You should come on out.”\n\nHan Sen thought there must have been another creature about. He looked around, but no one else appeared.\n\n“I am talking about you. Who are you looking for?” Tai Yi’s expression looked a bit weird. He looked at the wall Han Sen was hiding behind.\n\nHan Sen knew Tai Yi must have discovered his location. He coughed and stepped out from the broken wall. He said, “I just did not want to disturb you and Sky God King Jun’s discussion. I did not mean to eavesdrop.”\n\n“You were here before me,” Tai Yi said with a nod. “I know you weren’t eavesdropping.”\n\nHan Sen was shocked. He was surprised Tai Yi had discovered him already. The skill to hide his presence did not work.\n\n“Crystallizer?” Tai Yi looked at Han Sen with interest.\n\n“Yes.” Han Sen nodded.\n\nAfter checking him out, Tai Yi said, “No. You are not a crystallizer. You are a human.”\n\nHan Sen was shocked. Even God believed he was a crystallizer, yet Tai Yi believed he was human. Something had to be going on.\n\n“What do you mean?” Han Sen asked with a frown.\n\nled\n\nTai Yi laughed. “I did not expect humans to come crawling out of the sanctuary after my brief nap. It seems that it was worth the Sacred Leader’s effort way back then.”\n\n“What do humans have to do with Sacred Leader?” Han Sen was stunned. He remembered humans were a part of the crystallizer, but he did not think they had a connection to Sacred Leader.\n\nIf they were related, crystallizers would have taken over Sacred Leader’s shelters.\n\nTai Yi knew about the sanctuaries, so he knew humans came from the sanctuaries. It also did not seem as if he was lying.\n\nTai Yi laughed but did not answer. He turned around and looked at the broken altar. “Can you help me?”\n\n“I am so weak. I cannot help you.” Tai Yi looked weird. Han Sen did not want to make promises, but he wanted to learn secrets about the humans from Tai Yi. He did not really want to refuse outright.\n\n“It is nothing too difficult,” Tai Yi said. “I want to fix this altar. The materials needed are here already, but we need some pure water to fix it. Can you use a water geno art?”\n\n“I can use a water geno art or two, but why are you fixing the altar?” Han Sen was confused. He did not understand Tai Yi.\n\nHearing him talk with King Jun, Tai Yi did not seem to be on good terms with Sky God King Jun, but he also knew about Sacred Leader and the sanctuaries. Now, he wanted to fix the altar. Han Sen could not tell which side he might ultimately be serving.\n\nKing Jun had said he entered a temple and killed a God Spirit. Han Sen was pretty convinced that Tai Yi was the Godslayer Tai Yi from the scroll.\n\nTai Yi did not answer Han Sen. He removed many materials from the broken altar. He flicked his fingers. A white fire descended onto the altar. The white fire burned the entire altar. Flames enveloped the altar.\n\nHan Sen stood next to the altar, but he could not feel the fire’s heat. The altar’s materials turned into juice, which filled up the cracks inside the altar.\n\nThe altar was burning like hot, red steel. It was half-transparent.\n\nThe melted juice flowed into the altar. The cracks inside the altar filled up and slowly vanished. Not long after, it looked like a perfect altar but was crystallized. It was like a crystal.\n\n“Help me out with the water,” Tai Yi coldly said.\n\nHan Sen’s heart jumped. He followed Tai Yi’s instructions and used a water geno art. He generated a lot of water to spray the altar. The water was poured on the altar. Before it touched the altar, the water was vaporized.\n\n“We need more to cool the whole altar down,” Tai Yi said.\n\nHan Sen increased his power. He got more water to hit the altar. Han Sen tried his hardest, but the water was unable to douse the altar. Despite being like the tide, the water was vaporized in the air.\n\n“Very powerful Tai Yi.” Now, Han Sen had a better understanding of how scary Tai Yi’s fire power was.\n\nSince Han Sen had already committed, he was not going to give up. He clutched his Ancient Water God origin and simulated Ancient Water God’s presence. He then fired water at the altar.\n\nChee!\n\nThe water hit the altar. White smoke rose from the altar. The burning, crystal-looking altar was stone again."
}