{
    "chapter": 2915,
    "title": "Ancient Abyss Grandmaster",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2915",
    "text": "“If our purpose is the same, why don’t we cooperate? We can avoid conflict and risk less. What do you think?” Ancient Abyss Grandmaster looked like he never became mad. He always spoke quietly.\n\n“Cooperate? How would you like to cooperate, Grandmaster?” Han Sen was shocked, but this was perfect for him. He did not know anything. If he was able to get some information from Ancient Abyss Grandmaster and the others, it was not a bad thing to pursue.\n\n“It depends on what your purpose is.” Ancient Abyss Grandmaster smiled.\n\n“Ancient Abyss Grandmaster is such an old fox.” Han Sen knew it would be impossible to get information out of him. He looked at the direction he wanted to go and said, “I do not know what Grandmaster’s purpose is either. With things being that way, I believe we should just go our separate ways.”\n\nAfter saying that, Han Sen turned around and started going in the direction he wanted to.\n\nAncient Abyss Grandmaster did not stop him. He followed him, smiled, and said, “If we are sharing the same road, we should at least go together. We can look after each other. If something bad happens to us, perhaps we can cooperate in those moments.”\n\n“I do not own this path. If you want to go, Grandmaster, that is up to you.” Han Sen ignored Ancient Abyss and the others. He took Bao’er with him to fly away.\n\nAncient Abyss and the four Extreme King deifieds followed. Ancient Abyss Grandmaster was a rare character. Even if the Extreme King and Han Sen were hostile, he was being surprisingly pleasant to Han Sen.\n\nIt was not like Han Sen loved talking to him. It was just that Ancient Abyss Grandmaster was very intelligent and knew how to socialize with people. While he was talking to Han Sen, it was like he was talking to an old friend. It did not make him feel uncomfortable.\n\nThe things he talked about, along with the way he spoke, made people very interested. When spoken by him, something that was very normal seemed very interesting. It propagated an allure and desire to hear more.\n\nOn the road, Ancient Abyss Grandmaster introduced to him the things they encountered. Han Sen and Bao’er found it very interesting. He could not avoid talking to him. The atmosphere was quite pleasant. It was like they were a bunch of friends going on a hike.\n\nThe more Han Sen thought about it, the things Ancient Abyss Grandmaster discussed did not help him out at all. Han Sen really admired that.\n\nThe more a person talked, the more at risk they were at leaking information they shouldn’t. Ancient Abyss Grandmaster, however, despite flapping his gums for the longest amount of time, did not let a single thing slip. It made people feel very comfortable and that he was not being pushy. That was not something normal people could do.\n\n“Ancient Abyss Grandmaster is a very special character.” Han Sen was now on higher alert.\n\nIt was not scary to make enemies. It was scary when one had an enemy standing in front of them, but the enemy made them feel comfortable and at ease. Although he made it known he was the enemy, the hostile thoughts were less frequent. That was the scariest kind of enemy.\n\nThe group of people flew for 10 days. Han Sen was given loads of universal knowledge from Ancient Abyss Grandmaster. He learned about the legends of Sacred and many more myths.\n\nHan Sen suddenly saw an area that looked like a landfill. Many universal trash heaps were floating about. It was like an endless sea of trash.\n\nWhile overlooking the sea of trash, Ancient Abyss Grandmaster said, “This place is very close to the Sacred core area back then. If we keep going this way, time and space will be all messed up. All kinds of energies and chaotic forces swell here. Plus, all the xenogeneics here are top class. Even a true god elite would feel under pressure in a place like this. If you want to proceed, you should be very careful. Plus, you are taking a child along with you. You should be doubly careful.”\n\n“All this time, we have yet to encounter a single xenogeneic. I say this big barren system is not as scary as the legends claim.” Han Sen only feigned his ignorance.\n\nWith a serious look, Ancient Abyss Grandmaster reminded him, “Please, do not be so reckless. The reason why we can travel here safely is that an elite has come here before us. He has cleared the dangers that were here. It will not be the same if we proceed. Even the true god class elite could not clear out all the dangers ahead.”\n\n“Oh, really? Do you know who the elite ahead of us is, Grandmaster?” Han Sen asked.\n\n“I do not know.” Ancient Abyss shook his head. “They have deliberately erased the traces of their coming. Although you can still follow a trail, you cannot identify whose it was. That is something to worry about. I hope you will be careful about all this and not bring harm to that child.”\n\n“Thank you for the reminder, Grandmaster. If it is that dangerous, I will not proceed. I think I will go elsewhere.” Han Sen bowed to Ancient Abyss Grandmaster. “Grandmaster, thank you for taking care of us. We appreciate it. I guess we will part ways here. Let’s hope we meet again.”\n\nAfter that, Han Sen carried Bao’er and traveled to another side of the trash sea. He understood that Ancient Abyss Grandmaster had not only told him all he had as a simple reminder to be careful. It was a sign of refusal.\n\nIt was supposed to mean that the way forward was too dangerous, and they should not have trusted each other. It was not very nice if they were to go on together.\n\nHan Sen understood what he meant, so he chose to leave.\n\nAfter Han Sen was gone, an Extreme King deified elite looked toward where Han Sen departed and asked, “Mister Grandmaster, do you think Han Sen is here for that?”\n\nAncient Abyss Grandmaster shook his head. “It is hard to say, but where he is going is possibly where we are headed too.”\n\nAnother deified elite quietly asked, “Do you think we should take him out first?”\n\n“Not yet,” Ancient Abyss Grandmaster said.\n\n“If we do not do it now and reach that place, he has a weird geno art that can prove troublesome to us,” a deified elite said.\n\n“That is fine. Although his geno arts are strange, I have a way to break them. Do not worry.” After pausing, Ancient Abyss Grandmaster looked in the direction Han Sen left and squinted his eyes. “Maybe he will even be able to help us.”\n\nHan Sen followed the outskirts of the trash sea for a while. He stopped when he was no longer able to see Ancient Abyss Grandmaster and the others. He looked around. The trash sea appeared endless. He had no idea how big it was.\n\n“Let’s go in from here,” Han Sen said to Bao’er, who was perched on his shoulder. “Don’t you run off.”\n\n“Bao’er has been good,” Bao’er said as she blinked her eyes. “I have not run off.”"
}