{
    "chapter": 2756,
    "title": "Butchering the Flock of Sheep",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2756",
    "text": "The nine white unicorns descended to the field, swooping down elegantly until the carriage touched down on the grass. Han Sen hid within the flock of sheep, but he kept his eyes pinned to the door of the carriage. He wondered what sort of scary being might be lurking within. It had to be something fierce if it was scaring the sheep this much. None of them dared to run, and they all remained rooted to the ground, shivering and shaking.\n\nThe nine unicorns finally came to a halt, and a drawn-out creak sounded as the door of the carriage opened. A small figure descended from the carriage, and Han Sen’s brow furrowed. The person coming out of that carriage was a little girl. She looked to be no more than ten years old.\n\n“The scary being that the sheep all fear cannot be this little girl, surely.” Han Sen didn’t take his eyes away from the carriage. He believed another creature would emerge behind the girl. She must be a servant or slave of some kind.\n\nBut the carriage now seemed to be empty. The little girl was the only one to come out, and in her hands was a sharp knife. She moved toward a flock of sheep.\n\nHan Sen turned his attention back to the girl. Her body was undoubtedly that of a child, but for some reason, something about her eyes seemed a bit mature for her age.\n\n“Is she a Sky?” Han Sen felt the presence of the girl, and he noticed there was a mark on her forehead. She might have been one of the Sky. Either that or she was a Very High. Although there were large cultural differences between them, in terms of simple physicality, the two races were practically the same. The Very High simply had purer blood.\n\nThe girl lifted the sharp knife before the flock. She reached out her hand towards a sheep’s head and sighed. “Little sheep, little sheep. I have no choice but to do this. If you ever seek revenge, come for me. Don’t take out your rage on someone else.”\n\nAfter that, the sharp knife in the girl’s hands was thrust forward. It slid straight into the heart of the sheep and killed it in a single strike. Blood dribbled across the hilt of the knife and gushed from the new cavity in the sheep’s chest.\n\nThe weird thing was, the blood never had a chance to drip to the ground. As soon as the sheep’s blood welled up, it was absorbed by the knife that killed it. In moments, the sheep’s body had been sucked dry by the weapon. Under the draining powers of the knife, the sheep became a dried-up husk of its former self. The knife’s color changed to a dark red, and it began to give off a very strong and bloody presence.\n\nOnce the first sheep was dead, the girl moved on to another sheep. Every member of the flock was shivering violently, but they didn’t dare to resist. The girl lifted her knife and thrust it through the next creature. Like the last, its blood was sucked dry.\n\nHan Sen was shocked at the sight. The girl continued killing the sheep, and not a single one of them tried to resist. It was like they were all queuing up to die, one after another.\n\nSoon, the death toll had reached a hundred sheep. The blade of her knife had become as red as blood, now. It looked like blood was going to begin dripping out of it any second.\n\nThe strong, coppery smell was awful. Han Sen could have detected the scent from a few miles away, and the smell was nauseating.\n\n“There’s definitely something wrong with that girl’s knife,” Han Sen murmured with a frown. He looked at the weapon in the little girl’s hand.\n\nThe girl’s presence wasn’t very strong, but there was something very frightening and strange about the aura of the sharp knife. It was much greater than the presence of the little girl herself.\n\nThe little girl shouldn’t have been capable of using such a powerful blade, but she was using it with finesse. The knife’s power hadn’t consumed her. This was a situation that Han Sen had never encountered before.\n\nBefore he became deified, even Han Sen couldn’t make use of 100% of a deified treasure’s power. Yet the little girl was casually able to use a supremely sharp knife that was far greater than herself. Every strike she unleashed was lethal, and a sheep died each time she swung her hand. Everything about this situation was weird.\n\n“This flock of sheep must be more afraid of the knife than the girl,” Han Sen guessed to himself, but he still wasn’t too sure what was going on. He kept staring at the sharp knife.\n\nIt was a short knife that was composed of a wooden handle and a steel blade. The wooden handle was seven inches long, but he couldn’t determine what sort of wood it had been carved from. The handle was so darkly colored that it was almost black. The blade, on the other hand, was one foot long. It was shaped like a crescent moon. Because it had absorbed so much blood, it was gleaming red. It looked as if it was going to start gushing blood from its tip at any second.\n\nThe girl didn’t seem to be holding any sort of scabbard or sheath for the knife. Also, based on its shape, Han Sen surmised that the knife wasn’t a combat weapon. It was more of a chef’s knife or a butcher’s tool.\n\nSuddenly, Han Sen felt a chill. Maybe it was because it had absorbed so much blood, but under the sunlight, Han Sen saw the blade expel some sort of bloody light. The bloody light rose, forming itself into the shadow of a red demon. The more sheep the girl killed, the more blood the demon could absorb. The blood demon grew scarier as more time passed.\n\nWhen that girl killed her thousandth sheep, the shadow of the sharp knife had already generated a blood flame that was visible to the naked eye.\n\n“Of course, the flock is afraid of the knife, not the little girl who is holding it. Still, this is such a strange situation. The girl is so weak. How can she wield such a potent weapon? And the sharp knife’s power hasn’t consumed her,” Han Sen thought to himself as he observed the girl and her knife.\n\nSuddenly, Han Sen felt a chill run down his spine. He had been focusing too much on the knife, and the blood demon’s shadow had discovered his existence. The shadowy body suddenly turned. The creature’s eye sockets were empty aside from a pair of blood flames, and those fires now stared in Han Sen’s direction.\n\nBzzt!\n\nBefore Han Sen could do anything, the sharp knife released a weird buzzing noise. Then, the sharp knife started to fly. Carrying the little girl’s body along behind it, the weapon shot toward Han Sen.\n\nHan Sen could see the blood demon shadow clearly. It was opening its jaws, looking ready to devour him.\n\nThe knife pulled the little girl straight toward Han Sen. The moment she saw him, she froze in surprise.\n\nHan Sen was prepared to fight, but the little girl’s hand yanked back against the knife. Using all of her strength, the girl tried to keep the knife from heading for Han Sen.\n\nBut her power was too small, and the sharp knife had a real lust for Han Sen. She wrapped both hands around the knife’s handle and pulled as hard as she could, but her efforts were futile. She couldn’t stop the knife. Her slim body was pulled steadily forward.\n\nHan Sen’s frown deepened. He readied himself to fight, but the little girl gritted her teeth and pressed her hands down on the blade itself. The blade sliced into her hands, and the knife quickly absorbed the blood that welled up in her palms. Then, the blade went quiet.\n\nThe blood shadow demon was still visible above the blade, but it seemed to have been suppressed by some mystical power. The bloody light that formed the image of a red demon had dimmed slightly.\n\n“No wonder she can use that sharp, weird knife. Something about her body is special. She must have some unusual connection to the knife,” Han Sen thought to himself.\n\nJudging from the little girl’s behavior, she didn’t seem to be hostile toward Han Sen. He walked over to the girl and asked her, “Little Girl, what is your name?”\n\n“Run! Leave here quickly!” the little girl said in a rush, still keeping a white-knuckled grip on the knife."
}