{
    "chapter": 1229,
    "title": "Super Aristocrat",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1229",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Dear friends, I am Fang Mingquan. I am standing here at the heart of Levo Planet, in the renowned Levo Plaza. Less than five hundred meters away from me sits the sacred Holy War Platform. As is the custom, all of humanity’s great heroes, like the Alliance General Peng Hongming, receive their awards there. But today, we have someone else of similar prestige being honored. In honor and gratitude of his deeds, he will be bestowed the new title Super Aristocrat.”\n\n“In the council’s voting chamber, most were in agreement that Han Sen should be the first to be given this title.”\n\nFang Mingquan looked at the clock and then went on to say, “In fifteen minutes and thirty seconds, President Ji Ruozhen will issue and bestow the aforementioned title and a medal in honor of it. It must be a proud day for the president, given that he will be bestowing these gifts upon his son-in-law.”\n\nCountless people were watching the stream live, fascinated by the ceremony of someone being bestowed the new title Super Aristocrat.\n\nThe glory of conquering an Emperor Shelter in the Third God’s Sanctuary had not been seen before. It was something new for humanity, and it painted Han Sen as a hero to the masses. This was a feat that went above and beyond what they thought he could achieve.\n\nIt had a great influence on the drive of humankind and the Alliance. It meant people could become better than a Sacred-Blood Aristocrat. The greatness a person could achieve did not stop there, and everyone was capable of more.\n\nIn the resting room, Han Sen was kitted out in his neatly prepared uniform. He was still in the Special Squad, so he still counted as a soldier.\n\nHan Sen was going to represent the army, that day.\n\n“Do I look okay?” Han Sen smiled at Ji Yanran.\n\nJi Yanran patted him down and said, “Today, you are the most handsome man in the universe. Every other man will look upon you and feel nothing but jealousy.”\n\n“Only for today, though, huh?” Han Sen said, feigning disappointment in jest.\n\n“Well, we can’t have you in the public eye all the time. It’s not fair on the others, you know?” Ji Yanran laughed.\n\nHan Sen still wished to say something, but another soldier appeared, indicating it was time for him to go.\n\nOn the Holy War Platform, Ji Ruozhen was beginning his speech. The people who were there were fine, but those who watched it live on a stream were impatient. They wanted to get straight to the heart of the event. The president always had speeches prepared, and more often than not, they ended up long-winded. People were bored in the opening minutes, desperate to see Han Sen.\n\n“A lot of people know I have a daughter. Like any father of a daughter would know, she is your princess. Her importance is equal to that of her mother, who you take to be your queen.” When Ji Ruozhen said that, everyone looked at him with shock. He sounded different on this day.\n\nJi Ruozhen smiled and said, “When she was small, I thought no one would ever be good enough for her… The man who took her hand in marriage would have to be the best of the best, but rarely can fathers be one hundred percent happy in the person their daughter loves. Their betrothed is always assumed to be a thief, who steals their most precious diamond.”\n\nEveryone smiled, hearing these words.\n\n“Honestly, when my daughter first told me she wanted to marry Han Sen, I shuddered at the mere thought. He was just a young lad from an ordinary family. He wasn’t high class, he didn’t have money, he didn’t have much of an education. I didn’t think he was good enough for my daughter, and again, I believed him to be a thief. He stole my daughter’s heart, and my diamond in the process.”\n\n“But today, I realize I could not have been more wrong. I looked for value in all the wrong places. He is a soldier that represents the best in humanity. Not once has he disappointed me, and most importantly, not once has he disappointed my daughter. In the two hundred years of our era, in which we have dealt with the sanctuaries, a huge price has been paid to get to where we are. And each and every day, transactions in lives are made. Without the sacrifices of those who go before us, our survival in the Third God’s Sanctuary would not be possible. Those who go there are trailblazers, building the foundation of a road we can all travel and build upon, in asserting our progression and ascension as a species.”\n\n“Today, I will be bestowing the title of Super Aristocrat to an important person who has gone above and beyond for us all. He is an individual who currently roams the Third God’s Sanctuary in defiance of what we thought to be impossible. He is a person we can all look upon in pride, because again, he represents the best of what we humans are capable of. Today, the Alliance will enter the super era. The importance of each individual will be measured and valued by their deeds in the Third God’s Sanctuary.”\n\n“The young people who bravely go are pious and fearless, unafraid of death when they march into the dark valleys of that sanctuary. Lives can be lost, yes, but each and every one is held dear, and no one is ever forgotten. Every contribution made, no matter the size, is valued. Please, to the people that dare the Third God’s Sanctuary, continue as you have done. It is my hope that one day, you will all reach the heights of Han Sen. You will each become a Super Aristocrat. Today, he brought down an Emperor Shelter. Perhaps in the near future, we will see every shelter of that sanctuary hold proud the Levo Flag.”\n\n…\n\nHan Sen approached the stage and accepted the medal and title of Super Aristocrat. Then, he and Ji Ruozhen hugged.\n\nEvery media publication wrote an article about the events of that day, and many young people became inspired. The desire to join Han Sen as a Super Aristocrat was a compelling one.\n\nAnd indeed, Han Sen became an idol to all.\n\nDespite being the first Super Aristocrat of the Alliance, though, Han Sen did not spend much time reveling in the celebrations. He was eager to return to the sanctuary, and so he did. There, in silence, he absorbed his cherished Life Geno Essences.\n\nHan Sen appreciated the glory he was given, but he knew that he himself was not powerful enough to go against an emperor in proper combat. Taking down Thunder Hell Shelter was a group effort, and it was luck and sneakiness that made it possible. Holding it, now and in the future, was another question entirely."
}