{
    "chapter": 1279,
    "title": "Strong Killing",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1279",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“That… looks like a human.” Xue Chen observed the presence of a young man approaching, but he couldn’t be entirely sure he was a human, given the brashness an individual would require to actually stroll up to a shelter such as that.\n\nFurthermore, if it really was a young human, why would they all be in such a state of panic, and why would Blood River King himself be concerned?\n\n“Who dares approach?!” Blood River King called out to the figure below their walls.\n\nThe spirit was unfamiliar with Han Sen, and therefore, he did not know how strong Han Sen was. With his creatures all acting up, however, he knew he wasn’t dealing with someone ordinary. Even Blood River King knew he should be cautious.\n\nHan Sen saw the three super creatures and responded by saying, “I am Human Emperor, Han Sen. If you pass me your spirit stone, I’ll let you live.”\n\n“After Blood River Shelter, I am going to take down each and every shelter in the Third God’s Sanctuary, so that when Ji Yanran and Mom make the jump, they can do so in safety,” Han Sen told himself.\n\nHe was not strong enough to do that just yet, but this would go on to be the humble beginning of that venture.\n\nHuman Emperor.\n\nThese two words, this name, would someday freeze hearts. But having just been used for the first time, it was an unfamiliar title. It confused the inhabitants of the shelter.\n\nBut at least it told Xue Chen that the person who had come was a human.\n\nBlood River King replied to Han Sen’s demand, saying, “How dare a human call himself an emperor!”\n\nHan Sen didn’t submit a verbal reply, and instead drew his Phoenix Sword.\n\nXue Chen was in awe, thinking the young man approaching was far more reckless than anyone in the Xue family. That, in itself, was quite a feat.\n\nBlood River King drew his greatsword. Powers were to collide, and Xue Chen knew a big fight was brewing. But in the next second, that did not turn out to be true. Instead, Xue Chen was just made speechless, frozen in shock.\n\nBlood River King’s eyes were wide open, rolling in their sockets as the head that carried them was sent tumbling through the air. Before Blood River King could even ready his sword after he unsheathed it, he had been beheaded.\n\nEvery being in the shelter was now either in shock, fright, or absolute panic. Whatever the case was, everything and everyone wanted to up-stakes and escape. Blood River King had been killed practically before the fight began. Whoever remained to combat such a foe would be a fool, after all.\n\nHan Sen didn’t want to let the super creatures get away, though. So he flew up into the air and chased each of them down like an airborne hound. Xue Chen saw Han Sen and the silver fox swoop down at the creatures like a pair of hawks, and he was gobsmacked.\n\nWherever they went, all that remained on the ground following their re-ascent was a mound of fallen creatures and spirits and a pool of blood.\n\n“Now that is what you call unstoppable!” Xue Chen was jumping for joy in his heart.\n\nThe young man that had come to assault the shelter had amazed him. It filled him with a surge of energy he hadn’t felt in a long time. But most of all, it gave him a sense of hope. It told him there was a chance of achieving a future in the Third God’s Sanctuary, where humans weren’t always reduced to slavery.\n\n“If he takes down this shelter and breaks the spirit stone, does that mean our contracts will be destroyed as well? Will we be free?” Xue Yucheng wondered.\n\nXue Yucheng saw Han Sen commit to slaying every super creature that previously inhabited the shelter, and the act genuinely surprised him.\n\n“Since when can humans achieve that much strength?” Xue Yucheng was amazed by what he saw.\n\nTwo of the super creatures had been killed in less than two seconds.\n\nThe other super creature was finely-attuned with the elements of earth. It tunneled underground as quickly as it could, but even when Han Sen drove his sword under in pursuit, it managed to escape. It was gone.\n\nHan Sen didn’t concern himself with escapee too much, though. He simply proceeded to the spirit hall of the shelter. Han Sen swung his sword to kill the faithful spirit servants, felling each one with a casual whisk of his blade. The rest of the creatures were allowed to escape as freely as they may, as long as they did not get in his way.\n\nXue Yucheng drove the boat closer to the shelter. He was still hanging from the pins, so although he couldn’t dismount, he could still see everything.\n\nXue Yucheng was reveling in sheer delight, the possibilities of which he thought had long since abandoned him. In this joy, tears filled his eyes and rolled to soak his cheeks. “Oh God, I have made it to this day!”\n\nHan Sen entered the spirit hall. Blood River King had yet to respawn, and it made Han Sen notice the fact that different spirits possessed different respawn times. Thunder Hell Emperor could respawn instantly, for instance.\n\nHan Sen flew over to the statue and took the stone in his hand.\n\nHan Sen could faintly hear the sound of Blood River King crying inside the gem he now held. The next second, the spirit stone collapsed into a mound of broken glass. It had chosen not to obey Han Sen.\n\nThe moment it was destroyed, though, Xue Yucheng and Xue Chen’s contracts were broken.\n\nThe two looked at each other in utter happiness.\n\nFollowing this short conquest, Han Sen had received zero beast souls and earned two Life Geno Essences.\n\nHan Sen knew he probably spent all his luck in his last adventure, to get the berserk super beast soul and the fruit cores. He sent Xue Chen and Xue Yucheng back to the Alliance, to fulfill the task Han Sen had promised to do for their family.\n\nHan Sen stood in Blood River Shelter alone now. He looked at the spirit statue and squinted. In Han Sen’s Sea of Soul, the Serpent Throne was showing visible excitement towards it.\n\n“Does this thing like it? I still don’t even know what a doll beast soul is used for, anyway.” Han Sen summoned it.\n\nWhen the Serpent Throne appeared, it turned and immediately ran towards the spirit statue."
}