{
    "chapter": 2527,
    "title": "Wolf God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2527",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen and Li Keer flew through space together, but the bronze furnace lagged some distance behind them. It still wasn’t willing to come anywhere close to Li Keer.\n\nIf Li Keer was willing to lead, Han Sen had no reason to reject her offer. If she could find deified xenogeneics, Han Sen wouldn’t mind helping her slay the bronze tripod.\n\nHan Sen still wasn’t fond of Li Keer’s personality, so he didn’t talk to her all that much. But Li Keer was smart and talkative, and Han Sen discovered that she even had a sense of humor. He found it difficult to rectify her personality with how she had acted when they first met.\n\nHan Sen didn’t know that her attitude had actually changed.\n\nWhen they first met, Li Keer had looked at Han Sen as if she was far superior to him. It was like a human talking to a cow. Humans normally wouldn’t bother talking to cows, because there was no point in having a conversation with a being of such low intelligence. They would just teach the cow what to do, instead.\n\nBut ever since that bet, Li Keer had realized Han Sen wasn’t just some lesser being. He was her equal, or perhaps he even stronger, in some ways. Li Keer could no longer think of Han Sen as some foolish creature.\n\nBut the blame couldn’t be put on Li Keer for her initial assumptions. Across the entire universe, all beings with emotions made similar assumptions about others that were not of their species. Even humans did.\n\n“There’s a deified xenogeneic that I saw not too long ago. It is a wolf god. I don’t really know much about it, but I have heard that he isn’t very strong compared to most of the deified xenogeneics in the core area.” Li Keer continued to fly forward as she gave Han Sen the low down on the deified xenogeneic.\n\nAs she spoke, Li Keer was thinking, “I’m not lying; the wolf god really isn’t that strong compared to most deified xenogeneics in the core area. It can be considered medium-low. But it does have a wolf god area. That area not only summons a wolf pack, but it also summons clones of the wolf god. A whole horde of wolf god clones will be summoned, and they aren’t much weaker than the wolf god itself. Let’s see how you deal with an opponent like this.”\n\nLi Keer wasn’t doing this to harm Han Sen, but to see how he handled himself in danger. When he did fall into trouble, she would swoop in and help. She would save him and impress him with her skill at the same time. Then, Han Sen would more willingly obey her. That way, she could take him on as her silkworm.\n\nFollowing Li Keer’s lead, Han Sen flew down toward a planet. Li Keer pointed in the direction of a mountain and said, “I saw the wolf god on that mountain. I’m too weak to fight it, so I’m certainly not going over there.”\n\n“Okay. Wait here, then. If there is a deified xenogeneic, I will help you eliminate the core bronze tripod whether or not I manage to kill this deified,” Han Sen said.\n\n“I will await your good news,” Li Keer said with a smile.\n\nHan Sen nodded and flew toward the mountain. The bronze furnace remained behind at Han Sen’s request. It didn’t head for the same mountain as him.\n\nLi Keer’s eyes flickered. She was far away from the mountain, but she could see all the flowers and forests that littered the landscape.\n\nQuickly, Li Keer’s senses detected the wolf god on that mountain. It was different from ordinary wolves. The wolf god lived alone, and its body wasn’t very big. It was barely bigger than an ordinary wolf.\n\nThe wolf was colored grey with a single black line running across its coat, but its fur wasn’t ordinary. It was made of some weird metal. The metallic fur was smooth, and it didn’t affect the creature’s mobility.\n\nAs Li Keer’s watched, Han Sen quickly found the wolf god. The wolf god was very territorial, and Han Sen had only just stepped into the valley when the wolf god revealed itself. Its hair straightened up, and its green wolf eyes peered down on Han Sen.\n\nBuzz!\n\nThe wolf god crouched and leaped forward, but then it disappeared.\n\nThe wolf disappeared from Han Sen’s vision before he even got a good look at it. His eyes couldn’t match the speed of the wolf god.\n\nWithout hesitation, Han Sen used his super god spirit body. While Han Sen was invincible, the wolf god’s gray body leaped at him.\n\nBut instead of landing on Han Sen, the wolf god’s leap carried it past him. It turned around and looked at Han Sen without attacking again.\n\nHan Sen had only just opened the super god spirit body, but he noticed that his super god spirit power was already starting to fade. Although Wan’er was asleep, her effect on the super god spirit body was still strong.\n\nLi Keer planned to watch the fight between the man and the wolf, and then save Han Sen during a critical moment. But right after the fight began, Han Sen ran away.\n\nAs Han Sen flew up away from the planet, she could see that he had committed his full strength to fleeing. He didn’t hesitate or ponder what direction he was going. Li Keer was frozen as she watched him do that. She didn’t know if she should swoop in to save Han Sen.\n\nAlthough this was the result she wanted, she hadn’t expected it to happen like this. She was planning to use the fight with the wolf god to witness Dollar’s real power. Now she was still empty-handed, and Han Sen was running away.\n\nLi Keer was very confused. Han Sen apparently had no way of defeating the wolf god, and the creature leaped into the air and tore into Han Sen’s body with its teeth.\n\nPang!\n\nHan Sen’s body was torn to shreds, but it was just a Moon doppelganger. The real Han Sen appeared farther in space, and he was still running.\n\nHe only wanted to confirm that there was a deified xenogeneic on the planet. He didn’t plan on summoning the Gold Armor General to defeat the wolf god in front of her.\n\nBut the wolf god was a very aggressive creature, and it kept chasing after Han Sen. Although it wasn’t as strong as the Gold Armor General, Han Sen would still have a hard time fighting it. He kept using Moon copies of himself to avoid the wolf god.\n\nHan Sen noticed that the core area’s deified xenogeneics had some flaws. They might be deified in some ways, but in other ways, they were much worse than proper deified xenogeneics.\n\nSuch as the Gold Armor General: while its defense and swordlights were deified in class, its speed was still wholly King class. It even fought like a King. The creature didn’t have the control and talent that Han Sen would expect from a true deified.\n\nAnd while this wolf god’s speed was deified, its judgment and skill weren’t up to par. Its attacking skills fell short, about as talented as an average King. So, Han Sen could see that the wolf was far weaker than an ordinary deified.\n\n“No wonder the core area’s deifieds are referred to as fake deifieds. They all have flaws. I can’t see them as being truly on a deified level,” Han Sen thought to himself.\n\nThe epic battle Li Keer had hoped to watch quickly devolved into a hungry wolf chasing a fleeing human. Han Sen used his clones and movements to evade his foe. His movement skills were spectacular, and not even the wolf god could harm him. But that still wasn’t what Li Keer wanted."
}