{
    "chapter": 1865,
    "title": "Breaking Their Knives and Not Hurting the People",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1865",
    "text": "Han Sen did not plan on escaping this time. He\n\nhad already achieved first place here, so there was little to worry about. Now it was time for him to show off the knife skills that Yisha had taught him.\n\nYisha had been teaching him Teeth Knife for a while, and by now, that was what he was best at.\n\nNow he needed to perform what he had learned well in order to avoid disappointing her. If he made her happy, it was only expectable that he would receive more resources from her. So, this next move would be more important than anything.\n\nHe gripped his Ghost Teeth Knife as he ran towards Night Giant God. He was holding the hilt, but the weapon was still inside its sheath. He hadn’t drawn it.\n\n“Good timing!” Night Giant God shouted, as he swung his own knife with greater strength.\n\nHis geno art was called Battle River. It was a water geno art. Water geno arts were usually quite soft, and they had a sense of infinity about them. They were usually quite effective against something hard.\n\nBut Battle River was different. It was a really rough water geno art, that was like a river coming down from the sky. It was the strongest strike, and that was just the beginning.\n\nBacked by the knife skills of the Rebate, his attack would be so fast and so strong. No one at the same level would be able to block him.\n\nHan Sen did not plan on escaping. He slashed with Ghost Teeth Knife, and he used Teeth Knife skills to perform the technique Tooth-for-a-Tooth.\n\nThis was different from Tusk. This move changed depending on the opponent. If the foe was cruel, then it’d be cruder than them. If the foe was hard, then it would be harder than them. If the foe was obscene, it would be obscener than them.\n\nNight Giant God was striking very hard, and so Han Sen did the same thing.\n\nThere was no way around this.\n\nThey are going for a direct collision with each other! Night Giant God was born powerful. He has five hundred flowers despite being a Baron. Very few people can fight him. Although he does not have a King class weapon, I don’t think it matters all that much. Han Sen himself can’t cast the King class power of his weapon, after all,” someone who knew Night Giant God said.\n\nDong!\n\nGhost Teeth Knife and Night Giant God’s knife came against each other. The thin and curved Ghost Teeth Knife, coming against the large knife of the opposition, did not look appropriately scaled.\n\nBut the purple blade of Ghost Teeth cleaved right into the big knife. It shattered the big knife, sending fragments flying everywhere.\n\nGhost Teeth Knife did not stop. It kept coming forward towards Night Giant God. When it was less than one inch away from his head, just about brushing his hair, the knife stopped dead.\n\nNight Giant God’s eyes were opened wide, and sweat broke out across his brow. He did not dare to move at all.\n\nHan Sen smiled. He put the knife away and walked right past Night Giant God.\n\n“You only won because you have a King class weapon. I will fight you.” Another Baron appeared. He moved like a ghost and tried to attack Han Sen’s neck with a dagger.\n\nBut within a second, his dagger was also broken.\n\nA few other Barons came at Han Sen at the same time, prompting him to move. But wherever Ghost Teeth Knife went, a broken weapon would follow in its wake. No one’s weapon could withstand the strike of that knife.\n\n“Powerful, that Teeth Knife skill is,” the beautiful man said in compliment.\n\nThe man with the head of a cow replied, “He is a powerful man.”\n\nHan Sen kept on swinging his blade fearlessly. If any Baron came close, he’d break their weapon. He was not killing anyone, though. He’d simply break their knives and that was it. If he did start killing, the entirety of Narrow Moon would likely consider him an enemy.\n\nThe Barons could not stop Han Sen’s advance. And before long, it was a Viscount that tried him next.\n\nThe sword of the Viscount came at him like a shadow. The swordlight became a flash of light that weaved a net of strikes to attack Han Sen all at once. This was a Rebate skill known as Moon Shadow Slash.\n\nHan Sen kept on moving, not slowing down as he came towards the sword net. He used a Teeth slash towards the Viscount.\n\nThe Viscount was shocked by the boldness, because Han Sen was now moving toward where Moon Shadow Slash actually began. The net was just an illusion, and it wasn’t where the actual sword was going to strike.\n\nIt was too late for him to withdraw his sword, too. So, the Viscount committed to the slash, as the swordlight came down on Han Sen’s Ghost Teeth Knife.\n\nKatcha!\n\nA large chunk was carved out of the Viscount’s sword. This wasn’t because the Ghost Teeth Knife was sharp and hard.\n\nDog Teeth was based on the concept of a heavy strike. Many Rebate used this skill, as it was infamous for destroying popular swords. Many King class weapons were missing chunks due to this technique.\n\nAnd seeing that the Viscount was unable to block Han Sen, many other Viscounts swept forward to stop him. They were afraid he’d run off again.\n\nBut this time, Han Sen was not planning to run. He had achieved first place already, and now was the time to show off. The better he performed, the more resources Yisha might be willing to give him. This was his best chance of securing valuables.\n\nHe had Yisha as back-up, anyway. He wasn’t afraid anyone could actually do something to him.\n\nHan Sen used his knife to fight many Nobles, all alone. The Barons had stopped, so it was mostly just the Viscounts that were fighting him now.\n\nHan Sen did not use his Viscount Jadeskin, though. He maintained his Baron class for the fight. He didn’t use his Teeth Rabbit shoes, either. He was only using his Ghost Teeth Knife to fight back against the Viscounts.\n\n“It looks like Knife Queen recruited him a long time ago. How long she’s been training him, god only knows. But it would take a decade for him to reach this sort of level.” Night River King hummed.\n\nYisha was shocked, too. She knew exactly how long she had been teaching him: Han Sen had only been with her for a few months. She had not taught him for long, at all. The last skill he learned was eight days ago.\n\nIt was shocking that Han Sen could use Teeth Knife with that level of proficiency.\n\n“Is he a knife master?” Yisha had a complicated look.\n\nHan Sen’s performance kept on surprising her. As a teacher, she was very lucky to have such a student. She had only taken him on in a bet to find out where Dollar might be, but she felt like having him as a student was not a negative thing, at all.\n\n“Should I expect more from him?” Yisha wondered. But whenever she did, the thought of The Story of Genes would return and give her a headache.\n\n“He is good at Teeth Knife, yes, but he is not one of the Rebate. It is difficult for him to use Teeth Power. Even though he is good at it, it is still a waste.” Moon Wheel King felt ashamed.\n\nSeeing that the Viscounts could not block Han Sen, and no one could strike, it seemed likely Han Sen would be able to escape.\n\nThe beautiful man then decided to teleport in front of Han Sen. His bone knife was forged from dragon bones. He slashed towards Han Sen."
}