{
    "chapter": 156,
    "title": "Game on",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_156",
    "text": "\"Sen, they will tear us apart.\" Feeling the wolfish gazes from other players, Shi Zhikang felt upset. He was sure that they would be besieged, because those guys simply hated Han Sen and Silver Killer too much to let go of such a good opportunity.\n\n\"What is there to be afraid of? We will show Starry Group the power of Room 304,\" Zhang Yang exclaimed in excitement.\n\n\"Not Room 304, but Heavy Warframe Society,\" Li Zhenzhen corrected him.\n\n\"But we are so few. How could we survive the attacks from all the other players on campus?\" Fatty looked rather sad. It was rare that the Heavy Warframe Society had a chance to shine, which would end very soon.\n\n\"One society against the entire school. Even if we lose, we should still feel honored.\" Wang Mengmeng said seriously.\n\n\"Yes, even if we lose, we will give them a hard time,\" Skinny also said excitedly.\n\n\"Blindness cannot solve any problems,\" Lu Meng calmly said. \"Starry Group was stupid to have chosen this map. They think that now Sen could not dodge or hide, but they have forgotten that we are against students instead of an army. Maybe the Warframe Society members have better disciplines, but the rest of them have no experience in group fight. In such a narrow space, we have more opportunities.\"\n\n\"Lu, tell us what plan you have,\" Shi urged him anxiously.\n\n\"At that time, they will certainly place us in the same spot, so there has to be sacrifices. However, if some of us could manage to march into the crowd, they will become our best cover.\" Lu Meng said confidently, \"Among us, Sen, Zhang Yang and I have the best skills, so the rest of you should cover us to get to the crows. I made a diagram and we should all have a look. Fatty and Skinny will come with us and sacrifice themselves when necessary. The three girls are responsible for covering the team by firing...\"\n\n\"Great. Let’s do this and kill those sons of bitches out there.\" Skinny cried after looking at Lu Meng's diagram.\n\n\"No problem, this is our chance to shine. We will go as far as possible and none would dare to look down on Heavy Warframe Society,\" Fatty gritted his teeth and said.\n\n\"Brother Han, rest assured that I will cover you,\" Wang Mengmeng said.\n\n\"Don’t, Mengmeng. Please do not try to cover Sen. Just avoid firing on us,\" Shi quickly said. He was worried about Wang Mengmeng’s operational skills. She was like a kid and completely wasted such a good warframe as Destroyer.\n\n\"Ha-ha...\" Others laughed.\n\n\"Well, Mengmeng, you will be the one responsible for covering me. Don’t mind other things,\" Han Sen said with a smile.\n\n\"A brother is a brother... much better than the rest of you,\" Wang Mengmeng said happily.\n\nAt the start of the fight, in the virtual scene, all players were sent from the surrounding channels. And the sponsor, Starry Group, did what Lu Meng said they would do—sending the Heavy Warframe Society members in the same spot in order for the rest to besiege them.\n\nThe moment they appeared in the ring, Han Sen, Lu Meng, Zhang Yang, Fatty and Skinny drove their warframes at full speed and rushed to the crowd.\n\nWang Mengmeng, Wang Chun and Li Zhenzhen were firing at them at the same time to cover the five warframes leading the team.\n\nWhat Lu Meng said was right. The opponents were not a well-trained army after all. Seeing the five coming over, everyone’s first reaction was to fire at them, which made a complete mess.\n\nBecause the venue is a ring with limited space, crossfire would easily cause accidental injuries.\n\nHan Sen and his people spread out, firing while approaching the other warframes, which was not easy to achieve under such intense assault.\n\nHan Sen’s eyes were burning. Sitting in the holographic simulation machine, he summoned fairy queen and shapeshifted.\n\nImmediately, the holographic images seemed to have slowed down. Everything can be calculated now.\n\nHan Sen quickly made dazzling movements with his hands, making Silver Killer move like a ghost. Holding one particle submachine gun in each hand and carrying two laser swords on his back, Han Sen marched forward without pauses while shooting rapidly.\n\nAt Blackhawk, most of the teachers and students were watching this game, and Fang Mingquan now had over 10 million viewers and was getting more.\n\n\"Ha-ha, Heavy Warframe Society took the initiative to attack.\"\n\n\"It seems they have not given up.\"\n\n\"Come on, annihilate the rest!\"\n\n\"It's so exciting!\"\n\nFang Mingquan was constantly adjusting all the lens to present the viewers with the best angles.\n\n\"They want to go inside the crowd, which is a very smart approach. Because their opponents are not professional soldiers, they can use the melee to their advantage.\" Those who knew tactics understood what the Heavy Warframe Society was trying to accomplish.\n\n\"Please let them go deep!\" Some people were praying for the Heavy Warframe Society.\n\n\"Go!\" More people were simply excited. No matter who won, all they wanted to see was a good fight.\n\nIn the monitoring room of the sponsor, Zhao Nengtian sneered, \"With so few people, they could never beat hundreds of warframes.\"\n\n\"Director, you are so wise. That guy is dead,\" His secretary Zhang said with a flattering smile.\n\nBoom! Boom! Boom!\n\nThe sounds of explosion were ringing on the site and it was a total chaos.\n\nWang Mengmeng made Destroyer stand still and fired away toward the direction of Silver Killer.\n\n\"S*#t! That Destroyer must be operated by a spy. It will kill Silver Killer first before anything else.\"\n\n\"Ha-ha, we have a traitor here.\"\n\n\"The Destroyer is such a clown!\"\n\nWhen the viewers were amused by the performance of the Destroyer, their faces suddenly froze.\n\nSilver Killer was moving like a phantom. As if it had eyes on its back as well, it managed to dodge all the attacks from the Destroyer like it was rehearsed beforehand.\n\nSince the opponents’ vision was first blocked by Silver Killer, they had failed to see the Destroyer’s attacks. When they saw, it was too late.\n\nBoom! Boom! Boom!\n\nAs Silver Killer moved past them, several warframes exploded under the fierce assault, leaving all the viewers stunned."
}