{
    "chapter": 2526,
    "title": "Meeting Li Keer Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2526",
    "text": "When he fought with his Gold Robot General, Han Sen was like a wolf entering a sheep pen. Wherever his swordlights went, his enemies fell to pieces. Those King class Steel Armors couldn’t withstand the weakest of his strikes.\n\n“Xenogeneic King hunted: Steel Armor. Xenogeneic gene found. Obtained Steel Armor beast soul.”\n\nAfter killing one hundred Steel Armors, Han Sen finally earned a beast soul.\n\nThe steel castle appeared to be tired now, though. Its speed had slowed, and not as many Steel Armors were coming out of its doors. It looked like a gasping beast after a long run.\n\nThere were fewer than two hundred Steel Armors, all-in-all. Before today, Han Sen would have had a hard time tracking down and eliminating that many. But the Gold Robot General went through them like a hot knife through butter. He mopped up the last of them in moments.\n\nWhen Han Sen turned to go after the steel castle, the space around it vibrated, trembling like it was being shaken by some cosmic earthquake. A crack in space opened behind the weird steel castle, and the monster entered the space crack and disappeared.\n\nHan Sen was shocked. The bronze furnace was happily munching on the bodies of the Steel Armors, placing them in its forge-like belly.\n\nBut because the furnace was small, after eating eight of the Steel Armors, it couldn’t consume any more.\n\n“Where is the deified xenogeneic you were talking about?” Han Sen asked the bronze furnace.\n\nThe bronze furnace whistled like a steam engine and spat out more fire. The fire became words, and they said, “Didn’t it just run away?”\n\n“That steel castle was a deified xenogeneic?” Han Sen mumbled in surprise. And then he asked, “Can I still find it?”\n\nHe had wanted to see what else might be able to come out of the steel castle, which was why he hadn’t tried to enter it. But now that it had run off, Han Sen was starting to regret his approach.\n\n“Can’t find it,” the bronze furnace said by spitting out words.\n\nHan Sen shrugged his shoulders. He turned around and rummaged through the broken Steel Armors for their xenogeneic genes. There was a steel cogwheel in each of their hearts. Those were their xenogeneic genes.\n\nHan Sen wasn’t going to swallow their entire bodies like the smithy furnace. He dug out the core xenogeneic genes and placed them inside Destiny’s Tower.\n\nHan Sen put away the Gold Robot General beast soul. He didn’t need it any longer.\n\nHan Sen was still collecting his core xenogeneic genes when he saw someone approach. He raised his head. It was that yellow-clothed woman again.\n\nLi Keer had followed the trail left behind by the bronze furnace’s presence. She had been quite shocked to find that her Very High Sense couldn’t pick up Han Sen’s trail. Her only hope of finding him was to follow the leftover presence of the bronze furnace.\n\nAs soon as Han Sen came into view, Li Keer also saw the Steel Armors scattered all across that zone of space. She paused for a moment to stare at the sight, dumbfounded.\n\nShe recognized those Steel Armors for what they were. She knew that the Steel Armors came from a steel castle that was a core deified xenogeneic. She could only see the bodies of the Steel Armors, though. She didn’t see the steel castle anywhere. The steel castle, she surmised, had probably run away from Han Sen.\n\nThat realization was stunning.\n\nDuring the fight with the Gold Armor General, Han Sen’s main attack had come from Dragon One’s deified treasure, the Dragon Tattoo Tooth Dagger. Li Keer understood that.\n\nAt that point, Li Keer had doubted Han Sen’s attack power. But now, Han Sen had chased the steel castle away all alone. She was no longer hesitant to believe in his capabilities.\n\n“A King can battle deifieds? Although the core area’s deified xenogeneics are weak—akin to fake deifieds—the results Dollar is achieving are still nearly unbelievable. Plus, he can somehow slip under my Very High Sense. Where does this human Dollar come from? Even the Extreme King haven’t had someone this talented in the last thousand years,” Li Keer thought to herself. Without hesitation, she went right up to Han Sen.\n\n“Lady Clothes, how much of a coincidence it is for you to show up here.” Han Sen greeted her grudgingly, but he still acknowledged her as she drew near.\n\n“It isn’t a coincidence. I have come looking for you,” Li Keer said.\n\n“You were looking for me? You aren’t asking me to kill the bronze core tripod again, are you?” Han Sen frowned. He wasn’t interested in doing that, and if Li Keer didn’t uphold her end of their bargain, he was just going to ignore her.\n\nLi Keer shook her head. “I saw the words you left on my back. I saw them, and I’m here to admit that I lost. I really did lose to you.”\n\nHan Sen was shocked. He hadn’t expected Li Keer’s attitude to change so much. She suddenly wasn’t so annoying to talk to.\n\n“You don’t have to say such things, my lady,” Han Sen said.\n\n“Why don’t we get to know each other a little better? Let’s try this again. My name is Li Keer.” Li Keer held out her hand and smiled.\n\n“Dollar.” Han Sen shook her hand.\n\n“I’ve heard a little about you. If it is possible, I’m interested in hiring you to kill the bronze tripod with me.” After Li Keer lowered her hand, she smiled again.\n\n“I’m afraid I must disappoint you. I have something important that needs doing.” It didn’t matter if Li Keer was nice or not; Han Sen had no interest in traveling with her. His plan to kill deified xenogeneics took precedence.\n\nLi Keer wasn’t disappointed, though. She gently said, “Don’t say no just yet. How about hearing what I can offer you first?”\n\nHan Sen thought she would offer up a xenogeneic gene or something. It couldn’t be anything spectacular, but since she was being polite and she wasn’t an enemy, Han Sen was willing to let her say her piece.\n\nLi Keer rolled her eyes. She moved forward to stand atop the bodies of the Steel Armors. “If I’m understanding this situation correctly, you have just slain a horde of Steel Armors and made the steel castle run away, yes?”\n\nHan Sen looked at Li Keer. He didn’t confirm or deny her summary. His silence was an affirmation on its own, though.\n\nLi Keer’s eyes brightened. She had already guessed what had happened, but now her conjecture had received confirmation. She was pleasantly surprised.\n\n“The steel castle of the core area isn’t very strong for a deified, but you have managed to chase it off as a King class. Not many people in this universe could do such a thing. Dollar’s name surely carries weight,” Li Keer said, gushing his praises.\n\n“What are you trying to say?” Han Sen frowned. He felt annoyed.\n\nHe wasn’t a kid who had never seen the world. He wasn’t going to get cocky just because this woman was complimenting him. From what he could tell, Li Keer’s praise was just wasting his time.\n\n“You have the power to kill core deified xenogeneics, but actually taking them down isn’t as simple as beating them in a fight. Most deified xenogeneics won’t remain in one place for you to deliver the final blow. Like the steel castle, they can be hard to find once they decide to flee. But I can find them. If you help me hunt a core bronze tripod, I can help you locate the deified xenogeneics you seek,” Li Keer said with a wink."
}