{
    "chapter": 2898,
    "title": "Yellow Temple",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2898",
    "text": "All the princes and princesses followed, but Han Sen did not. He walked into the Red Temple and went into the building via the doors.\n\nKatcha!\n\nThe closed metal box opened again. Quickly, Han Sen saw a transparent monster manifest from out of the box.\n\n“This is it. This creature looks like a spirit, but it is not quite the same.” Han Sen looked at the transparent monster and had many thoughts.\n\nWhen the creature appeared, it threw a punch at Han Sen. Han Sen looked at it with a complicated expression. He did not want to fight back. He wanted to accept its punch and feel its power.\n\nWith Han Sen’s power, even if he were to be the recipient of a no-holds-barred punch, he would not be hurt. He might as well have been tickled.\n\nThe undead fist and red light did not land on Han Sen. Another hand, which was like crystal and jade, punched toward the incoming fist. It punched the red light and struck the creature. It made the creature fall backward.\n\nHan Sen turned around. He saw it was Bai Wei who was stumbling back after claiming the hit, which was initially primed to strike Han Sen.\n\n“It is dangerous here,” Bai Wei said. “You should fall back!” She waved her fists. Without waiting around, she was madly going for the creature again. She was eager for a good fight.\n\nIt was an Extreme King Shocking Sky Punch versus an Extreme King Shocking Sky Punch. Bai Wei and the creature were having a hard fight.\n\nBai Wei’s Extreme King Shocking Sky Punch was very big and powerful, and the creature was very weird and sneaky. It was hard to determine who would win.\n\nBai Wei’s Extreme King Shocking Sky Punch kept changing throughout the fight. She slowly started to cast it like the creature’s own use of Extreme King Shocking Sky Punch.\n\nHan Sen could tell Bai Wei was using the undead to practice the Extreme King Shocking Sky Punch. She had learned the undead’s Extreme King Shocking Sky Punch movement.\n\nHer talent was very good. Not long later, she was already very good with the undead’s Extreme King Shocking Sky Punch. The way she used it was just like the undead.\n\nPang!\n\nThe undead was punched. It broke apart and vanished like water.\n\n“Killed beginner undead.” The Red Temple played that same electric voice again. The metal box immediately closed.\n\nBai Lingshang smiled and walked forward. He looked at Bai Wei as he said, “Bai Wei, your punching skills have vastly improved.”\n\n“Thanks, Sister Ten. It was just a basic thing of the Extreme King,” Bai Wei coldly answered.\n\nWhile they were talking, the metal box opened again. The exact same undead came out of it.\n\nPang!\n\nThe undead had only just emerged when Bai Lingshang waved her hand. An ice light froze the undead’s body and made it become some icy dust.\n\nAfter becoming familiar with the pattern of attack of this undead and its movements, the prince and princesses, who had king bodies, could eliminate the foe with ease.\n\nBai Lingshang said, “Let’s leave the Red Temple. Otherwise, the undead here will keep on coming.” She immediately departed the Red Temple.\n\nHan Sen and Bai Wei left the Red Temple too. After leaving the Red Temple, Han Sen went back to have a look at it. The metal box was shut. Nothing jumped out again.\n\n“Hm, that undead really does look like a spirit. The resemblance is truly uncanny. That is especially true of the aura it carries. Very strange. Very strange, indeed.”\n\nHan Sen frowned and thought, “The xenogeneics inside the Nine-Defense Palace lost their spirits. Is it related to the undead over here?”\n\nHan Sen felt as if he had discovered something, but it was still quite messy. The thoughts he was having about it all weren’t exactly in focus yet. He knew he would have to put his mind to it a little harder. Figuring out the exact connection between these factoids was quite the head-scratcher. After all, answers were never handed over to him on a silver platter.\n\n“Mister Holy Baby, is there a reason father sent you here?” Bai Lingshang walked in front of Han Sen. She lowered her body and smiled at Han Sen.\n\n“What am I supposed to do for him?” Han Sen asked.\n\n“Perhaps recording the performances of the prince and princesses?” Bai Lingshang put her lips next to Han Sen and spoke quietly so only they would hear it.\n\nAfter that, Bai Lingshang stood up and smiled. “Let’s go. They are already on the other island. If we delay any longer, we might miss out on the good stuff.”\n\nAfter that, Bai Lingshang walked to the bridge behind the Red Temple.\n\nHan Sen thought, “These princes and princesses… None of them are lanterns that have saved oil. Bai Lingshang guessed some of it right, but she will never think that aside from watching them, I need to keep them safe. I have to say, Bai King is very thoughtful. If he allowed a different elite to come, the princes and princesses would be more suspicious.” He walked with Bai Wei to the bridge.\n\nMost of the princes had already started crossing the bridge. Only a few prince and princesses stayed to watch Bai Wei fight the undead, so they were a bit slow. Han Sen, Bai Lingshang, and Bai Wei were the last ones to go. Once they got closer to the second island, they noticed the island was very similar to the first one. There was a metal temple on its peak, but this time the metal temple was yellow. It looked like it was made from gold. The sign atop the door simply said, “Yellow Temple.”\n\nThe door of the Yellow Temple opened. From far away, they saw a transparent undead with blood vessels that looked like gold fighting Bai Kanglang.\n\nThat undead’s power was stronger than the last. The foe still made use of Extreme King Shocking Sky Punch, but it was suppressing Bai Kanglang. Bai Kanglang was in trouble.\n\nHan Sen arrived on the island and watched the fight just as the others did. He noticed the yellow undead was different from the red undead.\n\nThe yellow undead seemed stronger than the red undead, but not by much. The body of the yellow undead was a bit different. It had long hair, and the body was not so transparent. One was able to see its gold blood vessels but not the organs. It looked more alive, unlike the red undead that looked like a machine.\n\nThis yellow undead was more agile than the red one. Its intelligence in the fight was greater too. Bai Kanglang was already using his king body, but he was still being suppressed. He could not claim an advantage, so he was getting beat. It seemed likely he would soon lose.\n\n“This familiar feeling is stronger.” Han Sen looked at the yellow undead and frowned. He did not know if it was just a placebo, but he felt like the undead had a connection to spirits.\n\nKatcha!\n\nBai Kanglang’s knife was broken by the undead. He looked frazzled as he stumbled in retreat.\n\n“Let me fight it!” Bai Wanjie’s eyes looked bright. He stepped forward and ran toward the yellow undead."
}