{
    "chapter": 1184,
    "title": "You’re All Going to Die Here",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1184",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen removed the Dragon-Blood Ring from his finger. If Immortal Emperor truly was Sky King, he’d recognize Dragon King right away. Han Sen and Dry Bone King arrived at the Immortal Hall. Han Sen was eager to see what Immortal Emperor looked like.\n\nQing Jun and Ghost Eye were there, as well. When Baby Ghost saw Han Sen, a visible look of surprise came over his face. Han Sen waved at him cheekily and then went to sit down.\n\nHan Sen looked over towards the primary seat of the table, which was currently empty. Immortal Emperor had yet to arrive. No one spoke during the wait, not even the oh-so talkative Ghost Eye. It just sat where it was, taking part in the eerie silence.\n\nQing Jun was the one who sat nearest the primary seat, and she looked at Han Sen as if she were looking at a dead man.\n\nHan Sen didn’t care very much what she may have been thinking, though. He just sat in his seat, waiting for Immortal Emperor to arrive.\n\nKatcha!\n\nThe latch of the back door was lifted. The sudden sound was loud, and it shocked those in their seats. Han Sen turned to look in the direction of the noise.\n\nWhen his eyes fell upon Immortal Emperor, he was surprised. He had often wondered what the enigmatic spirit would look like, and he had come up with numerous visions and images in his head. But this spirit subverted all his expectations: Immortal Emperor looked like a peacock.\n\nThe peacock was gold, with a number of multi-colored ornamental eyespots decorating its plumage. It was stunning.\n\n“I thought he was a spirit. Why is he a peacock?” Han Sen mulled the appearance, as the peacock waddled its way over and took its rightful place in the primary seat.\n\nAll the king spirits and super creatures in the hall bowed before it, so Han Sen did the same. The peacock’s eyes glanced over everyone in the hall but paused when they passed over Han Sen.\n\nWhen it was done, the peacock screeched, prompting everyone to look at it in wonder.\n\nIt stretched its wings, and its eyes shot out a beam of golden light.\n\nWithin that gold light, a thin shadow formed. Han Sen could not make out the face of whatever or whoever it was, but its mere presence there rattled his nerves.\n\nHan Sen saw the shadow’s lips begin to move, and it looked to be speaking to Qing Jun. No one else was able to hear what was being spoken except for her, it seemed, for she nodded in answer.\n\nWhen the light came to an end, Qing Jun said, “Yes, My Emperor.”\n\nThe shadow nodded and faded as the light dimmed. Then, the peacock flapped its wings and flew out. After the peacock left, the king spirits and super creatures in the hall all felt great relief. It was as if they had been holding their breaths the whole time.\n\n“Qing Jun, what did Mister Immortal tell you?” Water Fairy asked.\n\nQing Jun quietly said, “Mister Immortal is going to open the Holy Door. He needs a lot of Sky Fruit to make pills, so he wants us to gather as much as we can over the next month.”\n\n“A month isn’t very long. There are still twenty-three of them to go; do we even have enough time?” Dry Bone King said.\n\n“We will have to form the paths, too. It is best that we hurry. Delaying Mister Immortal would be most unwise,” Qing Jun said.\n\nDry Bone’s face changed.\n\n“Everyone works beneath my command. I will be most cruel and unpleasant to anyone who seeks to disturb Mister Immortal’s business,” Qing Jun said.\n\n“I don’t want to delay anything, but I have to eat walnuts every three days. If I don’t, I cannot participate in the work,” Han Sen said.\n\nQing Jun said, “Lifewater can keep you in your current state, child. There is no need for you to exit.”\n\n“I don’t have any lifewater,” Han Sen then said, as cover for not wanting to consume it due to the possible consequences they could result in.\n\nQing Jun expected Han Sen to say this, though, so she gave everyone a bottle of the stuff. Then, she said, “Everyone is given ten drops of lifewater as a bonus. If we finish the job within the allotted month, we’ll get twenty more as a reward.”\n\nEveryone was delighted to hear this. They accepted the lifewater merrily, thanking the emperor for the gracious gift. Han Sen accepted the bottle and listened to Qing Jun’s work instructions.\n\nQing Jun took them straight over to the Sky Fruit. The spirits and creatures were supposed to create the paths that led to them, but now they had to chip in and make their own due to the rush.\n\nQing Jun put everyone in charge of two Sky Fruit.\n\n“If things go according to plan, the tree will indeed see a revival in the next month,” Dragon King said. Han Sen had re-equipped the ring and was consulting with him.\n\n“Is there any way we might be able to muck up his plans?” Han Sen said.\n\nDragon King said, “I don’t think so. The spirits and super creatures have all consumed too much lifewater. They are beyond saving, and the Sky Tree is sure to absorb them all. Unless you can cut down the Sky Tree, it is hopeless. Not even Sky King himself could make a comeback after that.”\n\nHan Sen frowned. He had yet to save Qiu Ping, and he had just learned about Baby Ghost being a Vice-Leader of Blood Legion. It would be a proper shame if the latter died. Just as Han Sen was thinking about Baby Ghost, Baby Ghost was actually approaching him.\n\n“Didn’t I tell you not to return?” Baby Ghost looked ugly—uglier than usual.\n\n“Give it a rest, will you? You’re like a broken record. I’m fine where I am, okay?” Han Sen said.\n\n“If it wasn’t for that relic you showed me, I wouldn’t care about you one bit.” Baby Ghost paused for a moment, before going on to say, “But for you to come back at this time, it is as good as suicide.”\n\n“Why?” Han Sen asked.\n\nBaby Ghost then said, “Honestly? Aside from Qing Jun and me, you’re all going to die here.”"
}