{
    "chapter": 2639,
    "title": "Killing a Deified Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2639",
    "text": "Han Sen used his power to restrict the Demon Abyss Beast King, but his arrows didn’t seem to inflict any damage on the creature. Black holes appeared and vanished all across the Demon Abyss Beast King’s body. Whenever an arrow came close, it would be sucked into one of those black pits, keeping the damage from reaching the Demon Abyss Beast King. This was all within what Han Sen had expected, though. The Demon Abyss Beast King’s power and capabilities had been detailed in the information he had been given. Han Sen never expected his arrows to be able to damage the Demon Abyss Beast King. He was simply buying enough time to get closer to the creature.\n\nFinally, Han Sen got close enough to the Demon Abyss Beast King. Han Sen spun his Six Core Snake Bow and used it like a knife. The razor-sharp string sliced into the Demon Abyss Beast King’s scales, leaving deep wounds across its flesh.\n\n“Just as the file said. The Demon Abyss Beast King’s Demon Abyss power can consume energy, but it cannot turn away physical damage.” Han Sen felt calm.\n\nThe Demon Abyss Beast King became very angry after being struck. Its blue light raged with greater ferocity.\n\nBut Han Sen attacked again and again with the Six Core Snake Bow, flitting around the Demon Abyss Beast King like a mosquito buzzing around a magnificent beast. No matter how loudly the Demon Abyss Beast King roared, it couldn’t hit Han Sen. It then activated an area attack, but the fortitude of Han Sen’s peacock king’s soul robe was enough to shrug off all the damage. The Demon Abyss Beast King couldn’t do anything against him.\n\nYu Kun stood to the side, doing absolutely nothing at all. He only restricted the Demon Abyss Beast King a little bit. Han Sen continued fighting at close range, and the Demon Abyss Beast King was being dealt more and more wounds.\n\n“What a scary guy. This moveset and those knifeskills resemble Sky Palace’s Under the Sky. But who in our race ever practiced Under the Sky to such a level of proficiency?” Shiya asked with shock.\n\nZuo Yu was recording the fight between Han Sen and the Demon Abyss Beast King. And as he continued to record it, he said, “Under the Sky hasn’t been complete for long. Not many students have practiced it, no. But there will eventually be more. This will be perfect learning material.”\n\nShiya shook her head. “This isn’t something you can just watch and learn. You need to know how to use it, and executing a skill like this would be much harder than analyzing it. To be straight with you, only practitioners who have already mastered the skill could benefit from watching this. Most students wouldn’t stand any chance of becoming as skilled as Han Sen, no matter how many times they watched this video. Maybe it wasn’t a fluke that the Very High test ranked him as an eleven armor talent.”\n\nZuo Yu laughed and said, “Well, having this video will be better than nothing! I hope the Sky can develop a few elites like Han Sen.”\n\n“I don’t think we need to doubt Han Sen’s capabilities any longer. A ninth-tier King is killing the Demon Abyss Beast King. Although he does use two powerful treasures, Han Sen is definitely scary. If he is a spy, he is a great danger to Sky Palace. But right now, we still don’t know where he came from,” Shiya said.\n\n“If he isn’t a spy, then we have gotten very lucky. This is our department’s responsibility. We must confirm his identity and political alignments,” Zuo Yu said.\n\n“That is true, but the civilization of the crystallizers is long gone. The few that remain are vagrant, interstellar travelers. We have been looking into Han Sen’s past for some time, but after finding the Kate, we lost the trail. Plus, the Kate’s planet has been ravaged by war in recent years. Many of the Kate people have lost their homes. There won’t be much left for us to learn,” Shiya said.\n\n“But we still have to do it. This investigation is our responsibility, and the leader takes Han Sen very seriously. So, we have to find out. With his reputation, his influence within Sky Palace will continue to grow,” Zuo Yu said as he watched the Demon Abyss Beast King battle Han Sen. The man’s expression was grave.\n\nA sad wail rocked the whole of the Demon Abyss. The Demon Abyss Beast King’s head was chopped off by the Six Core Snake Bow. Demon blood cascaded down like rain.\n\n“Xenogeneic deified hunted: Demon Abyss Beast King. Xenogeneic gene found.” As this happened, an announcement sounded inside Han Sen’s head. When he heard no mention of a beast soul, he looked disappointed. Yu Kun began hauling the Demon Abyss Beast King’s body out of Demon Abyss. He couldn’t hide it from the Sky Palace students. They could guess that Han Sen and Yu Kun had killed the Demon Abyss Beast King together.\n\nAs everyone discussed Han Sen killing the deified xenogeneic, a student found a video showing Han Sen’s performance in killing the Demon Abyss Beast King. That video was quickly distributed all around Sky Palace.\n\n“Brother Han is using Under the Sky. That belongs to the Sky, doesn’t it?”\n\n“Under the Sky can be that powerful?”\n\n“Of course it is strong. I heard Brother Han actually contributed to its modifications.”\n\n“It looks like I should start learning Under the Sky, then.”\n\n“Yes, we should. When Brother Han gets back to teaching, we should ask him.”\n\nMany of the students in Sky Palace started to discuss Han Sen’s use of Under the Sky, but after Han Sen saw the video himself, he could only frown.\n\n“It looks like Sky Palace sent someone to watch me. Otherwise, there’s no way someone could have filmed a video like that while we were fighting,” Han Sen said. Han Sen kept thinking. He decided to agree to Sky Palace Leader’s request that he join the Very High for four years. When he returned, he would be given the Constellation Sea all for himself.\n\nWhen Sky Palace Leader heard Han Sen’s decision, he didn’t sound happy. He said grimly, “If you want to go, there is something annoying you must do before your departure. You cannot leave, otherwise.”\n\n“What annoying thing?” Han Sen frowned. He had thought that making the decision would be the difficult part. What had gone wrong now?\n\nSky Palace Leader squinted his eyes and said, “Exquisite wanted you to go, but you beat her and made her give up all hope. If you want to go, you need to make Exquisite select you once more. You will have to clean up this mess yourself.”\n\nHan Sen’s mouth hung open. After a while, he said, “What is this? If I had known, I wouldn’t have beaten her so badly.”\n\n“Don’t be so depressed. Beating her might not have been a bad thing. At least now she will look at you differently. And that means she will hold you in higher esteem. This way, you will have more freedom,” Sky Palace Leader said with a laugh.\n\n“Can’t you send someone to apologize on my behalf?” Han Sen asked, trying not to cringe. He had beaten her badly and forced her to face painful realizations, all because he didn’t want to go. Now he had changed his mind. After Han Sen thought about it some more, he realized he might have been a bit of a cretin.\n\n“You are the one who beat her. It is now up to you to change her mind again. Otherwise, even if you somehow reached the Very High on your own, only trouble would await you. Why not get it sorted before you go?” Sky Palace Leader patted him on the shoulder and went on to say, “Don’t mess this up. I have faith in you.”\n\nHan Sen had no idea how to deal with this situation, but he wanted the Constellation Sea. He had to do what Sky Palace Leader was telling him to."
}