{
    "chapter": 2238,
    "title": "Transfer Order",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2238",
    "text": "When Han Sen arrived at Ice Blue Knight King’s office, the Knight King and Mister White were already there. They both looked at Han Sen with strange intensity as he entered.\n\n“Ahem… Mister Knight King. Is there something you require of me?” Han Sen asked with a cough.\n\nIce Blue Knight King squinted while he looked at Han Sen. “Kid, you are good. You are just like me in the days of my youth.”\n\n“Mister Knight King, what is that supposed to mean?” Han Sen looked at Ice Blue Knight with a modicum of confusion.\n\nIce Blue Knight King handed Han Sen a form with a blank space for his signature. “Queen Bai Wei would like to invite you to go to the Extreme King homeworlds with her. The request has been approved. If you sign this, you can leave with Queen Bai Wei.”\n\nAfter giving Han Sen a quick rundown on the relevant details of the trip, Ice Blue Knight King smiled and said, “You are good. It only took you a few days to attract the desire of the arrogant little Queen Bai Wei. She is a uniquely talented girl. Many nobles of the Extreme King wish to marry her, but she has rejected the advances of every one of them. I sure didn’t see this coming.”\n\n“You misunderstand. I think Queen Bai Wei only admires my power.” Han Sen didn’t really agree with Ice Blue Knight King’s description of her talents.\n\nBut still, Bai Wei was strong. Her body wasn’t any weaker than Han Sen’s, and she was a top Marquise by all accounts and measurements. It was an exaggeration to say she was “uniquely talented,” though. Lone Bamboo’s fitness was just as strong as Bai Wei’s, and it’d be fair to say he was more skilled.\n\nIt seemed that Mister White could see right through Han Sen, though. The man smiled and said, “You might not have heard this, but there is something special about the Extreme King. Being accepted amongst the three highest races has its perks. Right now, Queen Bai Wei is top class. She might not be the strongest in the universe, but if she becomes King class and activates her King body, killing a half-deified enemy won’t be a difficult task for someone like her. She might even be able to hold her own against a fully deified opponent.”\n\n“King body?” Han Sen looked at Mister White with shock.\n\n“That is no secret. Although the Extreme King may not be born deified like those of the Ancient God, we have King bodies. As long as we achieve King class, we can activate King bodies. That power makes us stronger than those of the same level. That being said, it does cost a lot of energy, and it cannot be used infinitely. Still, it is quite powerful. Plus, once we become deified, the King body can give us a boost. That makes a deified Extreme King stronger than the average deified.”\n\nMister White paused briefly, then resumed by saying, “It has been discovered that Queen Bai Wei possesses a very brilliant King body. She is one of the most gifted you can find amongst the Extreme King. If she becomes King class, she can become deified.”\n\n“It’s that great?” Han Sen was surprised. Mister White seemed quite willing to discuss the subject in depth.\n\nIce Blue Knight King looked at Han Sen and said, “Mister White has spoken a great deal to you, so you should understand our situation.”\n\n“I understand. I will stay away from her.” Han Sen nodded.\n\nWith talent like Bai Wei’s, she would be very important to the future of the Extreme King, and her marriage would be a very complicated political matter.\n\nThe two men before Han Sen were giving him a warning. They didn’t want him chasing after Bai Wei.\n\n“You don’t have to think too much. We might be going overboard. Just be yourself and don’t disobey her. Being Queen Bai Wei’s loyal guard is an important posting. You will benefit greatly from that position.” Ice Blue Knight King smiled.\n\n“I don’t like leaving so soon. Please let me stay in the Ice Blue System for a while.” Han Sen wasn’t interested in selling himself off to the Extreme King.\n\nHan Sen had little interest in being a loyal guard, and he hadn’t yet discovered how to use the plate. He hadn’t tracked down what Night River King had discovered out at the border of the Ice Blue System, either. He didn’t want to leave with so many loose ends.\n\n“That won’t be possible. This transfer order is coming straight from King Bai. You and your team have to go to the Extreme King homeworld with Queen Bai Wei,” Ice Blue Knight King said.\n\n“She said she was here as punishment, and she is going back so soon?” Han Sen had a wry smile.\n\n“After what happened with Night River King, King Bai doesn’t believe she is safe here. So, she is being forced to return,” Mister White said.\n\n“Return to your rooms and ready yourself. In two days, I will be escorting you to the Extreme King to be sure that nothing else happens to you.” Ice Blue Knight King then waved his hand in dismissal.\n\nHan Sen had to leave Ice Blue Knight King’s office. As he walked, he thought to himself, “Did King Bai find out that I took the Undying Bird Nest? Is that why he’s actually summoning me?”\n\nIt had been two weeks, and the little red bird had remained quietly in the nest the entire time. Han Sen had put other bird eggs inside, and within two hours, they hatched. That meant the nest still had its powers. He just didn’t know why the little red bird was taking so long to hatch.\n\n“I hope the little red bird hatches before I journey to the Extreme King. If the Undying Bird Nest is taken by King Bai, I’ll have no chance.”\n\nBack in his rooms, Han Sen explained his situation to Han Yan and his companions. They prepared to go to the Extreme King in a few short days.\n\nEdward heard the news, and it made him frown.\n\n“If Han Sen goes to the homeworld, we’ll lose our chance to get our hands on the item.” As the Ice Blue Knight spoke, his expression turned pensive.\n\n“We can’t allow him to go to the Extreme King. He has to stay here,” Edward said.\n\n“How do we make him stay? After the incident with Night River King, Ice Blue Knight King himself is going to escort Han Sen to the Extreme King. We wouldn’t stand a chance. You want to take on people loyal to Ice Blue Knight King? We aren’t strong enough.”\n\n“Maybe not.” Edward suddenly had a thought. “The only way is to cooperate with Ice Blue Knight King.”\n\n“What?” The Ice Blue Knight jumped out of his chair, staring at Edward with wide eyes. “You’re going to tell Ice Blue Knight King that Han Sen took the relic?”\n\n“Yes.” Edward nodded.\n\n“No, no way!” the Ice Blue Knight shouted.\n\n“It is the only way. That is how we keep Han Sen and the item,” Edward stated coldly.\n\n“But…” Before the Ice Blue Knight finished, Edward interrupted.\n\n“There is no ‘but.’ This is the only way.” Edward squinted in thought. “Do not forget that Ice Blue Knight King doesn’t know about the relic.”\n\nThe Ice Blue Knight was shocked. He sat down and forcibly calmed himself, then said, “You mean we are going to tell Ice Blue Knight King that Han Sen has a relic, but we won’t tell him what it is?”"
}