{
    "chapter": 2273,
    "title": "Secret of a Stone",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2273",
    "text": "Crime approached the statue from the side, but it gave no reaction. So, Crime walked in front of the main hall’s gate. Nothing weird happened there, either.\n\n“Mister White, if it isn’t affecting us, should we just ignore it?” Han Sen looked at the stone.\n\nMister White shook his head. “The Sacred Leader left this item here on purpose. Maybe we will require it later on, and it could be difficult to come back to get it. And Fox Queen might take it if we leave it here.”\n\n“You are right, but isn’t it possible that the Sacred Leader is trying to play us? There might actually be a trap inside the stone,” Han Sen said.\n\nMister White was momentarily silent. “That’s possible, but I still think we should try. If the Sacred Leader wants to trick us, we might have to spring the trap in order to find the treasure.”\n\n“Let me give it a try,” Crime said. He gathered up a surge of black light within his knife and swung it at the stone.\n\nDong!\n\nA strike that could split space came down on the stone. It made a loud clanging sound, but the stone wasn’t damaged. And there wasn’t even a mark left behind.\n\nCrime’s face became grim. The black light rose around his body and turned into a dark fire. His body looked as if it was wholly shielded by demons. The disturbing light danced around the hall.\n\nThe dark light surrounded Han Sen, and he could not see or feel anything. It was like he was stuck in absolute darkness.\n\nHan Sen was shocked. He expanded the bird’s nest to shield himself and the blood kirin, in case Crime was preparing to attack them.\n\n“Crime’s area of effect ability can muffle all seven senses. It kind of resembles my Dongxuan Aura.” While Han Sen was thinking, the darkness dissipated.\n\nCrime hadn’t tried to attack them. When the room brightened again, he was standing beside the rock, looking defeated. He shook his head to Mister White. He had tried his best, but he had been unable to break the stone.\n\n“Mister White, would you like to give it a try?” Crime offered politely.\n\n“No thanks. If not even your power was able to leave a mark on it, then this stone isn’t something that can be opened by brute force,” Mister White said, then walked over to the stone to examine it.\n\nHan Sen put away his bird’s nest. He walked closer to the stone and used his Purple-Eye Butterfly to check the stone out.\n\nThe history of the stone began to scroll back in Han Sen’s vision, and after a minute or two, Han Sen jumped in surprise.\n\nThe stone had originally been a bucket of viscous liquid, like cement. A demon-like creature was thrown into the liquid.\n\nNo matter how much the demon struggled, it was unable to get out. The demon and that liquid were dumped into a mold. The liquid hardened over time until it became the stone in front of them.\n\nHan Sen raised his eyebrow at the stone.\n\nMister White looked at it for a while and frowned. “This stone seems to have a will of its own. A very scary will, at that. Perhaps that will is the key to breaking the stone open.”\n\n“Mister White, what do you propose to do?” Crime asked.\n\nMister White thought and said, “Let me use my soul sealing technique. I’ll see if I am able to seal the will that’s inside this thing.”\n\nAfter that, Mister White lowered his hand onto the stone, a strange symbol glowing on his palm. The symbol pressed against the stone, and the quiet stone was suddenly shaking like mad. A demonic, roaring noise came from it. It was terrifying.\n\nUnder the glow of the symbol’s light, the green stone started to bleed. The stone turned red.\n\nPat!\n\nThe symbol that Mister White had branded onto the stone cracked and shattered, and then the stone returned to normal again.\n\nMister White was pale and trembling. Crime immediately moved over to put a hand on his shoulder and ask, “Sir, are you okay!”\n\n“I am fine.” Mister White shook his head. “The will inside that stone is so strong that not even my soul sealing technique worked. I’m afraid that this will belongs to a deified being.”\n\nUpon hearing those words, Han Sen smiled and asked, “Mister White, if I am able to break this stone, can I have whatever is inside?”\n\n“We are cooperating, so we will have to share, of course,” Crime said coldly.\n\nMister White, however, seemed to have thought of something. He smiled. “If Han Sen can open it, then it would be a waste to leave it here. If you can open it, then the item inside is all yours. If it is useful, I hope you will use it to help us when the time demands it.”\n\n“Of course.” Han Sen walked in front of the stone. He pulled out a silver sycee and placed it on the stone. Then he stepped back. Han Sen used his mind to self-destruct the beast soul he had linked to the sycee.\n\nAfter the beast soul was destroyed, the silver sycee’s suppressing power was directed into the stone, instead. The stone started to shake again, and a scary roaring noise came from it. Drops of blood appeared on its surface.\n\nThe silver sycee was vibrating as well, but it did not fall off the top of the stone where Han Sen had placed it.\n\n“It looks like the leader left the Silver Treasure Fruit Tree in the palace earlier on purpose. It was not a random placement; it was put there so that this stone could be broken. It is fortunate Han Sen brought the silver sycees with him. Otherwise, we’d have had no hope of opening this stone,” Mister White said.\n\nWhile they were talking, cracks began to spread across the stone’s surface. The raging noises of its interior became even worse.\n\nPang!\n\nSuddenly, the stone exploded. Chunks of red rock flew in every direction. When the dust had settled, Han Sen walked over to the site of the explosion and picked up an item.\n\nIt was a green crystal orb. There seemed to be smoke inside it, and the cloudy mass swirled with a magical allure. Han Sen could even see words flashing within the murk.\n\n“What is it?” Crime asked Han Sen, who was still holding the orb.\n\nHan Sen grinned and put the orb in his pocket. “Didn’t Mister White say that the contents of the stone would be mine?”\n\nCrime grunted and turned away from Han Sen. Mister White smiled graciously. “Well, now you have it. Let’s get moving.”\n\nHan Sen doubted that Mister White and Crime would keep their promises. They had come there prepared, and they were going to betray Han Sen. He was very firm in his suspicions, so he had to claim as many rewards as he could for as long as he was able to.\n\nHan Sen followed behind Mister White, examining the orb as he went.\n\nThe orb was very misty, and the cloudiness almost hid the words inside it. When Han Sen looked closely, he was given a surprise. The content of the text was similar to the Blood-Pulse Sutra."
}