{
    "chapter": 2448,
    "title": "Location Confirmed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2448",
    "text": "“Talk me through your idea,” Han Sen said to Fang Qing Yu. He was beginning to think that this young man was a very interesting person.\n\n“The path you have selected isn’t bad. You have taken a road that the Extreme King have no control over. Plus, you have a pretty amazing ship in the shape of a big whale. It is a fair assessment that the Extreme King won’t catch up to you very quickly. But the road you have selected is also very dangerous. Even if the Extreme King don’t catch you, your path is full of risks. Both the Tianxia System and the systems of chaos have innumerable dangers, many of which are impossible to predict or anticipate. And the Extreme King have three teams of knights in the systems of chaos. They will probably be your greatest opposition. But, if I send them a video of you at the proper time, we might actually be able to put them to use.” Fang Qing Yu’s excitement took on a mischievous edge.\n\n…\n\nA giant black beetle soared through the clouds, and upon the back of the black beetle rested a stone castle. Many Extreme King were moving about the castle as they fulfilled their various duties.\n\n“Mr. Bao Qin! Mr. Bao Qin!” An old member of the Extreme King raced over to the floating garden, where Bao Qin was drinking tea.\n\n“Old Butler, what’s the rush?” Bao Qin asked the butler, taking a sip of tea and putting down the cup.\n\nThe old butler looked very excited. He stepped over to Bao Qing’s chair and said, “We found him! We have found where Han Sen is!”\n\n“Oh, where is he?” Bao Qin jerked his head up in surprise. The investigators themselves hadn’t brought him this news, so he wasn’t sure how the butler had received word.\n\n“Here…” The old butler brought out a Wanjie Rubix Cube. He set it in front of Bao Qin and pressed one of the squares to show the video.\n\nA boat appeared, traveling through a sea of blue clouds. A man sat on the small boat, appearing relaxed and comfortable as he paged through a book. At the front of the boat, a line of creatures were using their power to pull the ship forward.\n\nThe creatures were from a dozen different races, and there was even a Demon amongst them.\n\nThey were like huskies pulling a sleigh as they struggled to drag the boat forward. If they slowed down for a second, the man atop the boat would wave his hand and whip the creatures. The blows broke their armor and flesh, and they screamed with every strike. The man, meanwhile, never even looked up from his book.\n\nOne of the creatures pulling the boat, a Feather man, was covered in wounds. It looked as if he had received numerous beatings. His head was lowered, but he had secretly activated the Rubix cube. He looked very angry.\n\n“Save me! If anyone can get me out of here, I will give them all the treasure I have in the Thousand Treasures Alliance. No, I will give seventy percent…” said the man’s voice. Bao Qin stared at the Rubix cube on the table in front of him.\n\n“What is going on?” Bao Qin looked at the man on the boat, and then realized it was Han Sen, the very man they were after.\n\nThe old butler was almost vibrating with excitement. “The Feather man pulling the boat is Fang Qing Yu. He is a member of the Thousand Treasures Alliance. He hired a group to help him explore the Tianxia System. While there, his group encountered Han Sen. Han Sen captured them and set them all to pulling his boat; he appears to be trying to escape the Tianxia System. Fang Qing Yu is a Feather, but Han Sen doesn’t know he is a member of the Thousand Treasures Alliance. Fang Qing Yu has a Wanjie Rubix Cube that he’s using to send out a call for help, hoping that someone will rescue him.” The old butler sounded so excited. “Now that Fang Qing Yu is sending messages through the Wanjie Rubix Cube, we know where Han Sen is. All we must do is give chase!”\n\n“Who is this Fang Qing Yu?” Bao Qin asked the old butler. Rather than seeming happy, his face had turned down into a frown.\n\nThe old butler quickly said, “I have checked. Fang Qing Yu is a Feather, but he is an orphan. He was taken in by an elder of the Thousand Treasures Alliance. He has nothing to do with the Feathers, and he has nothing to do with Han Sen. That elder from the Thousand Treasures Alliance has already sent people to the Tianxia System in order to save him.”\n\n“Good.” Bao Qin nodded. He looked at the video on the Wanjie Rubix Cube. “Can you tell where he is within the Tianxia System?”\n\nThe old butler laughed. “The blue sea clouds. There are hundreds of them across the Tianxia System, but the clouds in different areas all have unique identifying aspects. Judging from the information we’ve gleaned from the video and the direction the boat appears to be proceeding, we have deduced they are located in Sea Cloud Number 75. We’re in purple Sea Cloud Number 86, which isn’t too far from Han Sen’s position.”\n\n“Keep an eye on them, and turn us to an intercept course,” Bao Qin said.\n\n“Yes! Han Sen can’t outrun us this time, no matter what,” the old butler said, then he sent the order to turn the giant black beetle toward Han Sen.\n\nAs they began traveling through clouds that Han Sen had already passed through, the old butler frowned. “Weird. When they went through here, they must have left some trace of their passage, even if it was only a single hair. Why can I not sense anything? Did we go the wrong way?”\n\nBao Qin smiled and said, “If we found obvious evidence of their passage, then we’d know that we weren’t on Han Sen’s trail. He’s too good to leave behind obvious signs of his presence. Go faster. We must be going the right way!”\n\n“Yes,” the old butler answered, and the black beetle accelerated.\n\nThey didn’t discover any signs of Han Sen’s presence, but based on the video of Fang Qing Yu’s Wanjie Rubix Cube, they knew they were headed in the right direction.\n\nHan Sen’s little boat wasn’t moving nearly as fast as the black beetle. By the old butler’s estimation, they would catch up to Han Sen in another eighteen hours.\n\nAt that moment, they glanced at the video on the Wanjie Rubix Cube and saw that Han Sen’s boat was coming to a stop. A group of cloud beasts appeared in front of the boat, then turned aggressively and attacked. Chaos ensued. Fang Qing Yu was trying to fight off the xenogeneics. He couldn’t use the Wanjie Rubix Cube at the same time, so the video was switched off.\n\n“Oh no! It is a bunch of high-level cloud beasts. A few of them are King class cloud apes. If Fang Qing Yu is killed, we’ll lose track of Han Sen,” the old butler said, looking glum.\n\n“Go full speed! Find them before they finish fighting the cloud beasts,” Bao Qin commanded, his face grim."
}