{
    "chapter": 2489,
    "title": "Weird Hordes of Cloud Beasts",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2489",
    "text": "Frustration filled Han Sen. Since leaving Lando and Meng Lie, he had changed directions many times and even crossed back over his own path. He could barely believe that Meng Lie had still managed to find him.\n\n“If I knew he’d show up, I wouldn’t have come back. That sea of clouds was weird, but I’d be better off there than here facing Meng Lie.” Han Sen turned around, wanting to return to that sea of clouds.\n\nBut just as he started moving, Meng Lie swiftly teleported in front of him. Rather than attacking, though, Meng Lie simply spoke.\n\n“Han Sen, if you come with me, I won’t hurt you. Perhaps I can even keep you alive.”\n\n“You think the Extreme King will let me live if I go back with you?” Han Sen lifted his lips in a sneer.\n\nMeng Lie laughed. “I’m not going to lie to you; you were going to be killed. But things changed once you helped Lando become deified. This ability can guarantee your survival. If you aid the Extreme King with unwavering dedication, we can erase the crime of killing a prince.”\n\nHan Sen was shocked. He couldn’t believe Meng Lie had said such a thing.\n\n“But I killed King Bai’s son. Are you sure he will let me live?” Han Sen said in disbelief.\n\n“You know, the king has over a hundred children and countless grandkids.” Meng Lie chuckled again. “You didn’t kill an important prince. And if anyone else had killed him, there’s no way they would have been able to elude capture for so long. But you, Han Sen, are different. If you will work for the Extreme King, I can keep you alive.”\n\nHan Sen rolled his eyes. There was no chance of winning if he fought Meng Lie, and there would be no way of escaping this man, either. He was just pretending to listen, stalling for time as he tried to think of a way out.\n\nSeeing that Han Sen hadn’t responded, Meng Lie went on to say, “Let’s presume you make it to Sky Palace. Do you really think all of this will blow over with time? The Extreme King will not allow a prince to have died for nothing.”\n\n“Fourth Uncle, it’s just as you say: a prince of the Extreme King cannot die for nothing. If I go back with you, how would they allow me to live?” Han Sen frowned.\n\nMeng Lie smiled and said, “Han Sen has to die. But you might not be Han Sen.”\n\nWhen Han Sen finally understood was Meng Lie had been implying, his eyes widened.\n\nSeeing that Han Sen was confused, Meng Lie said, “Our people won’t let the killing of an Extreme King prince go without retribution, and we wouldn’t make this sort of offer to anyone other than you. But if you insist on continuing to Sky Palace, it doesn’t matter what crime you committed or what skills you have; the Extreme King will not allow you to live.”\n\nMeng Lie’s explanation had made things very clear. If Han Sen was willing to submit and work for them, he would be allowed to live. If he couldn’t be used to their benefit, then they would keep trying to kill him even if he reached Sky Palace.\n\nHan Sen started to say something, but he suddenly saw some blue cloud beasts heading toward them.\n\nMeng Lie frowned. Deified elites tended to scare off anything beneath their level, but these cloud beasts were just Marquise class. Despite their complete lack of strength, the cloud beasts charged forward without hesitation. Han Sen thought this was strange, to say the least.\n\nHe waved his hand, and the cloud beasts disappeared. After his deified power hit them, not even their bones remained.\n\n“Han Sen, what is your decision?” Meng Lie asked, looking at Han Sen.\n\nHan Sen remained silent, but Meng Lie didn’t rush him. He just stood where he was, patiently awaiting a response.\n\nHan Sen wasn’t mulling over Meng Lie’s question, however. He was thinking about the cloud beasts that had just come his way.\n\nWith a deified elite around, the cloud beasts should have stayed as far away as they could get. They would run off as soon as they smelled a deified, let alone walked right up to one.\n\nThe horrible expressions on the faces of those cloud beasts were the same as the ones Han Sen himself had witnessed in the sea of creamy clouds. But he was no longer in the creamy cloud sea. An idea began to form in Han Sen’s mind as he thought about the enraged cloud beasts he had fought.\n\nBefore Han Sen could answer Meng Lie, another group of cloud beasts came for them. But this time, the cloud beasts were clearly of a different variety. Several different varieties of cloud beast were represented here.\n\nThere were a few Kings among them, heading up the regiments of various species.\n\nHan Sen might be able to convince himself that the low-level cloud beasts were too stupid to detect the deified presence of Meng Lie, but there was no way that the more powerful cloud beasts were that dumb. They were Kings, and they led other cloud beasts toward Han Sen and Meng Lie. This was very abnormal behavior.\n\nMeng Lie’s face darkened in anger. He waved his hand, and his gold substance chains became an area. It killed the oncoming group of cloud beasts.\n\nThose first few King class cloud beasts were killed in a second. Nothing there stood a chance of fighting back.\n\n“I am Meng Lie! If you have the balls to, come out and fight me! Sending these pathetic cloud beasts against me won’t accomplish anything, you weakling!” Rather than looking at the bodies of the cloud beasts, Meng Lie had turned to shout up at the skies.\n\nMeng Lie knew that the cloud beasts weren’t behaving normally. He thought someone more powerful was deliberately sending the cloud beasts his way.\n\nBut Han Sen knew that the clouds beasts had been acting strangely since before Meng Lie had shown up, so whatever was going on, it had little to do with the deified Extreme King.\n\n“Weird. If someone is controlling these cloud beasts, that person must be very powerful. But if so, why aren’t they attacking directly?” Han Sen thought to himself. “Those cloud beasts didn’t act like something was controlling them. It was as if they had seen something.”\n\nSuddenly, Han Sen’s heart jumped as a thought crossed his mind. He suddenly looked into his Destiny’s Tower.\n\nHe had met a few cloud beasts before, but none of them had been this powerful. And the cloud beasts wouldn’t be attacking him without reason.\n\nThe weird stuff had only started happening after Han Sen took the black cricket and the spider plant.\n\nAt first, Han Sen thought that there was merely something wrong with the xenogeneics in the creamy cloud area. Perhaps they were naturally more aggressive or territorial than other cloud beasts. But after leaving the creamy cloud sea, weird things were still happening. That suggested that the problem stretched beyond the creamy cloud sea.\n\n“Are those cloud beasts coming after this?” Han Sen looked at the first floor of Destiny’s Tower, which was where he had placed the cloud, the black cricket, and the spider plant.\n\nThe cloud had wrapped around the spider plant, but the black cricket had disappeared. It must have gone into the cloud.\n\n“If the cloud beasts are attracted to these things, then taking them with me might be a bigger problem than I thought,” Han Sen thought to himself.\n\nBut he didn’t know if the cloud beasts were attracted by the spider plant or the black cricket. And with Meng Lie next to him, he couldn’t take the two items out to compare them.\n\n“Han Sen, have you made a decision yet?” Meng Lie asked Han Sen, upon seeing no other intruders.\n\n“Sure. I will go to the Extreme King with you, but you must swear that I will remain safe,” Han Sen said to Meng Lie after a bit of hesitation.\n\n“Don’t worry. I won’t let you die. If you come back with me and work for the Extreme King, I promise that no one will be able to hurt you,” Meng Lie said with grave certainty."
}