{
    "chapter": 2901,
    "title": "Egg in the Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2901",
    "text": "He rubbed his eyes to take another look. He knew he was not seeing things. The giant egg was really transparent.\n\n“Why is this happening? Does it have to do with a part of my bloodline belonging to the crystallizers? Is it because of Wan’er inside my Destiny’s Tower enabling me to see the lady in the egg?” Han Sen could not think of a reason, but he knew for sure that Starter King’s Land was not built by the Extreme King Alpha. He bet there was a 90% chance it had something to do with Sacred Leader. After Sacred was destroyed, it somehow fell into the Extreme King Alpha’s lap. He went ahead and turned it into Starter King’s Land.\n\nHan Sen wanted to get the blonde girl out of the big egg to see what was going on, but he did not rush the process.\n\nThe Extreme King had the big egg for a long time, and it was still fine. It had not been destroyed. Therefore, he believed it could not be so simple.\n\nBai Wanjie and the others were worried. They did not enter the mountain. They merely peered into it from the outside.\n\n“I have a question that I don’t understand,” Bai Wei said.\n\n“Bai Wei, you can ask whatever you want if you do not understand something,” Bai Lingshang said with a smile. “Let’s all discuss it together. Perhaps we can solve the problem you have.”\n\nBai Wei thought for a moment and said, “Everyone must have heard about whenever Starter King’s Land began. Princes and princesses were dying in Starter King’s Land, right?”\n\n“That is correct. Although the death rate in Starter King’s Land is low, the weird thing is that one or two prince or princesses died every time.” Bai Lingshang nodded.\n\n“That is weird,” Bai Wei said. “Starter King’s Land only opens once in a while, and you cannot exit when the way back is closed. The teleporter is active once a month. Even then, you can only exit and not enter. If so, who carried the bodies of dead prince or princesses back?”\n\n“Of course, it had to be the prince or princesses that went there,” Bai Lingshang said. She quickly thought something was wrong. She frowned and receded into thought.\n\nIf the danger was able to kill princes and princesses, and every time it opened it could kill princes and princesses, the danger was there. If the danger was there, how could the prince and princesses bring back the dead bodies while there was danger?\n\nDid the princes and princesses take family that seriously? Would they risk their lives so much as to bring back dead bodies?\n\n“It is a shame we do not know the prince or princesses that died. I have never thought about their bodies being brought back or not before.” Bai Lingshang frowned.\n\nBai Wanjie looked at the mountain. He glanced at the tool and big egg and said, “There are only two possibilities. One is that the danger comes and goes. It only happens if we do something. So, they are able to bring the bodies of the dead prince and princesses back. Or maybe…”\n\nBai Wanjie stopped talking. Everyone knew what he meant. Bai Wuchang said, “Or they did not have any dead bodies to bring back. Perhaps they were consumed by something, and that is why there were no dead bodies.”\n\nEveryone looked at the big egg. If the second possibility was true, it would be too dangerous for them to venture inside the mountain. Han Sen was thinking that there should have been a protector like him in the past. Perhaps it was the protector’s duty to bring the bodies of the prince and princesses back.\n\nHan Sen did not think that was correct. If there was a protector, why did many princes and princesses die in the first place?\n\n“That means there are only two possibilities. The first being that there was no protector at all. The second is that there were protectors, but they were unable to protect.” After Han Sen thought of this, he suddenly felt the need to be a whole lot more cautious.\n\nThe few of them looked at the big egg in the mountain with complicated expressions. No one dared to go in.\n\n“We cannot keep staying here,” Bai Wanjie said. “Let me see if I can find a way to try it.”\n\n“Brother, try any way you can,” Bai Lingshang and Bai Wuchang said at the same time.\n\nBai Wanjie nodded. He pulled something out that was the size of a fist. It looked as if it had been made of vines. It looked like a ball.\n\nWhen they looked closer, it was not a ball. It was like a birdcage. A green parrot was inside that small, ball-shaped birdcage. It had four legs, and its face looked like a tiger.\n\n“Inside this thing is the primitive-class xenogeneic Tiger God Eagle.” Bai Lingshang knew where that weird bird was from.\n\nBai Wanjie nodded. “This treasure is called Trapped Animal Cage. It can trap birds and such. The longer it is in there, the more they will listen to you. Their wildness will eventually be tamed. I have only had this Tiger God Eagle trapped inside here for half a year. It is not tamed yet, but we can use it to explore what is down there.”\n\nAfter that, Bai Wanjie threw the Trapped Animal Cage with the Tiger God Eagle into the mountain. The Trapped Animal Cage landed on the big egg. People thought it was going to slide away.\n\nThis trapped animal cage was like a magnet. It stuck to the big egg. It was no longer sliding down.\n\nBai Wanjie’s body flashed. He saw the cage was becoming bigger. It turned into a vine cage that was 30 feet tall. The Tiger God Eagle looked how it was before, but it was now like a big, prehistoric beast.\n\nThe giant egg now looked small. It looked like an egg that the Tiger God Eagle itself had pushed out. The Tiger God Eagle grabbed it in its talons.\n\nThe Trapped Animal Cage turned into a vine. It came out like a snake. It went back into Bai Wanjie’s hands and turned into a little vine ball.\n\nHan Sen and the others looked at the Tiger God Eagle, which was free. Its claws grabbed the big egg and made a strange sound. It flapped its wings and generated a green typhoon. It looked like it was going to fly.\n\nNo matter how much its wings flapped, it could not fly. Its claws were dug into the egg, and it could not release them.\n\nThe Tiger God Eagle kept screaming. It had a green light. The substance chains became stronger. It carried wind power to help its power go up.\n\nThe effort was useless. No matter how much it tried, it could not get out.\n\nThe scary thing was that Han Sen and the others saw the Tiger God Eagle’s body grow old. It was like someone’s life had been fast-forwarded in a video within the space of an hour.\n\nNot long later, the Tiger God Eagle lacked the power to struggle. Its old body fell, but it still stuck to the big egg hanging in the air. It was like a dead chicken that had been cooked.\n\nEveryone looked shocked. The Tiger God Eagle was not a very good primitive xenogeneic, but it wasn’t weak for a primitive either. It had been unable to escape, and its lifeforce was gone.\n\nPata!\n\nWhen the Tiger God Eagle body’s lifeforce was totally destroyed, its body detached from the big egg. It fell like a boulder. It fell into the bottom of the mountain and the crystal wheel inside."
}