{
    "chapter": 2589,
    "title": "Race Weapon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2589",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen everyone saw the skies of the systems of chaos, they all looked happy.\n\nHan Sen looked around as they emerged, but he couldn’t see a Black Hole Spider anywhere. The space crack they had just exited hung like a rift in the sky.\n\nOnce they fully left the rift, a short knife flew out behind them. That knife was shaped like a dagger that was only one foot long. It was curved like a crescent moon and white like a fang. Space distorted around the small weapon as it moved.\n\nYisha was holding a curved scabbard. When the fang-like knife reached her, she slid it into the scabbard and attached the scabbard to her waist.\n\nThe space crack lost the support of her Teeth Knife, and in seconds, it had collapsed and disappeared entirely.\n\n“Master, what kind of knife is that? Why is its presence so familiar to me?” Han Sen couldn’t help but ask Yisha. That moon-like Teeth Knife had Teeth powers. And they certainly weren’t ordinary Teeth powers.\n\n“This is the knife that belonged to my race’s alpha. It is called Break Space Teeth. If I hadn’t had this knife to open the space tunnel to get to you, it would have been impossible for me to get into the Black Hole Spider’s belly to save you,” Yisha said, her face impassive.\n\n“Teacher, how did you know we were inside the Black Hole Spider’s belly?” Han Sen had been wondering this since she first appeared.\n\nEven though she had Break Space Teeth, which could open a space tunnel, Yisha would have needed to know where Han Sen was before she could jump to him. How could she have so accurately leaped into the Black Hole Spider’s stomach to save him?\n\nIf she had made the tiniest mistake, such as opening a space tunnel inside the gruesome flesh of the Black Hole Spider and alerting the gross fiend, Yisha would have probably met a grizzly end. She wouldn’t have been saving anybody.\n\n“While no one else knows of your return, let us head to Sky Palace,” Yisha said simply. She didn’t answer Han Sen’s question.\n\nIf Yisha wasn’t going to answer, then there was no point in Han Sen asking her again. He continued to follow Yisha as she traveled through the systems of chaos.\n\nWith Yisha there, leading the way, their path was much safer. Han Sen had unlocked the ninth-tier of his Blood-Pulse Sutra during his time inside the Black Hole Spider’s belly. The Story of Genes had been leveled up, too.\n\nIt was just as Han Sen expected. As The Story of Genes’ area increased, the strength of his body increased along with it. His connection with the black crystal armor had also become clearer and more defined.\n\n“If I become half-deified, will I be able to manually activate the black crystal armor?” Han Sen wondered.\n\nThe white tiger followed them out. It flew along with them, not looking as if it wanted to leave.\n\nIt was weird. When they left the Black Hole Spider’s belly, the mushrooms on their heads died and didn’t grow back.\n\nBut the white tiger’s head still had a mushroom on it, and that mushroom showed no signs of dying. Everyone else, however, was quite pleased to see their mushrooms shrivel and fall away. It was as if a weight had been lifted off their shoulders as a grand crisis was resolved. But Yisha looked at the white tiger and said, “Inside the Black Hole Spider’s belly, nothing below the rank of deified can survive. If you all survived this long, you should be thanking the mushrooms you were given.”\n\nHan Sen and the others were shocked. They had viewed their mushrooms as something of a curse. They had never realized that the mushrooms were protecting them. They looked at Yisha with a gaze of disbelief.\n\n“You think it’s that easy to live inside the Black Hole Spider’s belly?” Yisha asked sternly. “There are scary powers in there that you couldn’t even see. The powers in that place are like viruses that can invade the bodies of anything. They break down entire creatures into nothing but raw nutrients to feed the Black Hole Spider. Without a deified body, it is impossible to withstand or even notice those powers before it is too late. Even with a deified body, survival is not guaranteed. The mushrooms that the big white cat placed on your heads are the only reason you guys were able to survive there for the duration you did.”\n\nWhen Han Sen heard Yisha say this, he suddenly had a flashback to the information he discovered inside the broken battleship. He thought to himself, “When that woman conducted the tests that we saw, was it to allow the white cat to survive there? If what Yisha says is true, then it seems pretty likely. The mushroom on the white cat was probably invented by that woman. It was a vaccine to resist the viruses that would have otherwise ravaged the white tiger’s body. We were saved by it.”\n\nHan Sen wasn’t sure if “vaccine” was the right word to describe a mushroom with magical healing powers, but he decided to go with it. “So, ever since we first arrived in that place, the white tiger was sustaining our lives. Without it, even if I survived, everyone else would have died.”\n\n“But how did that woman get inside the Black Hole Spider’s belly in the first place? And why did she leave by herself, leaving the white tiger behind?” Han Sen really wanted to find that woman and ask her. But he had no clue where she might be found.\n\nEver since they parted ways in Two World Mountains, he never heard from her again.\n\n“What is up with you?” Yisha asked, looking at Han Sen’s head.\n\nBao’er was sitting on Han Sen’s shoulders, playing idly with Han Sen’s fox ears. She kept squeezing them. She seemed to be having a lot of fun with them.\n\nHan Sen told Yisha about what had happened in the tunnels under the island, and when Yisha heard what he said, she looked stunned. “Let me see the jian.”\n\nHan Sen brought out the purple copper jian to show Yisha. Yisha didn’t take it into her hands, but after a while, she nodded and said, “That’s it! That is the fox’s race weapon.”\n\n“It’s a race weapon?” Han Sen didn’t understand. He had never heard that term before.\n\nYisha sighed and said, “Right now, not many know about race weapons. In ancient times, all the races that lit up a geno lantern were able to make a gene weapon with the fire of the lantern. That race weapon would be fused with the genes of the race that forged it. It would gain incredible power and become a very special weapon. Some strong race weapons are like true god-level deified weapons. They might even be stronger. But each gene lantern can only ever forge one race weapon. The first person that lights up the lantern receives the weapon. If they light up the gene lantern again, they won’t get another. Stealing a race weapon is the only way to get a second one. So, right now, not many creatures know about race weapons. Even if they encountered one, most people would just think it was a powerful deified weapon.”\n\nAfter a brief pause, Yisha said, “The Foxes’ race weapon is called Nine Spin Destiny Mirror, but from what I know, it was a race weapon that the Foxes stole. It didn’t originally belong to them. I have heard that their real race weapon, the one they received when they lit their lantern, is the purple copper jian. I’ve never seen it myself, but I think that might be it.”\n\nHan Sen was thrilled to hear that, because the Nine Spin Destiny Mirror was also in his hands. He just didn’t know how to use the Nine Spin Destiny Mirror. He heard from Fox Queen that the Nine Spin Destiny Mirror only worked for Foxes who became deified. He didn’t know if that was the truth.\n\n“Teacher, is there a way to remove this ailment of mine?” Han Sen looked at Yisha, his eyes full of hope. She knew where the purple copper jian came from, so she must have known a way to fix it."
}