{
    "chapter": 2907,
    "title": "Weird Deified Xenogeneic",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2907",
    "text": "Although Han Sen was only butterfly class now, in the universe, no one treated him like one.\n\nHan Sen looked at everyone. He noticed the around eight people were deified primitives who all hailed from different races.\n\nThey looked a bit familiar. He had seen them all participate in the geno god list fights, but their performances were nothing remarkable. It was because of that Han Sen was not able to recall their names.\n\n“These guys aren’t of the same race. What are they doing here together?” Han Sen thought.\n\nDeified elites frequently cooperated with each other, but that was usually only in groups of three or five best friends. It was rare to see so many races cooperate at once.\n\nThe deifieds all recognized Han Sen and greeted him with exuberant passion.\n\nA deified elite, who looked like a rat that could stand, shook his head and said, “Godfather Han, it is an honor to see you here. This is my lucky day…”\n\nWhile he spoke, his small yet long tail waved. It made people feel annoyed to see it.\n\nAfter pausing, the rat-looking deified elite said, “I would like Godfather Han to bless me. What material does Godfather Han require to bless others?”\n\nEvery creature knew Han Sen did not require any materials to bless others. For him to ask like that was basically asking how much it would cost.\n\nHan Sen laughed and said, “Blessing you would be easy. The price is fair and square. For just one true god weapon, I can do it. But I cannot guarantee you will level up.”\n\nHan Sen set the price very high. No one would give up a true god weapon for a blessing. That was a way for him to reject requests. Han Sen did not want to use Blood-Pulse Sutra.\n\nAll of the deified creatures were disappointed. They were just primitive deifieds, so they did not have a true god weapon to hand out.\n\nBut they did not dare get emotional. They did not want to incite the ire of Han Sen, who might turn them into dust. They had practiced hard to get to where they were as a deified. A lot of it had even required dumb luck. If they were turned into dust, it would not only be a sadness for their loss of lives. It could have very well spelled doom for their entire race.\n\nIt was like the Buddha and the Destroyed. The Buddha were barely able to maintain control of the Buddha Kingdom, and the Destroyed were being harassed by ancient enemies.\n\nHan Sen looked at them and asked, “What are you guys doing here?”\n\nThe rat-looking deified creature immediately said, “Earlier, there was a God Spirit storm. A deified xenogeneic appeared from the God Spirit storm. We saw it. The deified xenogeneic was weird though. We are still talking about it.”\n\n“How weird was it?” Han Sen asked.\n\nEveryone was talking at once. They explained that they had encountered a deified xenogeneic.\n\nThe xenogeneics in the God Area came with the appearance of God Spirit storms.\n\nAll the primitive deifieds were in the same area when they experienced the God Spirit storm. They were all deemed food for the assembling deified xenogeneics.\n\nThe xenogeneic they saw inside the God Spirit storm was different from the usual suspects. That xenogeneic was like a stone tablet that was 30 feet tall.\n\nThe stone tablet had electricity in it. It was surrounded by a lot of light. Even a blind man could see it from a thousand miles away.\n\nThey rushed in front of the stone tablet, but the tablet had no words or symbols. There were no pictures on it either. There were three indentations in it.\n\nThere were three slots on the tablet. They were at the top and led down. The first one was like a human handprint, albeit much bigger.\n\nThe second one looked like a cat paw, but it was much bigger too.\n\nThe third one was like a cow’s footprint. That one, however, was at a normal size. It was a small footprint.\n\nThe three marks on the stone tablet released a bright light.\n\nIn the God Area, all xenogeneics were weird. One often found stone xenogeneics too. The primitive deified creatures wanted to destroy the stone tablet to see if they could get a deified xenogeneic gene.\n\nWhen they attacked the stone tablet, they were unable to harm the stone tablet. The light of the stone tablet grew brighter. Ultimately, there was no difference. The power of the stone tablet did not fight back either.\n\n“How could this happen? Is that stone tablet xenogeneic still around?” Some xenogeneics that fell from the God Spirit storm would not disappear when the storm was over, which was why Han Sen asked.\n\n“It is still around, but the stone tablet is black and no longer shines. If we do not see it shining, no one would think it was a deified xenogeneic. You would just think of it as an ordinary stone block.” The rat-like creature paused. With an evil look, he said, “Han Godfather, if you are interested, we can take you there to see it.”\n\n“Yes, please.” Han Sen was worried about not being able to find high-level xenogeneics. Upon hearing what they said about the stone tablet xenogeneic was weird, there was a chance it was a high-level one.\n\nA few deified xenogeneics led the way. Han Sen followed them. Altogether, they flew for 3,000 miles. Eventually, they saw a stone tablet that was a couple of dozen feet high.\n\nThe stone tablet was very rough. It was square, and it did not have engravings or markings on it. The stone tablet was full of holes. It was not even. It looked like a normal big stone board.\n\nHan Sen turned the stone tablet around. He saw the three marks on it. Their shape and appearance were just as they had been described.\n\nAside from the stone tablet, someone was standing before it. It was Bai Wushang. He was one of the Extreme Kings in the god list fights.\n\nHan Sen had heard Bai Wushang was a higher level than Bai King now. He was a person from the same era as Bao King. He was very powerful in the god list fights.\n\nHan Sen had not watched him fight, so he knew little about him.\n\nBefore the top 100 rank fights, Han Sen had not watched many battles. He had missed out on Bai Wushang’s fighting performance. In the top 100, no one dared to challenge Bai Wushang, and Bai Wushang did not challenge anyone.\n\nSo, Han Sen only knew how strong he was. He did not know exactly how strong he was.\n\nThe few primitive deifieds who saw Bai Wushang bowed before him. They did not dare go slow.\n\nHan Sen just stood where he was and did not move. His identity was one that harbored a grudge with the Extreme King. He would not talk with a deified from the Extreme King.\n\nBai Wushang ignored the primitive deified creatures. He just stared at the stone tablet.\n\nThe primitive deifieds were ignored, but they did not show emotion. They just retreated elsewhere.\n\nBai Wushang watched for a while. He then raised his fist and punched the stone tablet.\n\nHe used the Extreme King Shocking Sky Punch. His punch was performed at a very high level. The punch, which looked very casual, had the power to suppress the sky and the earth.\n\nBoom!\n\nHe punched the stone tablet. The stone tablet’s surface caved-in with the shape of a fist.\n\nThe moment Bai Wushang brought his fist back, the fist-crater shone. It shone with rainbow light."
}