{
    "chapter": 9,
    "title": "Sacred-Blood Creature",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_9",
    "text": "Han Sen returned to his room, tied the copper-toothed beast to a cage and put the black crystal in front of it. The beast gobbled up the black crystal greedily.\n\nAfter an entire day, Han Sen noticed some changes to the copper-toothed beast. Its fur had been gray-black like a wild boar, and its fangs had been bronze. Now its fur also started to show a bit of bronze luster, and the fangs had become brighter in color.\n\nHowever, this was not a true mutant copper-toothed beast, which ought to look like a bronze statue. Although this one did show some show some bronze luster, it was still quite different from a mutant one.\n\n\"It seems that the evolution from a primitive creature to a mutant creature is a more complex process than from ordinary to primitive, so it requires more time than one day,\" Han Sen pondered.\n\nAfter more than two days, its bronze color thickened, but the copper-toothed beast still didn’t look like it was going to evolve anytime soon.\n\nHan Sen had to let the beast evolve at its own pace, and go kill some primitive creatures for money. Plus, he could also use some primitive geno points.\n\nEven if one didn’t choose to use the primitive geno points to complete evolution, the more primitive geno points one gained, the stronger the body would become. And the same went for ordinary and mutant geno points.\n\nIf one could max out on ordinary, primitive and mutant geno points, one’s physical conditions would still be far beyond the average level, even without evolution.\n\nWith the black cystal, it wouldn’t be difficult for Han Sen to max out on all four types of geno points. At the moment, he wanted to max out on the other three before he focused on sacred geno points.\n\nHan Sen left his room and walked into the shelter, feeling slightly different: today the streets seemed to be a lot less crowded than usual.\n\n\"What’s going on?\" Han Sen walked past the plaza and found fewer stalls there than usual as well. People there were all whispering something to each other.\n\nHan Sen listened for a while and started to figure out what had happened.\n\nA few days ago, someone had spotted a new sacred-blood creature near the Sunset Slope. Somehow the three gangs in Steel Armor Shelter all found out about it and gathered at the slope, but the outcome was terrible: the sacred-blood creature ran free while a lot of men were killed.\n\nToday, Qin Xuan, Son of Heaven and Fist Guy had reached an agreement to hunt the sacred-blood creature together. They also recruited a lot of lone wolves and smaller groups, forming the largest campaign in Steel Armor Shelter in recent years. The three gangs were determined to kill this creature.\n\nHan Sen suddenly had an idea, so he turned around and ran out of the city. When there was no one around, he summoned the black-beetle beast soul and covered himself in armor. After running for two hours, he came to a stone hill west of Sunset Slope.\n\nHaving finally climbed to the top of the hill, Han Sen took a look in the direction of Sunset Slope. Among thousands of people fighting and yelling, there was a monster with the head of a cow, the upper body of a human and the lower body of a horse. It was holding a double-edged golden axe and pushing its way through the crowd. No one could withstand the fierce blow of its axe.\n\nHan Sen happened to see the monster swinging the axe at Son of Heaven. who even had his blood-red sword, Son of Heaven did not dare to block the axe. He stepped on his own mount and leaped back a few feet.\n\nRoar!\n\nThe monster's double-edged axe hit the triceratops-like beast soul mount and split it in two halves. That broke Son of Heaven’s heart. A mutant beast soul mount was very rare, with the same value as a small interstellar spaceship.\n\n\"How is this sacred-blood creature so strong?\" Han Sen was shocked.\n\nThe sacred-blood creature ran and killed thousands of people in a flash, and no one was able to fight back. Even people as strong as Qin Xuan, Son of Heaven and Fist Guy didn’t dare to engage in a frontal attack. Hit by all sorts of alloy arrows and beast soul arrows, the monster still didn’t even get a scratch. When it swung the axe, no one could get close.\n\nSuch a mighty creature corresponded to Han Sen’s impression of a sacred-blood creature. The sacred-blood black beetle he killed was way too weak compared to this monster. It was only a little stronger than an ordinary black beetle and didn’t even feel like a sacred-blood creature.\n\nPeople were expecting to trap the sacred-blood creature, but now a key buffer was lost as the mount of Son of Heaven was killed. The sacred-blood creature was charging madly, waving the golden double-edged axe and leaving screams, blood, and limbs behind. It took it only moments to rush out of the siege to the mountain.\n\nAt the foot of the mountain, it even smugly turned around and stood on its back legs, mooing like a cow before it ran into the mountain.\n\n\"F*#k! It wants to escape!\" Son of Heaven furiously summoned a green eagle-shaped beast soul, which turned into a green iron bow in his hand. Then he summoned a fiery beast soul in the shape of a giant six-winged wasp as his arrow.\n\nSeeing the arrow, Qin Xuan and Fist Guy exclaimed, \"A sacred-blood beast soul of a six-winged wasp!\"\n\nThey had joined force with Son of Heaven in hunting the sacred-blood six-winged wasp. Son of Heaven was the one who had launched the final blow. They just didn’t expect him to be so lucky to have gained its beast soul.\n\nThere were less than ten beast souls known to people in the entire Steel Armor Shelter, and many were left by those who already had evolved and gone to Second God’s Sanctuary.\n\n\"Son of Heaven, stop! It’s a beast soul that can only be used once. If you failed to kill it…\" Luo Tianyang wanted to stop him, but it was too late.\n\nSon of Heaven had already shot the sacred-blood beast soul arrow with a full draw. The arrow turned into a red lightning bolt flying towards the sacred-blood creature.\n\nBang!\n\nThe sacred-blood creature felt the imminent danger and turned around. The wasp arrow shot into its chest and exploded, bursting open its flesh. The monster fell to the ground, losing its vitality as its internal organs and blood sprayed out.\n\n\"How dare you kill my mount? There is no way I’d let you live after doing that,\" Son of Heaven yelled loftily, standing like a king, leaving everyone in shock.\n\nWhile proud to see the crowd being impressed, including Qin Xuan, Son of Heaven suddenly saw a green shadow shooting down from the sky into the dying sacred-blood creature and ended its life.\n\nA golden figure immediately rushed down from the stone hill nearby and approached the sacred-blood creature. Lifting the golden double-edged axe to his shoulder, the mysterious figure ran towards the mountain in a flash.\n\n\"Dollar!\" Su Xiaoqiao recognized Han Sen’s unique golden armor in no time and called out loud."
}