{
    "chapter": 1960,
    "title": "Starsea Beast Evolves",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1960",
    "text": "Little Star was so happy, and it wagged its tail. It stuck out its tongue and consumed one whole piece of Galaxy Sand. It didn’t even chew the thing before gulping it down.\n\n“People might think you were a pig. You should at least try to taste it.” Han Sen looked depressed.\n\nLittle Star did not listen to Han Sen, though. It started to shine, until a strange aura burst out from it.\n\n“Don’t generate geno armor here. Stop!” Han Sen did not expect that a single grain of Galaxy Sand would force Little Star to produce its geno armor, so he shouted loudly in surprise.\n\nBut Little Star could not control the process. So, Han Sen brought it to the space tunnel and took it to Planet Eclipse.\n\nLittle Star shone with starlight. And then, it generated a starry set of armor. Without stopping, the star armor melted into a geno fluid that was absorbed by its body. The generation was heading into a second cycle.\n\nLittle Star’s second evolution was xenogeneic. Its starlight grew brighter, and it looked like a beast shrouded amid a countless number of stars.\n\nLittle Star finished its evolution, and then put its head next to Han Sen. It was staring at the box that contained the Galaxy Sand.\n\nHan Sen hid the box behind him, but Little Star was still looking at Han Sen with its eyes wide open. It looked as if the creature was begging.\n\n“I can only give you one more, then. But no more after this!” Han Sen felt pretty bad about it, but he gave in under Little Star’s gaze.\n\nLittle Star licked Han Sen and swallowed the grain of Galaxy Sand.\n\nThe most shocking thing was that after eating it, Little Star leveled up once again. It generated starlight power and became a Viscount.\n\n“D*mn! These things are that good?” Han Sen gritted his teeth and decided to give another one to Little Star. He wanted to see how much he could level it up. If one level really did equate to one grain of Galaxy Sand, then that would be wonderful.\n\nBut Han Sen’s wishes were not fulfilled this time. After Little Star swallowed the third piece of Galaxy Sand, it did not level up. The stars around it grew brighter, but that was it.\n\nLittle Star looked at Han Sen, but Han Sen did not provide it with any more. He called Little Angel, Zero, Han Meng’er, and Dragon Lady. He gave them each a grain of Galaxy Sand, with the hopes of bringing them up to become Viscounts.\n\nBut after they used the Galaxy Sand, none of them became a Viscount. That surprised Han Sen.\n\nDragon Lady said, “Galaxy Sand is powerful, but we have different elements. We have to refine it well for full-digestion, otherwise it will be hard to level up.”\n\nThe other three nodded and agreed with Dragon Lady. They were in a similar predicament as her, too.\n\nHan Sen ate one himself, then. The Galaxy Sand dissolved into a liquid inside his body. The power streamed through this body like a river.\n\nHan Sen quickly cast The Story of Genes to absorb the power of the Galaxy Sand.\n\nThe Story of Genes was really compatible. Han Sen had no trouble connecting with different elements, so he was able to use the energy quite effectively.\n\nGalaxy Sand was powerful, and it took Han Sen a few hours to completely refine the energy he was bestowed. It was difficult to refine it all. Han Sen gave Little Silver a grain of Galaxy Sand next, but he was already a Viscount. It didn’t work well on him, but it did provide him a lot of power to refine slowly.\n\nLuckily, Little Star was a xenogeneic. If anybody asked where it came from, Han Sen could just say it was from Planet Eclipse.\n\nThe tale might seem unlikely, but there were enough xenogeneics on Planet Eclipse that it would be difficult to prove if the tale was true or false.\n\nHan Sen took the grains of Galaxy Sand back with him to the Alliance, and he began refining it one piece per day. He spent his leftover time learning geno arts and staying with his family.\n\nHan Sen thought that due to the fact that there were so many grains of Galaxy Sand, with each one packing so much energy, the bounty would eventually bring his The Story of Genes up to Earl class. After refining half of the lode, though, there had yet to be a single sign of him leveling up again.\n\nHan Sen was depressed, so he decided to feed Little Star a few more. Little Star ate ten of them, and eventually, it became an Earl.\n\n“That is a staggering difference.” Han Sen felt depressed.\n\nHe knew Little Star’s element was highly compatible with the Galaxy Sand, but it really was so much easier for Little Star to level up compared to him and The Story of Genes.\n\nHan Sen refined the rest of the Galaxy Sand himself, and when he was done, he felt himself teetering on the brink of leveling up. But even so, he couldn’t get that last push to nudge him into Earl class.\n\n“So many pieces of Galaxy Sand. If I had given them all to Little Star, it might have become a Marquise.”\n\nHan Sen felt bad about his decision, but it was not as if he had anything better to do. The days he spent holding his daughter and kissing his wife were great, and Han Sen didn’t worry too much about things he couldn’t change. Yisha sent a message to his base, asking for Han Sen to meet her on Planet Blade.\n\nWhen Han Sen was standing in front of Yisha, she saw that Han Sen had recovered his human form. She looked startled.\n\n“Since when have you been a human again?” Yisha asked Han Sen.\n\n“I practiced The Story of Genes every day. Within two months, I was back in a human state. Unfortunately, I feared there might be some side effects. So, I planned to practice for a while longer to make sure I wouldn’t turn back into an ant or something before telling you.” Han Sen had already prepped this speech beforehand.\n\nYisha nodded and said, “I hatched a plan for fixing this, but since you are already healed, I guess there is no need for it. Don’t go around telling everybody you are healed, though. And don’t go drawing any unnecessary attention.”\n\nYes,” Han Sen said quickly.\n\nAfter a moment of silence, Yisha went on to say, “There are too many spies on Planet Eclipse. Don’t go back just yet. I will send you to Sky Palace for the time being, and you can study there.”\n\n“Sky Palace?” Han Sen was surprised.\n\nHan Sen had heard this name before. When the crazy crystallizer opened the gate of the Sanctuaries, Han Sen met a man who said he owned the throne of Sky Palace.\n\nAnd Littleflower was almost taken by that man. Luckily, Han Sen was able to get away in time.\n\nYisha said, “Sky Palace’s leader is a deified elite. He has a deep connection with my elder. I used to practice in Sky Palace, as well. In essence, half of what I was taught came from him. I have already informed him of your arrival, and so he will assuredly take care of you.”\n\n“But Queen, I want to study where you are near.” Han Sen looked sincere as he stared at Yisha.\n\nThe leader of Sky Palace had seen Han Sen before. If he was recognized, things could go bad very quickly ‘You are going there tomorrow.” Yisha obviously wasn’t interested in a debate."
}