{
    "chapter": 2888,
    "title": "Under the Sky",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2888",
    "text": "When feeling the power in that knife, even a deified elite would have felt a chill.\n\n“You insulted my Buddha! You will die!” Burning Lamp’s body carried the presence of the causal karma knife. It was oscillating at an extreme level. He was like an ancient god claiming the sky with a god sound that was like a judgment sound. The causal karma knife was coming down.\n\nThe power was strong. It could split the universe and space in half. The scariest thing was that the knife light from the knife had the ripping qualities of a Teeth Knife. This slash was stronger than any attack wielded by Han Sen. It was unknown how many times stronger it was.\n\nAll the Buddha were happy. This knife shocked them, but the shock also made them feel awesome and happy.\n\n“Die! You dared to challenge my Buddha! You insulted my alpha! You should be ripped apart!” Many of the Buddha had lots of hatred in their hearts. They wanted to see Han Sen get torn apart in a single strike.\n\nSeeing knife lights come like the end of the world, Han Sen complimented it. “Like turning expectations on their head, that is a very powerful causal karma knife.”\n\nThis knife made him feel as if he could not dodge it. It was so powerful that he was afraid not even a true god xenogeneic would be able to run.\n\n“It is merely a shame that your opponent was me.” Han Sen’s eyes froze. The power in his body changed. He used one arm like a knife and slashed toward the incoming knife light.\n\n“Is he directly fighting him?” Meng Lie looked surprised. Anyone was able to tell that Burning Lamp’s knife had generated the strength of Han Sen’s relentless attacks earlier for his own use. One knife was able to kill a true god. Han Sen used one hit to go against countless of his own strikes. It was not wise.\n\nBai Buyi shook his head. “It is not like he does not want to dodge. He cannot dodge. Although the causal karma knife did not have Demon Alpha’s Sky Demon Power, it carries the same causal power. The causal karma knife has absorbed all the damage dealt to Burning Lamp by Han Sen earlier, but the attack must land on Han Sen. Even if Han Sen used Space Teleportation to somewhere a few systems away, the karma is something he has to accept.”\n\n“But a hit like that? How can Han Sen go against it?” Meng Lie had a wry smile.\n\nJust as Meng Lie believed, Exquisite, Li Keer, Han Yen, Yun Suyi, Tang Zhenliu, and anyone else that had a connection to Han Sen were all worried about him.\n\nHan Sen slashed, but his arm did not unleash knife air. It was like he was slashing in space. He had no power.\n\nEveryone was shocked, wondering what was up with Han Sen. Such a powerful knife had not unleashed knife air.\n\n“Have you given up?” All the Buddha looked happy.\n\nSeeing Burning Lamp’s scary knife light about to reach him, Han Sen did not have the time to combat it.\n\nIn the next second, everyone froze. The scary knife light stopped in front of Han Sen. It was like it had stopped in space. The scary knife light was shaking as if it was afraid.\n\nBoom!\n\nWhile everyone was shocked, the scary knife light shattered before Han Sen. It became purple knife silk. It was like a purple flood that returned to Burning Lamp.\n\nYun Suyi was so surprised that she screamed, “Under the Sky Knife skill!”\n\n“How was he able to break the causal power knife like that?” Yun Sushang was shocked.\n\n“With Under the Sky, everything is a chess piece. Han Sen has mastered Under the Sky.” Sky Palace Leader was impressed.\n\nBurning Lamp’s expression immediately changed. The faces of the Buddha were grey like ash. The knife they had placed all their hopes and dreams on had suddenly been reversed. Its power was now Han Sen’s power. No one could believe that.\n\n“Impossible… The causal power cannot be controlled… That is impossible.” Burning Lamp’s state of unbelief was magnified 1,000 times. At the end of the day, he had no choice but to believe it.\n\nSeeing that scary knife stream come, Burning Lamp realized he was unable to block it. He gnashed his teeth and released the god doll. The god doll suddenly grew bigger. It turned into a black wood god doll. Mysterious flower symbols flashed across it. It was punching at the scary knife stream.\n\nBoom!\n\nA mysterious black punch was striking the purple knife stream. The knife stream was broken. The power of the god doll was shaken away.\n\nSky Palace Leader looked at the god doll in shock as he said, “Huh, a true god class xenogeneic. No, that is not a xenogeneic… It seems like a treasure…”\n\nHan Sen knew it wasn’t a xenogeneic as well. It was a treasure. He looked at the god doll and laughed. “Is that the true god reward you received from the god fights? It is an interesting true god weapon since it can fight on its own. It can also explode with true god power. It is much better than your master.”\n\n“Buddha brothers, listen! Activate the race lantern and kill this thief!” Burning Lamp roared and controlled the god doll. He commanded it to kill Han Sen.\n\nAll the Buddha heeded Burning Lamp’s order. They ceased all hesitation and exploded the power inside their bodies. No matter how strong or weak they were, they infused their power with the race lantern.\n\nThe race lantern was shining brightly. It was like a volcano erupting. In space, the gold lantern’s flame had become a giant and gold old Buddha. His eyes flashed with a god light. It was like a spotlight aiming down at Han Sen. The gold flames generated incredible power through suppression.\n\nIt was the Buddha generating their entire race’s power to form a race spirit. Its power was no worse than a deified elite. It attacked Han Sen with the god doll and Burning Lamp Alpha.\n\nBeing surrounded by three scary creatures, Han Sen did not move. His body was like a shadow. His hand turned into a knife and slashed casually.\n\nWith Han Sen slashing, the broken knife stream appeared again. A sky full of knife light turned into a flood that fought three separate enemies. It was not losing.\n\nThe god’s doll was affected the most. It kept breaking the knife stream, but the knife stream kept respawning. As time went by, the knife stream grew bigger.\n\nThe universe’s creatures were shocked by what was on display. Han Sen was fighting a god doll, Burning Lamp, and the race spirit all alone. It looked like they had the advantage, but it was Burning Lamp and the others that were actually being suppressed. Although their powers shocked the sky, they could not break Han Sen’s streams of knife lights.\n\n“Under the Sky, everyone is a chess piece.” Han Sen stood in space. He sounded like a god. His arm was like a knife slashing. Instantly, 10,000 knife lights went toward his arm. It became a Slash Sky god knife.\n\nUnder that knife, the whole of space was covered with knife lights. There was nowhere to dodge. The god doll was being slashed. It flew back a few dozen miles. The knife lights were still coming down. They could not be blocked. They were slashing toward the shocked Burning Lamp and Buddha race spirit."
}