{
    "chapter": 2286,
    "title": "Crystallizer Technology",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2286",
    "text": "Boom!\n\nHan Sen was about to say something, but a scary sound cut him off. And then, the white whale suddenly flipped and started to sink.\n\nMany forces of horrible powers lashed the white whale, and each strike was like the crack of thunder.\n\nFortunately, the big white whale was pretty solid. The shockwaves of combat coming from Yisha and Fox Queen were not enough to break the hull. But even so, the impacts were driving it deeper into the sea.\n\nBoom!\n\nThe whale shook under their feet as if it had just hit something, and after that, they heard the sound of something large being destroyed. Then, there was only silence. The white whale was no longer being tossed about.\n\nLooking out the white whale’s eyes, they couldn’t see anything except seawater and piles of rock. It looked as if the big white whale had been crushed under an enormous pile of rubble far below the surface.\n\nThe sea around them was swirling like mad. Even though they were far enough underwater that they could hear the fight overhead, they still saw occasional shockwaves rolling through the water. The turbulence had, however, slowed down a lot. The white whale was now buried by the stone, and it could no longer move. That made Han Sen feel better, at least.\n\n“This white whale is a machine!” Crime looked around the control room in shock. The revelation had obviously caught him off guard.\n\nMister White was also looking about the big white whale with interest.\n\nBig King Bell, who wasn’t the original owner, had been able to control the big white whale. Han Sen figured that Mister White probably could as well.\n\nAnyone could control a machine like that, as long as it wasn’t locked down. It should work on essentially the same principles as any other machine.\n\n“Don’t move it!” Mister White shouted, just as Han Sen was about to move the skeleton on the command chair.\n\nHan Sen stopped and waited as Mister White and Crime came to the control deck.\n\n“What have you learned, Mister White?” Han Sen asked politely.\n\nMister White looked at the skeleton and said, “If I understand the situation correctly, this skeleton is the key that makes it possible to control the white whale.”\n\nHan Sen was shocked. He had previously watched Big King Bell jump around on the platform, but he didn’t think much of it since the bell was able to control the white whale.\n\nBut Han Sen now saw the thing he had missed earlier. Big King Bell must have used the white whale for a long time, but the bell had never moved the skeleton. There must have been a reason for that.\n\n“Mister White, where do you think this technology came from?” Han Sen asked Mister White.\n\nMister White shook his head. “This is the first time I have ever come across something like this. I don’t know how to control it, either.”\n\nAfter pausing, Mister White looked at the skeleton and said, “But judging from its clothing, this person must have been connected to the control systems. His remains must be the key to controlling this entire machine. I cannot tell what might happen if we were to remove them.”\n\nHan Sen examined the skeleton’s clothes and started thinking. The skeleton’s uniform was silver and black, and aside from the head, the entire body was wrapped up tight.\n\nIt wore a transparent mask that was connected to the uniform. There was no visible seam.\n\nHan Sen spent some time observing it, and although he couldn’t find a connection between the chair and the uniform, he thought the uniform and the white whale must have been linked somehow.\n\nHan Sen activated the Purple-Eye Butterfly to examine the uniform, the platform, and the chair.\n\nThere were many powerful relics that the Purple-Eye Butterfly could tell Han Sen very little about. But if the item in question was some sort of technology, the Purple-Eye Butterfly was incredibly useful in revealing how it had been made and what its purpose was.\n\nWhen the Purple-Eye Butterfly rewound, Han Sen could see the entire process of the white whale’s creation. What he witnessed gave Han Sen quite the surprise.\n\nWithout a doubt, the white whale was one of the most powerful technologies to ever exist in the entire universe. The process of creating it had been very complicated. It was even harder to build than a deified weapon.\n\nIt was doubtlessly so complicated because there was a lot of science involved. Every problem that arose with each individual part of the machine had to be solved through science.\n\nIf Han Sen could analyze every facet of the white whale’s technology, leveling up the Alliance’s technological advancement would be easy.\n\nThat wasn’t the most shocking thing, either. As Han Sen watched the construction of the white whale, he saw the shadow of the beetle.\n\nAlthough the white whale was more advanced than the beetle, the concept of their creation was similar. The white whale was just on a whole new level. The technology of the white whale, in every possible way, far exceeded that of the beetle. Every detail was better than the beetle’s, too.\n\n“Is this crystallizer technology?” Han Sen wondered in shock. The more he saw of the big white whale, the more accurate his guess seemed to be.\n\n“Was the technology of the crystallizers ever this good? Could they make machines of a deified level? That’s a very frightening idea,” Han Sen mused.\n\nThat would explain why the crystallizers challenged a higher race despite lacking deified elites of their own. Having such technology probably gave them the confidence to start a fight for a lantern.\n\nIn the end, however, their arrogance and hubris had led to their failure and downfall. As a result, the race was almost entirely destroyed.\n\n“What a shame. If the crystallizers had challenged a less powerful higher race, they could have definitely claimed a lantern. And then, they would have developed even further. They would probably have become one of the top races in the universe.” Han Sen sighed.\n\nBut Han Sen then realized that if the crystallizers had become a higher race, they would have continued to develop their technology. They wouldn’t have wanted to change their genes and blood pulse. They might never have experimented with their genes, and if that was so, humans would never have come into existence.\n\n“Han Sen, you still have the relic, right?” Mister White asked Han Sen.\n\n“Why are you asking me this?” Han Sen looked at Mister White.\n\nMister White smiled and said, “I left a trace so that you could follow us, and that means I wish to continue our venture of cooperation. Before one of those two wins the fight above us, we should explore the holy town.”\n\n“What made you think I’d catch up with you?” Han Sen asked Mister White with a raised eyebrow.\n\n“Because I believe in you,” Mister White said gently.\n\nHan Sen stared back at Mister White. Han Sen hadn’t believed that the two of them were very close, but Mister White had just claimed to have an unbelievable amount of faith in him. He gazed into Mister White’s eyes and acknowledged the sincerity within them. This wasn’t just another bargain for Mister White.\n\nBut for some reason, when Han Sen looked deep into Mister White’s eyes, he had a familiar feeling. It was as if they had already met a long time ago."
}