{
    "chapter": 1876,
    "title": "Purgatory Heaven",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1876",
    "text": "“Everyone should know that the pharmaceutical talents of the Gana are connected with their power. The purer their blood, the greater their medicine becomes. This Holy Lady is not of the royal family, but her blood is as pure as it gets. She is undoubtedly the best out of all the Gana. Her starting price is…” The Kao kept on speaking.\n\nThe people around all started shouting out their bids, which annoyed the auctioneers. The clamor shocked Han Sen quite a bit.\n\nThere were only a few dozen Gana still waiting to be sold, which put pressure on the bidders who still hadn’t secured a Gana. And this was the Holy Lady, so she was a hot item.\n\nGold Jade King had not been actively bidding in the previous auctions. He had seemed to be waiting for a Gana of pure blood.\n\nHan Sen, seeing the lady on stage, looked awfully worried.\n\nThe lady was chained up, and her snake tail was stiffened so she would stand and not fall over. She looked completely emotionless. Her eyes were closed, revealing her long eyelashes.\n\nHer pretty lips trembled. It looked as if she was a nun who was in the midst of dire prayers. The noise around her could not cause her expression to falter.\n\n“Something is wrong.” Han Sen looked around again. The Gana that had been bought were all doing the same. They had closed their eyes, and they were in the midst of prayer.\n\nNo matter how Han Sen looked at them, they seemed to be praying. Even the way they moved their mouths suggested this. Their voices were quiet, and Han Sen could barely hear them. They were not using the common language, however, so Han Sen was unsure what they were saying.\n\n“King, the Gana are mumbling something. What are they doing?” Han Sen informed Gold Jade King. He was feeling very nervous about it all.\n\nGold Jade King looked at the Gana and said, “This is the language of the Gana. They are praying for the assistance of their god. If their deified elite was here, their prayers might actually help. But that elite betrayed the Gana long ago, and they might not respond to the prayers.”\n\nGold Jade King went back to ignoring Han Sen and bidding on the lady.\n\nMany Kings were elites, and they were fearless. Even though there was danger in being there, they wouldn’t stop. They would try to grab whatever resources they could first.\n\nHan Sen was not that strong, and he was afraid of what might happen. He listened to Gold Jade King’s words and got even more nervous.\n\n“Icebird Duke, let’s go,” Han Sen said, standing up.\n\n“Why?” Icebird Duke was able to sense something was wrong, but not with the clarity Han Sen could.\n\nHan Sen did not have the time to explain. He walked away and said, “I am uncomfortable. Let’s walk and talk, shall we?” Icebird Duke was confused, but she still stood up and followed Han Sen out of the hall.\n\nBefore they made it outside, however, the lady being sold on the stage raised her voice. Emotionlessly, she called out, “Hearts like glass, bodies like mirrors, fall to hell and become dust. If the heart has heaven, only then will you be free.”\n\n“If the heart has heaven, only then will you be free.” The praying Gana all began to open their eyes. Their voices bellowed over the proceedings of the auction.\n\n“Shut up.” A Kao guard hit one of the girls.\n\nShe didn’t try to avoid the strike, and she allowed the whip to hit her. Her lovely face was marred by the presence of a mark.\n\nThe girl that was hit ignored the strike, and she continued to speak.\n\n“I told you to shut up, didn’t I?” The Kao guard hit her again. Her snow-white skin split open, and blood began to spill over her body.\n\nThe lady still kept her holy look, though. She was chanting alongside the other Gana, uncaring for the wounds she had sustained. It seemed as if she wasn’t the one bleeding.\n\nKings like Gold Jade King were now starting to feel as if something was really wrong. Thinking they were strong, though, they did not believe they had a reason to fall back.\n\nThe strongest Gana there was no greater than a Duke, so they did not think they had to be afraid. They did not have to give up the Gana they had already bought, either.\n\nSuddenly, the statue in the hall suddenly made a katcha noise. The statue cracked, and the crack wreathed its way around the entire statue.\n\nA big slab of stone fell from the statue. It was followed by another, and another, and another. When the rocks fell, they revealed something gold inside the statue.\n\n“Something is inside that Gana statue!” Everyone was shocked, looking towards the statue.\n\nBoom!\n\nThere were too many cracks across the statue, and they eventually caused it to shatter like glass. All the stone fell off, revealing a gold statue on the inside.\n\nThat Gana goddess statue looked just like Guna, as well. Just like the lady on stage did. The snake tail of the statue- come-to-life slithered slowly back and forth. The floor began to rise up as countless twisted arms. They looked like demonic arms from hell. The goddess did not look down to the ground. Her hand was raised, and her eyes looked up to the sky. She looked very holy.\n\nSeeing that weird Gana statue, Gold Jade King and the others were all stunned. One Duke was so scared, he screamed, “Purgatory Heaven! This is the Gana’s deified item. Why would it be here?”\n\n“Kill these Gana, we cannot let them activate Purgatory Heaven!” some Noble shouted.\n\nSome people started to run off, but it was too late to do that. The sky above the hall was shining with gold. You could not see the stars or the galaxy high above.\n\nThe place was plunged into complete darkness. The machines came to a stop. The sky above was bright, but its light didn’t reach the ground. Only the gold Gana statue lit up the hall. Everything else was dark; it looked like hell.\n\nSomeone drew out a weapon and killed the Gana right next to him, but when the Gana died, their light was absorbed by the statue. And when it did, the whole world became darker.\n\n“Idiot! Don’t kill them. They are sacrificing themselves,” a King shouted coldly.\n\nHorrible screams began to erupt from the outside. A Kao from outside rushed into the hall, but a large portion of her body had already been ripped away. She struggled a bit and then died."
}