{
    "chapter": 2761,
    "title": "A Way to Break It",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2761",
    "text": "He had never been as embarrassed as he was right then. He had needed a little girl to step in and save his life. If Gu Wan’er hadn’t stalled God’s Knife for him, he never would’ve had the chance to use the Four Sheep Cube to escape.\n\nAnd he had even told Gu Wan’er not to get in his way. But in the end, this was how things had turned out. He would never forget the expression on Gu Wan’er’s face when he had to leave her.\n\n“I must find a way to defeat that crappy knife and bring Wan’er back safely.” Han Sen calmed himself and tried to think rationally. He knew feeling angry and embarrassed wasn’t going to solve anything. He needed to find a way to sort out that so-called God’s Knife to save Gu Wan’er. He needed to take her away from that place.\n\n“If I use my super god spirit body, I shouldn’t be harmed by Super Space Slash. But even if Wan’er and my super god spirit body didn’t conflict with each other, my super god spirit body wouldn’t last long. It couldn’t support me long enough to defeat God’s Knife. So, how can I block Super Space Slash while not using super god spirit body? Plus, on top of that, just blocking Super Space Slash isn’t enough. I need to find a way to counter and break God’s Knife itself. Even Old Blood Dragon Lady was unable to destroy its body, and my power will be far weaker than what she was capable of generating. It will be even harder for me to destroy its body.” Han Sen wasn’t going to give up just because of that, though. He took time to calculate every possibility of what might transpire there. There was still a sliver of a chance he could succeed—one which he calculated to be 1:10,000—but that wasn’t going to sway his firm resolve.\n\nThe Immortal Dragon had been healing Han Sen’s body non-stop, but he had been taking too many injuries. When he was in God’s Farm, the Immortal Dragon could only heal each wound partially, leaving his body looking like a spider web of scars. That fight had injured him so much that he hadn’t even known how badly he was injured.\n\n“I can’t change the past, so dodging is impossible. Unless I can erase the past…” At that thought, Han Sen’s eyes brightened.\n\n“Maybe I can try the alpha’s Sit and Forget Sutra. The Sit and Forget Sutra is about looking for a way for the body to disconnect from the universe, so the user can reside in a space that is outside of time and space. If a person’s power is disconnected from the universe, then the blood demon will be unable to see me in the past. That abides by the rules of the universe.” Han Sen thought this was something he could try. He had the experience of the alpha, so it wouldn’t be difficult for him to practice the Sit and Forget Sutra.\n\nBut even if the Sit and Forget Sutra could break Super Space Slash, Han Sen still had no way of destroying God’s Knife. This would only allow him to avoid losing for an indeterminate amount of time.\n\nHan Sen couldn’t think of a way in which he could destroy God’s Knife, but for now, he had a plan. First and foremost, he had to practice the Sit and Forget Sutra. He needed to see if he could break Super Space Slash.\n\nBecause he didn’t have the Very High Sense as a base, Han Sen could only use his Under the Sky as a base. He put the Sit and Forget Sutra into a part of the Under the Sky knife skill.\n\nIt had been two weeks, and Han Sen hadn’t set one foot out of the palace. Ever since the Old Blood Dragon Lady appeared, Han Sen’s body had no longer grown any scales. And the blood coral hadn’t so much as twitched in all that time, either. If Han Sen hadn’t seen it become the Old Blood Dragon Lady, he would have thought it was just an ordinary lump of coral.\n\n“It looks like the drop of the Old Blood Dragon Lady’s blood that I have wasn’t enough to support her full rebirth. But that is fine. I don’t know if she is a friend or foe, and so this is likely the best result for now.” Han Sen looked at the chunk of blood coral next to him, and then he walked outside of the palace.\n\nFor the past two weeks, he had been trying to let the Sit and Forget Sutra melt into his Under the Sky knife skills. But he had encountered a few problems he had been unable to overcome. He needed an idea or two, but there was nothing inspiring about that bottle palace. It was hard to come up with ideas.\n\nHan Sen walked around the palace in circles. He still didn’t understand, and he felt a bit annoyed. Although he understood that he had to be calm right now, the thought of Wan’er and her situation was driving him insane. He couldn’t keep calm.\n\nHe brought out the siren bottle and summoned the Siren Virgin. He spoke to her, hoping to get some ideas from her. The results were very disappointing for Han Sen once again, though. The Siren Virgin had never seen the Super Space Slash before, so she couldn’t think of a way in which he might be able to break it.\n\nAfter the Siren Virgin spent half a day spouting useless crap that he didn’t need to hear, Han Sen had to put his foot down. He sent her back into the bottle and tossed her into storage.\n\nThere was no one in that bottle palace to give Han Sen advice. After hesitating for a while, he eventually decided to enter Destiny’s Tower. He was going to see Ancient Devil, who had been trapped there for the longest time.\n\nCurrently, Ancient Devil was the only prisoner that Han Sen was keeping in Destiny’s Tower. All the other creatures he once kept there had been sent to Purgatory Heaven a long time ago. Only Ancient Devil seemed too dangerous to be allowed to leave Destiny’s Tower.\n\n“You need something from me?” Ancient Devil had been trapped there for a very long time, but he didn’t look angry or restless like the average prisoner. It looked like he was on vacation, rather than trapped in an inescapable prison. Han Sen had to admire his attitude. If Han Sen had been trapped in there for so many years, he didn’t think he would be so chill.\n\n“I have encountered a creature that wields a Super Space Slash power. I don’t know how to break it.” Rather than trying to hide anything, Han Sen laid out what had happened as plain as could be.\n\nAncient Devil’s intelligence was remarkably high. He wasn’t someone you could fool easily with a few lies, so Han Sen didn’t even bother trying.\n\n“That is easy. If you promise to let me go, I can teach you how to break it,” Ancient Devil answered calmly. When he spoke about the conditions for his aid, he didn’t sound excited about the prospect.\n\n“Your powers are at the lowest tier of this universe, and my opponent is one of the most powerful beings in this reality. Do you really think I’m going to believe you?” Han Sen asked coldly, staring at Ancient Devil.\n\n“Yes. That is why you came, isn’t it?” Ancient Devil paused, and then went on to say, “Plus, strength and knowledge don’t go hand-in-hand. Time and space in this universe are the same as time and space in other places, after all. They work the same here as they do in the sanctuaries. Super Space Slash works the same as well. The reasoning behind it is the same. If you understand that, you can find a way to break it.”\n\n“Then tell me. How would you break Super Space Slash?” Han Sen asked.\n\n“Agree to my conditions first,” Ancient Devil shot back.\n\n“You have to at least prove to me that you can really break the Super Space Slash power,” Han Sen said, while looking expressionlessly at Ancient Devil.\n\nThat Ancient Devil guy was too dangerous. Han Sen wouldn’t let him out unless he had no other option.\n\nThis had nothing to do with Ancient Devil’s strength. The man was simply too scary. Even if he was just at a Baron level, Han Sen wouldn’t give him the chance to escape.\n\nAncient Devil looked at Han Sen. He smiled and said, “You just want to trick me. You want me to give you the solution, and then you can abandon your end of the bargain and keep me here. I don’t think you’re going to get what you want.”\n\n“Tell me something I have never heard about first,” Han Sen said, his face unchanging.\n\nAncient Devil was quick-witted. He did not keep saying that Han Sen wouldn’t provide him his freedom. He fell silent, then said, “According to theory, there is only one way to break Super Space Slash.”\n\n“What way is that?” Han Sen said quickly. He had expected Ancient Devil to continue refusing to answer, but the man had replied startlingly fast.\n\n“It is to kill yourself.” Ancient Devil looked serious, and Han Sen could tell that the man meant what he said. But this was an answer that confused Han Sen."
}