{
    "chapter": 2685,
    "title": "Learning Knife Mind",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2685",
    "text": "“You are crazy. That word suits you very well,” Liyu Zhen coldly grunted.\n\nHe had to be insane. And Liyu Zhen wasn’t the only person thinking that. Even Open Sky Elder and the people who wanted Han Sen to win believed everything he had said was way too crazy.\n\nThe path was the universe. The universe was the path. When they considered Han Sen’s words, he seemed to be saying that his life was the sole reason for the universe to exist. If Han Sen died, the universe would die along with him.\n\nAcross history, even the true god elites wouldn’t have dared to say something like that. There were not many true god elites, but there were a few in every era. How many were currently alive was unknown, though. And even when they died, the universe never died along with them. And right now, Han Sen was someone who had just become half-deified.\n\nIn truth, his words didn’t even qualify as crazy. They were simply ignorant.\n\nBut people misunderstood what Han Sen meant. The “I” he was referring to did not mean himself. He was referring to everything.\n\nEveryone was like a chess piece. They were controlled by the strings of fate, but without those chess pieces, the chessboard was meaningless. It didn’t matter how good a chessboard was, it was a dead object. The chess pieces could lead to many events and combinations of moves, which was what led to a path. A chess piece led to a path and a road to traverse. Without a chess piece, there was no path.\n\nWhen Han Sen understood the meaning of this, happiness rolled through him. He was too happy. And it was that glee that prompted him to speak it out.\n\nPeople thought Han Sen was crazy and ignorant. Only Li Keer and Exquisite could understand the way Han Sen truly felt. Their pretty eyes fluttered strangely.\n\nHan Sen had gained understanding, which meant they understood as well. They were drowned in the will of Under the Sky. That will was so strong that they would only see something like this in a select few of the strongest Very High currently living.\n\nBut on this day, under the influence of that powerful will, they had learned something new. How could they not be surprised and happy?\n\n“This understanding is already beyond what a normal deified could manage…” Li Keer had a very complex look on her face. She was happy, but she also couldn’t believe what she was witnessing. Han Sen was only a half-deified, and yet, he could understand the entirety of that will.\n\nHan Sen had self-learned all of this. And his Under the Sky knife skills were supremely strong now. Before, he only used knives. But now, the knives were infused with his own understanding and knowledge. It was like he had given life to a concept.\n\nBefore, although Han Sen hadn’t been injured by Shale, he had seemed to be on the brink of disaster. Han Sen had only been hanging on by a thread, and he could have been killed at any moment.\n\nBut now, all of a sudden, things seemed different. Han Sen was still suppressed by Shale, but the audience sensed that he was more relaxed than ever. Even within this danger, he seemed to be oh so relaxed. He didn’t feel nervous or crushed.\n\nHan Sen used his hands like they were knives. The knife skills he deployed had a solid feeling to them. And it made people feel as if he had set things up like this deliberately. But now, Han Sen could use his skills at will, with almost casual ease. It was like every attack was unleashed randomly, yet he continued to fight with the exact same precision, and sometimes even more.\n\n“The sky and the ground are a chessboard, and I am the chess piece. Every breath and every sense are a path.” Han Sen was totally drowned in the will of Under the Sky. As his knowledge of it deepened, his attacks seemed to become even more random. But at the same time, it seemed like the universe itself was guiding his movements. As attacks rained down on him, there was a sinking feeling in Shale’s gut.\n\nYes, he was feeling terrible. Although Han Sen wasn’t putting him in any serious danger, Shale felt as if everything had gone horribly wrong.\n\nHe couldn’t tell what precisely had gone wrong, but everything about the fight now seemed… off.\n\nThe mountains were wrong. The rocks were wrong. Everything was wrong. It felt as if the world around him was now working against him, while Han Sen was moving smoothly between sky and earth. It was like everything was working to assist Han Sen. Shale didn’t know what to do.\n\n“This… isn’t this Sky and Men Combined Together, a technique from the Very High Sense?” Li Chun Qiu and the others who studied the Very High Sense looked at Han Sen as if they were seeing a ghost, with their eyes wide open.\n\nBy practicing the Very High Sense, one could practice Sky and Men Combined Together. By connecting the skill with the universe, the sky, and the ground, a practitioner could use it to borrow the power of the universe.\n\nBut that power was only available to those who practiced the Very High Sense. Only they should have been able to do what Han Sen was doing. Exquisite could only barely scratch the surface of learning it. She wasn’t fully proficient with Sky and Men Combined Together.\n\nHan Sen had never studied the Very High Sense, but the knife skills he got from the Textless Book had achieved the same effect as Sky and Men Combined Together. How could Li Chun Qiu and the others not be shocked?\n\nEven those who practiced the Very High Sense found themselves shuddering. Despite his emotional detachment, Li Chun Qiu was stunned.\n\n“This kid is so weird…” Open Sky Elder mumbled.\n\nHe and Qiyu Elder hadn’t practiced the Very High Sense, but they were behaving as if they had never eaten pork and were now seeing a pig run. They had experienced a lot over their lives, and even if they hadn’t practiced the Very High Sense personally, they knew a lot about it.\n\nRight now, Han Sen’s knife skills resembled the Very High Sense and Sky and Men Combined Together. They were shocked.\n\nBut Han Sen didn’t think that much about it. He was submerged in the aura of his knife mind.\n\nIn this universe, every blade of grass, block of wood, mountain, drop of water, and even specks of dust and bacteria, they all seemed to harness a meaning in his eyes. It was like it all had some kind of connection with his knife skills.\n\n“Everything in this world is a chess piece. Every chess piece can be used in a certain way. And you combine all these pieces to compose a game of chess. The chess piece that isn’t connected is actually connected. Every chess piece can affect the entirety of the game. And what I need to do is become a chess piece that can change the course of this game of chess.” Han Sen kept trying to understand. “I don’t need a special power. I only need to use my power in a place that requires me the most. If I go swimming, I would be a fish. If I went into the sky, I would be a bird. I would go along with the universe, the sky, and the earth. And I will help the sky, the earth, and the universe.”\n\nHan Sen’s knife skills were becoming more and more unpredictable, and those random attacks were causing Shale a lot of trouble.\n\nThe Very High that had previously mocked Han Sen for being crazy and ignorant had now fallen silent. Han Sen should have been at an incredible disadvantage, but right now, he didn’t seem to be struggling at all.\n\nInstead, Shale’s attacks were the ones that seemed stiff. They didn’t seem so smooth anymore.\n\n“How very interesting. He’s used Under the Sky to create Sky and Men Combined Together… Those Very High elders are going to go crazy with jealousy…” As Yu Shanxin watched Han Sen’s remarkable knife skill, the corners of his mouth rose. His smile was strange and unreadable."
}