{
    "chapter": 2590,
    "title": "Fighting Meng Lie",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2590",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Race weapons are deified as soon as they are created,” Yisha said, shaking her head. “They are smarter than the average deified weapon. They are stronger, too. If the weapon was used by a creature from the race that created it, the weapon would be incredibly beneficial to them. There wouldn’t be any such side-effects. If it was activated by someone of another race, however, they would adopt the traits and powers of the race the weapon belongs to. Their bodies would be invaded by the race’s genes, which would turn them into something weird. Unless you gain enough power to overwhelm the race weapon, you won’t be able to hold off its effects.”\n\n“Is there no other way?” Han Sen asked with depression.\n\n“Well, I can’t say with certainty that there isn’t some way to be rid of its influence. If there was an elite that could use force to suppress the power of the race weapon and erase the Fox genes within it, perhaps your genes could be placed in the weapon instead. You could probably get rid of the gene weapon’s side effects that way. It is like the Foxes’ Nine Spin Destiny Mirror. A scary Fox elite erased the original genes inside the mirror and replaced them with his own. That way, it became a race weapon of the Fox.”\n\nYisha paused and said, “But the genes of the Foxes are very good. I have heard that when they lit up their gene lantern, their ranking was quite high. This purple copper jian’s power might indeed be true god class. Unless you can find a true god class elite that is willing to spend some energy wanting to help you, there is no other way.”\n\n“Does that mean I’m done for?” Han Sen looked as if he was going to cry. He didn’t have a true god deified to help him. He didn’t know of any to begin with.\n\nEven if he did, there was no reason for someone else to expend so much effort erasing the Fox genes inside the purple copper jian on his behalf.\n\n“You look quite good the way you are,” Yisha said. Then, she continued flying.\n\nIt took a while for Han Sen to wake up from his disheartened daze.\n\nHan Sen equipped Glasses to hide his face, then used the item to inspect Yisha’s genes.\n\nThe numbers on the display kept cycling. It took a while for her details to be produced. The Rebate wasn’t a very rich race, but Yisha’s gene potential was at eight stars.\n\n“If the potential is eight stars, then that means she can become a butterfly. If she wants to become a true god, a grand opportunity will need to come her way and offer her a boost. It is a shame my Blood-Pulse Sutra is only King class right now. I can’t boost the genes of a deified. If I could, I’d definitely help Yisha perfect her genes. That way, she would have a greater chance of becoming a true god,” Han Sen thought to himself.\n\nBefore, Han Sen had tried to use the power of the Blood-Pulse Sutra on the little red bird, but it didn’t work. His King class Blood-Pulse Sutra was unable to push the self-cogwheel of a deified being.\n\nHan Sen looked at the white tiger. He noticed that its potential was the same as the small Crocodile God. It was nine stars.\n\nHan Sen asked Yisha to look at Ning Yue’s little green sword. She was unable to determine what sort of weapon it was, but judging from what had happened to him, it was likely a race weapon. Which race exactly? She didn’t know.\n\nThe white whale had almost fully recovered. Han Sen invited Yisha to ride inside the white whale, and it was an offer she didn’t refuse. The group rode inside the white whale for the remainder of their journey to Sky Palace.\n\nThey didn’t see elites from any other races as they traveled through the systems of chaos. They often encountered space xenogeneics, though. And luckily, Yisha was there to help them in such engagements. With Han Sen and the little red bird’s deified powers, they were in no danger.\n\nThat white tiger slept inside the ship day and night. It didn’t lend them any power or look as if it was willing to lift a finger to help out.\n\nThe white whale was flying forward as it usually did when suddenly, a group of ships appeared. The sight made Han Sen and the others feel a chill.\n\n“Spring Rain,” Han Sen said when he recognized the symbols on the battleships. It was Spring Rain, the group of agents that Miss Mirror commanded.\n\nOf course, when those battleships surrounded the white whale, a man and a woman came out of the lead ship. The woman was Miss Mirror. The man was the Fourth Uncle, Meng Lie.\n\n“We just exited the Black Hole Spider not too long ago. Why are they already here?” Han Sen was shocked.\n\n“Han Sen, do you want to come with us peacefully? Or are we going to have to drag you back?” Meng Lie asked with a laugh.\n\nHan Sen remained silent. Although they had three deifieds in their midst for combat, they were each of the lowest class. They were primitive deifieds. Miss Mirror was a primitive deified, but she had been deified for longer. Her powers were weird, and she would be hard to deal with.\n\nMeng Lie could certainly be a transmutation deified. Even Lando, who became deified, had been unable to defeat him. Fighting him would be harder than dealing with Miss Mirror.\n\nBut Han Sen had no choice now. He put on his peacock king soul robe, equipped his Six Core Snake Bow, and exited alongside the little red bird.\n\nYisha came out, as well. She quietly stood next to Han Sen.\n\nMiss Mirror looked at Yisha and said, “Knife Queen, the Rebate have always sided with the Extreme King. You aren’t going to destroy our longstanding relationship merely for Han Sen, are you?”\n\n“The Rebate already has an alliance with Sky Palace,” Yisha said flatly. “I’m willing to be friendly with the Extreme King, but if you people keep trying to get in my way, then I have no other choice.”\n\nWhen Han Sen first went on the run, Yisha was slow to act because she was dealing with the politics of the Rebate. She couldn’t get the whole of the Rebate involved simply to save Han Sen.\n\nNow, though, the Rebate had entered an alliance with Sky Palace. They had the protection of Sky Palace. It would be troublesome for the Extreme King to dare touch them.\n\n“Knife Queen, you need to rethink this. Is all of this worth it? Is it worth betraying us on behalf of your student? You know how traitors to the Extreme King are dealt with.” Meng Lie frowned.\n\n“If I cannot protect my student, then what use is there for the Rebate to even exist?” Yisha growled.\n\n“I would like to see what benefits Sky Palace offered that have given you the courage to flat-out deny the will of the Extreme King.” Miss Mirror’s face was hard as she raised her hand and moved to attack Yisha.\n\nYisha didn’t move, but she pulled out her short Teeth Knife to attack Miss Mirror.\n\nMeng Lie sighed. His body turned to gold, and then, he pressed his hands down on the lion mount he rode upon. The gold color dyed the lion.\n\nThe next second, Meng Lie waved his hand. The golden lion rose, turning into a golden knife that resembled the head of a lion.\n\n“I didn’t want to kill you, but you just won’t stay put.” Meng Lie lifted the knife that looked like the head of a lion and approached Han Sen. Each step he took was like he was crushing the whole world. It felt like the whole galaxy had become smaller in his presence.\n\nMeng Lie was coming like a golden god. The little red bird shrieked at him as a phoenix fire blazed across it. It became a beautiful fire burning next to Han Sen, and it unleashed a scary sea of flames."
}