{
    "chapter": 1052,
    "title": "A Door to a New World",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1052",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen left Xie Qing King in the shelter and returned to the Alliance. Xie Qing King had said that he wanted to read some human books, and while Han Sen was happy to oblige, he didn’t have any books he could give the spirit. After all, Han Sen could not risk leaking important human information.\n\nThe deal was still in place, too, in which Xie Qing King would help Han Sen eliminate Holy-Sword Emperor and conquer Holy-Sword Shelter. So, by giving Xie Qing King books as requested, Han Sen thought he’d be in a better mood to assist.\n\nHan Sen tuned into a TV show discussing classic books and composed a list from that.\n\nThen, Han Sen purchased a number of the books, in physical format, and placed them in a box to give to Xie Qing King.\n\n“A separation of race does not abolish the concept of friendship between them. We should treat those of a different species or race with a greater respect.” When Han Sen was done on Skynet, he said this as he returned to the shelter.\n\nHe had only been gone a day, but when he got back, he discovered Xie Qing King had been impatient while he was gone. And through his inability to wait, he had gotten mad and almost destroyed the place.\n\nPeople had become scared of him by this point, and now, most people decided to remain in the Alliance until he was no longer around.\n\nOnly Bao’er was unafraid of the big lug, and she frequently had fun riding around on his head.\n\n“What are these things?” Xie Qing King asked with wide eyes, upon seeing the boxes.\n\n“You will see, soon enough.” Han Sen gave him a smile, but then went on to ask, “By the way, how do you feel about books? I could bring you some, but I am unsure whether or not you would be able to read them.”\n\n“The human language is simple. Compared to the language of spirits, it is d*mn near babyish.” Xie Qing King sounded passive aggressive, but he returned a smile, all the same.\n\n“Well, that’s good! I brought you some books, many containing illustrations. Perhaps you can learn more about humanity through them. Humans make excellent storytellers.” Han Sen pushed the box to Xie Qing King and said, “And that’s what’s in the box; loads of such books. I can bring you others if you don’t like them, too.”\n\n“Okay.” Xie Qing King was appreciative, and he did like Han Sen quite a bit.\n\n“I am also going to prepare some human food for you. And I’ve actually brought a variety of snacks with me for you try, as well. Snacks are a staple of our culture!” Han Sen then presented a number of snacks and laid them out for Xie Qing King.\n\nXie Qing King thought there was much to like about the human race, and they were composed of good people. Or at least, even if the others seemed weak, Han Sen was decent.\n\nHan Sen had also requested the delivery of a sofa so Xie Qing King could be more comfortable. And while the spirit relaxed, Han Sen got to cooking up a storm. Compared to spirits, he was a master chef. His cooking skills were near-enough divine.\n\nOf course, the primary reason for spirits’ lack of interest in food was the fact that they did not have to eat. All they ever ate were fruits that proved beneficial to their development.\n\n“You don’t have to cook. I don’t eat. Just bring me more books,” Xie Qing King said, after finishing all the books that he had just been given.\n\n“But I have to cook you something. Fine dining is a cornerstone of human tradition. Cooking for others, or relishing the cooking of others, is incredibly important. So, you must try the food I am preparing,” Han Sen explained.\n\n“Hmm, all right then.” After agreeing, Xie Qing King watched Bao’er open a bag of chips. Curious, he did the same.\n\nAs Han Sen continued to cook, Xie Qing King developed a fondness for the chips he had just consumed.\n\nA door to a new world had opened before Xie Qing King.\n\nHan Sen, in the meantime, occupied his mind with a plan of attack for how he’d deal with Holy-Sword Shelter. For as long as that place remained active and controlled by Holy-Sword Emperor, he would not feel safe.\n\nSuddenly, Ji Yanran called Han Sen.\n\n“When are you coming back?” Han Sen asked her.\n\nAnd to this, Ji Yanran said, “I don’t think I can. Not for a long while, leastways. Our discussions with the shura are still ongoing, and we’ve just been talking about investigating a bunch of new crystallizer ruins that have been discovered.”\n\n“You’re co-operating with the shura?” Han Sen was quite shocked to hear this. The truce was still active, but he had thought that the tensions were still quite high. He never would have thought that relations with the shura would have advanced enough to allow a joint archaeology project with them.\n\nBut Ji Yanran explained, “In some places, the aid of the shura is imperative. We need them.”\n\n“But you are only just an evolver; why are you leading?” Han Sen frowned.\n\n“They picked me.” Ji Yanran smiled and then went on to say, “To them, I’m pretty much a princess. They sent a royal shura prince to escort me, so it’s not as if I could have declined their request.”\n\n“There’s a royal shura with you?” Han Sen’s face became dour.\n\n“Don’t worry. Human surpassers are also coming with me,” Ji Yanran said, to alleviate his concerns.\n\n“I’m coming with you,” Han Sen swiftly said.\n\nBut Ji Yanran responded, “The people going with me have opened eight of their gene locks. And that aside, only sixteen people can go. There’ll be eight humans and eight shuras.”\n\n“I don’t care. I’m coming with you.”\n\nJi Yanran wished to continue their talk, but Han Sen hung up. He then went to contact Ji Ruozhen.\n\n“Why are you letting your daughter go to a place so dangerous?!” Han Sen said, his voice clearly upset.\n\n“This is an important matter of the Alliance, and it is a privilege for my daughter to do this,” Ji Ruozhen explained.\n\n“She is my wife, too, remember? Shouldn’t I have a say in this?” Han Sen did not wait for a response, and immediately went on to say, “If you want her to go so badly, I’m going with her.”\n\n“Eight people is the max. I’m sorry, but we already have the best available people going,” Ji Ruozhen said with a frown.\n\n“You can either let me go, or I take her away from there.” Han Sen was firm in his stance on the matter."
}