{
    "chapter": 2326,
    "title": "The Promise of Bai Ling Shuang",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2326",
    "text": "“Why?” Han Sen’s lip curled a little.\n\n“If you want the relic, then give her to me. Otherwise, don’t even think about it. The choice is yours.” The princess’ face didn’t change.\n\n“Fine. Whatever. She is just a useless kid. If you want her, then you can have her.” Han Sen rolled his eyes and returned to the building. He brought out Bao’er and lobbed her toward the princess.\n\nThe princess frowned. She caught Bao’er and immediately turned away from Han Sen. She took Bao’er away from the garden. She moved hurriedly, as if remaining in the garden for one more second would make her feel incredibly filthy.\n\nBao’er lay across the princess’ shoulder, clutching her neck. She winked at Han Sen.\n\n“D*mn woman… Don’t let me find a chance…” Han Sen grumbled, but he winked back at Bao’er.\n\nThe princess wanted Bao’er, and Han Sen needed Bao’er to amass information on his behalf. Bao’er’s intelligence and power made her a great infiltrator.\n\nBai Wei and the princess didn’t give Han Sen any further headaches. He was most worried about the meeting with Bai Ling Shuang, and that was because Han Sen wasn’t sure what sort of deal had been established between Bai Ling Shuang and Bai Yi. He didn’t know what Bai Ling Shuang had offered Bai Yi to make him hunt Han Sen down in Knight’s Paradise.\n\nBut Han Sen needed to go to Night Charm Town. Bai Yi would definitely have chosen to go there if he had returned from his confrontation with Han Sen.\n\nFortunately, Han Sen was able to read all the information that Mister White had given him before the meeting. He knew what sort of social circles Bai Yi traveled in. At the very least, he knew a thing or two about Bai Yi now.\n\nAt the proposed time of the meet, Han Sen rode the blood kirin and left Planet Water Zone, heading for Bai Ling Shuang’s Night Charm Town.\n\nBai Ling Shuang was different from Bai Yi and Bai Wei. She had an abundance of resources. Night Charm Town was like a top club located in King’s Kingdom, but it was only one of Bai Ling Shuang’s many properties.\n\nIt was a town, yes, but it was one that covered an entire planet. Because Night Charm Town was very famous among the Extreme King, finding information about the place wasn’t difficult. Han Sen made sure to do his homework before he left. Hopefully, nothing there would be strange to him.\n\n“Go and tell your master that Prince Sixteen Bai Yi is here,” Han Sen said to the receptionist, slapping the woman’s butt and squeezing it firmly. He spoke aloud with much pride.\n\n“My Prince, Night Charm Town doesn’t allow xenogeneics.” The receptionist kept a fixed smile on her face, but her eyes revealed the glint of simmering anger.\n\n“You don’t accept people’s xenogeneics? Well, the xenogeneic of Bai Yi is an exception to your rule,” Han Sen said, then walked forward with the blood kirin.\n\nThe faces of the guards changed. They stepped forward as if to stop him, but they then returned to their posts.\n\nThere were many noble snobs around there. Compared to Bai Yi, though, those people were pleasant. No one liked Bai Yi, not even the workers.\n\n“Please wait, My Prince. The princess is coming.” The receptionist took Han Sen to a room on the highest floor, then left.\n\n“The Extreme King really know how to enjoy themselves.” Han Sen sat on a sofa and looked around. He stroked the blood kirin’s head as he thought.\n\n“Brother Sixteen, you only have one half-deified xenogeneic. You don’t have to show-off twenty-four-seven.” Bai Ling Shuang walked in and looked at the blood kirin as she spoke.\n\n“Half-deified xenogeneic? This is nothing in your eyes, of course, but to a useless prince such as myself, it is very important. I need to bring it around often.” Han Sen grabbed a glass of wine and drank it. He looked at Bai Ling Shuang. His smile didn’t reach his eyes, and he said, “By the way, thank you for your kindness. If it wasn’t for you, I wouldn’t be receiving this.”\n\nBai Ling Shuang didn’t want to talk to Han Sen more than necessary. She threw something towards him and clapped her hands.\n\nA very attractive woman came in. She stepped up next to Bai Ling Shuang and bowed. Then, she bowed to Han Sen and said, “My name is Cher. It is nice to meet you, My Prince.”\n\nCher’s body was very attractive, and her eyes could snare a person’s soul. Her voice was like a hook that could draw the attention of all.\n\n“Fox!” Han Sen’s eyes widened as he looked at Cher. He was given a fright. She had fox ears and a fox tail behind her.\n\n“The Extreme King’s Pavilion Pass and Cher are now yours for the day. You should be sufficiently satisfied,” Bai Ling Shuang said emotionlessly.\n\n“You had so much faith in me, Sister Ten.” Han Sen looked at Cher. He pulled her into his arms and reached right into her clothing.\n\nCher was smiling, but inside, he knew that she hated this.\n\nBai Ling Shuang coldly grunted and left the room. Han Sen now had a headache. He should have thought more about what Bai Yi would have asked for. As a request from Bai Yi, this sadly made sense.\n\nThe Extreme King Pavilion Pass surprised Han Sen, though. He hadn’t been in the Extreme King long, but he had heard about the Extreme King’s Pavilion.\n\nOnly the royal children that were rewarded by King Bai were granted a pass. This was an item that allowed one to get into the Extreme King’s Pavilion. One pass could provide one entry.\n\nThe legends said that there were many legendary treasures there, and that only the royal children were ever allowed access to them. If one was not a royal child, it would be pointless to have the pass.\n\nBai Yi had never received a pass before. Han Sen hadn’t expected that the deal with Bai Ling Shuang would earn him an Extreme King’s Pavilion Pass. The unexpected revelation made Han Sen very happy.\n\nIn the Extreme King’s Pavilion, randomly selected treasures could be bought for high prices. This was a surprise to Han Sen.\n\nBut the other part of Bai Yi’s deal, his desire for a woman—and a Fox woman at that—left Han Sen unsure of how to proceed.\n\nWith Bai Yi’s personality, he would have undoubtedly gone crazy all over the Fox woman.\n\nBut Han Sen wasn’t Bai Yi. He liked pretty girls too, but he didn’t want to do anything with a woman he didn’t know.\n\nAnd most importantly, the room had a camera. Han Sen didn’t have a fetish for being watched.\n\nBut right now, he was disguised as Bai Yi. Leaving a woman that Bai Yi had always dreamed of without doing anything would inspire suspicion from Bai Ling Shuang.\n\nHan Sen even thought Bai Ling Shuang was probably sitting behind a monitor of the camera’s feed, watching his every move.\n\nHan Sen held Cher by the waist, trying to think about how he might deal with the situation.\n\n“My Prince, this is my first time. Please be gentle…” Cher looked down. Her face seemed red, and the skin of her chest was flushed a little pink. She looked very charming. Seeing her would make anyone feel horny."
}