{
    "chapter": 2572,
    "title": "Gene Potential",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2572",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Are you mistaken? Isn’t she one of the Sky? Why does it say she is one of the Very High?” Han Sen asked Glasses in his mind. He was trying to keep his surprise under wraps while he read through the rest of the report.\n\n“Target: Very High female. Gene Age Calculation: 23 years”\n\n“Gene level: Ninth-tier King”\n\n“Gene potential: 5 stars”\n\n“Crystal Furnace Database has a lot of gene data concerning the Very High. Based on the target’s genes, her genes match the Very High profile at a rate of 87.675%. The genes that associate her with the Sky compose 0.3% of her form. Likelihood of target being a member of the Very High is 99.99%,” Glasses answered.\n\nHan Sen believed it. He already knew that Exquisite was ninth-tier King, which proved that Glasses wasn’t talking nonsense.\n\n“Right. I never heard about Li Keer and Exquisite in Sky Palace because they don’t belong to the Sky,” Han Sen surmised.\n\n“Then what does their gene potential mean? What is the highest star rating achievable?” Han Sen asked.\n\n“The gene potential means how much a creature can grow. According to the Crystal Furnace Database, there are ten stars in total,” Glasses answered.\n\n“No way. There are ten stars in total and a member of the Very High only has five?” Han Sen was very suspicious about these results due to the fact that the Very High were one of the strongest races in the entire universe. Even if their genes weren’t the best, they shouldn’t have been as low as five stars.\n\n“What are you doing, waiting around here?” Exquisite asked with a frown. Han Sen was just standing there staring at her.\n\n“It’s nothing. I was just thinking of a way to get out of here,” Han Sen said.\n\n“So, did you think of a way?” Exquisite asked.\n\n“No.” Han Sen shook his head.\n\n“Then let’s just wait for rescue. We have been missing for a while. Our people will probably think of a way to save us,” Exquisite said. Then, she left.\n\nHan Sen opened his mouth. He wanted to ask if she was one of the Very High, but if she was choosing not to divulge that information herself, there had to be a reason. He knew that very well, considering that he didn’t go around telling everyone that he was a human. With that in mind, he decided not to ask.\n\n“For a king, five stars is top class. Only deifieds start at six stars for analysis,” Glasses answered.\n\n“I see. How many stars do I have?” Han Sen asked out of curiosity.\n\n“Collecting data… analyzing data… analyzing…” Glasses’ data collection started going through the motions, except this time it was taking far longer.\n\n“Genes are unstable… Cannot confirm… Cannot confirm…” The data collection kept going on, and it didn’t seem as if it was going to stop.\n\n“It doesn’t matter, I suppose. There is no need to continue testing,” Han Sen said. Glasses had continued to say “cannot confirm,” which Han Sen found annoying.\n\nGlasses quieted down and the data on the screen vanished.\n\n“Right, let’s go and see how the big and little Crocodile Gods rank on this thing,” Han Sen thought. His heart already beating a little faster, Han Sen headed for the swimming pool.\n\nHan Sen saw the big Crocodile God still asleep on the sunbathing chair with Li Keer massaging its head. Curiosity rose in Han Sen, and he found himself wanting to test out Li Keer first.\n\nThe results were similar to Exquisite’s, and it turned out that Li Keer was one of the Very High, too. She also had five stars, but she was younger. According to the crystallizers’ gene calculations, Li Keer was only sixteen.\n\n“This time, I believe you.” Han Sen turned and looked at the big Crocodile God. He saw the icons spinning as the device collected data, but after a while passed, it hadn’t come up with any results.\n\n“There’s no way you cannot analyze that.” Han Sen started to doubt whether or not the glasses were working properly. But then, he saw the image and data of the Crocodile God appear.\n\nTarget: Gravity Crocodile God female. Gene Age Calculation: 1.365 billion years\n\nGene Level: Transmutation Deified\n\nGene potential: 7 star\n\n“Your analysis is so inaccurate. A deified of the transmutation rank only has a potential of seven stars?” Han Sen was doubting the analysis Glasses was providing again.\n\n“Gravity Crocodile God’s genes are only four stars. There is a limit to the rank that it can achieve. It cannot become fully deified because, even after modification, its gene potential will only rise to seven stars. It can never exceed the rank of transmutation. If there are no gene mutations, the chance of reaching larva class is one-in-a-billion.”\n\n“Seriously? You have that much deified data to compare with?” Han Sen asked skeptically.\n\n“This is the result after comparisons with the samples of other deified creatures. According to the database, without a nine-star potential, a deified creature can never become a true god,” Glasses answered.\n\nHan Sen looked at the little Crocodile God with much suspicion. Glasses worked again, and the data symbols started to spin.\n\nAfter a while, Han Sen was finally able to read the results.\n\nTarget: Gravity Crocodile God male. Gene Age Calculation: one month, seven days.\n\nGene Level: Primitive Deified\n\nGene Potential: 9 stars\n\n“Holy sh*t! This guy is a Gravity Crocodile God. Why does it have nine stars?” Han Sen asked.\n\n“This Gravity Crocodile God was born deified. Its genes mutated, becoming far better than the old ones. According to the genes shared, they must be mother and son.”\n\n“Seriously? This small thing has the potential to become a true god?” Han Sen looked at the small Crocodile God with a fire in his eyes.\n\nThe little Crocodile God realized Han Sen was staring at it. So, it looked at Han Sen with disdain. But Exquisite was still scrubbing the creature’s scales, so it didn’t do anything.\n\n“A nine-star deified xenogeneic can become a true god, but it isn’t guaranteed,” Glasses answered.\n\nHan Sen ignored Glasses as he tried to think of a way to kidnap the small Crocodile God. That thing could one day become a true god.\n\nBut Han Sen remembered that he couldn’t take a core xenogeneic away from there. So, kidnapping would be pointless.\n\nAfter considering the results delivered by Glasses, Han Sen decided to place his faith in them. If the crystallizers had designed this device by themselves, they wouldn’t have been able to gather so much data on deified creatures.\n\nBut the elders of the crystallizers helped Sacred Leader analyze The Story of Genes. And they eventually took over the sanctuaries. Han Sen believed they must have received some data from Sacred.\n\nFor someone like Sacred Leader, it wouldn’t have been too difficult to collect data on deified beings. Back then, the Very High and Ancient God were far below Sacred. The Extreme King were servants of Sacred. If Sacred Leader wanted their gene data, it would have been very easy for him to collect it.\n\nAfter all, gathering gene data didn’t require the deaths of the deifieds. It would only require a hair or a small sample of DNA. If Sacred Leader wanted a strand of hair, who would dare to turn down his request?\n\nNow, Han Sen just wanted to go home and try it out on his baby daughter Ling’er. He wanted to see how much gene potential she had.\n\nBut as long as he was under the control of the big and little Crocodile Gods, he couldn’t go anywhere. Leaving wasn’t an option just yet. Han Sen was going to remain patient and keep cleaning up the fortress in case there was anything else there for him to find. Glasses only scanned, analyzed, and compared. It didn’t do anything else."
}