{
    "chapter": 131,
    "title": "Golden Rock Worm King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_131",
    "text": "When the angry sacred-blood fox king limped back to the top of the dune, the team had dashed out of the skulk.\n\nAlmost without any hesitation, Han Sen roared at Wang Mengmeng, \"Summon your mount.\"\n\nWang Mengmeng quickly summoned the big white bear. Han Sen leapt on the bear and Wang urged the bear on at full speed.\n\nThe skulk of foxes was snapping at their heels, but only the few mutant horned sand foxes could catch up with the team’s mutant mounts.\n\nHan Sen thought that the skulk would give up the chase soon, since their king was injured and could not catch up with them.\n\nHowever, they soon heard a strange howl and what they saw was shocking.\n\nThe fox king was standing on top of the head of a golden rock worm and, gazing at Han Sen, bristled.\n\n\"F*#k! This fox king is abnormal. How could it command the rock worm? Is the rock worm also a sacred-blood creature?\" cried Su Xiaoqiao.\n\nThe team saw the golden rock worm approach them at a high speed and was horror-struck.\n\n\"You go east, I will go west.\" Han Sen then asked Wang Mengmeng to control her bear to go west.\n\nNow Wang Mengmeng almost trusted Han Sen blindly and did not even think about it before doing what he said.\n\n\"You have to be careful.\" Gambler had already understood Han Sen’s plan and led the rest to the east.\n\nThe fox king ordered the rock worm and mutant foxes to chase Han and Wang immediately. A fox never forgets. It would never give up until it tore Han Sen apart.\n\nHan Sen had already taken the fairy queen back to save his strength. He had also untied the rope and sat Wang in front of him so she could better control the bear.\n\n\"Fox king, come if you want to eat me,\" Han Sen said and suddenly shot an arrow, killing a mutant fox in the blink of an eye.\n\nThe fox king was stamping with rage, roaring on top of the golden rock worm’s head. The worm moved faster.\n\nThe mutant foxes were also trying to catch up with the bear.\n\nHan Sen glanced at the fox king and shot another mutant fox dead.\n\nWatching the fox king losing its temper, Han Sen laughed, \"Fox king, come at me if you will, and watch me kill your buddies.\"\n\nHen Sen’s hands never stopped, his black stinger arrow killing one mutant fox after another.\n\n\"Mutant horned sand fox killed. Beast soul of mutant horned sand fox gained. Eat its meat to gain zero to ten mutant geno points randomly.\"\n\nSuddenly a different voice sounded in Han Sen’s mind. He gained a mutant horned sand fox beast soul.\n\nWith great joy, Han Sen was shooting with great strength.\n\nThe fox king was about to explode. The white bear was a sacred-blood mount, so the golden rock worm could not catch up with them any time soon.\n\nFinally, at a howl of the fox king, all the mutant foxes stopped chasing.\n\nOnly the fox king continued with the rock worm as its mount.\n\nThere were no more mutant foxes for him to kill, so Han Sen made the fox king his target. This time the fox king was prepared and dodged. Although the distance was short, the arrow ended up hitting the golden rock worm.\n\nClank!\n\nIt sounded like the worm had a shell harder than metal. The mutant black stinger arrow only left a white mark that was barely visible on it.\n\nHan Sen was taken aback with a surprise. \"Sure enough, the golden rock worm is also a sacred-blood creature.\"\n\n\"Brother Han, now what should we do? The white bear is slower than the golden rock worm. They will catch up eventually,\" asked Wang Mengmeng, riding the bear.\n\nShe did not sound scared or worried, as for some reason, she believed Han Sen could always take care of things.\n\nIn such a dangerous escape, she did not even have any sense of crisis.\n\nAlthough there were occasionally some creatures in front of them, they would scatter at the sight of the golden rock worm. Hence they did not encounter any obstacles on the way.\n\n\"The rock worms are only fast in the desert. If we can get out of here, we should be able to get rid of it,\" Han Sen pondered and said.\n\n\"It’s full of sand and rocks here. I do not see any other color.\" Wang Mengmeng looked around said disappointedly, \"Just dunes and stony hills.\"\n\nHan Sen’s eyes suddenly lit up. Pointing in one direction, he said, \"Go over there.\"\n\nWang Mengmeng followed his order and urged the bear on. Soon she found they were on a cliff facing a deep valley. The path ended and the valley was at least a hundred feet wide.\n\n\"Brother Han, we have nowhere to go!\" exclaimed Wang Mengmeng.\n\n\"Go over,\" Han Sen said with no expression.\n\n\"No, the white bear cannot jump so far,\" Wang Mengmeng quickly said, seeing the big white bear approaching the edge.\n\n\"Trust me. Go over,\" said Han Sen firmly, while pointing an arrow at the fox king.\n\nKnowing their despair, the fox king looked cruel and pleased.\n\n\"Well, Brother Han, I believe you. Going over...\" Wang Mengmeng commanded her bear to rush off the edge at full speed.\n\nWith her blind trust in Han Sen, Wang Mengmeng was trying to make the impossible happen.\n\nBehind them the golden rock worm was getting closer and closer. The fox king watched the two humans viciously.\n\nPointing the arrow at the fox king, Han Sen did not shoot.\n\n\"Brother Han!\" Wang Mengmeng screamed and closed her eyes as the white bear ran off the edge.\n\nHan Sen finally shot the arrow, put an arm around her waist, and covered her eyes with his other hand. \"Take your white bear back,\" he said quietly."
}