{
    "chapter": 84,
    "title": "Ape Beast Soul",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_84",
    "text": "Finally, Dollar and Luo Tianyang’s codes were displayed on the martial stele. Each digit in Han Sen’s code was an eight, so everyone knew that was him.\n\nLuo Tianyang went on the stage first. From his leisurely look, it seems that he was confident about the upcoming match, which made Su Xiaoqiao quite nervous.\n\n\"Where is Dollar? The match is about to begin but we don’t see him yet. If he is not here in three minutes, he will automatically be considered the losing side.\"\n\nThe stands were filled with people eager to see Dollar’s match, but the familiar golden figure was missing.\n\nSu Xiaoqiao became even more tense. Liu Hongtao smiled unkindly, \"Su Xiaoqiao, it seems that you are in a bad place. If Dollar doesn’t show up at all, you wouldn’t be convinced even if I won the bet, right?\"\n\n\"What is this nonsense? It is still very early, and the boss always comes late. Don’t you understand that?\" Su Xiaoqiao retorted, but felt unsure as Dollar didn’t show up. He thought, \"Could Dollar be delayed by something? Then my mutant nocturnal wolf would be gone...\"\n\n\"Great, I’ll see how long you could keep that thought,\" Liu Hongtao ridiculed.\n\nSuddenly, the guy in cape sitting next to Su Xiaqiao who had been silent the whole time suddenly stood up and walked toward the stage, leaving Su Xiaoqiao and others dumbfounded.\n\nThe guy took off the cape while walking, revealing the golden armor underneath, leading to an uproar in the stands.\n\n\"Dollar... Dollar...\"\n\n\"Ha-ha, the angel came.\"\n\n\"I know there’s no way he would miss this.\"\n\nSu Xiaoqiao was so happy that he jumped up, \"My God, Dollar you are truly amazing. Kick Luo’s ass for my sake please. And remember, keep it under a minute... one minute...\"\n\nSu Xiaoqiao was now certain that Dollar have just heard the dialogue about the bet, that was to say Dollar knew he should defeat Luo within a minute, which was undoubtedly good news for Su.\n\nOther Bullseye members were also very excited, \"Dollar was just sitting here and we failed to recognize him!\"\n\n\"Indeed, we should’ve asked for his autograph! I hear you could sell that for a good price now.\"\n\n\"Xiaoqiao, you didn’t say what you said because you knew it was him, did you?\"\n\nSu Xiaqiao laughed, \"God helps those who help themselves. How could I know it was Dollar? He wrapped himself like a rice dumpling on such a hot day, and I was just wondering about that myself.\"\n\nLiu Hongtao's face was grim. He sneered and said, \"Don’t be happy now. Even if he wants to help you, it is impossible to defeat Luo in a minute.\"\n\n\"Nothing is impossible with Dollar. As long as he wants to do it, it will be done.\" Su Xiaoqiao immediately retorted, with all his faith in Dollar.\n\nAlthough Yang Manli was surprised that Dollar was sitting beside them, she was not as optimistic as Su Xiaoqiao. Rationally speaking, what Liu Hongtao said made sense.\n\nLuo Tianyang might not be Dollar’s match, but he had Son of Heaven behind him, so he must have plenty of beast souls on him. Despite that Luo’s fitness wasn’t the best in Son of Heaven’s gang, his fitness index should still be over ten. With strong beast souls, it would be difficult to beat him.\n\n\"If Dollar is an archer with advanced beast soul bow and arrows, he might be able to get rid of Luo fast. Unfortunately, it seems that he never uses arrows,\" Yang Manli sighed inwardly.\n\nSon of Heaven shot a harsh stare at Han Sen and eyed Luo Tianyang on the stage. Luo nodded knowingly.\n\nSon of Heaven had prepared well for this match. Knowing Luo wouldn’t be Dollar’s match, he didn’t count on Luo to defeat Dollar. Still, he lent Luo his sacred-blood ape beast soul and many powerful mutant beats souls. All he wanted to see was Dollar injured. Even if Dollar could not be injured, he must show his real skills in this match.\n\nSon of Heaven saw Dollar as a fierce rival, which was why he was using Luo as a pawn to weaken Dollar before he ran into Dollar himself and to find out how strong Dollar was.\n\nLuo Tianyang was both cunning and ruthless. He didn’t take Dollar lightly and summoned the ape beast soul and a mutant suit of armor as soon as the stele lit up and the match started.\n\nSuddenly, stood on the stage was a giant age more than nine feet tall in a suit of bone armor with a long mace in its hands. The look alone was terrifying.\n\nA wisp of a smile crossed Son of Heaven’s face. That was why he liked Luo. Luo’s ability was less than impressive in his gang, but Luo had always been careful and decisive.\n\nSon of Heaven had always believed that one must know one’s limits, which Luo did.\n\nBeing meek towards the brutal and brutal towards the meek might be viewed as a bad thing. But the way Son of Heaven saw it, it was also a wise attitude. Luo Tianyang’s decision now was much to Son of Heaven’s satisfaction—playing it safe and trying to survive.\n\nOf course, Luo Tianyang's life was not very important to him. But if Luo died, the ape beast soul would be ruined as well. So, Luo must not die.\n\n\"That’s it. Just do whatever you can and try to force Dollar to show all he got. If anything went wrong, just go off the stage and throw in the towel.\" Son of Heaven looked at the two on the stage and thought with a smile, \"Dollar, let me see what you’ve got.\"\n\nLiu Hongtao was amused by what Luo Tianyang did. \"I told you Son of Heaven would definitely give the ape beast soul to Luo. You see? With that mutant bone armor, it would take Dollar at least an hour to beat Luo.\"\n\n\"What are you talking about? Can someone like Luo Tianyang even shapeshift for an hour?\" Su Xiaoqiao disagreed. His heart did freeze a little as he didn’t think Luo would really have the ape beast soul on him.\n\n\"Anyway, it would be easy for him to last ten minutes, which means I could win ten times, so it’s a pity that you don’t have ten mutant beast souls,\" Liu Hongtao laughed."
}