{
    "chapter": 2591,
    "title": "Bad Fight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2591",
    "text": "The sky was full of fire, and it was all headed for Meng Lie. Meng Lie swung his knife, and the sea of fire parted like it had been cut with a pair of scissors. The fire fell away to either side of the man and faded.\n\nA cold, golden knife light suddenly flew toward the little red bird. If the little red bird hadn’t dodged the attack in time, it would have been cut in half.\n\n“Meng Lie is so powerful! His gold soldier body is very strong.” Han Sen couldn’t help but compliment his opponent.\n\nMeng Lie was a transmutation deified, and when he turned another deified xenogeneic into a soldier, his strength had grown. A primitive deified would have a hard time taking him down.\n\nHan Sen’s body shone with rainbow light. Between his fingers, he held an arrow that was infused with rainbow light. He pulled back the string of the Six Core Snake Bow and fired the arrow at Meng Lie.\n\nThe moment the rainbow light arrow left Han Sen’s fingers, it disappeared. When it appeared again, Meng Lie’s golden lion head knife hit the arrow of rainbow light. It broke the light arrow with ease, which shocked Han Sen.\n\nMeng Lie had somehow seen the arrow as it teleported. He had broken the arrow easily. A power like that was terrifying.\n\n“Transmutation class powers are that scary? Then how strong must a true god be?” Han Sen sighed. Meng Lie came slashing at Han Sen like a golden god spirit that was dominating the whole sky.\n\nThat knife consumed all of space. It made Han Sen feel as if he couldn’t dodge.\n\nIf Han Sen practiced the real God’s Wander, he could teleport anywhere he wished to. He could have teleported far away from that golden knife light. But with his current skills, such techniques were beyond him.\n\nHis eyes were like lightning as he pulled out his purple copper jian. He used a stance that would allow him to blow up the sky.\n\nPang!\n\nA knife silk was broken by the scary golden god light. Han Sen and the purple copper jian flew away. The purple copper jian shook violently, and Han Sen’s arms were almost cut off. The muscles in his hands were delivered a deep laceration, and his bones could be seen through the wound.\n\n“Huh? You blocked my knife and didn’t shatter. That is quite a good deified weapon. How many deified weapons do you possess?” Meng Lie looked at the purple copper jian in Han Sen’s hand with complete surprise.\n\nHan Sen didn’t answer him. He frowned and looked at the purple copper jian. “Does this guy’s power only work against enemies in the Black Hole Spider’s stomach?”\n\nThe purple copper jian was a race weapon. It was as good as a weapon of the true god rank, but now, the purple copper jian seemed a little underwhelming.\n\nHan Sen expected this, though. He hadn’t yet figured out what sort of power the purple copper jian possessed, so its real power hadn’t yet been displayed.\n\nIn addition, Han Sen’s power was simply too weak. He couldn’t use the jian’s full power to block Ming Lie’s strike, and it didn’t even look like the Fourth Uncle had been trying all that hard.\n\n“Han Sen, you should know that my first strike was just me going easy on you. If you still don’t understand, then the next attack won’t be so gentle,” Meng Lie said, word by word, as he approached Han Sen.\n\nEverything that existed trembled under the booming of his voice. Even Han Sen’s body shook a little.\n\nHan Sen wasn’t shaking because he was afraid, though. It was his natural reaction to facing a strong enemy. He was so hyped in the middle of combat that it released all of his hidden power, building more and more energy within him.\n\nThis was the biggest fight he’d had in years, and his only choice was to win. Losing wasn’t an option. If he lost, then all the people following him would be killed, too.\n\nHan Sen looked at Meng Lie who had come forward like a god. His Purple-Eye Butterfly spun like mad. Before Meng Lie attacked again, Glasses was bringing up the man’s test results.\n\nTarget: Extreme King male. Gene Age Calculation: 12,300 years\n\nGene Level: Transmutation deified\n\nGene Potential: 8 stars\n\nHan Sen was shocked. It seemed as if the gene potential level was trickier than he had expected. Even an Extreme King transmutation deified only had eight stars. The stars of a lower race were bound to be lower. So, Yisha’s eight stars were actually quite impressive.\n\nRight now, though, Han Sen didn’t care how many stars Meng Lie had. The man’s potential wasn’t something that mattered right now. At the moment, Meng Lie was simply a transmutation deified enemy that he had to get rid of.\n\nTarget: Lion male. Gene Age Calculation: 163,000 years\n\nGene Level: Primitive deified\n\nGene Potential: 6 stars\n\nThis was the data of the deified xenogeneic that had been turned into a knife that resembled the head of a gold lion. Its data didn’t mean anything, though. Under the influence of Meng Lie’s gold soldier body, the xenogeneic had been transformed into a knife and gained more power than ever before.\n\nBzzt!\n\nAnother strike was on its way. The gold sword light tore through the universe, effortlessly cutting through the fabric of space. Han Sen’s eyes flashed red, and his whole body turned red as well. The moment the golden knife light landed, it disappeared.\n\nMeng Lie frowned. He didn’t look around, though. He knew exactly where Han Sen was. He used his left hand to gouge his own eye.\n\nPang!\n\nMeng Lie’s eye exploded. It was a self-inflicted blow, and a stream of golden, god-like blood gushed out. Han Sen fell out with it.\n\nHan Sen had made use of his Blood Eye Evil God’s power to fire himself into Meng Lie’s eye. He hadn’t realized that Meng Lie would be so brutally efficient. He was happy to poke and obliterate his eye, which sent Han Sen rolling out.\n\n“Han Sen, spare me these tricks. They won’t work on the likes of me.” Meng Lie’s eye was still bleeding golden blood, but the flow of blood had been reduced dramatically. The wound wasn’t healed, however, which prevented Han Sen from re-entering the eye with his Blood Eye Evil God.\n\nHe had been blinded, but Meng Lie was still able to watch Han Sen. It was like he could see every move that Han Sen made.\n\nHe moved the gold lion head knife, and the gold knife light that could destroy the most ancient things surged toward Han Sen. It was so suppressive. It was like the whole galaxy was going to snap.\n\nThe peacock king robe had its wings open. A rainbow substance chain surrounded Han Sen. It connected with the purple copper jian, which Han Sen then used as an arrow with the Six Core Snake Bow.\n\nFacing this scary gold knife light, Han Sen pulled back the string of the Six Core Snake Bow. He fired the purple copper jian.\n\nThe purple copper jian disappeared in a hazy rainbow light. When it reappeared, it slammed into the scary gold knife light.\n\nHan Sen wasn’t worried about the purple copper jian breaking. Race weapons weren’t that easy to break, after all. And even if it did break, Han Sen wouldn’t be very upset about that. He didn’t want his new ears or tail anyway.\n\nPang!\n\nThe purple copper jian and the gold god light collided. It was like a sun had just exploded. It created a scary shockwave that destroyed everything around them.\n\nHan Sen watched that grand explosion. The purple copper jian came back, spinning like a flaming wheel. Han Sen grabbed it, and he marveled at how there wasn’t a single scratch on it.\n\nMeng Lie stared at the purple copper jian, his eyes blank with shock. He had used so much power that time, but even so, that\n\noring-looking purple copper jian had blown up his knife light without incurring any damage. That was unbelievable.\n\n“Is this another deified weapon like the Shield of the Medusa’s Gaze?” Meng Lie looked at Han Sen’s purple copper jian.\n\nHan Sen looked at his mint condition purple copper jian with joy. “I don’t know what the true power of the purple copper jian is, but it seems pretty good. It can block Meng Lie’s knife lights.”\n\nAs Han Sen thought this, he put the purple copper jian back against the string of the Six Core Snake Bow and aimed at Meng Lie."
}