{
    "chapter": 3044,
    "title": "Make You Be My Servant",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3044",
    "text": "“It sounds very powerful. Is it just a gene race?” Han Sen put the little cat next to him and looked at it. Aside from the fact that it looked like Old Cat, there was nothing inherently special about it.\n\nHan Sen picked up the little cat. Its body was facing down. It stared at Han Sen with big, innocent eyes. It looked like some innocent little thing that did not know anything.\n\n“About that, ordinarily, gene races with a god pulse weird scene are quite strong,” Mister Yang said with hesitation. “Now, it is too small. It will probably take a while to develop.”\n\nAlthough the gene race might have been an evil beast, its appearance completely went against what one would suspect an evil beast was like. They were a mismatch. Even Mister Yang was starting to doubt himself.\n\nUsually, there was red dust everywhere and disasters all the time. Those were the signs of an evil beast being born. That did not appear to be the case.\n\nHan Sen looked at the little cat as he asked, “How do I make it grow up? Do I feed it cat food?”\n\n“A gene race needs to eat other gene eggs or other gene races to evolve,” Mister Yang confidently replied. “Normal food cannot be used to develop it.”\n\n“That will be troublesome. Where can I find many gene races to feed it?” Han Sen was a bit troubled.\n\nDigging up gene eggs was very annoying, especially to get a lot of gene races. Han Sen did not think whichever path he had to take would be easy.\n\n“It is very small now. Low-level gene eggs and gene races are enough to feed it. You should be able to get it to evolve once. When it grows bigger, ordinary gene eggs and gene races may not be digested by it. It will need higher-level gene races each time to keep evolving.”\n\nAfter pausing, Mister Yang asked, “Mister, are you really going to raise him? It is an evil beast, and you cannot make a contract with spirits. If you only tame it, betrayal will be very easy.”\n\n“It is fine. I will just have one to play with.” Han Sen held the little cat. He looked at it and asked, “Why don’t I call you Small Cat?”\n\nHan Sen was very bad at naming things. It looked as if it was from the same race as Old Cat, so there was no harm in naming it Small Cat. This way, Old Cat could still be called Old Cat. That saved a lot of trouble.\n\n“Meow.” The little cat seemed to understand. It nicely meowed to Han Sen as if it was happy for the name it had been bestowed.\n\n“Old Yang, please find me a few more god pulses. We will dig up some more gene eggs.” Han Sen seemed to understand that he could not combine with gene eggs. He was not interested in gene eggs anymore. He only wanted the gene eggs to feed Small Cat.\n\n“OK.” Mister Yang had no choice but to nod. He looked at the cat with conflicted emotions and said, “In recent years, I do not know why, but the number of land pulses has increased. There are a lot more gene eggs up for grabs. Before, it was quite rare for a land pulse to yield two gene eggs. Recently, we have been able to find three or four gene eggs in a land pulse reliably. It should not be difficult for us to track down some low-level gene eggs for you. If this was the past, it would be very difficult.”\n\nHan Sen looked at the 24-foot-long metal pillar and walked next to it. He lifted it onto his shoulder. It was like he was carrying some wood.\n\n“This thing should be worth something,” Han Sen remarked. “Maybe I can trade it in for some gene eggs.”\n\nMister Yang looked at him strangely. He said, “A suppress pulse item is worth a lot, but its owner is likely someone very famous and powerful. If the owner finds you hawking it, it might lead to another point of concern on your growing list of troubles.”\n\nHan Sen did not care for what he worried about. He continued to hold the pillar. He stood behind Mister Yang. The two of them trekked on in search of land pulses. They were eager to find more gene eggs.\n\nJust like Mister Yang said, the land pulses were not hard to find. After a 10-mile walk, they reached another land pulse. This time, there were no sinister incidents. The two of them were soon able to dig up a fist-sized, white egg out of the earth.\n\nMister Yang had a look. He said that it was a baron-class gene race toxic snake egg. It was a fairly common gene race. In Ancient God City, many people used this gene race.\n\nIf it was nothing special, so Han Sen did not care for it. He gave the toxic snake egg to Small Cat. He placed it before its mouth. Small Cat was excited. It reached its tongue out to lick the sides of the egg. It kept licking and meowing, showing how much he loved it.\n\nSmall Cat’s head was not big, but its stomach was large. It managed to eat the fist-sized snake egg in one gobble. Its belly did not even look plumper after the meal. In fact, it looked as if the kitten wanted more.\n\nHan Sen had to have Mister Yang take him further in pursuit of more gene eggs. The two of them did not have to walk for very long when they heard the sound of horse hooves approach from behind.\n\nHe turned around and saw a giant, overbearing bug coming right at them. Mister Yang was shocked. He was so scared that he yelled, “Has Shibo sent out others in pursuit of revenge?”\n\n“It’s not Shibo. It’s Peaceful and someone younger than her.” Han Sen’s eyes were powerful. The people were far away, but he was able to see who was on the back of the overbearing bug.\n\nOf course, when the overbearing bug drew near, Mister Yang saw Peaceful. Next to Peaceful was a pretty man clad in white garments.\n\nThe overbearing bug was less than 15 feet away from Han Sen when it came to a halt. The white-clothed man looked about 13 to 14 years old. He looked at Han Sen with interest. “Peaceful, is he the guy who used his bare hands to kill an overbearing bug?” “Yes, Mister White,” Peaceful politely answered.\n\nMister Yang was shocked. Peaceful was the granddaughter of Dragon Song City’s leader. Her identity was prestigious. Seeing her now, it seemed as if even she was being super respectful to the man. It suggested that he was of even greater nobility. “Did you really use your bare hands to kill an overbearing bug?” the white-clothed man asked as he jumped off of the overbearing bug’s back. He walked over to Han Sen.\n\n“Yes, I did.” Han Sen nodded and did not deny it.\n\n“In that case, can you kill this overbearing bug?” the white-clothed man asked, as he pointed to the mount they had ridden in on.\n\nAlthough the overbearing bug had just become an adult, it was stronger than the one Shibo had. Its head was twice as big.\n\n“You and I have no conflict,” Han Sen said. “Why would I kill your overbearing bug?” “This is not my overbearing bug. It is hers. I want to see if you can really kill an overbearing bug with your bare hands.” The white-clothed young man pointed at Peaceful as he spoke.\n\nPeaceful did not look so good, but she did not say anything. Clearly, she was afraid of that white-clothed man.\n\n“Why would I want to show you? What is the point in killing your overbearing bug?” Han Sen frowned. The young man gave him a weird feeling\n\nUpon hearing Han Sen, the white-clothed young man looked as if he was deep in thought. He said, “If you can really kill an overbearing bug with your bare hands, I will make you my servant.”\n\nThe white-clothed man said this as if it was perfectly normal. It was like Han Sen would have been lucky to become his servant.\n\nUpon hearing this, Mister Yang thought things were going to turn foul. He knew what sort of person Han Sen was. There was no way he would accept this."
}