{
    "chapter": 2645,
    "title": "Fairy Flowers",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2645",
    "text": "When Exquisite returned to the wooden house, she frowned. It seemed that Han Sen had already left. The further away from her that Han Sen was, the weaker her connection with him became. Now, she could only sense what direction Han Sen had gone off in and get a faint feel for his current state of emotion.\n\nAll Exquisite could tell was that Han Sen was feeling happy. She couldn’t really feel anything other than that.\n\nBut if he felt happy, that meant he hadn’t encountered any trouble. And that suggested she didn’t have to worry about him too much.\n\n“He is quite daring. He’s just arrived in Outer Sky, and yet he has already run-off so far on his own. Doesn’t he realize how many deified xenogeneics there are roaming around? Even if he uses his deified treasures to bolster his power, it will still be hard for him to survive out there amidst those ancient monsters,” Exquisite thought to herself.\n\nHan Sen was getting close to the wooden house now, and as he approached, Exquisite was able to sense more and more about him. After an hour, she could sense that he was holding a bunch of flowers.\n\nBut Exquisite could only feel and not see, which was a shame. She could sense how careful Han Sen was being to hold the flowers without crushing them, but she couldn’t see what he was seeing. So, she could only guess what he was holding by judging his sense of touch.\n\nHan Sen’s happiness ran through her. It seemed that he might have already discovered a treasure of some kind.\n\n“Fairy flowers,” Exquisite realized, when Han Sen was finally close enough for her to detect what he was thinking about. Han Sen had collected fairy flowers. He didn’t know how to use them, though. So, he was bringing the flowers back to ask her what they were for.\n\n“How is that possible?” Exquisite couldn’t believe Han Sen had somehow managed to find fairy flowers. Those flowers were quite unusual. Many of the Very High wanted fairy flowers, but the strange plants were incredibly rare.\n\nHan Sen had only been in Outer Sky for two days, and already he had come across fairy flowers. This really was so weird. Since Exquisite still couldn’t see Han Sen with her own eyes, she didn’t believe Han Sen had discovered real fairy flowers, though. He must have been mistaken about what he had. But when Han Sen appeared in her vision, Exquisite’s eyes opened wide.\n\nHan Sen was holding real fairy flowers, and not just one, but several. There were seventeen individual flowers on the plant. Fairy flowers only opened a single bloom every hundred million years. There were seventeen flowers here, so that meant the plant had been alive for 1.7 billion years.\n\nAcross the whole history of the Very High, 1.7 billion years wasn’t very long. But it was very rare to find a fairy flower that had been growing for that length of time.\n\nEven if someone was lucky enough to find a fairy flower, it usually only had two or three blossoms. In the Very High Palace, there was a very old fairy flower that had 72 blossoms on it. That number of blossoms seemed to be the maximum that a fairy flower could achieve. The plant had never grown any further. That flower was called the Fairy King Flower, and it was the Very High’s most important flower.\n\nHan Sen’s fairy flower had 17 blossoms. That wasn’t a bad sum. If he was able to grow it and keep it alive, it could help him a lot. “Why did you run out there all alone?” Exquisite asked when Han Sen had returned to the yard.\n\n“I thought I’d go check out the neighborhood. And look, I found a strange bunch of flowers. Do you know what these things do?” Han Sen asked, holding out the fairy flowers as if he had just stumbled upon them. He didn’t mention the trade he had conducted with the God Spirit Touch.\n\nAlthough Exquisite knew that Han Sen wasn’t saying something important, she still listened to what Han Sen told her. Then, she answered, “That is a fairy flower. If you can grow it, it could very well become a true god class plant xenogeneic. But it grows incredibly slowly. It will only produce one flower every one hundred million years. Once it has 72 flowers, it will become a butterfly. Whether it can become a true god after that will depend on its luck and power.”\n\nAfter pausing, Exquisite looked at the plant in Han Sen’s hand and said, “The plant you found has 17 flowers. It should be half-deified already. If it produces one more blossom, it will become deified.”\n\n“One hundred million years per flower? Right now, there isn’t even another bud. I’m afraid I won’t live long enough for it to grow its 18th flower,” Han Sen said with a sardonic smile. One hundred million years was far too long for him to wait. No human had a lifespan that long.\n\n“Maybe not. Fairy flowers don’t show signs of their growth. When the time comes, a new blossom will simply sprout overnight. Maybe this plant is very close to having another flower already,” Exquisite said.\n\n“What use are the flowers, anyway?” Han Sen asked.\n\nAfter a moment of thought, Exquisite told him, “The flower has multiple uses. It can be used to produce medicine, but unless the medicine was direly necessary, no one would use it for that purpose. Instead, people prefer to transplant the flowers into their own gardens. The presence of the fairy flower helps nearby plants and creatures to develop. Having a fairy flower in close proximity can also boost one’s lifeforce and add to one’s lifespan. And, after a while, the fairy flower will attract God King Bees. That is what yields the greatest benefit.”\n\n“What benefit is that?” Han Sen quickly asked.\n\n“After a God King Bee eats the nectar of a fairy flower, it will become drunk and slump down underneath the fairy flower,” Exquisite said. “It is about ten thousand times easier to take out God King Bees that way. If this plant can become deified and attract deified God King Bees, that would be fairly awesome.”\n\n“But I need one more flower before that happens. I don’t know when it will grow that 18th flower,” Han Sen mumbled, his voice a little dull. He felt as if his luck was far inferior to the luck of others. He only needed one more flower. If he could attract deified God King Bees and kill them easily, that would be a great boost to his development.\n\nExquisite could sense that Han Sen was feeling a bit disappointed, and so she said unsympathetically, “You can still attract half-deified God King Bees, which isn’t too bad at all. It is a very good resource for you at your current level.”“I have a few geno arts. Take a look and tell me if you want one. If you would like a different geno art, feel free to tell me.” Exquisite placed a few books down on Han Sen’s desk.\n\nHan Sen picked up a few of the books and perused them. One of them, which Han Sen had already practiced, was God’s Wander. But Han Sen hadn’t known it was called God’s Wander. He thought it was just a good space teleportation technique.\n\nAside from God’s Wander, there was an assortment of knife skills, punching techniques, and a geno art called Very Real Body. Very Real Body was a geno art that strengthened a practitioner’s body. If he practiced it very well, he would be able to use his body to block any physical attack. Even deified elites wouldn’t be able to harm him.\n\nExquisite had obviously selected these geno arts based on her interpretation of Han Sen’s character. They were all skills Han Sen would be very good at. It seemed as if Exquisite had gone through a lot of effort to find them.\n\n“Thank you very much.” Han Sen greatly appreciated her kindness.\n\n“These are only what my silkworm deserves. You just need to keep practicing. If you are lacking anything, make sure to let me know,” Exquisite coldly said.\n\nAfter pausing, Exquisite glanced at the text for Very Real Body and said, “This copy of Very Real Body is only the basic version. It is suitable for people who haven’t yet become deified. If you can become deified, I can get you the rest of this geno art, and you can become deified with it. Very Real Body can be practiced all the way to butterfly class. It is a geno art that reinforces your body. I noticed your body was strong, so I thought you might as well try it.”\n\nHan Sen agreed with her. He accepted the geno arts she had brought him and planted the fairy flowers in the garden. He was going to wait until the God King Bees came, so he could kill them with ease."
}