{
    "chapter": 2602,
    "title": "Han Sen’s Gene Talent",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2602",
    "text": "After the God Spirit Touch’s body shivered, it quickly emerged from its first shell. It left the empty shell behind.\n\n“I wonder how many layers of shell Teacher Han can make the God Spirit Touch leave behind?” Some of the Sky Palace students had studied directly underneath him back when he was a teacher. So, they were used to calling him Teacher Han.\n\n“It’s difficult to tell. If that God Spirit Touch is accurate, Teacher Han’s rating won’t be that high. It’s true that the genes of the crystallizers aren’t very strong.”\n\nEveryone whispered to each other in hushed discussions as the God Spirit Touch removed its third layer of shell. Then it removed its fourth. It had removed four layers of shell in total.\n\nHan Sen was excited about this. Glasses hadn’t been able to determine the talent of humans, but this God Spirit Touch seemed to be capable of doing so. This ladybug could conduct a test no matter what level you were. If a person wasn’t deified, Glasses showed a max rating of five stars.\n\nBut that was to be expected. Glasses could only collect a certain amount of information by scanning. That wasn’t bad, considering that it couldn’t directly analyze blood like the ladybug could. Glasses couldn’t be expected to be as accurate as the God Spirit Touch.\n\n“That pair of glasses is like some kid’s education tool. The crystallizers must surely have some better tools somewhere.” As Han Sen was thinking about this, the God Spirit Touch removed its fifth layer of shell.\n\n“It’s still peeling off its skin… It looks like Brother Han’s talent is exceptional,” Thousand Feather Crane complimented, as he watched the God Spirit Touch remove the seventh layer.\n\nBixi and Exquisite were both surprised. The evolutional capabilities of crystallizer genes were not high. It wasn’t bad to have a four armor talent, but a seven armor talent was a little too much. He must have experienced a lot of mutations to see the gene potential reach such numerical heights.\n\nBut then, after the God Spirit Touch removed its seventh armor, it continued to peel off more.\n\n“He has an eight armor talent?” Exquisite and Bixi were shocked. The concept seemed impossible. One of the crystallizers shouldn’t have been able to evolve that much.\n\nEven if a deified placed his deified genes into the body of a crystallizer, it still couldn’t guarantee that a weak crystallizer could show an eight armor talent.\n\nBut it didn’t seem to be ending there, either. The God Spirit Touch, after the removal of the eighth shell, continued to shiver and shake. It looked as if it had an itch, and that was why it was removing its skin.\n\nWhen the God Spirit Touch removed another layer of its shell, the Sky Palace students were beaming with unbridled joy.\n\n“It looks like this bug is accurate, after all! It is better than some guy making a random judgment.”\n\n“No wonder Brother Han is considered an equal to Lone Bamboo. His gene talents are excellent.”\n\n“Teacher Han is so smart. If he worked harder, he could be greater than the Very High.”\n\n“That is all a nine armor talent can do? Brother Han reached that prestige easily. What was that guy saying? Didn’t he say crystallizers can’t have a nine armor talent?” The Sky Palace students weren’t fond of Bixi and Exquisite due to the Very High’s treatment of Lone Bamboo. They wouldn’t let this opportunity go. The Kings and half-deifieds didn’t say anything horrible, but the nearby students wouldn’t stop talking. They mocked the two Very High continually.\n\nBixi and Exquisite weren’t paying attention to the snide remarks of the Sky Palace students, though. They merely looked at Han Sen and frowned.\n\n“The gene talent of crystallizers cannot reach nine armors, unless this Han Sen isn’t one of the crystallizers. Either that, or his genes evolved due to some very unique circumstances. That’s the only way he could achieve a nine armor talent. No matter what the cause, though, we should be wary of this Han Sen,” Bixi said seriously.\n\nExquisite nodded. “Nine armor talents are rare. I didn’t expect to see this result from a crystallizer. If he evolved, he must have received a boost that we can’t possibly fathom. That is how his genes have evolved so much.”\n\nExquisite didn’t doubt that Han Sen was a crystallizer. Crystallizers were easy to recognize, and when Kong Fei lit up the lantern to create the race of the No, many of the elites saw Han Sen accompanying him. They had immediately known that he was a crystallizer.\n\nBack then, Han Sen was too low level. The deified elites were able to see through his genes with ease, and there was no way for Han Sen to hide the identity of his genes back then. There was no way he could have masked his race.\n\nSo, Bixi and Exquisite believed Han Sen must have stumbled upon some ancient secret that allowed his gene talents to become so scary that they were almost as good as the Very High’s.\n\nBut neither of them thought there was anything sketchy about the fact that he had a nine armor talent.\n\nNine armor talents, while rare, did exist. Some of the Extreme King and the Sky could produce the nine armor talent result.\n\nThat was especially true of the Extreme King. Their powerful King bodies could reach a nine armor talent. So, having a nine armor talent didn’t interest Bixi and Exquisite. It all came down to a person’s intelligence.\n\nBixi’s silkworm was Yu Shanxin. Exquisite wanted Lone Bamboo. They were happy with their silkworms. Even if Han Sen had a nine armor talent, they still believed their silkworms were better.\n\nBut what happened next shocked Bixi and Exquisite. Even if they hadn’t practiced the Very High Forget Love, their emotions would have been colder than the average person’s. But now, their faces changed as they looked upon the God Spirit Touch.\n\nThat God Spirit Touch had removed nine layers of its shell, but now its body moved to peel off another.\n\n“How is that possible?” Bixi and Exquisite were in shock. Even amongst the Very High, not many could produce a ten armor talent figure.\n\nThe Sky Palace students were overjoyed. Yun Suyi was smiling as she said, “Brother Han really is different! He has a ten armor talent.”\n\n“No wonder Han Sen has been able to achieve so much. He is so talented,” Yun Sushang said with a smile.The other Sky Palace students weren’t as polite as the Yun sisters, though. They were all laughing. “I thought a nine armor talent was good, but apparently it isn’t. Teacher Han randomly tested it and received a ten armor talent result.”\n\n“Right. I bet they just started gushing about how crystallizer gene talents would be bad because they only had a nine armor talent.”\n\n“You guys don’t understand. Whoever is born first is bigger, and in that case, nine is bigger than ten.”\n\n“You are right. No wonder they’re so confident.”\n\nAs the Sky Palace students continued to mock, the God Spirit Touch crawled out of the front of its shell and left behind a layer of armor that was like a coin.\n\n“A ten armor talent… He really does have a ten armor talent…” Exquisite and Bixi looked at Han Sen with astonishment. It wasn’t hard to find a silkworm with a nine armor talent, but a ten armor talent silkworm would be very hard to achieve.\n\nIf there were no accidents, and he was given enough resources, a person with a ten armor talent had a high chance of becoming a true god.\n\nBut something even more shocking happened. After the God Spirit Touch peeled off its tenth layer, it continued to move."
}