{
    "chapter": 264,
    "title": "Crowned",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_264",
    "text": "Han Sen's bow was so weak that his arrows could never hit Jing Jiwu. Even if they could, they would be much slower than Jing Jiwu's arrows, so he would still be eliminated first.\n\nIn Jing Jiwu's arrows were so strong that even the two arrows from Han Sen could hit Jing Jiwu's, they would never be able to stop them.\n\nIt seemed that the result was already clear.\n\nNeither of Han Sen's arrows could touch Jing Jiwu's, while Jing Jiwu's arrow traveled between Han Sen's two arrows and was in Han Sen's face instantaneously like a lightning bolt.\n\n\"Damn!\" Ji Yanran did not want to watch anymore.\n\n\"It's over.\" Situ Xiang was filled with regret. How she wished she could give Han Sen a strong arrow for a fair duel. Han Sen should not have lost the game like this.\n\n\"Even the emperor did not beat the monster,\" Wen Xiuxiu also lamented.\n\nEveryone thought Han Sen was about to lose.\n\nHowever, when that arrow approached Han Sen, Han Sen pulled the string when he completely lost his balance. The arrow in Han Sen's hand did not go out. Han Sen held the tail of the arrow and used its head to hit Jing Jiwu's arrow.\n\nThis way, Han Sen was using the weight of his body to move the incoming arrow, which was knocked away, and Han Sen himself down to the ground.\n\nAt this time, the first of the three arrows shot by Han Sen collided with Jing Jiwu's second arrow, while Han Sen's other two arrows flew toward Jing Jiwu.\n\nIt seemed that the last two arrows shot lost their accuracy since they were shot when Han Sen was falling. One turned left and the other turned right, flying past Jing Jiwu's body.\n\nWhen the audience were sighing, Jing Jiwu's expression changed. The arrow that was supposed to be blocked by Jing Jiwu's arrow did not stop but continued to fly to Jing Jiwu.\n\n\"How is this possible? How can Jing Jiwu make this mistake?\" Qin Cheng suddenly stood up, grabbing the fence.\n\n\"An error? How did that happen?\" Wen Xiuxiu was also shocked. Someone like Jing Jiwu would never make a mistake.\n\nIn his four years of military school study, Jing Jiwu had attended thousands of competitions of a wide range, in which he had never made a single mistake.\n\n\"Wonderful!\" Situ Xiang did not know why Jing Jiwu would have missed, but she was overjoyed.\n\nBecause of this mistake, Han Sen's arrow was already in Jing Jiwu's face. And Jing Jiwu also noticed that the other two arrows from Han Sen happened to block everywhere he could dodge.\n\nInstantaneously, Jing Jiwu made the right judgment. Like Han Sen, he drew his bow string, but did not launch the arrow. Jing Jiwu held the tail of his arrow and uses the head to hit Han Sen's.\n\nEveryone was looking at Jing Jiwu's hands. It seemed the head of Jing Jiwu's arrow was about to collide with Han Sen's. Everybody thought that Han Sen's arrow would be flicked away.\n\nAfter all, Han Sen and Jing Jiwu were using the same method. Now Han Sen's arrow was shot from a 11.0 bow, so it was even more likely that it would be bounced off.\n\nHowever, Han Sen's arrow suddenly became alive and moved half an inch away from Jing Jiwu's arrow head. Like a snake, it dove under Jing Jiwu's arrow and ended up on Jing Jiwu's chest.\n\nLooking down, Jing Jiwu was dumbstruck.\n\nQin Cheng was speechless. So was Wen Xiuxiu, Situ Xiang, every team member from the Alliant Central Military Academy and Blackhawk Military Academy, and all the viewers.\n\nAlthough everyone saw what had happened, they could not believe that Jing Jiwu would be hit like this.\n\nJi Yanran and Qu Lili were cheering and jumping like a couple of maniacs.\n\n\"Jing Jiwu… is out?\" muttered Shi Zhikang.\n\n\"I believe so…\" Zhang Yang wasn't so sure about it.\n\nNo one in the Blackhawk team believed it had actually happened.\n\nThey could not trust their own eyes. The monster, the invincible monster, who had ruled the Military Academy League for three years, was hit like this.\n\n\"Alliance Central Military Academy… Jing Jiwu… Out… Archer… Blackhawk… Han Sen…\"\n\nWhen the voice of the AI ran in the field, everyone came back to themselves.\n\n\"Ah!\" Shi Zhikang hugged Lu Meng, shouting and turning around.\n\n\"We won!\" Xu Tianhao was still sitting there, surprise and joy filled his eyes.\n\nZhang Yang threw away the towel in his hands and jumped over the fence, rushing over to Han Sen. And the other teammates followed him to Han Sen's side.\n\n\"Coach, did we just win?\" The team manager looked at Situ Xiang incredulously.\n\n\"Yes, we did.\" Situ Xiang was answering both the manager and herself.\n\nThe entire venue and Skynet were going mad.\n\n\"Jing Jiwu lost…\"\n\n\"What's that arrow made of? Did I see it right? It dodged Jing Jiwu's arrow itself!\"\n\n\"An era has ended?\"\n\n\"The monster just lost…\"\n\n\"Unbelievable…\"\n\nWen Xiuxiu felt that her blood was almost boiling and her voice changing. Disregarding that, she shouted at the top of her lungs, \"Miracle… Blackhawk made a miracle… Han Sen created a miracle… The monster Jing Jiwu fell under the miraculous shot. Our new emperor has crowned himself with an arrow.\""
}