{
    "chapter": 2905,
    "title": "Trapped in the Mountain",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2905",
    "text": "“It is no wonder Father took him as a student. He did not show off, gloat, or anything, yet he possesses such power.” Bai Wanjie frowned.\n\nBai Lingshang said, “It looks like our guesses were not so accurate. Holy Baby did not just come here to evaluate our performance. Father must have asked him to protect us too.”\n\nWhen she said that, she sighed. “If I had known that, I would not have had to do what I did earlier.”\n\n“Who could have guessed Holy Baby would have this sort of power? You cannot blame us for what we did. It is fine if he reports it to Father.” Bai Wanjie did not regret his course of action.\n\nBai Wei and Bai Wuchang looked at Han Sen with shock. They could not do anything before the blonde-haired lady, yet he was able to suppress her with one hand. That kind of power was quite shocking to behold.\n\nHan Sen pushed the blonde-haired lady against the mountain wall and quietly asked, “What are you?”\n\nHe wanted to know where the blonde-haired lady came from. She was able to take the spirits of other creatures. In addition to that, she looked just like Wan’er. She had a god spirit presence too. It was very strange.\n\nThe blonde-haired lady was emotionless. It was like she did not even hear what Han Sen said. She suddenly turned her body around. She did not care for the fact that her arms were captured. She broke her arms just to turn her body. She looked at Han Sen and used another arm to grab Han Sen’s wrist.\n\nBoom!\n\nAll Han Sen saw was golden light. He and the blonde-haired lady went inside the mountain where the crystal machinery was shining. It created many crystal lights. They covered Han Sen and the blonde-haired lady.\n\nHan Sen was shocked. He wanted to teleport away from the mountain, but he felt like the space around him was completely sealed. He was unable to teleport.\n\nThe crystal lights turned into crystals that one could see. When the crystals got bigger, they took on a circular shape. They looked just like the big eggs Han Sen and the others saw earlier.\n\nHan Sen punched the blonde-haired lady. In the crystal light, the blonde-haired lady’s power had reached a scarier level. Han Sen’s punching power looked like a commoner trying to punch a steel board. He was unable to hurt the lady.\n\nThe crystal shell wrapped the pair up. It was just like when Han Sen saw the crystal egg in the beginning.\n\nThe blonde-haired lady’s broken arm recovered. She held onto Han Sen. A scary power kept invading his body. It was trying to take Han Sen’s spirit away.\n\nIn that forever solidified mode, the blonde-haired lady could not take Han Sen’s spirit. Yet, Han Sen could not get free of the blonde-haired lady’s grip. They were both stuck in the big egg.\n\nHan Sen thought, “Did Bai King treat me so nice to lead me here and have the blonde-haired lady take my spirit?”\n\nWith that blonde-haired lady’s weird power and the help of the crystallizer machines, even true god elites would not have been able to fight her.\n\nBai King had sent him there to protect the prince and princesses. Something had to be amiss.\n\nIf Bai King was tricking him, he would not know if Han Sen was going to fight the blonde-haired lady. That was not something he could control. Han Sen could have just left. He was curious about the blonde-haired lady’s identity, so that was why he was there.\n\nBai King could not have known Han Sen would be interested in the blonde-haired lady, so it did not make any sense.\n\nIn that crystal egg light’s buff, the blonde-haired lady’s body suction was stronger. Her entire body was like an octopus holding on to Han Sen.\n\nHan Sen used his power to punch her. He felt like her body had been protected by a layer of a crystal shell. He was unable to break it.\n\nIn the mountain in Starter King’s Land, Han Sen was grabbed by the blonde-haired lady. The big crystal egg had been filled with crystal. It was like Han Sen and the blonde-haired lady were frozen in ice. He could not move.\n\nHan Sen used his Sky Vine Radish God Lance, but he was unable to harm the blonde-haired lady. She was steadily becoming stronger. and Han Sen felt as if his body was starting to become loose. He was unable to withstand the suction power of the blonde-haired lady.\n\n“It looks like I have to use Super God Spirit mode.” Han Sen forced himself to make use of Super God Spirit mode. He wanted to use that moment to escape the mountain.\n\nWhen Han Sen used Super God Spirit mode, he activated Wan’er, who was still asleep. It made Wan’er’s body shine with gold.\n\nHan Sen thought the results would be the same. He thought Wan’er’s power would nullify the power of his Super God Spirit mode, thus enabling him to leave the area before that happened.\n\nWho would have known that this time, Wan’er suddenly opened her eyes to awake from a deep sleep?\n\nBai Wanjie and the others saw the flash of gold light. Han Sen and the blonde lady vanished together. The mountain’s crystal light was like a volcanic eruption that blew into the sky.\n\nThey did not dare get close to the mountain. They waited from afar. After time passed, they still did not see Han Sen come out from the mountain. The volcanic eruption created lingering crystal light.\n\nThe princes and princesses heard Bai Wanjie tell them what happened. They looked at Bai Wuchang, who had white hair. They were so shocked that they did not proceed to the next island.\n\nAfter a long time, when Starter King’s Land opened again, Han Sen had yet to appear from the mountain. The princes and princesses returned to the bones of the True Space Demon Dragon and teleported away from Starter King’s Land.\n\nBai Wanjie, Bai Wei, Bai Lingshang, and Bai Wuchang were called upon by Bai King. They reported what had happened to Holy Baby to Bai King. They did not hide anything.\n\nBai Wanjie and Bai Lingshang felt conflicted about telling him, but Bai King did not look any different when hearing what he was told. He did not say much. He only asked them a few questions about the blonde-haired lady and Han Sen. He then asked them to leave.\n\n“It was fortunate that Father sent Holy Baby to protect us,” Bai Wanjie said. “If he hadn’t, who knows what would have happened?”\n\n“Father, you were so clever,” Bai Lingshang said with a smile. “You took Holy Baby as a student and saved Wuchang and Wei.”\n\nAfter they left, Bai King frowned as he sat by the table. After a while, he said to himself, “He shouldn’t have. If he was able to kill Sky Armor God, why was he unable to defeat that tester? Was that tester more powerful than a God Spirit?”"
}