{
    "chapter": 1162,
    "title": "A Tree Hole",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1162",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe boar continued to eat ravenously, despite its literal shortcoming, until it reached the size of an ant. Han Sen observed it intently, wondering why the boar might have wanted that to happen.\n\nThe consumption of one of those walnuts did not seem to impart any benefits. It merely brought pain and made the consumer shrink. And now, the boar had lost all semblance of its previous, intimidating look.\n\nBut despite having been made that small, the speed and strength of the creature looked unchanged.\n\nHan Sen used his dongxuan aura to give the boar a scan and observe what it might have been attempting to do.\n\nBut the boar took off running through the forest. It was only a primitive creature, though, so it was no trouble for Han Sen to follow it closely.\n\nThe boar skittered its way over a distance of ten miles before coming up to another, albeit stranger, walnut tree.\n\nThe tree was of similar size to the others, but this tree had leaves that were black and red, not verdant green. Furthermore, the tree looked as if it had been made from metal. Each leaf, and even the composition of its trunk, looked to be metallic. And even stranger, Han Sen was unable to detect the presence of a lifeforce stemming from that particular tree.\n\nIf it was a tree king, there had to be a lifeforce. But if it really was a tree, it must have died a long time ago. And yet despite that, many fruits decorated the twigs and branches of the tree. That indicated it was actually alive.\n\nThe mini boar took to climbing the tree, and it went up and up until it reached a small hole on the trunk’s surface.\n\nThe hole was almost as small as a needle hole, and Han Sen reckoned an average ant would have a difficult time squeezing through.\n\nAt least Han Sen knew now why the boar wanted to make itself so small: it wanted to enter that little hole.\n\nOf course, this posed another question. Han Sen now wanted to know why the boar wanted to enter the hole so much. It had cost it a lot to do so, and all that effort had to be for some tangible result.\n\nHan Sen scanned the whole tree, top to bottom. He could not get a look at what might have resided inside the tree, due to its only point of entry being so small.\n\nSuddenly, though, Han Sen saw another creature approach. This time, it was a snake, but it was just as small as the boar. It climbed the tree and entered the hole just as the boar had.\n\n“There must be something inside that tree hole.” Han Sen thought he might be able to find out by simply sawing the tree in two.\n\nBut he ultimately decided against this, preferring to wait and watch for a while longer.\n\nOver the course of an hour, Han Sen was able to witness a number of similar creatures enter the tree. They were all tiny, just like the boar.\n\nIt was quite perplexing, and difficult to fathom why so many creatures were shrinking themselves to enter the tree hole. One mini creature even looked like a titan.\n\n“Does a special treasure reside in there? Is that why so many are going inside?” Han Sen wondered, but then, he saw a creature exit the hole.\n\nIt looked like a monkey, except it possessed three tails.\n\nThe monkey seemed bloated, following its exit. And eventually, after reaching the forest ground, it suddenly transformed into a three-meter-tall ape, directly in front of Han Sen.\n\nThe three-tailed ape didn’t remain there, though. After its sudden burst of growth, it took off running into the forest and disappeared from sight.\n\nHan Sen then thought to himself, “Are the effects of becoming mini temporary?”\n\nHe was very curious over the on-going event, so Han Sen decided to remain there for a few days and watch what went on.\n\nOver that time, Han Sen was able to witness many different creatures come to and fro from the tree. The boar that had led Han Sen there came out on the third day of Han Sen’s watch.\n\nWhen the boar exited the tree, it returned to its original size.\n\nHan Sen was positive it was the same boar, but he couldn’t help but notice it looked a little different.\n\nHan Sen remembered its fangs were a creamy color, but now they gleamed with the color and brightness of gold. Furthermore, its lifeforce had become much stronger.\n\nMaker knew what happened inside that tree, over the course of a few days.\n\nMost creatures that Han Sen saw enter left the tree in three days.\n\nA few of them, however, did not return. It made Han Sen wonder what happened to them on the inside, that prohibited their return.\n\nAfter a few more days, Han Sen decided to do something about the ordeal. He opened his nine gene locks, and with Phoenix Sword in hand, he hacked the tree.\n\nHan Sen believed there had to be some sort of treasure inside; otherwise, the creatures wouldn’t be so eager to go in and neither would they appear different after leaving.\n\nBut when Han Sen slashed the tree, the sword was only able to leave a streak of white against the tree’s metallic, glimmering surface.\n\nHan Sen was shocked, so he thought to himself, “Hmm, this really is special!”\n\nIf Han Sen was unable to bring the tree down through brute strength, he was going to do as the creatures did and dine on a feast of walnuts.\n\nHe first tried grabbing the walnuts on the tree he stood before, but strangely, he could not remove the walnuts. They were hard and firm in place, as if they had been nailed to the branches.\n\nThis did not dismay him, though. In fact, it made Han Sen happy. This proved to him that something awesome had to reside within the tree.\n\nHan Sen wasn’t going to give it up, so he decided to spend time eating the ordinary walnuts.\n\nIf the creatures could grow smaller after eating many of them, Han Sen believed he could do the same.\n\n“Since I’ll be able to change back, I might as well give it a shot.” Han Sen still wanted to exercise caution, though, despite this assumption. So, he brought out a creature he had captured a while ago to be his guinea pig."
}