{
    "chapter": 2789,
    "title": "Mutating the Space Garden",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2789",
    "text": "They knew if the Flower Gods were unable to overcome the curse, they would end up like mindless zombies. Now, the Space Garden had undergone major changes. The whole place was occupied by scary deified plant xenogeneics. With the power of the Flower Gods, they could not cultivate and develop the place. Therefore, they had to request the aid of Han Sen.\n\nFirst, only Han Sen was able to remove the curse plaguing the Flower Gods and free them from their doom. Second, Xie Qing King and Han Sen did not have notable backgrounds. Via them, the Flower Gods might be able to prosper in the future.\n\n“It is no use just saying that.” Xie Qing King looked at Flower God Leader and asked. “How are you going to make me believe the rest of the Flower Gods will be willing to follow us?”\n\n“You two, please follow me. I have something to give you. After receiving it, you can completely control the Space Garden.” The Flower God Leader had no hesitation in telling Han Sen that.\n\nXie Qing King and Han Sen looked at each other. Xie Qing King nodded and said, “OK. If the Flower Gods really want to serve us, we will try to save the rest of the Flower Gods.”\n\nThey were ready to leave with Flower God Leader when Bai Wanjie smiled, stepped forward, and said, “Teacher Xie, since we are trapped here and cannot leave, we would like to help.”\n\n“If Mister Crown Prince wants to help, please wait here. If there is something we need, we will come to you.” Xie Qing King was not dumb. He wasn’t going to let Bai Wanjie and the others see the secrets of the Space Garden.\n\n“If things are like that, we will wait here for your good news.” Bai Wanjie did not try to push it. He let Han Sen and the others go off with the Flower God.\n\nAfter waiting for Han Sen and the others disappeared, the girl asked Bai Wanjie, “Nephew, why did you not kill them?”\n\n“The Flower Gods and Xie Qing King are not scary, but San Mu is an enigma,” Bai Wanjie replied. “His power is like the legendary phoenix flame. If it is a phoenix flame, he must have a true god phoenix supporting him. That is one of the sacred beasts. It is not something we can dare try to provoke.”\n\n“No matter which way you look at him, he doesn’t look like a phoenix,” the girl said. “I thought the four sacred beasts were killed in a god war.”\n\n“That is why it is so scary,” Bai Wanjie said. “The four sacred beasts and 10 generals were killed in all the legends. These days, they seem to keep appearing again and again. Just now, a god spirit was killed. We should be careful. We do not want to get dragged into this grand, frightening conspiracy.”\n\n“You talk so much, but I think you’re just scared of San Mu,” the girl said with a smile.\n\n“I guess. After all, he is a scary bloke. If he has the legendary phoenix flame, I do not think I can fight him.” Bai Wanjie was fine with being honest.\n\n“Hmph.” The girl coldly grunted and said nothing.\n\nThe Space Garden was 10 times bigger than they initially believed. Although the landscape had not changed much, there were many changes in the details. The scariest thing about all of it was the fact that the ordinary plant xenogeneics in the flower fields had all received a large boost in their growth. Some of them were now deified.\n\nAs they traveled across the flower fields, they saw the fields had a xenogeneic with the upper body of a witch and the lower body of a big flower.\n\n“Deified plant xenogeneic.” Han Sen looked at that strange witch-flower. He saw a weird, plant substance chain on her. She was obviously a deified class being.\n\n“Has the queen flower already evolved that much? The Space Garden had many plant xenogeneics on the same level as the queen flower. If they saw boosts like the queen flower, the Space Garden will be a very dangerous place now.” The Flower God Leader had a complicated look on his face.\n\nAfter he spoke, the queen flower opened her eyes. She stared at Han Sen and the others. Her weird purple eyes were glowing. Her purple-red flower clothes were waving in the breeze. She raised her jade arms. Suddenly, the garden had many thorny vines shoot out of the ground. They were like demon dragons headed for Han Sen and the others.\n\nHan Sen coldly grunted. He generated a phoenix flame and punched forward. The white flame went right past the flower vine. It was not able to harm the flower vine at all.\n\n“Oh, sh*t! Does the phoenix flame only work on Sky Vine Radish? Can’t it hurt these vines?” Han Sen was shocked. Those vines were covering the sky and the ground, and they were all coming.\n\nThe faces of Flower God Leader and others changed. They did not believe Han Sen had the chops to fight the queen flower.\n\nHan Sen’s eyes looked cold, but he did not do anything. He merely coldly shouted, “Damn!” Then, his Dongxuan Area was cast around the vines of the flowers. They all stopped a few feet away from them. No matter how the queen flower shouted, the vines would not move.\n\nHan Sen did not use his phoenix flame. He teleported in front of the queen flower and punched the strange queen flower’s body to blow her up.\n\nThe Flower God Leader and the others were in shock. They thought, I do not know who this person is. I really cannot tell how strong he is. I do not know if the Flower Gods serving him is a good or bad idea.\n\nFor now, the Flower Gods were out of options. Aside from Han Sen, no other being was able to save the Flower Gods, which were being controlled.\n\n“Deified xenogeneic hunted: Queen Flower. Deified xenogeneic gene found.”\n\nThere was no beast soul, and it made him feel ashamed. But the Space Garden had undergone many changes, and that managed to keep his spirits lifted.\n\nThere were many plant xenogeneics in the Space Garden, which meant that the realm had a lot of resources to plunder. For Han Sen and the whole race, that was a good thing.\n\nHan Sen killed a few more mutated plant xenogeneics on the way, but he did not encounter any more deified xenogeneics. Under the guidance of the Flower God Leader, they arrived at a city made from vines.\n\nThe vines used to build the city were once dead objects. Now, they were booming with the vibrance of a healthy lifeforce. They grew green leaves and all sorts of flowers. The entire vine city’s aesthetic was given a big boost in the pretty department. It thrived with an unbridled lifeforce.\n\nThe Flower Gods were visibly surprised to see what had become of their city. With a wry smile, one of the Flower Gods said, “The Space Garden is living up to its name. It has become a garden!”\n\n“I love this beautiful garden city. I am going to live here.” Xie Qing King expressed his love for that garden-like city.\n\nPang!\n\nSuddenly, a fighting force erupted someplace in the distance. The Flower God Leader’s face changed. “Someone has invaded this land. The Flower God treasure is placed. We need it to control the Space Garden.”Han Sen frowned. He hastened his pace to reach the place the Flower God Leader had referred to."
}