{
    "chapter": 1707,
    "title": "Meeting Old Cat Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1707",
    "text": "Han Sen put a drop of his blood on the Western King Sword. The blood didn’t spread and blend into the metal, however, and it just remained a droplet upon the surface.\n\n“I can’t believe this isn’t working!” Han Sen cut his wrist and bled some more of his Real Blood over the sword, and went at it until it was entirely painted red.\n\nEven after rubbing it in, it didn’t work. Han Sen put the Western King Sword aside, hoping the Real Blood would do something in time.\n\nIf there was a will there was a way, and Han Sen wasn’t keen on giving up just yet. That was one of the four crystal king armors, and he didn’t think there’d be a fifth in existence.\n\nAccording to Stay Up Late, whether someone was qualified was determined by the geno armor they generated. But the difference between the average geno armor and the special geno armors was something Stay Up Late couldn’t accurately define. Fitness was not an accurate measurement, and it wasn’t that you simply reached a certain fitness and were then able to generate a special armor.\n\nEastern King, of the four kings, had a fitness that was not all that excellent during his earlier years. He was like an average crystallizer, and yet, he went on to generate one of those special geno armors.\n\nSo, the crystallizer observer’s task was to watch their creatures grow and learn how they might go on to generate the special geno armors. But before they could find another special one like those, the race was destroyed and brought to ruin. Even the crystallizers did not know if a qualified one currently existed.\n\nHan Sen went to practice The Story of Genes. He progressed quickly, and it was like he was learning new skills every single day. And through that, his fitness was rising. Even so, it would still take a long time for him to recover the demi-god strength he had lost.\n\nEntering the sanctuary again, Han Sen appeared right where he should have been. Xie Qing King was still there, too.\n\nAlthough the Nine-Life Cat had told him his blood would not restrict him from entering any sanctuary, he didn’t really know how to get to any of the others, as of yet. For the time being, he was stuck in the Fourth God’s Sanctuary.\n\nHan Sen was worried about the officer appearing, though, so he wouldn’t stay there for long. He had a chat with Xie Qing King, and the spirit asked Han Sen to take his latest issue of the comic. He wanted it uploaded.\n\nHan Sen’s life had been quiet for a while now. After the last fight, the officer and God’s Organization seemed to have been dealt with. He didn’t hear anything about their movements anymore, and there was no news regarding potential operations.\n\nHan Sen was a legend in the Alliance, but it was fortunate he was not one to revel in the limelight and fame of such stature.\n\n<- And truth be told, he could control the entire Alliance by force, if he so wanted to.\n\nEven though he didn’t do this just yet, Han Sen’s power was still sending ripples across the Alliance. The Ji family grew more quickly and steadily. They were no longer given any trouble. Some said it was because of their strong ties with others, but those associations paled in comparison to the influence of Han Sen.\n\nIn the next election, Ji Ruozhen was planning on running for the presidency again.\n\nSome of the other families that had ties with Han Sen also benefitted. Even if Han Sen didn’t want to play any role or part in the politics of the government, his mere existence was influencing things. It didn’t mean much to him, though. Controlling the whole Alliance through bureaucracy wasn’t even remotely interesting to him.\n\nCivilizations like the crystallizers were destroyed easily. Humans would fall even swifter if similar forces came against them. The officer was an enemy, yes, but what he said was true.\n\nTime passed, and Littleflower was three years old. Han Sen wished to send him to a kindergarten, but he was afraid that God’s Organization might come and bring Littleflower harm if he was out there without Han Sen’s supervision.\n\nAfter a lengthy discussion with the family, they decided on having Littleflower study at a kindergarten on Roca. Han Sen could protect him there, and Littleflower would be able to socialize with ordinary folk of society.\n\nHan Sen decided to buy half of the planet, too. Littleflower’s kindergarten was located on the side that he did not own, though. Traveling would take some time.\n\nStay Up Late volunteered to take Littleflower to school every day and bring him home. He worked harder than Ji Yanran and Han Sen, that was for sure.\n\nHe frequently said Littleflower was special, and there was a chance he could be qualified. His potential was even greater than Han Sen’s. So, he spent a lot of his time observing Littleflower.\n\nThat made Han Sen feel safer. If the officer was planning on taking Littleflower, and Han Sen was late to the rescue, Stay Up Late could definitely keep the child protected for a time.\n\nAfter soaking the Western King Sword in blood for a whole year, a reaction was finally achieved. It wasn’t falling under Real Blood’s control, but the sword’s own will was finally returning.\n\nBut even with the will coming back, it wasn’t quite like the glove and the shoes. It was easy to trigger the Western King Sword’s power, at least.\n\nHan Sen decided to give it to Stay Up Late. Han Sen would need someone to fight if the officer showed up again, and Han Sen himself wasn’t around.\n\nLittleflower was a popular kid in school. There, though, aside from the principal, no one knew he was Han Sen’s son. And even so, the kids and teachers all grew fond of him. He was the cutest kid in the kindergarten. Kids loved playing with him, and teachers liked treating him better than the others.\n\nBut even so, Littleflower was still very quiet. No one knew he was Han Sen’s son, and so other than being well-liked, he didn’t draw much attention.\n\nHan Sen entered the sanctuary again, and there, he found the Nine-Life Cat.\n\n“Why are you here?” Han Sen frowned. He didn’t believe that their unexpected meeting was coincidental.\n\nOld Cat laughed and said, “I found something interesting in the ruin, but I can’t get it out by myself! Let’s partner up again, if you’re interested.”\n\n“I might help you, but only if you answer a few of my questions. No answer, no thank you,” Han Sen said sternly.\n\n“You have Nine-Life Cat’s blood! Come on, we’re like family. You can ask me anything, and I’ll give you a proper answer.” Old Cat spoke as if they were brothers.\n\n“What is this thing on my back?” Han Sen asked Old Cat."
}