{
    "chapter": 2799,
    "title": "Extreme King Overbearing Eye",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2799",
    "text": "“Even if I know he is the red-robed child, it will be pointless if I cannot find a way to control it. Even Mister Yin was unable to control it. So, that means I will have to ask the Grandmaster. But the Grandmaster went to the big barren systems, so I do not think he will be back anytime soon.” Bai Wanjie sighed. He quickly thought of someone else.\n\n“I need to get Mister White from the Winter Garden.” Bai Wanjie summoned a servant and gave him a pass. He told him, “Be polite to Mister White. Do not offend him.”\n\nThe servant accepted the pass and departed. Bai Wanjie thought, Mister White has a lot of knowledge. Before he was deified, he had already accomplished many shocking things. After becoming deified, he has only become even better. With his weird powers, we might stand a chance.\n\n“Greetings, Mister Crown Prince.” Mister White went to the crown prince’s manor and bowed before Bai Wanjie.\n\n“There is no need for such modesty.” Bai Wanjie lifted Mister White and said, “Today, I have asked you to come here because there is something you must understand. I hope you will be able to help me.”\n\n“Please tell me what it is, Mister Crown Prince, ” Mister White gently said. “If I know how to fix what bothers you, it will be my pleasure to do just that.”\n\nBai Wanjie told him about Mister Yin using Ghost Head Fall on Han Sen and how he ended up dying, but he did not tell him about Han Sen’s story or where he had come from.\n\nAfter hearing this, Mister White thought for a moment. He soon said, “I will need to take a look at the xenogeneic first. Only then can I examine it and give you the accurate answer you seek, Mister Crown Prince.”\n\n“Please do that.” Bai Wanjie took Mister White over to the supergravity cabin that contained Han Sen.\n\nHan Sen saw Bai Wanjie had brought Mister White with him. When he did, he suddenly felt happy. Yet, he did not dare show that happiness on his face. He looked at Bai Wanjie and gave him a look of scornful mocking.\n\n“That is the xenogeneic, Mister White.” Bai Wanjie did not care. He gestured toward Mister White.\n\nMister White walked in front of Han Sen and checked him out. He reached a hand out to touch Han Sen’s head. On the other hand, he was counting his fingers as if he was calculating something.\n\nHan Sen’s face was full of disdain. His heart was jumping, but he did not seek to give him any hints in case Bai Wanjie saw it.\n\nEven if Bai Wanjie didn’t see it, there were cameras. If Bai Wanjie went to look at the cameras, he would notice something. That would only lead to harm upon Mister White.\n\nHan Sen thought, With Mister White’s power, he must be able to recognize me.\n\nMister White did not seem to show any sign of knowing that. His face did not change. He acted as if Han Sen was a total stranger. He touched every inch of Han Sen’s body and returned to Bai Wanjie.\n\nAfter all that time, however, Han Sen did not see any changes in Mister White’s eyes.\n\nDid Mister White not recognize me? Han Sen felt a bit sad about that, but he could not hint at him in any way.\n\n“Did you find out anything?” Bai Wanjie asked.\n\nMister White looked at Han Sen before replying to Bai Wanjie. “We should talk about it when we’re out of here.”\n\nUpon hearing that, Han Sen felt a chill. Did Mister White recognize me?\n\nBai Wanjie understood and gestured for them to exit. He and Mister White left the supergravity cabin.\n\nHe took Mister White to a lobby. After they sat down, Bai Wanjie said, “We can talk in here. You can tell me anything.”\n\nMister White did not reply. It seemed as if he was trying to find a way to compose what he wished to say. A while later, he said, “From what I have been able to tell, Mister Yin should not have used Ghost Head Fall on him. Mister Yin had just become a transmutation class. Even if he was larvae class or even butterfly class, using Ghost Head Fall would have likely resulted in his death.”\n\nBai Wanjie was surprised, so he asked, “Oh, why is that?”\n\n“If I have guessed correctly, that xenogeneic came from the Space Garden,” Mister White slowly said. “Is that right?”\n\n“How did you know where it came from?” Bai Wanjie was shocked. He had not told Mister White where Han Sen had come from, yet Mister White had been able to guess it. That was unbelievable.\n\nMister White quietly said, “I am good at predicting. It is not hard to see where it came from.”\n\n“You really are a genius, but what is that supposed to mean?” Bai Wanjie now believed Mister White.\n\n“From what I have seen, the Space Garden is a plant xenogeneic that is true god class,” Mister White replied. “Its power is very unique. Even if a true god-class elite tried to, it may not enter the Space Garden.”\n\nBai Wanjie saw that Mister White was able to tell the secrets of the place. Thus, he believed him even more.\n\nThe secrets of the Space Garden being a true god xenogeneic was not something many people knew. He had only heard the secret from Bai King once before.\n\nMister White was from a small race that was raised by the Extreme King, yet he knew this secret. Bai Wanjie believed Mister White even more.\n\n“Earlier, I calculated this xenogeneic’s identity. If I have guessed correctly, he is the son of the Space Garden. When the Space Garden raised him, he earned many special abilities. So, he is not just a born-deified. He has two talents. He is a special child that can conquer the universe.”\n\nMister White paused and said, “I believe that something strange must have happened in the Space Garden that made many creatures die. That is what must have happened when he was born. When this special child was born, its lifeforce and genes were scarier than ordinary born-deifieds. He is almost immortal. Other people might be able to kill it, but taking its mind is an impossible task.”\n\n“If that is true, how can I control him?” Bai Wanjie knew Mister White hadn’t gone to the Space Garden, but he spoke like he had been. He had not missed a single part, which made him very confused.\n\n“With my power, I do not think I can help you,” Mister White said. “Why don’t you find the Grandmaster to help? With his power, I am sure you can tame it.”\n\n“The Grandmaster is out on business, and I am afraid he will not be back soon.” Bai Wanjie could see there was more for Mister White to say, so he asked, “Mister White, is there no other way?”\n\n“It is not that there is not another way, but it would be very troublesome,” Mister White said.\n\n“Please tell me, Mister White,” Bai Wanjie said with glee.\n\n“If you want to control this child, perhaps you can go and make use of the Extreme King’s Overbearing Eye,” Mister White slowly said."
}