{
    "chapter": 2470,
    "title": "Three Hit Promise",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2470",
    "text": "Han Sen was unable to shake the Dragon’s pursuit, so he stopped running.\n\nLando came to a stop directly in front of Han Sen. Instead of striking, he just looked at Han Sen and asked, “You are the Han Sen that the Extreme King want?”\n\n“Would you believe me if I said no?” Han Sen smiled.\n\nLando nodded. “Then come with me.”\n\n“I could certainly come with you, but could you at least give me a reason that I should follow you?” Han Sen said without moving.\n\nLando laughed. “I’m Lando. That should be reason enough.”\n\n“You are Lando?” Han Sen was shocked to hear this name.\n\nBecause the factions of the geno universe were so competitive, many people had been bribed by their enemies to betray their race. Some would become proper traitors, whereas others would merely become spies who carried information.\n\nLando was the most famous traitor in the past few decades. When others became traitors, they usually just sold classified information. But Lando had the gall to cut off the head of his master, who was a deified Dragon. He gave it to the ruler of the Destroyed, who used it as a chair.\n\nInverse Dragon Lando’s name was known across the universe. When Dragon-culture was discussed, his name always came up. His actions were a shameful stain on the honor of the Dragons.\n\nThe Dragons had wanted to kill Lando for a long time, but Lando might have been the greatest half-deified to ever exist. And he always worked with extreme caution. The king of the Destroyed protected him, as well. So far, the Dragons hadn’t been able to touch him.\n\nKnowing this story, Han Sen looked at Lando’s back. The man had no draconic wings.\n\nLando was a pure Dragon, but when he killed his teacher, the dying man had managed to tear off his dragon wings. They had never grown back.\n\n“Will you come with me now?” Lando asked in a gravelly voice.\n\n“I’m not sure if I believe all the legends about you, but no matter who you are or how strong you are, I have to test your mettle for myself,” Han Sen said.\n\n“Right. If I was you, I wouldn’t believe the stories about me, either. It’s a shame that the Extreme King want you alive. If they didn’t, I wouldn’t have to go through all this trouble,” Lando said. And then, he moved. He tried to grab Han Sen by his head.\n\nHan Sen didn’t retreat. He sent his full power into Jadeskin. His body became like ice, and he threw his own palm against the hand that Lando had extended.\n\nThe Dragon’s clutching fingers tore through the fabric of space, but Han Sen and Lando’s hands were both bounced backward.\n\nJadeskin’s ice power hadn’t been able to seal Lando. All Dragons had a high resistance to every element, and of course, Lando was no exception to this rule.\n\nThe next second, their fists collided once more. The bodies of the two had become deadly weapons. Their fingers, palms, fists, arms, elbows, legs, and knees moved too fast to track. Neither of them would take a step back.\n\nRather than releasing their power, the fighters exchanged blows of raw physical power. Even that was enough to strain and stretch the fabric of space.\n\nKatcha!\n\nThe bones in Han Sen’s fingers were unable to withstand that next scary hit. They broke.\n\nHan Sen’s eyes widened. His Jadeskin made his body very strong, and although it was only at the first tier, his body was as sturdy as a half-deified’s. Lando, however, had been able to break his fingers with a random punch. That was a disturbing amount of power.\n\nLando’s fists kept coming without reprieve. His eyes were perfectly calm as he unleashed his attacks, but his fists flew like a raging fire. Every punch took Han Sen’s full attention.\n\nHan Sen’s Jadeskin let out a groaning sound. His arm bones cracked under the next hit, and still, Lando did not relent.\n\nThe Dragon wasn’t attacking Han Sen’s weak spots, though. He was making sure to only strike Han Sen’s arms and legs.\n\n“Is this guy going to break all my limbs to drag me back alive?” Han Sen looked at Lando’s face, and he became certain that he had guessed correctly.\n\n“F*ck you! You’re so cruel.” Han Sen knew that his Jadeskin was too low level. If he had an eighth or ninth-tier Jadeskin, he might have been able to fight against Lando. But right now, he was too weak. If this continued, Lando would completely shatter his arms and legs.\n\n“The bodies of the Dragons are so scary, but their true talent lies in using Evilbreaker powers, right? Lando is so strong, perhaps the tales are true.” Han Sen’s chest was growing tight with tension. He used movement abilities to fight with Lando.\n\nGuys like Lando, who favored raw aggression and violence, usually didn’t develop a very sophisticated movement set.\n\nLando had a very powerful body and amazing strength, and he could usually beat his enemies outright. He wouldn’t have to study his enemies before engaging them in combat.\n\nBut when Han Sen started to use his movement abilities, he noticed that they didn’t benefit him much against Lando. It turned out that Lando could also move pretty well, and in that high-speed magical fight, Han Sen didn’t have a single advantage. He had to fight Lando on even footing. After a few more hits, his arms felt as if they were about to break.\n\nPang!\n\nLando’s fists came down on Han Sen’s arms like hammers. His jade-covered arms had sustained too much damage, and cracks spread across them. When the final blow landed, they were completely broken. Lando’s unstoppable fists flew forward to clobber Han Sen’s chest.\n\nHan Sen’s chest exploded like water, but the splashing water drew itself back together and reformed. His wounds recovered very quickly.\n\nThe Original Water King body wasn’t as strong as Jadeskin, but its recovery speed was much better. It was quite useful, after all.\n\nLando didn’t keep attacking. He looked at Han Sen and said, “You either come with me now, or I turn you into a cripple.”\n\n“You live up to your reputation, Lando, but that doesn’t mean I want to go home with you,” Han Sen blinked and said. “How about this? Your body is so strong, yes? If you can withstand three of my blows without falling, I will stop fighting and let you take me back. Even if people come to save me, I will not run.”\n\n“Sure.” Lando agreed to the proposition without a second thought.\n\n“You’re a very determined man.” Han Sen gave him a thumbs up.\n\n“Go ahead, then,” Lando said coldly.\n\n“My three hits require some time to prepare, but in the meantime, I can’t deal with your constant attacks. We have a deal. If you fight me before I finish my three attacks, then you lose,” Han Sen said.\n\n“Strike,” Lando said in an emotionless voice. His face was wholly unmoving.\n\n“That means you are agreeing. Take my first hit, then,” Han Sen said. Then, he gathered up power in his fist. Jadeskin was running at full power, and he used the Yin Yang Blast method to strike Lando’s chest.\n\nLando remained where he was. He didn’t dodge, and he didn’t run. He allowed Han Sen’s punch to fall on his chest.\n\nThe punch was silent, but Han Sen had woven his scary ice-sealing power with the Yin Force. It drilled right into Lando’s chest to freeze his organs."
}