{
    "chapter": 2749,
    "title": "Blood Coral",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2749",
    "text": "“If that electric eel can survive in there, can’t I do the same?” Han Sen made his mind up. He was going to kill that electric eel and dine on its xenogeneic gene, no matter what it took.\n\nSteeling himself, Han Sen began to move through the coral forest. After he entered it, the effectiveness of his Dongxuan Area fell dramatically. He couldn’t see beyond the blood coral all around him.\n\nThe blood coral was like a signal disruptor. It prohibited Han Sen’s power from penetrating the red pillars that surrounded him.\n\nHan Sen kept traveling through the sea, and he observed the blood coral carefully as he went by. The blood coral looked like ordinary coral, but for some reason, the power of Han Sen’s Dongxuan Area couldn’t get close to it. That being said, it didn’t seem as if the blood coral was a living creature.\n\nIf it was like normal coral, then swarms of small sea creatures should have been making their homes among it. But strangely, Han Sen had been inside the blood coral forest for a while now, and he hadn’t seen another living creature. Not a single fish swam through the red trunks, and not even one crab scurried around the sandy floor of the coral forest.\n\n“This place is really weird. I can’t find a single xenogeneic. Is this the electric eel’s nest? Is it designed like this to prohibit any other creatures from daring to get close?” Han Sen wondered to himself.\n\nThe blood coral forest was around ten thousand miles wide, so it wasn’t that big. Han Sen traveled steadily, and he had ventured through half of it before long. He had yet to find the body of the electric eel, but he also hadn’t encountered any danger. It was like a dead zone that remained perfectly quiet and still.\n\nWhile Han Sen was pondering this mystery, he suddenly saw a light coming from inside the blood coral forest. When viewed from a distance, it was like a sun that had risen just over the horizon in the morning. It was red, but it didn’t really shine all that brightly. It simply glowed like heated steel.\n\n“What is that?” Han Sen could see the light, but because of the blood coral, he couldn’t see what was causing it.\n\nSince Han Sen had only just arrived in the coral forest, he couldn’t leave just yet. He had to keep going forward and exploring.\n\nAs Han Sen slowly drew nearer to the light, the light started to look brighter. After many more coral stacks, Han Sen discovered the source of that illumination.\n\nIt was a piece of blood coral that was releasing the red light. This particular coral tower looked different from all the other blood coral.\n\nIt was much shorter than the rest of the coral, only standing three or four meters high. Compared to the other blood coral that could be ten meters high, this one was quite diminutive.\n\nIt was a darker color than the rest of the blood coral, too. The color was mysterious, and it was releasing a red light. The entire piece of coral seemed to glow.\n\nThe blood coral was oddly shaped, too. Instead of having many branches like ordinary coral, this one had only a few small twigs. In addition, the main stalk was all twisted up.\n\n“This blood coral, why does it look like… Like a dragon…” Han Sen looked at the blood coral as these thoughts flashed through his mind.\n\nThe coral’s shape was distinctly serpentine. It looked like a dragon that was circling among the clouds. Its shape suggested that it wanted to soar ever higher, but it was just a piece of coral. Still, it gave people a weird feeling that it was about to break free of the soil and fly to cloud nine.\n\n“Weird. What is this strange red coral thing? It looks very amazing, but it doesn’t look like it is alive…” Han Sen thought to himself.\n\nHan Sen was standing some distance from the strange coral, trying to decide whether he should approach, when he heard the water stir. A weird rubbing noise broke the silence.\n\nWa-la-la! Wa-la-la!\n\nHe turned to where the noise was coming from, and he saw that the blood coral forest was shaking like mad. Not long after, he saw the electric eel emerge from among the coral.\n\nBecause its body was too big, when it traveled between the trunks of the blood coral, its body would brush against the coral.\n\nBut the blood coral didn’t fall or break due to the electric eel’s crude movements. In fact, some of the coral had sharp edges that actually cut through the electric eel’s skin. The edges sliced effortlessly through the scales that looked like diamonds, covering the electric eel with many small wounds.\n\nThe electric eel didn’t seem very concerned about the injuries, though. It was still forcing its way quickly through the coral bushes. In seconds, it reached the twisted coral tree that looked like a blood dragon.\n\nWhen it was ten meters away from that weird coral, the electric eel finally stopped. Its eyes were intense as it scanned the blood coral. It didn’t move for some time.\n\n“It looks like the electric eel’s sensing powers have also been dampened by the coral forest. Otherwise, it would definitely have realized that I am so close to it.” Han Sen had hidden behind a large stack of coral. He had leaned around the coral to get a better look at what the electric eel was doing.\n\nThe electric eel looked at the blood coral for a while. Eventually, it seemed to come to a decision. It drew closer to the blood coral, then opened its mouth wide and swallowed the weird blood coral and the sand around it. The enormous maw of the eel left a ten-meter-wide hole in the sea floor.\n\nThings happened too quickly, though, and Han Sen didn’t have time to react. When he saw the electric eel gulp down the weird blood coral, he instantly regretted his own inaction.\n\n“It looks like that piece of blood coral was good stuff. If I had known that, I would have taken it first.” Han Sen’s heart suddenly jumped as another thought crossed his mind. “This is the Buried Dragon Sea. The legends say a true god class evil dragon died here. That blood coral couldn’t be related to the true god dragon, could it? If that is true, then I’ve missed out on something incredibly potent. I should have picked it up first.”\n\nWhile Han Sen was regretting his life choices, he saw the electric eel that had eaten the blood coral start to thrash. It began convulsing and twisting its body, churning up the water around it.\n\nIts body erupted with wild lightning, but when the lightning touched the nearby blood coral, it was extinguished. It didn’t leave so much as a scorch mark on the coral forest.\n\n“This coral is so powerful! The electric eel has such a scary lightning power, yet the coral wasn’t damaged by a full-power attack? This blood coral seems to be made of harder materials than a primitive treasure… And this is a large coral forest. If I could take it all with me and use it to build a castle, then the castle would even bar the entrance of deified elites.” Han Sen started to drool as he thought of this. He eyed the blood coral most lecherously. His mind began planning how to take thousands of miles of blood coral home with him. Once he had his own xenogeneic space, he could use that blood coral to build a fortress. And then, he could have three palaces, six rooms in each, occupied by 72 wives. That would be delicious.\n\nMeanwhile, the electric eel seemed to be in agony. Its body repeatedly twitched, while its tail kept slapping the sand, forming a big hole in the bottom of the sea bed. Its diamond-like scales suddenly became red. It looked like all of the creature’s blood vessels had burst, and the blood was dyeing the creature’s skin.\n\n“Huh, what is this?” Han Sen didn’t bother watching the suffering of the electric eel as it struggled and writhed. Its thrashing had opened a hole where the weird blood coral had once been, and the hole seemed to be utterly devoid of sand. There was, however, something red glowing in the depths of the depression."
}