{
    "chapter": 2930,
    "title": "A Dark Place",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2930",
    "text": "The long, bright lanterns only led in a singular direction. They had been traveling all that time but had yet to see hide nor hair of Nine Thousand King or Moon Shadow God. It meant they had to have gone that way.\n\n“Moon Shadow God was the wife of Crow Sky Dog,” Ancient Abyss Grandmaster said. “She must know quite a few of Sacred’s secrets. It is not surprising that she was able to go through this.”\n\n“If they were able to through this way, there is no reason why we cannot do the same,” Yang Yun Sheng said. “We should just push on and brute force our way through.”\n\n“I agree,” Ancient Abyss Grandmaster said. “Forcing our way forward is the only way, but we should ensure we are prepared.” He waved his sleeves and took out a white umbrella that looked like a jade bone.\n\nAncient Abyss Grandmaster opened the umbrella. The umbrella started to drop white holy light. It covered approximately 30 feet of the area around them.\n\n“This is called Shining Umbrella,” Ancient Abyss Grandmaster said. “It has light bai sema power. Perhaps it will work against the pervasive dark. Why don’t you guys come with us under the umbrella?” He looked at the big and small goldfish and said, “These two goldfish are two big. The Shining Umbrella won’t cover them. Why don’t we just leave them here and go on ahead?”\n\n“Thank you for your good intention, Grandmaster. Since I brought them this far, I cannot just leave them behind. Grandmaster, you can go on ahead. I will search for another way through this mess.” Han Sen was not willing to let go of the goldfish family just yet.\n\nIt was not like Han Sen had a strong bond with them. It was because they were creatures that belonged to Sacred. They likely knew more about Sacred than anyone else present.\n\nAncient Abyss Grandmaster tried to convince him. Han Sen kept insisting on bringing the goldfish family, so there was nothing else he could say. He raised the Shining Umbrella and went into the darkness with Yang Yun Sheng and the others.\n\nHan Sen saw the Shining Umbrella’s bai sema keep colliding with the darkness. The light of the umbrella was fairly suppressed. There were only six more feet of the radius left for them. Ancient Abyss Grandmaster and the others were all squeezed together. It barely kept them all protected on the inside.\n\nThe bai sema kept quivering in the dark like it was going to fall apart at any second. It was unknown whether or not they would make it through to reach the next long, bright lantern.\n\nThe distance between the two bright lanterns was 60 to 90 feet. After Ancient Abyss Grandmaster and the others walked a few steps into the dark, they were gone. It was like they had been consumed by the darkness.\n\nHan Sen looked at the other side with the next bright lantern. As he gazed upon it, he likened it to a firefly. Yet, he was not able to see what was under the lantern.\n\n“Ancient Abyss Grandmaster and the others barely attempted it. They just walked into the dark. They were clearly prepared for this. How can I get the goldfish through it though?” Han Sen was not going to be like Ancient Abyss Grandmaster and just make use of a treasure to walk right in.\n\nHan Sen hesitated a moment before he brought out his Cold Light Sword. He walked in front of the darkness and slashed out some pink sword lights through the darkness.\n\nThe sword lights ran out into the darkness, but they vanished within a second. They did not create anything. There was no reaction.\n\nHan Sen frowned. He slowly put the Cold Light Sword’s tip into the darkness. The sword barely touched the darkness. Han Sen felt the tip of the Cold Light Sword being twisted by some sort of power. He almost lost his grip on the blade.\n\nHan Sen quickly removed the Cold Light Sword from the dark. The Cold Light Sword’s sword light had a few cracks in it.\n\n“That is very scary darkness.” Han Sen gasped. He was shocked that the Cold Light Sword, which was almost as good as a true god weapon, had been affected like that. If that dark power was applied to his body, it was difficult to imagine what might happen.\n\nHan Sen was a bit annoyed. He did not know how to get through the dark zone. Bao’er, who was on his shoulder, asked, “Dad, didn’t you get a stone lantern before? Can you light up this place with that?”\n\n“I can try to.” Han Sen had already been thinking about making use of the stone lantern, but the stone lantern’s lantern flame was different from the flame that adorned the long, bright lanterns around. He did not know if it would work, but he resolved to give it a go.\n\nHan Sen took the stone lantern out of Destiny’s Tower. The stone lantern was the same as before. The flame was about the size of a thumb. It was not very bright.\n\nHolding the stone lantern, Han Sen tip-toed closer to the darkness. Where the light shone, the darkness melted and fell back. It carved out a lit area.\n\n“It really does work!” Han Sen was extremely happy. He held the stone lantern and kept moving forward. Large amounts of darkness were chased away.\n\nThe stone lantern did not look very bright, but in the dark, it was able to light up an area that was several dozen feet wide. In the radius of the stone lantern, the universal cogwheels returned to normal. They did not break again.\n\n“It looks like this stone lantern is better than these long, light lanterns. I do not know what this stone lantern is, but it is very weird.” Han Sen stroked the stone lantern hard. He really loved it.\n\nA significant portion of the zone was lit up. It was not difficult to bring the goldfish family through with him. Han Sen held Bao’er and sat atop the big goldfish’s back. He enabled the big goldfish to lead them. Han Sen held the stone lantern to keep the area bright.\n\nThe big goldfish’s rabid powers did not advance any further, but the fish had not recovered either. It still seemed as if it had some clarity even though its reaction was a bit slow.\n\nFortunately, the fish was still able to understand Han Sen’s words. It kept following Han Sen’s direction. The small goldfish followed next to them. It seemed to be scared while venturing through the dark.\n\nWhile they were traveling, Han Sen thought he heard a woman wailing in the dark. It was a sorrowful sound, and it seemed rather close to them.\n\nThe crying voice was more than spooky. It was very sad as it rang out from the silence. It made people feel a chill.\n\n“Dad, it looks like someone is crying,” Bao said while looking into the dark area.\n\n“It does not matter. Just ignore it.” Han Sen continued to hold the lantern. He made the big goldfish carry on toward the next long, light lantern. The lantern was not too far away. It was just 120 to 150 feet away, but they had been traveling a few hundred miles. They had yet to reach the long, bright lantern.\n\nHan Sen thought, “Sacred is so weird. When I walked past the long, bright lantern, both of the distances seemed 90 to 120 feet apart from each other. Even if there was a long, bright lantern missing, it would only be 210 to 240 feet away. Now, we have walked a few hundred miles and have yet to reach the next lantern. Clearly, there is some problem with the space in this area.”\n\nThe darkness around was suddenly filled with a countless number of sharp blades. They were headed for Han Sen from every angle.\n\n“Moon Shadow God!” Han Sen recognized who the black blades belonged to.\n\n“I will make you pay for my son’s death.” Moon Shadow God’s angry voice sounded out from the dark. She was able to travel through the darkness, and she seemed to be able to control it."
}