{
    "chapter": 2985,
    "title": "Kill Sky God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2985",
    "text": "Teleporting so fast through broken space made the scary power from behind become weaker. When Han Sen exited the broken space area. He did not see that Annihilation God Spirit follow. Bai King must have halted its pursuit.\n\n“The spirit weapon the Extreme King made was stronger than the Holy Kirin. That is surprising.” Han Sen was shocked.\n\nThinking of how that thing came from the Extreme King alpha, it must have been handed down generation after generation. It was unknown how many xenogeneic spirits had been built into it. It was not impossible for it to possess such wild strength.\n\nIt was enough to fight an Annihilation class God Spirit. Han Sen still thought it was too ridiculous.\n\n“Why does Bai King treat me the way he does?” Han Sen thought. That was what he wondered about the most.\n\nIn the past, Bai King was in a rush to save him in the god temple. He was so surprised. Now, Bai King was willing to fight an Annihilation class God Spirit to save him. That made no sense.\n\n“No matter what, let me get out of here first.” Han Sen was silent. He did not dare return to Space Garden yet. He teleported to the outskirts of the big barren systems.\n\nHe was afraid the God Spirit would trace his retreat into Space Garden. If it followed him there, he feared things would not go so well.\n\nGoing to the outskirts, Han Sen went into the big barren systems again. He wanted to use the hidden power inside the big barren systems so that the God Spirit would not find out where he was. He would then be able to escape with Han Sen’s identity.\n\nHan Sen had only just entered the big barren systems when he heard some thunder rage above his head. The space around cracked. It resulted in it all cracking like a spiderweb. That God Spirit tore through space and managed to catch up.\n\n“I thought that after a God Spirit was possessed, their powers were restricted by their bodies. I thought they could only be true god class at best. This God Spirit’s power is way better than a true god class.” Han Sen frowned.\n\nHan Sen looked at the God Spirit and asked, “Where is Bai King?”\n\n“I, Kill Sky God, want to kill. Not even God can stop me, and he is just a creature in the universe.” Kill Sky God was holding his god hammer. He was floating in space and coldly looking at Han Sen as he spoke.\n\nHan Sen heard Kill Sky God’s tone of voice and felt a flush of relief. It seemed as if Bai King had not been killed by him.\n\nKill Sky God raised the hammer in his hand. In a voice laden with disdain, he said, “The slayers of gods should be killed. No one can save you now.”\n\nKill Sky God used one hand to hold the giant hammer and swung it down. It was like the whole of space had become some brittle glass Beneath the hammer. It just broke with the strike of the hammer.\n\nHan Sen’s eyes froze. His body was suddenly full of light. He entered Super God Spirit mode again. The shattering space had not left any marks on him.\n\nThe Sky Vine Radish God Lance brought some cold light forward. It was thrust toward Kill Sky God. With a look of disdain, Kill Sky God raised his hammer to attack the Sky Vine Radish God Lance. Han Sen flashed away holding the lance. He went behind Kill Sky God and thrust it through the back of his head.\n\n“Super Spank!” Han Sen was still in Super God Spirit mode. He used Super Spank’s power at max capacity.\n\nKatcha-cha!\n\nThe tip of the lance broke behind Kill Sky God. It sounded like metal shattering. It was like some metal had been sucked into a blender.\n\nGod light and sparks were everywhere. The tip of the Sky Vine Radish God Lance only went in about five inches before not being able to proceed further. Super Spank’s power was not enough to completely destroy Kill Sky God’s substance chain. It only shattered a few of the substance chains that were outside.\n\nKill Sky God waved his big hammer as Han Sen had to pull his lance back. He used Galaxy Teleportation to get away from that system.\n\nUnder the Super God Spirit mode, the broken space layers were unable to prevent him from using Galaxy Teleportation, but Wan’er was still inside his Destiny’s Tower. She was burning with gold light. She canceled Han Sen’s Super God Spirit mode.\n\nHan Sen gnashed his teeth and held on, but he could not keep it up. His body fell out of Super God Spirit mode, forcing him out of Galaxy Teleportation.\n\nAlthough he left Kill Sky God’s broken space, he was still inside the big barren systems. He had not gone too far.\n\nWithout Super God Spirit mode, Galaxy Teleportation could not be used in the big barren systems because they had magnetic storms and space vortexes.\n\nHan Sen tried his best to get to the holy palace. There, the darkness power would at least affect the God Spirit. The God Spirit would not dare venture near that place. He had the Holy Kirin spirit, which restricted the darkness from damaging him while he was in there. That was the best place for Han Sen to use as a battleground.\n\nHan Sen had not been flying for long when the sound of Kill Sky God’s big hammer broke space again. The spiderweb-like cracks in space reappeared and covered the sky to trap Han Sen.\n\n“Wan’er! Wan’er! It is not that I do not want to take care of you. It is just because this is a critical moment. I need to live for the future.” Han Sen raised his hand and Destiny’s Tower appeared in it. Han Sen tossed it out.\n\nSeeing the Destiny’s Tower go further and further, Han Sen felt Super God Spirit body could be used with his body again. Wan’er’s effects on him were diminishing.\n\n“Destiny’s Tower? Impossible. You are not a God Spirit! How can you have Destiny’s Tower?” Kill Sky God saw Han Sen throw Destiny’s Tower away. He was shocked.\n\nSeeing it twice, Kill Sky God saw something amiss. He looked at Destiny’s Tower and said, “No, this is not Destiny’s Tower. It is just a copy of Destiny’s Tower. I think I have seen this copy someplace else. I know it now. Back then, Sacred Leader wanted to create Destiny’s Tower. It did not break. It is still here. They should really die.”\n\nKill Sky God’s face looked more murderous. He kept clutching his giant hammer, but he did not attack. A scary power was gathering up in the big hammer. There were very old and mysterious spells on each side of the hammer.\n\nHan Sen’s body still had Super God Spirit mode, but he was still worried. From inside Destiny’s Tower, something was thrown away. Wan’er’s body shone with a golden light. It looked crazy as she entered blonde mode. It was just like Han Sen. She adopted a strange status. Her body kept rapidly increasing.\n\nIt was still different from Han Sen. His Super God Spirit mode was not able to harm him. He just had to get out before it ended.\n\nWan’er was different. Her blonde mode cost her significant life every second. If she was blonde for too long, there was a chance her life force would end with it.\n\nThe scariest thing was that after she turned into blonde mode, she would not recognize anyone. She would become like the raging demon lady. There was a chance that she would emerge from Destiny’s Tower not knowing who was a friend and who was a foe.\n\n“Whatever you are, just go to hell!” The symbols on Kill Sky God’s hammer were like suns. The weapon was striking toward space.\n\nThe god symbol that was hanging in space suddenly branded space with a god symbol.\n\nIn the next second, the symbol shattered. As the symbol shattered, everything inside the symbol turned to dust. It did not matter if it was a planet or sun. Although it did not explode, it released energy. In just a second it had become a substance."
}