{
    "chapter": 1687,
    "title": "Jewelry Light",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1687",
    "text": "When a greatsword came at him next, Han Sen didn’t dodge. He reached out his arm that had been plated in geno armor and caught the falling blade.\n\nHe reached out his other hand and grabbed another incoming greatsword. He pulled both creatures in by their weapons, thrusting them into each other. The sheer force flattened their helmets.\n\nHan Sen took the two greatswords, one in each hand. Then, he swung them akimbo at the monsters coming at him from behind. He skewered them both, and then pegged them into the ground.\n\nThe monsters wished to rise back up, but Han Sen stepped on the helmet of one and crushed it completely.\n\n“Super Creature Death Armor Swordsman killed. Beast soul gained. Geno Core shattered. The flesh is not edible. Collect Life Geno Essence to gain zero to ten super geno points randomly.”\n\nHan Sen was delighted. Then, he proceeded to step on the heads of the other three swordsmen. Unfortunately, he didn’t get any more beast souls.\n\nThe four bodies then disappeared, along with their greatswords. All that remained were the four Life Geno Essences.\n\nHan Sen picked them all up and checked out his Sea of Soul.\n\nWhen he leveled up, he had lost a lot of beast souls and geno cores. Being able to replenish his stock again was good.\n\nDeath Armor Swordsman: Transfusion Beast Soul\n\nHan Sen was very happy. It was a humanoid shapeshifting beast soul. It might not have been berserk, but it’d still help him. With that beast soul, he could fight super creatures without even using his geno armor.\n\n“See? I told you. You have Nine-Life Cat’s blood, and so these weren’t a problem.” Old Cat leaped off the tablet. He looked very proud as he went to examine the cleft in the metal board.\n\nIt was now obvious that it wasn’t a metal board; it was hollow on the inside. It was more akin to a rectangular container than anything else. A sparkling light was still beaming out of the cracks. It was like a strange chest.\n\nOld Cat peered keenly into the cracks with both eyes. Strangely, it didn’t seem as if he could see anything.\n\n“Why does the Nine-Life Cat’s blood allow for so many exceptions in the Fourth God’s Sanctuary?” Han Sen asked Old Cat.\n\nHan Sen had heard from Stay Up Late that the sanctuary was the last safe place of refuge for the crystallizers. Other beings were unable to enter, and there shouldn’t have been an exception to bypass that rule.\n\nNine-Life Cat was a being from outside the sanctuary, so why would his blood allow for so many anomalies?\n\nOld Cat continued looking inside the metal box as he spoke. He said, “Let’s not talk about that Come open this box so we can see what’s inside. There might be something decent”\n\nIf Old Cat did not want to speak, there was nothing Han Sen could do. He walked near the metal container to take a look inside.\n\nIt was so bright inside, you couldn’t see anything much.\n\n“I can’t see anything. Let’s open it up,” Old Cat said.\n\nHan Sen nodded. Then, he placed his fingers into one of the cracks and pulled firmly. The metal bent under Han Sen’s hands, and the crack opened another inch. Han Sen let go to take a look.\n\nOld Cat joined him for a look, too. It was still as bright as before, and they were unable to see what was inside.\n\nSo, Han Sen tore it further. Cracks spread across the surface of the box, but none provided the visibility that allowed him to look inside.\n\n“Stop it,” Old Cat said. “The item in there is releasing light If you remove the entire box, it’s likely that we’ll only be able to see that light.”\n\nHan Sen could tell this might have been the case, so he complied and did not continue. He just frowned and said, “What now? Do you know anything about what might be inside?”\n\n“I don’t know. It doesn’t seem dangerous, though, so you can probably go ahead and touch it. And by doing so, find out what it is.” Old Cat circled the box as he spoke to Han Sen.\n\n“Why don’t you go touch it?” Han Sen lifted his lip. He didn’t know what was inside, and if there was some monster lurking in there, he could lose his hand if he stuck it inside. That wasn’t something he’d be willing to risk.\n\n“You are stronger. You have geno armor. It won’t be a danger for you.” Old Cat clearly didn’t want to do it himself.\n\nHan Sen was not stupid, though. And he’d never fully trust Old Cat. But right now, no progress was being made.\n\nNeither of them dared pick it up, and it’d be a shame and a waste to just pack their bags and leave now. They looked at each other, with neither of them saying a word.\n\nAfter a while, Old Cat coughed and said, “How about, he who takes it owns it?”\n\n“Okay. And because I am a gentleman, I’ll let you go first.” Han Sen smiled at Old Cat.\n\nOld Cat gritted his teeth and said, “Or let’s just play rock, paper, scissors. That way we can decide who goes first.”\n\n“Okay.” Han Sen agreed, but then thought, “I am the king of rock, paper, scissors. You won’t even have your panties left if you play with me.”\n\nOld Cat was feeling cocky, and he thought, “You are too green to compete with me. When I was the champion of the universe, your mother wasn’t even born yet. You are stupid to play this with me.”\n\nThey both smiled queerly at each other. Han Sen pulled out a coin and threw it up into the sky. Then, he said, “Make your move when the coin hits the ground, okay?”\n\n“Okay.” Old Cat nodded. Then, he watched the coin fall.\n\nDong!\n\nThe moment the coin hit the ground, they both made their move.\n\nWhen the fists showed up, they looked confident. The first time was just a test. The next would be about skills and mind tricks.\n\nScissors, scissors, paper, rock, paper, rock.\n\nHan Sen and Old Cat were gasping, and they looked at each other with red eyes. They had played this for one hour, and they were both tired. They eventually just looked shocked.\n\nRock, Paper, Scissors was about using your brain. It was more tiring than combat Neither of them could win, and it just left them exhausted. Both of them sat down next to the metal box, with neither of them being declared a winner.\n\nKatcha!\n\nSuddenly, the metal box produced a crunchy sound. Startled, they both jumped up to take a look at whatever was inside the box."
}