{
    "chapter": 1127,
    "title": "A Man Who Wants to Die",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1127",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen Han Sen saw what emerged from the sack, his body flared with goosebumps and his head got all itchy.\n\nThe person that emerged from the bag was a man who was very skinny and seemed to be around thirty years of age.\n\nIt was a living person, and Han Sen could see the fright that twisted his face.\n\nBefore Han Sen could return from his thoughts, the scorpions were stinging the poor man. He was stung many times, like he was being deliberately tortured. He rolled around on the ground, writhing and screaming in agony.\n\n“It is all a ruse! How can Uncle Bug feign such kindness every day, when this is the sick and twisted stuff he gets up to on his own. How could he even think to torture a man like that?!” Han Sen spine was frosting over with the chills he was feeling.\n\nWhen Han Sen next looked at Uncle Bug, he froze.\n\nUncle Bug was crying. As he watched the man get stung all over, he himself looked as if he was in pain. Amidst the tears, he prayed over the man down below.\n\nIt was then that Han Sen realized the man being tortured looked familiar, like someone he had seen in the shelter.\n\nUncle Bug was being very emotional. Han Sen used dongxuan aura to get a read of the man’s feelings and see what he could hear of the man’s thoughts. But all he could hear was screaming.\n\nThere was one word he was able to discern, though.\n\n“Son? Did he say ‘son’? That can’t be his son!” Han Sen exclaimed in his head as he turned to look at the naked man. He couldn’t even begin to fathom why Uncle Bug would treat his son in such a manner.\n\nBut people wouldn’t lie to themselves in such a situation. He had heard Uncle Bug scream it was his son. Han Sen could not have been mistaken.\n\nNow, the body of the person on the ground was all swollen. The natural assumption would be to presume he was dead, or was going to be, in such a state.\n\nHe had been a rather skinny man when Han Sen first saw him. Now, he was swollen like a fat man. The man could no longer scream, but his muscles still twitched with the pain he was continuing to endure.\n\nUncle Bug continued to pray as tears drenched his face. As he did so, his teeth chattered in what had to be fear.\n\nHan Sen had never seen anything as remotely curious, horrific, and upsetting as this. He had no idea how he should feel about what was going on.\n\nJust as Han Sen thought the man was about to be dined on, he heard the baby cry again.\n\nIt wasn’t sharp like before: the sound of the baby was rough and coarse.\n\nWhen the noise echoed across the valley, all the scorpions returned to their holes.\n\nSoon enough, all that remained was a man who looked much like a bloated pig.\n\nUncle Bug looked at the dying man in the valley.\n\nHan Sen was keen to know what had happened, why this was happening, and what was to happen. He was sweating with nervousness. This entire scenario seemed bizarre.\n\nWhen Han Sen looked at the man, he noticed his shadow appeared to be strangely large.\n\nThe man was like a pig, but there was no way his shadow was three meters tall.\n\nThe shadow was very weird. Half of it looked like a man, and the other half looked like a scorpion.\n\nThe shadow came to life and moved.\n\nA person with long black hair and eyes that were as black as coal emerged. His muscles were thick and ripped beneath the black armor he was clad in.\n\nThe man’s lower body was a scorpion, and the transition from man to scorpion was seamless. Han Sen looked at the scorpion man, feeling his lifeforce to be even greater than Disloyal Knight’s.\n\n“Why would this guy’s shadow be a super creature?” Han Sen wondered as he looked at the scorpion man.\n\nThe scorpion man then waved his tail and plunged it into the chest of the corpse on the ground. Then, the body quickly became slimmer.\n\nThe man’s body returned to normal, as all the stinging fluids went into the tail of the scorpion man.\n\nThen, after that, the man stood up. He looked very energized.\n\nWhen the man stood up, he walked towards the scorpion man angrily.\n\nWhen he was in front of the scorpion man, the scorpion man became that man’s shadow.\n\nThe man fell to the ground, throwing his fists against his own shadow. It looked like he was just punching the sand.\n\nThe man’s hands bled as they beat against the ground, but he did not seem as if he wanted to stop.\n\n“Little Yan!” Uncle Bug ran towards the man, wanting to hug him.\n\nWhen the man turned around, though, Uncle Bug stopped his approach.\n\n“I will hate you forever.” The man looked furious.\n\nThe man stood up, picked up a rock, and tried to slam it into his own head. But before he could do that, a shadow touched the rock, causing it to explode. He couldn’t kill himself."
}