{
    "chapter": 1884,
    "title": "Heaven",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1884",
    "text": "Han Sen was busy cutting down the twisted arms as the dragon-like Purgatory Beast came rushing for them. He did not have the power to deal with it.\n\nDragon Lady and the others were starting to think that this was the end. They used all the powers they could exert against the Purgatory Beast, but it was all to no avail.\n\nHan Sen frowned. He kept thinking, wondering if now was the time to use super king spirit.\n\nJust as he was going to activate super king spirit, there was a loud boom. A giant body appeared, and it was the Giant King. He landed in front of them and used his hammer to smack down the Purgatory Beast.\n\n“Go!” The giant killed the Purgatory Beast, and his body possessed a radiant godlight. He ran back into the godlight, and it looked as if he had been talking to Han Sen and the others.\n\nThis made Han Sen very happy, and he and the others followed Giant King into the goddess’ godlight. They stayed near Giant King, whose light was like a shelter. It shielded them from the goddess’ suppression.\n\n“Giant King, why are you bringing them here instead of focusing on removing the godlight?” a King with a spear asked coldly.\n\nGiant King’s voice boomed like thunder, and he replied, “For this small group to have survived this long in Purgatory Heaven, they must be useful in some capacity. And furthermore, if we exhaust the blood of the Gana, we can use theirs.”\n\n“Like hell we can! The blood of these two Gana only works because they are of the goddess’ bloodline. This group isn’t even Gana, so what is the point!” The King with a spear kept attacking the godlight while he berated Giant King.\n\n“It’s better than nothing.” Giant King hammered the crack again. His strong attacks could crack open the godlight, and the shockwaves almost tossed the others onto the floor.\n\nLuckily, Giant King’s power was sufficient to keep them protected. Otherwise, the force could very well have killed them.\n\n“I thought they wanted to save us, but no. It seems that they are after something else!” Wang Yuhang said.\n\n“No matter what the case is, it’s better than getting killed out there, as seemed likely.” Han Sen stood near the giant’s foot. Han Sen was quite tall for a human, but even so, he only reached the giant’s ankle.\n\n“I just hope the Kings can clear a path for us,” Icebird Duke said.\n\nMany horrible powers came crashing against the godlight, and the path cleaved was becoming deeper and deeper.\n\nGuna and Guya’s blood was on the path, and it prevented the godlight from repairing its defenses.\n\nSix elites kept striking at the path, and outside the godlight, the arms were rising and wriggling in countless numbers. There was an abundance of Purgatory Beasts, too.\n\nThey could not step into the godlight, and so they roared at the people inside.\n\nIn the beginning, there was just that dragon-like one, but then other Purgatory Beasts emerged. They all looked murderous.\n\nThere was a Purgatory Beast that looked like a real dragon, and it was flying in the sky. It looked as if it could consume everything.\n\nHan Sen could also see a creature that resembled an angel of some sort, but it was black. Even its wings were black, too. It looked like it had come crawling out of purgatory.\n\nHan Sen and the others felt like they were in some big glass bowl. If the bowl broke, any of the Purgatory Beasts could eat them.\n\nIt was fortunate that none of the creatures were able to set foot inside the godlight. Even so, Wang Yuhang and the others were very scared.\n\nBoom!\n\nThere was an explosion, and the godlight shattered beneath the big hammer. Giant King had managed to destroy the final layer of the godlight. It revealed the statue body of the golden Gana.\n\nThe entrance they needed was by the statue’s tail.\n\nGuna and Guya were dying, as they had lost most of their blood. They were still alive because they were strong, but also because the Buddha King had forced them to remain alive. He was worried that their blood would be rendered ineffective if they died.\n\nWhen the path opened up, Giant King ran straight for the crack. As the giant entered the crack, he became smaller and smaller. Eventually, he disappeared inside the space tunnel.\n\nGold Jade King and Buddha King went in at almost the same time. When Buddha King went in, he did so with a grip on Guna and Guya.\n\nThe rest of the elites went towards the crack, too. Han Sen and Icebird Duke followed Giant King. Giant King’s body was getting smaller the further it went, until it slipped right into the tear.\n\nHan Sen and the others were the last to draw near the crack, and luckily, the path was still dyed red. It hadn’t been suppressed by the godlight yet. So, quickly, he jumped into the crack.\n\nThe dimensional tear in the fabric of that space was crooked. Han Sen dug himself in, and he felt the same sensation he’d get when using a teleporter. Space turned blurry, and when his vision was restored, he was someplace completely different.\n\nHe was atop a sea of clouds. There were many palaces built in a sky realm. There were many large plants, adorned with flowers all around them. It was a picturesque scene of heaven, as taken from long ago myths.\n\nHan Sen and the others appeared in the plaza of one particular palace. There was a gold fountain at its center, and it looked incredibly beautiful.\n\nBut when Han Sen entered that heavenly place, his gut clenched. His powers had vanished. He couldn’t feel anything anymore. He was like an average commoner, without a modicum of extra power.\n\nHan Sen looked around, and so did Icebird Duke. And when they did, they were shocked.\n\nIt wasn’t just them, either. Giant King himself looked stunned, and none of the other Kings looked to be faring well.\n\nGuna and Guya, who had been under the control of the Buddha, now had their freedom restored. Buddha King’s Buddha Light had all vanished.\n\n“Welcome to Heaven. The Gana Heaven.” Guna and Guya helped each other up as they clenched their teeth. They looked very angry.\n\nTheir anger was understandable, though. The Gana had been treated like worthless slaves, and their blood had been sucked dry. It was only natural for them to be angry.\n\nHan Sen thought things were quickly turning sour. This was not a way out."
}