{
    "chapter": 2537,
    "title": "Big Evil Beast",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2537",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Who told you I was one of the Very High?” Han Sen asked with confusion.\n\nLi Keer wanted to ask this, as well, but she didn’t have a chance to.\n\n“Brother Dollar, stop hiding it from us. We have heard that you stole the Sea Sky Eye and the deified treasure Sky God Pillar from Bai Wan Jie before he could even fart,” Dia Robber said.\n\nDragon One was technically an ally of the Extreme King, but the three big races hadn’t started fighting yet. The Dragon wouldn’t do anything to the people of the Very High. Instead, as the leader of the three big races, the Very High had an even better reputation than the Extreme King did. When it became a matter of life and death, no one would ever oppose the Very High.\n\n“I’m not one of the Very High. I am human. I said that a long time ago,” Han Sen said.\n\n“We understand that Brother Dollar is human.” Dragon One and Dia Robber looked at each other. For a moment, Han Sen thought they were going to wink knowingly at each other.\n\nHan Sen looked at their faces, and he knew he hadn’t explained things well enough. But still, Han Sen wasn’t in the mood to talk about it anymore. So, he didn’t speak.\n\nLi Keer, however, was very frustrated. She wanted to say that Dollar wasn’t one of the Very High and that she actually was, but now wasn’t the time to mention something like that.\n\n“How did things come to this?” Li Keer couldn’t figure out how she had gotten herself into this situation.\n\nDollar said he was human, but now people were recognizing him as one of the Very High. And a Very High like her couldn’t even explain things clearly.\n\n“Brother Dollar, do you have the time to hunt a deified xenogeneic with me? I have prepared Big Destroyed,” Dia Robber said to Han Sen with an excited look.\n\nThe Destroyed hadn’t been very happy to bargain with their precious Big Destroyed, but now that they thought Han Sen was one of the Very High, their apprehension vanished. They weren’t just happy to proceed with the deal; they felt honored.\n\nIt was like saying, “Are you seeing this? Even the Very High are interested in a geno art that we Destroyed have created. They want to research our Big Destroyed. Do you know how strong our Destroyed geno arts are? We have geno arts that even the Very High are interested in.”\n\nOf course, the Destroyed didn’t make their true feelings known openly. They were just more than willing to make this exchange using Big Destroyed. Han Sen wasn’t just going to be given Big Destroyed, though; the Destroyed were going to provide a manual and a heap of extra information to go along with the geno art. Unlike their previous meeting, Dia Robber had actually brought the geno art with him this time.\n\n“Sure. We can go now. Sign the contract and give Big Destroyed to Dragon One to hold onto.” Han Sen nodded.\n\nDia Robber pushed the box containing Big Destroyed to Han Sen and said, “I totally trust you. You can take a look at Big Destroyed first. It’s okay!”\n\n“There are actually some benefits to having that Very High title erroneously above my head…” Han Sen thought. He knew that Dia Robber still believed he was one of the Very High, which was why the man was being so kind. Still, Han Sen didn’t see any point in explaining since he had no intention of betraying his word.\n\n“What is going on?” Li Keer thought again. Hearing all this made her want to cry.\n\nHan Sen accepted Big Destroyed and had a look. He discovered that there were many manuals and pamphlets of information, which would make the geno art easier for him to learn.\n\nHan Sen quickly flicked through Big Destroyed and memorized all the contents. He would practice it whenever he had the time to.\n\nDue to the fact this geno art required the talents of the Destroyed, Han Sen didn’t know if he would be able to learn it.\n\nThe deified xenogeneic Dia Robber wanted to kill was called Big Evil Beast. It was both incredibly powerful and insanely fast. It also possessed an evil area. Inside that area, no matter how great your defenses were, you would be weakened. Even deified creatures in its radius would be reduced to half-deified or even King level. There was no way they could defeat the Big Evil Beast.\n\n“Brother Dollar, how are we going to kill the Big Evil Beast?” Dia Robber had plans of his own, and he only required Han Sen’s power. But after learning that Han Sen was one of the Very High, Dia Robber was more interested in hearing Han Sen’s thoughts and ideas for tackling such a foe.\n\nHan Sen asked, “How did you guys plan on fighting it?”\n\n“We planned to combine our powers to restrain the Big Evil Beast, and then have you perform the deadly strike,” Dia Robber explained their attack strategy. “What do you think about the plan?”\n\n“We’ll use your plan, then.” Han Sen didn’t have an opinion on the matter. He thought this plan would work because the Big Evil Beast probably had a weakness somewhere, as well. It wouldn’t be like ordinary deifieds outside the core area, which were flawless. Cooperating with them to fell the Big Evil Beast wouldn’t be too difficult.\n\nSeeing that Dollar wasn’t opposed to their plan, Dia Robber and Dragon One believed he was just too polite. They would never have expected that Han Sen simply wasn’t interested in coming up with a plan of his own.\n\nLi Keer could see Dia Robber and Dragon One falling in love with Han Sen, and it made her as angry as she was amused. She was the genuine Very High of the assembly, and yet, no one even paid any attention to her. And yet they lavished attention on Dollar, who was a fake Very High.\n\n“Wait until you guys learn the truth. It’ll be funny to see how you respond to that revelation,” Li Keer laughed. She didn’t plan to expose the reality of the situation, however. She was going to go along with the charade for a while.\n\nAfter a brief journey, everyone arrived where the Big Evil Beast was said to reside. Dragon One and Dia Robber sent out a lot of people to draw the creature into the open so Han Sen could perform the final strike.\n\nDia Robber borrowed Dragon One’s Dragon Tattoo Tooth Dagger and gave it to Han Sen. Although they believed Han Sen was one of the Very High and thus had no lack of deified weaponry, they still did what they believed was courteous and right. They didn’t want to make a bad impression.\n\n“I can use Galaxy Teleportation. If you need my help, I can lend a hand,” Li Keer volunteered. She said this to Dia Robber, but she only wanted to fight alongside Han Sen to further refine their tender friendship.\n\nBut Dia Robber shook his head. “Thank you, Lady Keer, but you can just spectate. We are fine with Dollar’s help.”\n\nLi Keer felt so sad, and she thought to herself, “There is a real Very High here, and yet you leave her on the sidelines. And you’re spending so much to hire a fake Very High in the belief that you’re getting a bargain. Are you guys stupid?”\n\nLi Keer knew she couldn’t blame Dia Robber or the others, but she still felt depressed about it.\n\nHan Sen was waiting in the system. A short while later, Dragon One and Dia Robber rushed out of a planet. They were being chased by a very scary giant beast.\n\nThe beast looked like a tiger, and it was pitch black. Its body was covered in scales, though, and a pair of enormous wings spread out behind it. The tail looked like a lion’s tail.\n\nWhen it flapped its wings to fly, black smoke billowed out behind it. It was like a monster soaring out of the pits of hell.\n\nDia Robber and Dragon One led a dozen half-deifieds to restrict the Big Evil Beast, but their performance was worse than it had been when they fought the Gold Armor General. After a short while, they were on the cusp of losing.\n\n“Brother Dollar, it is your time!” Dragon One cast the Dragon Blood Evilbreaker and shouted to Han Sen."
}