{
    "chapter": 1213,
    "title": "Blood Contract",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1213",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Dragon King, are there any better ways to control a super creature?” Han Sen asked.\n\nDragon King was quick to misinterpret his words and he said, “Don’t worry; when you get me a new body, I would never betray you. A sordid deed such as that would not even flicker in the depths of my most wretched nightmares. And you, sir, are an inspiration. You are as mighty as a giant! You are a role model to me, of sorts.”\n\nHan Sen pointed at the furry critter.\n\nDragon King, now understanding his true request, then said, “Yes, but it requires their approval. You can’t commandeer their respect to control them.”\n\nHan Sen knew there had to be another method, one that was a little more wicked. But Dragon King was most likely afraid to tell him.\n\n“Spit it out, then.” Han Sen didn’t force Dragon King to tell him the nasty method, as he wasn’t in the business of being unnecessarily cruel to creatures or animals.\n\nDragon King answered, “It’s a simple affair, but it requires their blood.”\n\n“Just tell me,” Han Sen said.\n\nDragon King explained to Han Sen what he had to do.\n\nThis method required a willing participant. And after Han Sen tried it out, it worked just as he was told it would. Perhaps it was because of his attunement with the Blood-Pulse Sutra, but he was able to do it successfully.\n\nHan Sen felt relieved, learning he could use it. If he hadn’t been able to control the snowball, he would have had to just kill it. He needed to know he could control the snowball and its powers properly. Otherwise, it could be a threat to him and others.\n\nHan Sen then let Dragon King continue his search for the egg. In the meantime, Han Sen went to speak with the snowball. He first asked it, “Do you understand the words that are coming out of my mouth?”\n\nThe snowball’s face squinted, indicating that for better or for worse, it understood Han Sen. The snowball slowly nodded. This creature was unique, and it was rather intelligent in comparison to its peers.\n\n“Good. Now, do you want to be spit-roasted? Or perhaps made into a lovely stew? I mean, it’s either that, or you submit and adhere to my commands, under the oath of a contract. The choice is yours.” Han Sen spoke these words with a surprisingly menacing tone of voice.\n\nThe snowball looked at the boiling pot of water and the fire below it, and then turned back to face Han Sen. It nodded, opting for door number three.\n\nHan Sen pulled out his Phoenix Sword and cut its body a little. The snowball whined and cried as this happened.\n\nThen, Han Sen summoned its blood towards him. He laughed and mocked, “You are such a wimp! You’re the first super creature I’ve ever seen to cry like a baby.”\n\nThe blood landed in a vortex, swirling above his hand. Then, it was absorbed with no mess. In that spot on his hand now rested an image of the snowball he had taken under contract.\n\n“Come on!” Han Sen reached out his hand.\n\nThe snowball then spat out a white light which mixed with the fresh symbol on Han Sen’s hand. The symbol began to shiver and shake, and eventually, it faded from his skin.\n\nThe snowball then collapsed on the floor as if it had just been abused.\n\nWhen Han Sen put the snowball back in his mind, the symbol reappeared on his hand. When this occurred, the snowball started to squeal. When Han Sen shelved his nasty thought, the symbol disappeared again. And after this, the snowball stopped its squealing, too.\n\nHan Sen quite liked this method of gaining proper control and ownership of a creature, but he figured it wouldn’t be something he could do very often. Most super creatures would probably opt for the stew, as they weren’t afraid of death.\n\nHan Sen then pointed at Dragon King, and he said to the snowball, “Take me to it. You know what I’m talking about.”\n\nThe snowball stood up and walked towards the exit of the cave.\n\n“You’re leaving already? You didn’t even look yet!” Dragon King called out.\n\n“We’re only having a look outside. You remain here.” Han Sen then followed the snowball out of the cave.\n\nDragon King had almost gotten Han Sen killed before, and with the egg most likely providing him with a few super geno points, it was the price the spirit had to pay. If Han Sen could work a blood contract on Dragon King, he’d probably give him the egg. But the terms of their relationship were still shaky at best.\n\n“Okay!” Dragon King answered, then returned his focus to the search of that egg.\n\nHan Sen didn’t hate Dragon King. He knew he wasn’t as graceful and intelligent as his name suggested, but he did have a lot of knowledge. His past blunders didn’t wholly negate his worth to Han Sen. And now, with Dragon King wholeheartedly believing the egg to reside inside the cave, it could have been another mistake, as the snowball seemed to believe it was outside the cave.\n\nAnd with the snowball’s life in his hands, he thought it’d be fine. He didn’t think he’d be deliberately led astray.\n\nOn the outside, Han Sen was led to another cave and another set of winding tunnels. When they reached the entrance to a particularly cavernous chamber, the snowball pointed inside.\n\nHan Sen did indeed find an egg there, but it looked like any ordinary one.\n\nThe egg was inside a pool of water, which waved and splashed.\n\n“Hey snowball, your name is Snowball. Snowball, is there something wrong with the water?” Han Sen asked.\n\nSnowball nodded and then shook his head. He barked and walked near it.\n\nBecause Snowball’s thoughts were weak, Han Sen could not see what exactly what he was thinking, but it looked as if he was going to grab the egg on his behalf.\n\nWhen Snowball went near the water, something came out of the pool.\n\nHan Sen was shocked. A red rose suddenly splashed out of the water."
}