{
    "chapter": 2780,
    "title": "The Excavated Flower God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2780",
    "text": "The group of elites had all reached the Space Garden via the Flower God’s battleship. They weren’t aware of the route they took to get there or even how they had made it through the border of the xenogeneic space. Because of that, they still didn’t know if entry to the Space Garden required some special password or technique. So, even if they took down the Space Garden now, there was no point in doing so if they wouldn’t be able to find or enter it again. As a result, no one tried anything suspicious or hostile.\n\nBased on what Violet had said, it seemed that something special was required to enter the Space Garden. And that made everyone think.\n\nThis was obviously a very difficult and vulnerable moment for the Flower Gods. But if Violet had dared to bring them all here anyway, then that had to mean he had contingencies in place. He couldn’t simply be carrying a special item on his person that would allow them to access the Space Garden at a later date.\n\nAll the deified elites were looking at the half-buried Flower Gods, and as they did, Han Sen was also thinking. Then, he leapt into the air and flew up into the sky. He wanted to look down on the Space Garden from above and see what it looked like from a bird’s eye view.\n\nBut as Han Sen flew, he noticed a shadow flying alongside him. Someone else had obviously had the same thought.\n\nThat shadow noticed Han Sen, too. They glanced at each other, and Han Sen realized it was the little girl that had been following Bai Wanjie. They had met briefly in the battleship’s canteen.\n\nThe girl didn’t look any older than Bai Wanjie, but the crown prince seemed to respect her a great deal, judging from the way that he treated her. Han Sen couldn’t correctly guess her identity.\n\nThe Bai family had many princes and princesses, and Han Sen had never been able to meet them all. And there were many other members of the royal family, as well. Not to mention that Han Sen had seen only a few of the Extreme King superiors.\n\n“What are you doing up here?” the girl asked with a lift of her lips.\n\n“I am admiring the view,” Han Sen replied with a smile.\n\n“Hmph. You are weird.” The girl turned away from Han Sen and continued flying high.\n\nHan Sen knew how to teleport, but if he used it openly, some of the elites might recognize it as God’s Wander. He didn’t want other people to see it, so he didn’t use it there.\n\nThe Space Garden was only the size of a planet, but that didn’t affect its rare and unique properties. When Han Sen flew high enough to see the whole of the Space Garden, he was stunned to discover that the entire place was like a giant ganoderma lucidum mushroom with many layers. The flower fields were like steps, and they were all a part of that mushroom. It was put together with an amazing level of detail and complexity.\n\nNow, Han Sen was able to confirm his guess. The Space Garden could very well be alive. Maybe it was a very high-level planet xenogeneic.\n\nGrowing plants on a plant xenogeneic seemed quite unbelievable, now that he really considered the idea. But Han Sen had seen all the beings that lived within the Black Hole Spider before. This was certainly possible.\n\n“What do you see?” the Extreme King girl asked, flying over next to Han Sen.\n\n“I see a big mushroom.” Han Sen smiled.\n\n“Hmph. You were boasting about your strength when we were on the battleship, and yet, you cannot see anything.” The girl lifted her lips.\n\n“So, do you see what’s actually going on?” Han Sen asked.\n\n“Of course.” The little girl looked quite cocky. She patted herself on the chest.\n\n“You are too young to see anything.” Han Sen pretended not to believe her.\n\nThe girl shot him an arch look, and she said, “Being older doesn’t mean someone is better. Just like you. You have eyes, but you are still blind. You cannot see anything.”\n\n“Then tell me what you see,” Han Sen said.\n\nFull of confidence, the girl said, “Of course. If I see it correctly, the Space Garden itself is a giant plant. It is a very high-level xenogeneic. It could even be true god class. But its lifeforce is so weak, it looks as if it is going to die soon.”\n\n“Violet said that when the Flower Gods made geno fluids a long time ago, they used a special material that was native to this region. I didn’t believe it back then, but I sure am starting to now. If this is a true god class xenogeneic plant, the xenogeneic plants that grow inside it will adopt its elements. Even an ordinary species that develops here will become different from those on the outside.” The girl really did seem to know her stuff. Just like Han Sen, she seemed to think the Space Garden was one large xenogeneic plant.\n\nHan Sen looked at the little girl with shock, and he thought to himself, “The Extreme King really are different. With their knowledge and their power, they really are much better than smaller races.”\n\n“If you think the Space Garden is a true god plant, then what do you make of all the Flower Gods that are buried in the field?” Han Sen asked.\n\nThe girl really liked how amazed Han Sen was, and she answered, “That is difficult to judge. It could be that the xenogeneic plant knows it is dying, and thus, it is trying to collect more energy to keep itself alive. Either that, or the Flower Gods themselves signed a contract with the xenogeneic plant. Right now, the xenogeneic plant is going to die, so the Flower Gods must die with it. There are many possibilities, but until we learn more, it will be difficult to tell which explanation is correct.”\n\n“In that case, how do we find out the truth?” Han Sen was truly flabbergasted this time. The Extreme King had many resources, but such powerful materials still took time to absorb. This girl was so young, and so, he was surprised that she had so much knowledge.\n\nThe girl thought for a moment and said, “The only way to learn more is to dig up the Flower God people. And then, if we fully examine their bodies, we are bound to learn a clue or two.”\n\n“That is easier said than done. Didn’t you see the power of those deified elites? Even they could not dig up the soil in that garden.” Han Sen lifted his lips. He had been infected by the girl’s mannerisms, it seemed. He had already adopted her gestures.\n\nThe girl glanced at the field with disdain. “You underestimate the deified elites. I don’t know about any others, but I know for sure that Bai Wanjie is not that useless. If he thinks hard enough, he’ll find a way to excavate the Flower Gods. The only thing that matters, following that, is the fact that whoever we excavate will probably die. With my knowledge of him, I think he is going to strike gold real soon.”\n\n“Isn’t Bai Wanjie your senior?” Han Sen asked when he noticed that the girl wasn’t using an honorific when she referred to Bai Wanjie. This weirded him out, and so he felt compelled to ask.\n\n“Who told you Bai Wanjie was my senior? That is backward. I am his senior,” the girl said while looking at Han Sen angrily.\n\nHan Sen wanted to say something, but he saw Bai Wanjie do something just like the girl had predicted. He started to do something special.\n\nAs Han Sen watched, the man selected an average member of the Flower Gods. And then, out of nowhere, Bai Wanjie pulled out a wine cup. He covered the Flower God member with it, and then pulled him up.\n\nThe Flower God had been motionless and almost completely buried in the soil, but now Bai Wanjie was pulling him up little by little. His head and his neck were showing. Furthermore, the Flower God’s body didn’t seem to be injured by the pull. He looked fine.\n\nBai Wanjie kept on pulling. Soon after, the Flower God’s feet popped out of the soil. Many people turned to look at him.\n\nWhile everyone turned to observe the excavated Flower God, the Flower God opened his eyes. The flower on his head opened, and it exploded with a powerful substance chain. The creature jumped furiously at Bai Wanjie, who was the closest.\n\n“Weird… I thought the Flower Gods didn’t have deified elites.” Han Sen was shocked. That Flower God had substance chain powers that only a deified should have possessed."
}