{
    "chapter": 430,
    "title": "Fierce",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_430",
    "text": "Seeing Lu Bin entered a fight himself, his friends and students were all quite surprised. Many people chose to observe the fight and the stands were soon filled.\n\nAlthough Lu Bin would log in Gladiator from time to time, he seldom fought. Most of the time, he was just instructing his students.\n\nIt was not because Lu Bin felt he was invincible, but because the simulated fights could not give him enough thrill. That was why Lu Bin was not at all interested in fights like this. In reality, however, he was even less likely to use Killer Kicks. Therefore, Lu Bin’s students rarely saw him in the fight. Many of his old comrades had not seen him using his best skills in a long while.\n\n\"Who is so good that even Lu went up himself?\" Wang Daqing was surprised to see Lu Bin in the fight himself.\n\n\"No idea. His opponent was using the face blur function, so we can’t tell who he is. But I bet he is quite somebody, otherwise Captain Lu Bin would not go up himself,\" another person said in surprise as well.\n\n\"Haven’t seen Killer Kicks in so long. I wonder if I had the luck to see it today.\"\n\n\"You know how Lu is. Since he is in a fight, he will do his best.\"\n\n\"Then we should all thank this soldier on warship. I hope he last longer so that we could enjoy the fight better.\"\n\n\"I will bet $1000 to say the guy would not last seven kicks.\"\n\n\"You give him too much credit. I’ll bet you 20,00 for four kicks.\"\n\n\"1500…\"\n\n\"Count me… I will bet 2000 as well…\"\n\n\"S*#t! No way you’re doing this. Everyone is betting on Lu Bin. There is no way this will work.\"\n\n\"…\"\n\nLu Bin’s friends were all quite excited, and his students were more curious. It was a fresh experience for them to see Lu Bin using Killer Kicks.\n\nOnly Qian Hezhen was looking at Han Sen with a complex expression. No one knew what he was thinking.\n\n\"Friend, which troop were you at?\" Before the fight started, Lu Bin did not rush to begin, but smiled and asked.\n\nHe thought Han Sen should also be a veteran, otherwise it was unlikely he would have this kind of ability. In fact, that was why Lu Bin felt close to Han Sen in the first place.\n\n\"Military secret,\" Han Sen said calmly.\n\nHe was not being arrogant, but it was really a military secret. At least that was what it said on his assignment paper. He also signed a nondisclosure agreement. If Han Sen told anyone about it, he would be sent to a military court.\n\nLeaking military secrets could be a misdemeanor or a felony. Han Sen did not want to have any offense in this regard.\n\nHearing Han Sen’s words, Lu Bin smiled and said, \"Do not show any mercy later.\"\n\n\"Of course,\" Han Sen nodded and said.\n\n\"Then let’s begin.\" Lu Bin suddenly became very calm and made a side kick as sharp as a blade at Han Sen. He was so fast and fierce that it was nerve-racking.\n\nThe scarier part was that the kick was so sudden that no one saw it coming.\n\n\"That’s what Killer Kicks looked like…\" Many students who had been instructed by Lu Bin could not help but doubt whether they had learned the skills correctly after watching Lu Bin do it. They could not reach Lu Bin’s level at all. When they made the kicks themselves, it was not as sudden or fierce.\n\n\"Lu is serious this time. I don’t believe the boy could even take this one kick,\" Wang Daqing said with his eyes wide, he did not realize that Lu Bin would be so serious as if he was treating his opponent as a Shura in the battlefield.\n\nBoom!\n\nAfter Wang Daqing said that, A Soldier On Warship suddenly raised his arm to block Lu Bin’s kick. Although he took two steps back, he only lost two points in health.\n\n\"Quite an opponent! He was able to block Lu Bin’s kick in time. I wonder who he is?\" Lu Bin’s comrades all felt unexpected.\n\nHowever, no one could answer this question. Even Qian Hezhen did not know A Soldier On Warship was.\n\nLu Bin suddenly looked exhilarated, as if the blood in his body was brought to a boil. He roared and kicked at Han Sen repeatedly, every kick faster and fiercer than the last.\n\nLu Bin’s leg skills were not flamboyant, but every kick he made was life-threatening, with no additional moves. Many moves he made were practical yet unexpected, which was very inspiring.\n\nHan Sen was forced back by the kicks and had to take defensive positions with his arms and legs moving. Although he was able to block Lu Bin’s attacks, he was at an absolute disadvantage, like a small boat in surging waves, likely to think anytime.\n\n\"This is the true Killer Kicks. So fierce!\"\n\n\"Coach Lu is absolutely amazing. What kicks!\"\n\n\"Five kicks in a row. So strong.\"\n\n\"How did he achieve that leg whipping? The angle was simply impossible.\"\n\n\"Captain Lu did not forget any of his kung fu.\"\n\n\"Every move is a killer move. This is the leg skills of a true man.\"\n\n\"I’ve decided. I will sign up to learn this after I go back…\"\n\nThe audience were all dazed by Lu Bin’s moves. They wished they were Lu Bin himself to make those kicks.\n\nHowever, the true evolver masters among them couldn’t help frowning. the leg skills of Lu Bin were indeed very impressive to the point that it was shocking. Even if they were competing against Lu Bin themselves, they did not dare to say they could block his life-threatening attacks for sure.\n\nHowever, his opponent was able to block all Lu Bin’s attacks, though in an awkward way. Until this very point, Lu Bin was not able to break his defense. The points his opponent lost in health were mostly the automatic defense loss generated by the system, which were merely one to two points each time.\n\n\"Who is Lu Bin’s opponent? He is able to take so many kicks from Lu Bin!\" Those who knew Lu Bin well started to become dumbstruck.\n\nThey knew everything about Lu Bin’s leg skills, which were the skills to kill enemies in battles. Most of the time, the two persons at the fight had to fight with life when Lu Bin used the skills. If the opponent was able to beat Lu Bin, his friends would not be as surprised. However, the fact that the opponent was capable of blocking so many kicks was quite alarming.\n\nHan Sen also felt very excited. He did not expect the stranger who sent him an invite was an expert killer with excellent leg skills. Even Han Sen felt it was hard to predict Lu Bin’s kicks in the beginning, which was why he was having a hard time defending himself."
}