{
    "chapter": 2492,
    "title": "Tianxia Peacock King",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2492",
    "text": "Han Sen approached the cloud, but it quickly retreated so that Han Sen couldn’t touch it.\n\nHan Sen felt so angry. He sped up and chased after the cloud. As he chased it, it continued to retreat away from him. But whenever Han Sen turned around and tried to move away from the cloud, it would follow. After a short time of this, Han Sen became incredibly frustrated.\n\n“I was wrong to take you. I was wrong. Can you please stop following me?” Han Sen begged the cloud, tears in his eyes.\n\nUnfortunately for Han Sen, the cricket on the inside didn’t understand the common tongue of the universe. When Han Sen walked away, it followed again.\n\nNow, Han Sen’s situation had become a little awkward. He couldn’t leave, and neither could he stay. It was easy to invite a god in, but it was hard to send a god away.\n\n“Do you really think you can bully me this easily?” Han Sen was getting angry. Instead of going on its merry way, the cloud was creeping along behind him like a stalker.\n\nHan Sen decided to summon Spell and use her two pistols. He fired rapidly, and each bullet hit the cloud at high speed.\n\nThe cloud didn’t dodge, and the bullets slammed into the cloud’s surface. However, an instant later, the bullets were bouncing away instead of piercing through the cloud.\n\nHan Sen had expected this result. He hadn’t actually been trying to break the cloud.\n\n“You are too weak to fight against big brother Han.” Han Sen laughed coldly. He used his pistols to shoot the cloud again.\n\nMany bullets again hit the cloud, but this time, the cloud seemed to lose its bounciness. When the bullets hit it, it sounded like they were hitting a stone surface.\n\nHan Sen’s first attacks earlier had been infused with Spell’s solidifying power. He solidified the cloud, depriving it of its elastic resilience.\n\nAlthough the cloud was now very hard, the bullets still couldn’t hurt it. But where the bullets struck, turtle symbols now appeared. It was Han Sen’s Turtle skill.\n\nAfter Han Sen fired at it for a while more, the solidified cloud was completely checkered with the glowing symbols of a Turtle. When he was finished doing that, he cast an icy light, turning the cloud into a block of ice.\n\n“I don’t believe you’ll be able to follow me after that.” Han Sen turned around and flew away. As he flew, he turned repeatedly to check on the frozen cloud. The cloud began to move despite being frozen, but Han Sen was relieved to see that it was now as slow as a snail. It would be impossible for it to keep up with Han Sen now.\n\nHan Sen was happy about this. He left it in the dust, no longer looking back. It wasn’t going to catch-up.\n\n“I finally got rid of it.” Han Sen changed direction a few times, and when it was assuredly gone, he let out a long sigh of relief.\n\nHe was just going to keep flying, but he soon felt something come from up ahead. It seemed as if there were creatures doing battle ahead of him.\n\nThe fight was happening very far away, and the shockwaves from the battle barely rocked the clouds around him. Han Sen hesitated. He finally decided to fly over and get a better look at the battleground. Before long, he could analyze the shockwaves much more clearly.\n\n“This sonic power is so familiar… It’s Bao Qin! The other power being used is a fire element… Wait, isn’t that the little red bird’s power?” Han Sen was as much surprised as he was happy. He accelerated toward the battle.\n\nThe closer he got to the battleground, the crazier the shockwaves became. Before Han Sen saw the little red bird and Bao Qin, he saw the white whale positioned in the clouds. It was chasing two King class knights from the Extreme King.\n\nHan Sen was delighted. He headed straight for the white whale and the two Extreme King knights.\n\nThe two Extreme King knights were fleeing in fear. When they suddenly saw Han Sen in front of them, they froze. That momentary pause was all it took for the white whale’s mouth to open and suck them in like a black hole.\n\n“Daddy!” After Han Sen entered the white whale, Bao’er jumped into Han Sen’s chest. She excitedly said, “Daddy! I captured so many people in the ship.”\n\nHan Sen looked to where Bao’er was pointing, and he saw that the white whale’s prison was stuffed with a dozen Kings and half-deifieds. They were all Extreme King knights.\n\n“Good job.” Han Sen glanced over the other people on the ship. The pirates and Fang Qing Yu were fine. Only Ning Yue was looking a little messy. She was sitting in the corner with dirtied clothing. She seemed to be terrified.\n\nWhen Bao’er explained what had happened to her, Han Sen was momentarily stunned.\n\n“That little green sword can kill a half-deified? There’s obviously more to it than meets the eye. I wonder where it came from? It was an item dug up in Du God City. Could it have been a weapon left behind by the gods that did battle there? If it is a weapon of the gods, it could make Ning Yue very rich.” Han Sen looked at Ning Yue but was reminded of the state she was in. It made Han Sen think that scamming her might not be a very nice thing to do.\n\nBut Han Sen remembered the story that Bao’er had just told him. Although Ning Yue’s personality seemed overwhelmed and suppressed by the little green sword, it wasn’t gone. On certain occasions, his real self could shine through.\n\nBut the little green sword was too strong. Ning Yue’s will could only be activated under extreme duress for limited periods of time. Completely escaping the grasp of the little green sword seemed very difficult.\n\n“Is the little red bird okay?” Han Sen murmured to himself, looking worriedly at the burning sky.\n\nAccording to Bao’er, the little red bird and Bao Qin had been fighting for a few days without a winner being determined.\n\nBao’er lifted her lips and said, “Don’t worry, Daddy. Little Red will be fine. If he wasn’t so small, he could have already killed that guy.”\n\nHan Sen nodded. He wanted to say something more, but his face changed.\n\nHe glanced absentmindedly out of the white whale, and among the numerous clouds, he saw a single creamy cloud heading toward them. It soon came before the white whale, and Han Sen instantly that it was his stalker cloud.\n\n“Oh my God! How could it catch up with me?” Han Sen saw that the ice and Turtle symbols he’d placed on the cloud had now vanished. He didn’t know how to get rid of the d*mn thing.\n\n“Bao’er, call Little Red back. We have to go. Now.” Han Sen’s face looked dire.\n\nIf the cloud was here now, then many more cloud beasts might be on their way. If a deified xenogeneic was drawn to them, they would be in big trouble.\n\nBao’er didn’t know what was going on, but she did as Han Sen instructed. She used the white whale to fire a crystal light at the battleground.\n\nNot long after, Han Sen saw the little phoenix retreat. When it landed on the white whale, it returned to looking like the little red bird again.\n\n“Where are you running to?” Bao Qin traveled through space. His body was blackened and bleeding in various places, and the harp he used was burned. Some of its strings had even been broken. It looked as if he hadn’t gotten the better end of his battle with the little red bird.\n\nHan Sen let Bao’er use the white whale’s controls to escape. Bao Qin had been fighting for so long, he must have lost a lot of his energy. Chasing after the white whale now wouldn’t be an easy feat for him.\n\nThe white whale traveled away at high speed, and the creamy cloud followed behind them in close pursuit. Bao Qin straggled along behind the cloud. They all traveled through the clouds quickly.\n\nPang!\n\nThey hadn’t been flying for long when Han Sen saw a rainbow light. It immediately covered the sea of clouds all around.\n\n“The Tianxia Peacock King…” Han Sen breathed, seeing the majestic bird appear among the clouds."
}