{
    "chapter": 974,
    "title": "Mystic Stone Room",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_974",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe Red-Eye Rabbit jumped and grabbed one of the tree’s fruit. It swallowed it in one gulp, and immediately after doing so, started to roll on the floor as if it was suffering.\n\nNot long after, it calmed down. It looked weaker than it had before, and its lifeforce was faint. But slowly, it began to return to normal.\n\n“What is this plant? And who planted it here?” Han Sen was surprised at where he ended up, and he observed his surroundings with keen interest.\n\nAside from the plant, there was nothing else in the room. There was a single closed-door, but where it led, he had no idea.\n\nHan Sen turned his gaze back to the tree. Its lifeforce was incredibly strong, and he did not even have to use the dongxuan aura to feel it.\n\nIt was a very high-class tree. If this was what enabled the rabbit to open its seventh gene lock, then it could have very well been a super geno plant. Han Sen, wanting to try it, grabbed one of the fruits and took a bite. He felt the delicious juices roll into his belly.\n\nIf the rabbit was able to consume it, then he wagered he could too. He was interested in seeing if it would affect him similarly to how it affected the rabbit. Assuming his hypothesis was correct, of course.\n\nAfter eating the fruit, Han Sen felt as if his innards were getting sliced by some phantom knife. He fell to the ground, sweating.\n\nThe pain did not immediately relent. It continued to increase, and became so intense that he ended up screaming aloud.\n\nSoon after, though, the pain went away. His body was left in a weakened state, which was a foreign feeling to Han Sen. It was a sensation he wanted to be rid of soon.\n\n“Super King Self Spirit Gene +1.”\n\nHan Sen was surprised that this fruit was able to increase his self geno points. Looking up at the tree, it delighted Han Sen to see that there were around a hundred of the fruit.\n\nHan Sen was now glad to see that the rabbit was still incredibly weak. It took a while to digest the fruit. If it was still hungry and back to being spry, it’d take all the fruit before Han Sen could.\n\nHan Sen saw that a lot of the fruit had already been eaten, and he wasn’t sure how much had been taken.\n\nUsing his holy light, Han Sen was able to fully recover and get back on his feet. When he was upright, he wasted no time in gobbling up another.\n\nThe pain was just as bad as it was the previous time. Fitness level did not matter when eating this fruit; you were dealt unimaginable pain no matter how strong you were.\n\n“Super King Self Spirit Gene +1.”\n\nNo pain, no gain. Literally. And Han Sen could not wait to eat more.\n\nAfter eating the fruit, he healed himself. And when he was recovered, he’d immediately eat another fruit. This happened over and over, and suddenly, pain had become his pleasure.\n\nThe tree still had over a hundred fruit, and when he had eaten a hundred of them, Han Sen heard a strange announcement play:\n\n“Super King Spirit gene capacity at maximum. First gene lock open.”\n\nHan Sen was more than shocked, to say the least. He already knew opening his gene locks improved his super king spirit mode, but he had no idea super king spirit mode had its own gene locks to open.\n\nAlthough he wished to know what changes there were following the opening of its first gene lock, he had no idea where he was. He wasn’t going to randomly use it here.\n\nHan Sen ate the rest of the fruit on the tree, providing him an additional eighteen self geno points. This meant he had a grand total of one-hundred-and-eighteen self geno points following this excursion.\n\n“I’m sorry, rabbit. But fair’s fair. You eat my stuff, I eat your stuff.” Han Sen almost felt guilty.\n\nThe rabbit was not aggressive to him, and Han Sen comforted himself by telling himself the rabbit’s open gene locks were useless. All they did was strengthen the bubble shield around it.\n\n“Fine, I’ll tell you what. In return for what you’ve just given me, how about I provide you with a bunch of pet pills? You can have as many as you want.” Han Sen planned to bring the rabbit back with him.\n\nIn case it was ever killed by other humans, unable to defend itself due to the fact that Han Sen had stolen its source of strength, he decided to return with it.\n\nIt was a clumsy creature, and he figured if a human ever did set its sights on the rabbit, it’d be killed without much trouble.\n\n“The rabbit looks very cute, too. Bao’er might like it.” But thinking about what the bear had to suffer, he wasn’t sure he should subject any more creatures to her cruel torment.\n\nBesides, the rabbit was different than the bear. And the circumstances of their meeting were entirely different. The rabbit didn’t deserve to get destroyed everyday by Bao’er.\n\nHan Sen left the rabbit there for a while and went towards the door. He had already received a most amazing treasure in the room he was in. The thought of there being something even better, further in, excited him a great deal.\n\nHumans were both greedy and curious things, so Han Sen wasn’t going to leave without searching this place in full.\n\nHan Sen pushed against the door.\n\nIt opened easily, and there was no lock or rusted hinges to contend with.\n\nBeyond it, there was another stone room. This one was even bigger, and it was beautiful like a palace.\n\nThe walls were decorated with a variety of strange symbols. There were curves, straight lines, and dots of all sorts.\n\nThey were not religious symbols, instead, they seemed more like celestial imagery.\n\nIn the back of this palace-like room, there was a bronze tripod ding cauldron. It was ten meters tall, and it possessed similar imagery as well.\n\nHan Sen flew over there, curious about what might be inside the ding. And after seeing what was there, goosebumps rose up and down his body. His sweat turned cold."
}