{
    "chapter": 2210,
    "title": "Black Hole Spider",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2210",
    "text": "Inside a ship that was bound for the systems of chaos, Han Sen and Han Yan were engaged in a card game. They had been flying for a long time, and boredom had set in.\n\nThe Ice Blue Knights wouldn’t play card games, even if they were bored to death.\n\nBut Han Sen and the others were Mister White’s private guards now, so they could play any game they wished because Mister White allowed it. Mister White was actually playing with them.\n\nHan Sen, Mister White, Han Yan, Ji Qing, and Bao’er were all playing together. Zero and Little Angel hadn’t been interested. Han Meng’er was probably off obsessing over her beloved bows, and Little Silver and Little Star were resting.\n\nIn the room where they were playing cards, the only people that weren’t very close to Han Sen were Mister White and another guard. The guard was a man named Crime, who belonged to the Lane race.\n\nHe was three meters tall, and his body looked lean and powerful. He had long blonde hair that brushed his shoulders, and his square face was alarmingly serious. His eyes gleamed brightly.\n\nHis black armor had gold markings, and a gold lion sword was belted to his waist. It looked like a sturdy weapon.\n\nHe was different from Han Sen. Crime was one of Mister White’s guards as well, but he was a King of the Lane. He was a very smart person, and he had a keen insight into things and people.\n\nEvery time he looked at Han Sen and the others, he couldn’t help but frown.\n\nA group of Marquises, and even Earls, had become Mister White’s guards. It seemed like some sort of bad joke. He didn’t think they were worthy, and they would cause nothing but trouble. When they failed, he would have to pick up the slack.\n\nBut Crime wouldn’t voice any of his concerns because the decision had come directly from Mister White. He was just going to do his job, and at the same time, keep his eyes trained on the others.\n\n“Okay, I’m done. This is boring,” Han Sen said as he lost again. He stretched long and slow.\n\nAll the chips on the table were heaped close to Bao’er. It looked like she was sitting beside a small mountain. Han Sen owed her a lot of money now.\n\nJi Qing, Han Yan, and Mister White had lost, too, though not as much as Han Sen.\n\n“Let’s play again…” Ji Qing said, feeling desperate. She had lost even more than Han Sen.\n\nJi Qing’s luck had never been this bad before. Everyone was losing, and she almost thought that Bao’er was cheating.\n\nHan Sen started to say something, but before he could, an alarm sounded. Han Sen stood up.\n\nMister White smiled and said, “Don’t worry. That is a silent alarm, not a battle alarm. Let’s head for the control room.”\n\nThe others stayed in the room while Han Sen went to the control room with Mister White and Crime.\n\nWhen Han Sen arrived in the control room, he noticed that Ice Blue Knight King was there. The other important crew members of the ship were there as well, and that included Night River King.\n\nNight River King gave Han Sen a frigid glance. He didn’t look angry, but Han Sen knew that the Rebate wanted to kill him.\n\nIce Blue Knight King stepped over to Mister White and explained urgently, “Mister White, we have spotted a Black Hole Spider. We’re remaining in silent mode to avoid disturbing it.”\n\nHan Sen looked at the monitors and saw a black spider hovering in space. The creature was as big as a planet. The spider web encompassed a whole bunch of other planets, making the entire area look like a net of unbelievable size. The Black Hole Spider was lying in the net’s center.\n\nThis was Han Sen’s first time ever seeing something so big. Humans were tiny creatures before it, as small as bacteria by comparison.\n\nThe whole Ice Blue fleet went into silent mode, and all their lights went dark. All their scanning and communications equipment were switched off as well. They shut down most of their thrusters, as well, so only a few were left running on minimal power. And then, the ship slowly drifted past the Black Hole Spider.\n\n“The systems of chaos are scarier than I imagined,” Han Sen thought. That Black Hole Spider must have been deified, and even the Extreme King knights wouldn’t dare to touch it.\n\nThe ship slowly drew nearer to the Black Hole Spider. As they approached, Han Sen’s brow furrowed. There were many smaller creatures living on it.\n\nSeeing Han Sen look visibly surprised, Mister White explained to him, “The Black Hole Spiders themselves aren’t too threatening. It doesn’t bother to hunt small creatures like us. It eats planets, meteors, and even ships. But as long as we don’t enter its proximity, we ought to be safe. However, there is an entire biosphere of creatures that live on the Black Hole Spider, including many elites and Kings. To us, they are more threatening than the spider itself.”\n\n“If there are so many xenogeneics living on it, can we kill and harvest them?” Han Sen asked with keen curiosity.\n\n“Of course, but only if you aren’t afraid of attracting the Black Hole Spider’s attention,” answered a knight behind Ice Blue Knight King.\n\nIt took the ship three hours to pass by the Black Hole Spider safely. They didn’t alert the Black Hole Spider to their whereabouts, and neither did they draw the attention of the xenogeneics living on it.\n\nEveryone felt great relief when they had made it through. The Ice Blue Knights really didn’t want to deal with the Black Hole Spider or its entourage.\n\nHan Sen thought the danger was over, but suddenly, an explosion came from behind them, rocking the entire ship. A loud alarm began to blare.\n\n“It’s a Galactic Shrimp. Tell our ships to enter battle formation and prepare for a fight!” Ice Blue King commanded.\n\nThe other ships in the fleet started to fire their weapons at the threat. Lights were flaring everywhere through space as powerful explosions erupted all around them.\n\nHan Sen could see from the video feed that there was a shoal of what looked like shrimp, only they were glowing blue and around ten meters long. They swirled around the ships.\n\nThey bounced around with small flicks of their bodies. Whenever they moved close enough, the shrimps would become a blue light that pelted the ship. Their hard shells could blow fifty-meter-wide holes in the hull of a vessel. There were lots of explosions.\n\nThe powerful heavy guns of the ships turned to fire on the Galactic Shrimps. Each round was like a sun that could consume swathes of Galactic Shrimps at once. But even so, more and more were coming.\n\nMany blue lights shone around them. The Galactic Shrimps seemed countless.\n\nBoom! Boom! Boom!\n\nThe Galactic Shrimps continued to hit the ships like cannonballs, creating explosions every time."
}