{
    "chapter": 2393,
    "title": "Dongxuan Area",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2393",
    "text": "“Dollar! I will defeat you today.” After that declaration, a punch came right for Han Sen. Cloaked in Dragon Eight’s gold King area, the enormous power of that punch became a roaring gold dragon, ready to consume Han Sen.\n\n“Let me try my Dongxuan Area power,” Han Sen thought, his heart leaping. He opened his invisible Dongxuan Area, and all of a sudden, the whole world around Han Sen was now composed of an infinite number of spinning cogwheels.\n\nHan Sen could see his opponent’s draconic punch and area power. They came from Dragon Eight’s self-universe cogwheel, which exerted force on some universal cogwheels around it to generate more power.\n\nWithin the radius of the Dongxuan Area, Han Sen could feel Dragon Eight’s ability to affect the universal cogwheels. The Dongxuan Area could affect them, too.\n\nHan Sen lifted his hand and focused his mind.\n\nWhen Han Sen pushed forward, it wasn’t to affect Dragon Eight; instead, he used his Dongxuan Area to control the nearby cogwheels that were in motion.\n\nThe universal cogwheels that had been under Dragon Eight’s control suddenly came to a complete stop.\n\nIn that instant, something unbelievable happened. Dragon Eight’s gold King area and dragon punch lost their power.\n\nIt was an oddly embarrassing moment for Dragon Eight.\n\nIt was like an actor filming a special-effects based fight scene. The fight looked amazing with the special effects, but halfway through the video, the special effects had vanished. Dragon Eight was left hanging awkwardly in the air. A cruel punch had been sent toward Han Sen, but when the power in the attack vanished, Dragon Eight’s actual fist was still one hundred meters away from Han Sen, and so nothing happened.\n\nDragon Eight couldn’t believe his eyes, and so he threw another punch. No power was produced.\n\n“No… This is impossible… Why can’t I use my area and my power?” Dragon Eight stared at Han Sen, stupefied.\n\nDragon One and the other Dragon Kings were similarly dumbfounded. They couldn’t see the invisible Dongxuan Area. They had simply seen Han Sen wave his hand, and then Dragon Eight’s area and power vanished. It was very scary.\n\nHan Sen was pleased beyond words. The Dongxuan Area could control every universal cogwheel in its radius. That meant that unless the enemy was stronger than Han Sen, Han Sen could easily control his every cogwheel. Any power that came into contact with the Dongxuan Area would be dismissed.\n\nOf course, if the enemy was stronger than Han Sen and kept using their power to push against the cogwheels Han Sen was trying to gain control of, the Dongxuan Area wouldn’t work as well.\n\nBut even if the enemy’s power was stronger than Han Sen’s, the Dongxuan Area could still be quite effective. It could make the cogwheels spin slower, at least. It could even make a cogwheel accelerate, if there was cause for that.\n\nOrdinary area powers could only affect the universal cogwheels that immediately connected to the self-universe cogwheel, but the Dongxuan Area could affect all of the cogwheels within its radius. That was why the Dongxuan Area was so scary.\n\nAnd it didn’t simply destroy the power that the enemy had attempted to wield. It had an additional function.\n\nHan Sen lifted his fist and threw a punch toward Dragon Eight, who was still thoroughly dazed from the disappearance of his attack.\n\nA giant metal dragon launched from Han Sen’s fist and thundered toward Dragon Eight, mouth open. It was just like the punch Dragon Eight himself had tried to deliver.\n\nHan Sen had seen how the punch affected the universal cogwheels, so in order to simulate the punch, he just had to replicate the movement of the cogwheels.\n\nThe simulation wasn’t exactly the same, because the energy of the punch originated from Han Sen’s self-universe cogwheel instead of Dragon Eight’s. That meant that the core power of the attack was different.\n\nPang!\n\n“A gold dragon punch… How is that possible…?” Dragon Eight was frozen, and so he forgot to dodge. The blow sent him flying, blood spraying from his mouth in a long stream.\n\nFor Dragon One and the others, their surprise was turning into horror. That punch was Dragon Eight’s own skill merged with a Dragon secret called the Dragon Punch technique. It was a unique skill, but Han Sen had copied it and turned it back on his opponent in seconds. That was terrifying.\n\n“No wonder you were called the universe’s number one Marquise. Even at King class, you are still this strong,” Dragon One said to Han Sen as he picked up the injured Dragon Eight.\n\n“I am flattered. If there’s nothing else to be done here, I will take my leave,” Han Sen said and then turned to leave.\n\nDragon One raised his hand and stopped Han Sen. He said, “We found some core xenogeneics. Two of them are half-deified. Are you interested?”\n\n“How would the resources be split?” Han Sen asked Dragon One.\n\nThe universal core area had many core xenogeneics. They were King class at the very least, but the xenogeneic genes they yielded were very special. Core genes could provide a powerful boost to one’s King area. Many Kings sought those core genes in order to level up their area.\n\nHan Sen was interested. There were nine tiers he needed to climb, and then he would need to reset after that. Currently, Han Sen was only on the first tier. Climbing the levels one by one would be a difficult thing to do. If he could level up using core xenogeneic genes, it would be much easier.\n\n“It is a very large group of core xenogeneics,” Dragon One said. “Those two half-deified xenogeneics are very scary. I can deal with one, but I cannot take down two. If you can keep one busy, I will give you fifty percent of the reward.”\n\n“Boss… isn’t fifty percent a bit too much?” a King Dragon quickly said.\n\nDragon One waved his hand. “It isn’t too much. No one else among us can kite the other half-deified core xenogeneic. We have no chance of killing the group without that being done, though. Either we make this deal, or none of us get anything. He would deserve fifty percent.”\n\nDragon One turned back to Han Sen. “What do you think?”\n\n“It sounds good, as long as I’m only kiting that one half-deified xenogeneic. Let’s go get it done, then,” Han Sen answered, accepting their terms. This was his first time inside the universal core area, so he wasn’t really familiar with the place. Hanging out with the Dragons wasn’t a bad start.\n\n“It’s a deal.” Dragon One quickly agreed and signed a contract with Han Sen.\n\nTogether, they all flew into the sky. As they traveled, Dragon Eight asked, “Dollar, what tier have you reached?”\n\nDragon One and the others all perked up their ears to listen. They had been curious about this since they saw him fight. With Han Sen’s performance, they were guessing that he had to be at least fifth-tier. Some suspected he was ninth-tier; otherwise, how could he have destroyed Dragon Eight as he had?\n\n“Tier One.” Han Sen didn’t feel the need to hide his rank. After all, they would have to fight together. If he used his King area for a long time, it might become apparent that he only had a single tier. Lying about it now would serve no purpose.\n\nUpon hearing Han Sen’s answer, Dragon Eight jerked in the air as if he had hit a patch of turbulence. His face had gone slack.\n\n“You’re a first-tier King?” Dragon One and the others looked at Han Sen, trying to keep their expressions neutral. After that, they didn’t want to talk anymore."
}