{
    "chapter": 2995,
    "title": "United to Fight the God Temple",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2995",
    "text": "Fox Queen looked sincere as she said, “Mister, Extreme King’s Bai Wushang has been chasing me non-stop. I cannot beat him. He will kill me sooner or later, and I will be unable to serve you.”\n\nHan Sen thought, “Damn you, Fox Queen. You are a servant, yet you are still a conniving conspirator. You want to use me to get rid of Bai Wushang for you.”\n\nHan Sen’s heart jumped. Suddenly, the God of Wealth mark on Fox Queen’s forehead flashed. Fox Queen immediately held her head. With her will, she was unable to withstand the pain. She started rolling across the floor. In a moment, her face looked terribly pale. Her green veins were on display. Her eyes were sticking out of their sockets. It was terrible. It looked as if she was going blow up at any moment.\n\n“Mister… Mister… Mercy…” Fox Queen was begging. Han Sen turned the God of Wealth mark off. He looked at Fox Queen and said, “You are my servant. You listen to whatever I say. You speak only when you are spoken to.”\n\n“Mister, I know that I was wrong.” Fox Queen quickly straightened herself up and bowed. In her heart, she was thinking, “Old Fart, do not think you can control me forever. If I hadn’t discovered a way to break this, I would not have allowed you to take control of me for a time.”\n\nOleo\n\nHan Sen took out something for Fox Queen. “This is my token. Seeing this is like you are seeing me. If someone else uses the same token to find you, you must listen to that person. Otherwise, you are aware of the consequences, right?” “Yes, Mister.” Fox Queen politely bowed and put away the token.\n\nAfter Fox Queen left, Han Sen thought, “The Fox have attractive people all over the universe. Their intel is at the best level. If I can get the help of the Fox, that means I have eyes all over the place. But this Fox Queen was Ghost Bone General’s wife. She must know a lot of secrets about Sacred and the God Spirits. This time, she is willing to obey me, but perhaps she has more sinister and ulterior motives. I should be careful whenever I have dealings with her.”\n\nAfter Fox Queen left, Han Sen noticed Sky God Crown’s benefit. Fox Queen had the mark of the God of Wealth. Han Sen felt wherever she was in the universe. He could control the God of Wealth’s mark whenever he wished. If he wanted her to live, she lived. If he wanted her to die, she would die.\n\nWhen Han Sen took off the Sky God Crown, he no longer felt anything. Only the 300 lifespans were a part of Han Sen’s body.\n\n“My God Spirit seat only comes from the Sky God Crown. I am not really a God Spirit. That makes sense.” Han Sen did not think this was a shame. He never planned on being a god anyway. Having a big boost to his lifespan was already a surprise.\n\nIn the Extreme King’s little garden palace, a xenogeneic mode Han Sen walked in. Bai King was brewing tea as he coldly asked, “Dollar, how was your trip?” “It was successful,” Han Sen said. “I convinced Han Sen to join our co-operative efforts, but he has a condition.”\n\n“What condition might that be?” Bai King did not raise his head. It seemed as if he knew that was going to happen. “We have to give him the treasure that can save Golden Growler,” Han Sen said. “He will be the one who saves Golden Growler.”\n\n“Fine, but I will only give it to him when we are outside the god temple on that day,” Bai King said with a nod.\n\n“That should be fine.” Han Sen looked at Bai King’s black gem ring. He went on to ask, “Mister, can I look at the ring again?”\n\n“Why? Is there a problem?” Bai King asked. He took off the ring and threw it at Han Sen.\n\nHan Sen accepted the ring. He looked at it and gave it back to Bai King. “Do you really use this ring to test the Holy Body Geno Fluid?”\n\nBai King looked at Han Sen and asked, “Why would you say that?”\n\nHan Sen looked at Bai King as he said, “Believe it or not, I can tell you honestly that I never used the Holy Body Geno Fluid. Yet, this ring reacts to me. I am afraid there might be another reason for that. Can you help me clarify my confusion?” Bai King suddenly frowned and asked, “Do you think I am lying to you?”\n\n“If you really do not know anything, I am afraid this entire thing was incorrect from the beginning.” Han Sen sighed and said, “It’s fine. We will find out the truth. I still have things to do. I am going to leave.”\n\nAfter that, Han Sen flashed away. After he left the bai sema, he used Galaxy Teleportation to leave.\n\nBai King watched Han Sen depart. He spoke to himself with an expression that kept changing. “Is there really a problem with this ring? Or, is Dollar involved in some sort of conspiracy?”\n\nAfter Han Sen returned to Space Garden, he discovered that the house had another Han Sen.\n\nThe Han Sen in the house looked at the Han Sen that came in and asked, “How is it?” Pang! The Han Sen that walked in was some smoke. It looked like Bao’er. She laughed and said, “This ring reacts to me.” “That is good.” Han Sen nodded. Although he had guessed this result, he did not feel safe if he had not tested it.\n\nBai King had seen Han Sen before, but he did not show anything toward Han Sen. When Han Sen used his xenogeneic battle body to meet with Bai King, Bai King started to act all strange toward him.\n\nHan Sen guessed that the ring only reacted to Han Sen when he was in xenogeneic mode. It did not work on normal mode Han Sen.\n\nHan Sen did not know the xenogeneic battle mode Bao’er simulated made the ring react, which was why he wanted Bao’er to try it out for him.\n\nIf there was no reaction, Bai King would not give the ring to Bao’er. She would then be able to disguise herself as an assassin and do something to Bai King. If Bai King grew suspicious, he would have no proof and could not do anything to Han Sen.\n\nHe had now proved that the ring only reacted to xenogeneic battle body. This enabled Han Sen to guess about a lot more. “Xenogeneic battle body mode is a result of combining four geno arts. The ring reacts to xenogeneic battle body mode. I am afraid it is not a tool to test the Holy Body Geno Fluid. This is weird. I do not know if Bai King is lying to me or if the whole of the Extreme King has been fooled by past kings.”\n\nBut that was none of his business. The time for a meeting had come. Han Sen let Bao’er scan his xenogeneic body, but she did not transform yet.\n\n“Remember, you go in last. You are also the first to leave. Do not get close to Moment God. You wait here. Come in after I have established the deal with Bai King.” Han Sen was wearing the blue and black striped robe as he spoke to Bao’er. He then went to the god palaces. Bai King and two other people were already waiting there.\n\n“Mister, long time no see. Are you OK?” Han Sen was in front of Bai King. He bowed and looked at the other two people.\n\nHan Sen thought Bai King would have brought many Extreme King’s elites with him, but he had only brought two people who did not belong to the Extreme King."
}