{
    "chapter": 1852,
    "title": "Raven",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1852",
    "text": "Han Sen was shocked. Other than the strange solar system within, the purple-bronze palace was empty. Countless moons orbited a sun, and they looked like they had been there for a long time.\n\nThe Baron that opened the door stood where he was, as Captain Wood excitedly moved forward to push him out of the way. He walked forward, and the four Marquise followed.\n\nHan Sen thought it was strange that they suddenly seemed braver. They hadn’t sent their cannon fodder in first in case there were traps. It didn’t seem like a very Wood-thing to do.\n\nAnd as this strange feeling continued to permeate Han Sen’s temperament, Captain Wood kneeled in the air like a knight. As he faced the sun, he said, “Lord Skygod, greetings from your most loyal Rebate slave.”\n\nHan Sen felt his eyeballs bulge in their sockets, and it seemed like everyone else was equally surprised. He thought there was going to be a fight, with the situation changing so suddenly.\n\n“It looks like the god that the Rebate obey is the sun. It is no wonder it looks like that,” Gu Qingcheng said quietly.\n\nHan Sen understood what she was saying. No wonder the Rebate didn’t have accounts of their victory over the Ravens. It did not look as if they had beaten them at all. If the Rebate had won the war, even if the enemy had been weak and pitiable, they still could have claimed that it was a heroic and noble victory.\n\nThere was only one possible reason for the Rebate to avoid talking about their victory over the Raven: they hadn’t actually won. Something must have happened to the Raven, providing the Rebate a fortunate opportunity to steal Narrow Moon for themselves. Whether or not the Raven had completely disappeared was something they were not sure of.\n\n“You guys still remember me? What do you want, providing sacrifices like that?” The sun-like orb possessed an old voice.\n\n“Lord Skygod, I… I…” Captain Wood looked hesitant to say it, and his face twisted a little in the attempt to speak.\n\nCaptain Wood had come here on Black-Moon King’s orders. The wish he had to make was something Black-Moon King desired, but right now, another thought crept across his mind.\n\nHis mind was in two halves, and his face looked strange. After a while of thought, he said, “Lord Skygod, we require a fireseed.”\n\nThe sun-like orb said, “You should know that a sacrifice like that is not enough for a fireseed. You will require more.”\n\nWhen Han Sen and the others heard this, they tensed. If Captain Wood required live sacrifices, they would be in danger.\n\nBut things were not as Han Sen feared. Captain Wood brought out a box. He held it up to the Skygod and said, “Skygod, this is my sacrifice.”\n\nThe box in Captain Wood’s hands started to fly. It went past a moon right towards the sun.\n\nAfter some time passed, Sun Skygod said, “Good. This is enough. You can be granted a fireseed.”\n\nAfter that, the sun released a small fire. It was like the light of a candle, and it flew directly back to Captain Wood. Captain Wood pulled out a black bottle to put the flame inside. He closed it, and then put it away.\n\n“Thank you, Skygod.” Captain Wood bowed, and then went on to ask, “Skygod, is there still one more wish available to be made?”\n\n“No. The three wishes have been granted,” Sun Skygod used his old voice.\n\n“Did Chiron Earl make two wishes? Where did he get that many sacrifices?” Captain Wood’s face changed.\n\nSun Skygod said, “Chiron Earl only made one wish. Not long ago, a Viscount approached and made a wish. So, the three wishes have now been made.”\n\nCaptain Wood’s face looked ill, and he said, “A Viscount made a wish? Who?”\n\n“You can return to whence you came now.” Sun Skygod did not answer his question.\n\nCaptain Wood did not dare disobey the command, so he simply bowed and left the purple-bronze palace with his four Marquise. He looked quite gloomy.\n\nNow Han Sen wondered if Wind Viscount was the one who made the wish. It didn’t make sense if he had, though. If he had made a sacrifice and gone through all that effort, why would he have died not long after?\n\nAfter Captain Wood had left the hall, Sun Skygod’s voice boomed across the hall. “If you have the Raven feather, why do you not make a wish?” Everyone was shocked, and no one knew who his question was directed at.\n\nHan Sen was shocked, and he thought to himself, “The Raven feather cannot be that steel feather, can it?”\n\n“If you have the Raven feather, you can make one more wish.” Sun Skygod’s voice sounded again.\n\nEveryone looked at each other, wondering who amongst them might have had such a feather.\n\nHan Sen stayed quiet, but when he stepped forward, he noticed Captain Wood and the others’ faces change.\n\n“Mister Skygod, what are these Raven markings?” Han Sen did not make a wish. He simply asked a question before all else.\n\nSun Skygod answered, “Chiron Earl made a wish to grow a Raven. You need a sacrifice to grow the Raven, and the people with the marks on them are the sacrifices.”\n\n“Then, might I ask how it is possible to erase those Raven marks?” Han Sen asked.\n\nSun Skygod seemed to show bias towards Han Sen, and he answered him again. “You do not need to erase them. When the Raven is born, the marks will fade. The marks will not bring harm to the people possessing them. In fact, those who have it will be granted Raven blood. It will make them stronger.”\n\nNow, Han Sen was able to understand why Skygod was so nice and so willing to answer the questions.\n\nBut Han Sen had to keep on asking. “Then, how do I make the Raven be born in a way that the sacrifices don’t die?”\n\n“You find more sacrifices. Find more than you need, and you will live,” Sun Skygod said with certainty.\n\n“Is there anything else? Is there a method that won’t require any sacrifices?” Han Sen asked with a frown.\n\n“You can use your wish to erase those marks, of course. You ask too many questions; now, sacrifice the Raven feather and make your wish,” Sun Skygod said."
}