{
    "chapter": 2474,
    "title": "Herd of Unicorns",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2474",
    "text": "Now Han Sen knew another reason that Lando hadn’t tied him up. Lando knew that the way back to the Extreme King wouldn’t be safe. If he had to hold onto Han Sen in a fight, it would be too much trouble.\n\nLetting Han Sen run off on his own would allow Lando to focus his attention on whoever was attacking them.\n\n“You’re very calculating, but you’ve underestimated me. I am Han Sen! You think a mere tracking mark can beat me?” Han Sen laughed sinisterly, but he didn’t stick around to gloat. He ran off in the opposite direction.\n\nIt wasn’t long into his escape attempt that he saw a group of gold unicorns coming at him from another cloud. They were everywhere. And there were as many of these gold ones as there were white unicorns the other way.\n\n“Oh sh*t! Why are there so many xenogeneics?” Han Sen drew his knife and ran straight into the unicorn herd. The sword lights flashed. Blood was everywhere. He immediately killed a few unicorns.\n\n“Xenogeneic Duke hunted. Xenogeneic gene found.”\n\n“They really are xenogeneics!” Han Sen kept pushing through the enormous herd of unicorns, massacring them as he went. His Ghost Teeth Knife cut them down like a scythe through a wheat field. But he wasn’t harvesting wheat. He was harvesting lives.\n\nThe unicorns didn’t relent. Han Sen kept slicing and dicing, and blood splashed all around him. He killed countless unicorns in no time at all.\n\nHan Sen suddenly heard a long scream. A glowing unicorn stepped through the herd. It was twice as large as the ordinary gold unicorns, and its horn was pure gold as well. It was thundering toward Han Sen, and its body seemed to strain the space around it as it ran.\n\nHan Sen slashed at the unicorn’s horn. The blade and the horn collided with a metallic shriek. Han Sen bounced away a few hundred meters before coming to a stop.\n\nBefore Han Sen restabilized, he saw another unicorn coming for him. This next one was black, and it radiated a terrifying amount of power. It was no weaker than the enormous gold unicorn.\n\nHan Sen sent a punch toward the black unicorn. The ice light landed on the black unicorn, but the creature shone with a black light. It was as if a shield manifested, blooming from the tip of the creature’s horn. It was shaped like a spindle.\n\nThe ice light, when it touched down on the shield, was ricocheted away. It had been completely unable to pierce the fusiform area the creature had created.\n\nPang!\n\nThe black unicorn smashed into Han Sen’s body, breaking him in two. He turned into dust, but then his real body reappeared on the other side of the field of battle. As he turned, he saw another large unicorn coming for him. This one was a stark white.\n\n“Oh sh*t! Why are the white unicorns coming for me, as well? Isn’t Lando over there?” He began to wonder if Lando had played a trick on him.\n\nBut when he looked closer, he saw Lando engaged in combat with a rainbow-colored unicorn. The rainbow-colored unicorn was emitting a rainbow-colored godlight. But as he watched the light shimmer and warp reality around it, he knew that it was a deified unicorn.\n\n“How unlucky am I to encounter this deified xenogeneic?” Han Sen felt depressed. Even Lando wouldn’t be able to handle a deified xenogeneic. It seemed as if the situation was going from bad to worse.\n\nSince the rest of the unicorns couldn’t get anywhere close to the fight between Lando and the deified unicorn, they came for Han Sen instead. Han Sen had already encountered four half-deified unicorns, and now there was an entire ocean of lesser unicorns coming after him. If Han Sen stayed to fight, he’d wear his hand down to nubs even if the unicorns lined up so he could kill them one by one.\n\nWhen a red unicorn also began running toward him, Han Sen had an idea. His left eye flashed with red. He turned into a bloody shadow and hopped into the red unicorn’s eyes.\n\nLosing their target in the blink of an eye left all the unicorns shocked and confused. They looked around, trying to find Han Sen, but none of them could figure out where he had gone.\n\nHan Sen didn’t stop in the eye of the red unicorn, though. He immediately teleported into the eye of another unicorn. He kept bouncing through the herd of unicorns, never staying in any particular host for more than a second.\n\nAlthough four of the unicorns were half-deified, Han Sen wasn’t really scared of them. What unsettled him was the strange timing of the unicorns’ arrival. Han Sen felt like there were larger forces at work here, forces that he hadn’t yet identified.\n\nHe kept moving through the unicorn herd, flickering between the eyes of the beasts. By doing this, he was able to inch his way to the edge of the battleground. He kept watch over the unicorns as he moved, trying to discern what had inspired their sudden attack, but he still hadn’t noticed anything out of place.\n\n“Did I overthink this? I guess their attack was a good thing, all in all. At least this way, I can escape Lando. He’s still trying to fight that deified unicorn and all the rest. I don’t think he’ll make it. Even if he does make it out, he won’t be able to catch me again,” Han Sen thought. By this time, he had made it to the edge of the unicorn horde. He came out of the eye of the furthest one and tried to fly away unnoticed.\n\nPang!\n\nHan Sen felt as if he had run face-first into a steel board. He reeled back, his nose weeping blood.\n\n“What is this?” Han Sen looked forward but he couldn’t see anything. He reached out his hand to touch whatever he had crashed into, and he realized it was some sort of invisible shield.\n\n“There’s something wrong here.” Han Sen touched the invisible shield. His body flew up a few hundred miles, but his hands kept in contact with the shield. There was no end to it.\n\nHan Sen traveled another thousand miles, but there was no sign that the invisible shield would end anytime soon. He had no idea how far it went.\n\n“What is this? Who is doing this?” Han Sen was shocked. If that shield covered the entire battleground, then that meant there had to be an additional deified being who was pulling strings in this battle. Only someone of that level could create a shield so strong and large.\n\nHan Sen opened his Dongxuan Aura and used the purple butterfly in his right eye to see if he could discern more about the invisible shield.\n\nHe immediately saw that the thing prohibiting his passage was an invisible substance chain wall. He looked ahead and saw that the wall surrounded the entire area. There was no end to it.\n\n“There really is a deified elite behind all this.” Han Sen took a deep breath. He didn’t understand why the deified elite hadn’t revealed itself and fought. He only knew that the deified had locked down the battleground, and now, Han Sen couldn’t escape.\n\nSuddenly, Han Sen’s left finger grew hot. A beam of grey light emerged from his finger, glowing from the symbol painted on to one of his metacarpals.\n\nThe mark seemed to fade away from his finger, and the grey light formed the image of Lando in front of him.\n\n“Stop running. This place has been locked down by a deified elite. We need to kill every xenogeneic here. Otherwise, we die,” said the mark that had turned into the shadow of Lando.\n\n“Why?” Han Sen frowned.\n\n“There is no why. We simply aren’t strong enough to have any other options. I may not like this, but someone is using us as chess pieces right now.” Lando’s shadow slowly disappeared. It seemed as if the power was extinguished."
}