{
    "chapter": 2387,
    "title": "Permission to Enter Destiny’s Tower",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2387",
    "text": "“I failed again?” Han Sen looked pale. His power buzzed feebly, and his lifeforce was at a very low level.\n\nHan Sen had cast all the Dongxuan Sutra power that he was able to. He used all his energy trying to push the cogwheel and get it moving, so he could open its area and ascend to King class. Getting the cog moving should not have been this difficult.\n\nMany Dukes that were weaker than Han Sen reached King class with no trouble. Han Sen’s fitness and power let him fight most King class elites, but when Han Sen cast his Dongxuan Sutra, his own self-universe cogwheel would not move.\n\nHan Sen thought about the potential reasons for why that might be. The King area required its own universe cogwheel to spin within the universal machine.\n\nAccording to the theory, if he was powerful enough, he could move his own cogwheel to shift all the cogwheels that were connected.\n\nHan Sen was powerful. He was likely the only one of his kind as a Duke. So, his self-universe cogwheel was bigger than that of any other Duke.\n\nThe other Dukes had self-universe cogwheels that might only connect with one or two other cogwheels, but Han Sen’s self-universe cogwheel might connect with hundreds or even thousands of universal cogwheels. The more he was connected to, the harder it was to get it moving.\n\nClearly, Han Sen’s power wasn’t enough to push all those cogs at the same time. That was why it was so difficult for him to move up to King class.\n\nHan Sen decided to give up on his Dongxuan Sutra and bring his Jadeskin up to King class instead, but he soon noticed that this self-universe cogwheel was too strong, as well. It connected to too many universal cogwheels. So, leveling up Jadeskin to King class would be just as hard as ascending with the Dongxuan Sutra. The scariest thing, however, was that the Dongxuan Sutra could see the universal cogwheels. When Han Sen used Jadeskin instead, the cogwheels seemed blurry and indistinct. He couldn’t really see them, which actually made things harder.\n\n“The Dongxuan Sutra. The Dongxuan Sutra has the highest chance of letting me get my cogwheel spinning. Once I’ve ascended with the Dongxuan Sutra, it will be easier with Jadeskin. But how do I push the Dongxuan Sutra to get the cogwheels moving?” Han Sen thought about it for a long time, but no ideas were coming to him. It seemed impossible.\n\nBeing too strong had actually become a serious problem. Because his body was tied to four geno arts, getting just one of the geno arts to King class wasn’t enough to push his self-universe cogwheel.\n\nHan Sen only had one body, so it was impossible for him to use all four geno arts to level up at the same time. It was a scary thought, but even the conflict of his power and blood-pulse would be enough to annihilate his body.\n\n“It is fortunate that I only have four geno arts. If I had more, I could never make it to King class. Not even the holy pills could make my self-universe cogwheel move.” Han Sen tried to comfort himself.\n\n“Using my own power will never work. I have to use some sort of external power. But if I level up to King class using an external power, a single accident or loss of control could cause something far worse than failure to happen. My whole body would be destroyed.” All the time he had spent thinking hadn’t brought Han Sen to a conclusion.\n\n“I must find a reliable resource of power that is both stable and destructive. In that case, I may have to ask someone deified to help me. But what kind of deified elite would sacrifice something to help me? And who could I even trust?” Han Sen wondered. He couldn’t think of any reliable deified elites.\n\nOf all the deifieds he knew, Han Sen trusted the little red bird the most. But the little red bird’s power was a little too volatile, and its ability to control its power wasn’t very refined. It couldn’t perform such delicate work.\n\nOut of the deifieds who had the necessary level of control over their power, Han Sen thought Yisha would be the most reliable. It was the first name that popped into his head when he thought about who he trusted the most.\n\nYisha was actually his enemy, though. Even Han Sen was shocked to recall that little fact.\n\nBut despite that regrettable fact, he couldn’t think of any other deified that was as reliable as her.\n\n“It is a shame Yisha is still in Narrow-Moon. She cannot be the one to help me. I cannot leave King’s Kingdom,” Han Sen thought with a wry smile.\n\n“If I cannot ask for someone’s help, then I will have to borrow someone’s power. That will be the only way.” Han Sen’s eyes wavered with uncertainty.\n\nHan Sen was good with Yin Yang Blast and similar techniques. If he could borrow some stable and strong powers, perhaps he would be able to push the self-universe cogwheel.\n\nBut doing this was like dancing on the edge of a knife. Han Sen would be destroyed if things went south.\n\nHan Sen needed to use a power that was stronger than his own to push the self-universe cogwheel. He needed to maintain absolute, perfect control over a power that didn’t even belong to him. A minor mistake would be enough to cause a grand tragedy.\n\n“What a headache!” Han Selt thought, rubbing his temples. He still couldn’t come up with a solution to his woes, though.\n\n“My Prince, Princess Ten Bai Ling Shuang wishes to see you,” said Lilly’s voice from outside the door.\n\n“Why is she here?” Han Sen frowned. Because the Extreme King had been searching multiple planets for traces of Mad Sword, Han Sen hadn’t collected the fifty King class xenogeneic genes he was owed by Bai Ling Shuang. There was no sense in drawing attention to their little deal. He hadn’t expected her to come and visit him, though.\n\nWhen Han Sen entered the living room, he found Bai Ling Shuang there drinking tea. She looked very relaxed.\n\n“Princess Ten, why have you taken the time to come and visit me?” Han Sen asked casually, sitting down on the chair next to Bai Ling Shuang.\n\n“Because of the deal we struck. I have brought you the items we discussed.” Bai Ling Shuang raised her hand, and the two maids behind her presented Han Sen with a very large box.\n\n“Brother Sixteen, you may count them if you wish, but there are fifty King class xenogeneic genes. No more and no less,” Bai Ling Shuang said with a smile.\n\n“Sister Ten, you should have just told me. I would have gone and picked them up. You didn’t have to come all the way here to personally deliver them.” Han Sen laughed and opened the box. He counted fifty King class xenogeneic genes.\n\n“I am here because I have another big proposition for you, brother.” Bai Ling Shuang waved her hand, and all the maids dispersed.\n\nWhen he saw Bai Ling Shuang’s gesture, Han Sen turned and indicated that Lilly should depart, too. The hall emptied out, and only the two of them were left sitting in the room.\n\n“I have a reliable source who has confirmed that the exams will not be continuing this year. They will use the Rot Bone Mountain ranking. Brother Sixteen, you might be number one. In addition to the deified xenogeneic treasure, you will be given permission to enter Destiny’s Tower once. Do you plan to sell your admission ticket?” Bai Ling Shuang asked, her beautiful eyes staring directly at Han Sen.\n\n“Really?” Han Sen asked happily. Receiving permission to enter Destiny’s Tower would be great."
}