{
    "chapter": 2332,
    "title": "Extreme King Alpha’s Treasure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2332",
    "text": "Through the opening was a square hole which held a wooden box around the size of a football. Han Sen pulled the box out, and the statue returned to how it had been when he first saw it.\n\nHan Sen returned to sit in front of the statue. It didn’t have the sense of life that it had possessed before. It seemed that the statue really had become what it was supposed to be: a statue. There were no further hidden meanings to its existence, and the gourd in the statue’s hand didn’t summon that feeling of familiarity that it once had.\n\n“The statue really can only be activated once.” Han Sen was looking at the wooden box. He thought to himself, “This is what the alpha of the Extreme King left behind. It cannot be anything lame, surely. It must be a deified weapon or something of the sort.”\n\nThe box wasn’t locked, and when Han Sen opened it up, he was given a shock.\n\nThe wooden box held a jade gourd about the size of Han Sen’s hand. It looked like a green crystal. The crystal seemed transparent, but Han Sen couldn’t see what was inside it.\n\n“This jade gourd must have been carved. It isn’t a creature. Perhaps it’s a bottle shaped like a gourd?” Han Sen took the jade gourd out the box, but the gourd was entirely whole. There was no hole or seam that he could find.\n\nJudging from the weight and feel, it didn’t seem hollow, though. It was made of solid jade.\n\nHan Sen looked at the green gourd, and when he looked at its bottom, his fingers trembled. The bottom was flat, and a few words were carved on it.\n\n“For the leader of Sacred only.” Han Sen was given a proper shock after reading those words.\n\nAs far as Han Sen knew, there was only one “leader of Sacred.” And this thing was from the Extreme King alpha. This couldn’t have been some nameless, meaningless item.\n\n“Is the alpha of the Extreme King connected to the leader of Sacred? Otherwise, why would the Extreme King alpha have an item that belonged to the Sacred leader? Perhaps the Extreme King alpha received it sometime after the Sacred leader died. I still think they are related, though,” Han Sen thought to himself.\n\nHan Sen turned the jade gourd over in his hands to study it. He couldn’t tell what it did.\n\n“Whatever, I’ll just take it with me for now.” Han Sen put the jade gourd in his chest pocket. Then he picked up the wooden box and exited the Pavilion.\n\nHe knew many people would be watching the Pavilion, but he had no choice but to leave. He couldn’t stay there forever. He had to make an exit eventually.\n\nEven though he had gone through a lot of things, in the face of something like this, even Han Sen was quite nervous. He couldn’t be certain of avoiding exposure now, with all the eyes watching him and his disguise of Bai Yi.\n\n“Bai Yi! He is the one who…?” When Han Sen walked out of the Pavilion, all the Extreme King elites were surprised.\n\nMany high level people knew that Bai Yi had used Return to Origin on Han Sen. The only people that didn’t know Bai Yi now looked like Han Sen were the few who didn’t read the news.\n\nEven if they knew he was Bai Yi, though, they were still stunned. Even King Bai and Ancient Abyss were frightfully shocked. They hadn’t expected Bai Yi to have been the one to understand the statue.\n\n“That is a rare occurrence, indeed,” King Bai said, as he watched. That was all he said, and no one knew exactly what he meant by the cryptic remark.\n\nAncient Abyss looked at Han Sen. Then, he turned back to King Bai. “How lucky. Congratulations, your majesty.”\n\n“Luck has nothing to do with it,” King Bai said in a cool voice.\n\nThe other elites were even more shocked than King Bai. When Bai Wei looked at Han Sen, she felt a complex flurry of emotions.\n\nBai Ling Shuang’s face kept changing and twitching. When Miss Mirror looked at Han Sen, she frowned in thought.\n\nAmong the Extreme King, that day would be remembered for its stunning revelation. Prince Sixteen, Bai Yi, had claimed the alpha’s statue. It was like a miracle.\n\nThe alpha’s statue had been there for billions of years, and no one had been able to understand what was inside it. And Prince Sixteen, Bai Yi, who already had a bad reputation, had been the one to claim it. Everyone had their socks blown off.\n\nWhen Han Sen rode the blood kirin back to Planet Water Zone, even the Princess Lan Haixin couldn’t help but stare at him from atop the palace.\n\nLan Haixin didn’t understand how Bai Yi had been able to claim the alpha king’s statue. She found it a very hard thing to believe.\n\nHan Sen returned to his little building, closed the door, then started to play with his jade gourd. Aside from the words mentioning it was for the Sacred leader only, there was nothing else special about it. He couldn’t feel any special power residing inside it, despite searching it as thoroughly as he could.\n\nHan Sen had a look at it with his Purple-Eye Butterfly, and there was nothing to witness. But, that did prove that the jade gourd was unusual.\n\n“It is a shame Bao’er has gone undercover with Lan Haixin. It would be great if she was here. The statue’s gourd is so similar to Bao’er. Perhaps the jade gourd really is related to her,” Han Sen mused.\n\n“Dad!” As Han Sen was lost in thought, Bao’er came jumping toward him, holding a variety of packages in her small arms.\n\n“Bao’er, why are you back?” Han Sen was shocked. Bao’er was holding lots of food, and none of the goodies looked cheap. Her clothes were very pretty, too, and they obviously followed the fashion trends of the Siren.\n\n“I missed you, Dad!” Bao’er leaped into Han Sen’s chest and rubbed her face against Han Sen’s.\n\n“Dad missed Bao’er, too. But Bao’er, did Lan Haixin’s people see you coming?” Han Sen was hoping Bao’er had been able to get some information while he was away.\n\n“Don’t worry. No one saw me.” Bao’er gave the food to Han Sen. “You must have been eating bad food while you were alone. Allow me to give you the good stuff.”\n\n“Good good! You are so nice. You are the best daughter that a daddy could ask for.” Han Sen merrily accepted the food and started eating. Filled with curiosity, he handed Bao’er the jade gourd. “Bao’er, do you recognize what this is?”\n\nBao’er accepted the jade gourd and shook it. Then, she turned it upside-down. Something like water poured out of the jade gourd.\n\nHan Sen was given another shock. He had thought the jade gourd was solid. He hadn’t realized that there was something hidden away inside.\n\nThe liquid that came out of the gourd looked like water, but it wasn’t. When the liquid came out, it didn’t flow out onto the floor. It floated in the air, and it looked like a floating fairy. Rather than dividing into droplets, the fairy held together in a single floating pool. It looked similar to Han Sen using the Original Water King Body.\n\n“What is this? Han Sen was given another shock.\n\n“Help Daddy to shower,” Bao’er directed the water fairy as she held the gourd.\n\nThe water fairy came over to Han Sen and stripped all his clothes off. Then she twirled her finger, and a water air wrapped around Han Sen’s entire body. It made him feel as if he was in the embrace of a natural spring."
}