{
    "chapter": 1018,
    "title": "Crazy",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1018",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“What is it, Brother Han?” Liu Yuxuan asked, looking back at Han Sen.\n\n“There is something I need your help with, before your departure,” Han Sen said.\n\n“I’ll certainly help, if I am able to. What is it?” Liu Yuxuan said.\n\nWhat happened next would be up to him to decide.\n\n“Take us further,” Han Sen said, looking at Liu Yuxuan sternly.\n\nAt this request, his face changed. And he said, “Well, like I said, I would like to help you. Unfortunately, I am not too familiar with these roads. But, should you proceed this way and meet some misfortune, you can come back and seek me out. The offer for you staying at my shelter still stands.”\n\nLin Yuxuan’s tone of voice bordered one of mocking, as if he was trying to make Han Sen seem as if he was scared.\n\n“I have no problem going further, but you need to come with me,” Han Sen said.\n\nLiu Yuxuan was suddenly angered by the persistence of this request, and he moodily said, “Uncle San and Weiwei, did you hear what he just said? I am not one of you people, but I have helped you get this far out of the kindness of my heart. Haven’t I done enough for you? I even kowtowed on your behalf; what, do you expect me to die for you lot, too?”\n\nLin He looked at Han Sen and said, “Brother Liu, calm down. I’m sure you have misinterpreted Little Han’s words. Chill for a minute and hear him out, in full.”\n\n“He didn’t misunderstand. He has to come with us,” Han Sen spoke plainly.\n\n“You are crazy! Who do you think you are by telling me what to do!?” At this point Liu Yuxuan was yelling at the top of his voice. He went on to shout, “Uncle San, Weiwei, do you hear what he is saying? This guy is f*cking impossible to please; he wants even more?! Dogs would show a greater appreciation than this boy!”\n\nHan Sen coldly said, “I am crazy. I have been for a long time. Are you only just learning that now?”\n\n“The boy has a death wish. But whatever, I’m done with you!” Liu Yuxuan did his best to speak poorly of Han Sen, trying to discourage the group of travelers from supporting Han Sen any further.\n\nNo matter how powerful Han Sen had become, he had been in the Third God’s Sanctuary for a year. Most people would have only suspected him to have opened three gene locks at the most. Although Liu Yuxuan’s gene locks were weak, he still had eight of them. And what’s more, he had a sacred-blood turtle.\n\nLiu Yuxuan’s body was burning with a fire of utter hatred and contempt for Han Sen, and he growled, “You’re so cocky. You think you’re the best, don’t you? Come on, show me what you got!”\n\nOthers thought to say something, but before they could, Han Sen swung his fist.\n\nHan Sen knew why Liu Yuxuan was behaving the way he was, and he knew the man had a secret desire to get them all killed.\n\nWhat’s more, Han Sen was not a fan of negotiation. When he encountered a heated confrontation with someone he deemed evil, a quick fist was Han Sen’s favored method of achieving resolution.\n\nHan Sen’s fist traveled with a fire. Seeing it come, Liu Yuxuan transformed into a flaming snake that lunged at Han Sen.\n\nThe snake was ten meters long, and all Han Sen had was a fiery fist. The scene certainly looked unbalanced.\n\nBut when the two fiery figures collided, Liu Yuxuan was the one given the most shock.\n\nBoom!\n\nHan Sen hit the flaming snake, and ignited the body with a searing flame of a far crueler power.\n\nLiu Yuxuan dropped to the ground, rolling around on the grass and screaming in agony. He managed to utter a command to his turtle, which then attacked Han Sen.\n\nThe turtle’s first move was shooting water towards Han Sen.\n\nThis attack was rapidly dodged, and in retaliation, Han Sen jumped to the turtle’s head with Taia in hand.\n\nKatcha!\n\nThe turtle’s head was sliced off with ease. Blood squirted from the red, rhythmic pumping of its exposed throat.\n\n“Sacred-Blood Creature Armored Turtle killed. Beast soul gained. Consume its flesh to gain zero to ten sacred geno points randomly.”\n\nLiu Yuxuan continued rolling around on the ground, but the fire that was ruining his body refused to be put out.\n\nHan Sen picked him up and got rid of the flames himself, but the man was heavily damaged.\n\nLiu Yuxuan’s eight gene locks were nothing compared to Han Sen.\n\nLiu Yuxuan pretended to be a victim in this entire ordeal, crying tears while proclaiming, “Uncle San, Weiwei, Chen Hu… I helped you! What did I do to deserve this treatment?!”\n\nHe made himself look so wronged, others actually felt pity for him.\n\n“Maybe there really was a misunderstanding…” Lin He did believe Han Sen had been a little too cruel on him.\n\nBut Lin He trusted Han Sen’s judgment, and he knew there had to be a reason Han Sen was so willing to lash out against Liu Yuxuan.\n\n“I will explain later. You guys remain here.” Han Sen continued down the path, dragging Liu Yuxuan along with him.\n\nLiu Yuxuan yelled for help from the others, but he didn’t get any. Eventually, as Han Sen pulled him nearer the place he wished for them to meet their doom, he quieted down.\n\nHe was scared now; he was terrified of waking up the super creature that was said to lurk there.\n\nLiu Yuxuan, at this point, knew Han Sen had figured out what he had been up to. It had to be the reason why he had been dragged there like that.\n\nBut Liu Yuxuan believed Han Sen’s determined march into that wicked territory was merely a bluff. He thought Han Sen wouldn’t risk going too far forward. If Han Sen could not provide his party an explanation for what he had done, Liu Yuxuan thought there might be a chance to turn them all against each other and possibly crawl away from this entire affair with his life."
}