{
    "chapter": 2305,
    "title": "Choosing a Weapon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2305",
    "text": "Each grave had a special kind of spellwork laid across it. The veil of energy made it impossible to see what sort of treasure might lie within.\n\nBut through the viewpoint of the Purple-Eye Butterfly, Han Sen could see a replay of how the grave was constructed. That allowed him to see what was inside.\n\nBai Wei didn’t have any powers like that, so she didn’t want to waste time contemplating the fickleness of luck. She walked over to the closest crown grave, clearly intending to push it open.\n\n“Hang on!” Han Sen stopped Bai Wei from opening the grave.\n\nThe grave that Bai Wei was standing over held a decent weapon, but its level was still pretty low. It would be useless for their purposes.\n\n“What?” Bai Wei looked at Han Sen with some confusion.\n\n“That gravestone isn’t suitable for you. We should look around some more.” Han Sen smiled.\n\nNow that his ability to get resources was somewhat dependent on Bai Wei’s strength, Han Sen had to spare some concern for her development. The stronger Bai Wei became, the more resources he himself could enjoy. Han Sen wanted to help her as much as possible, because at the end of the day, he’d be helping himself. If she grew stronger, he would also benefit.\n\nBai Wei looked at Han Sen for a while. Then she said, “Which gravestone suits me, then?”\n\n“Let’s look around for a bit,” Han Sen said, walking forward.\n\nThe Grave of Soldiers and Kings was a very large planet. There were many xenogeneic treasures buried there, but most of them were useless.\n\nAlthough the ones with a crown symbol were usually better, their power was still dependent on their level, and these weapons were low level.\n\nHan Sen’s target was a deified weapon. If they couldn’t find one of those, he would settle for a lesser weapon, like a King class weapon.\n\nBai Wei walked behind Han Sen. Han Sen looked at all the graves, but she didn’t know what he was seeing. If Han Sen could determine something about the contents of the graves, she had no idea how.\n\n“What kind of weapon do you want?” Han Sen asked as he looked around.\n\n“Can I pick?” Bai Wei looked at Han Sen strangely.\n\n“Make a wish. What if it comes true? You should always have a dream.” Han Sen smiled.\n\nBai Wei looked at Han Sen for a while and said, “If possible, I would like a sword.”\n\nBai Wei figured that Han Sen would only ask her that question if he had some secret way of determining which weapon was inside each grave.\n\nThat sounded rather unbelievable to her, though. Royals always had trouble obtaining the weapons that they wanted in The Grave of Soldiers and Kings because of the veil covering every grave. The spellwork prevented weapon-seekers from using their powers to see into the graves.\n\nInside the Grave, only two powers could be used: luck and intense calculations.\n\nLuck was something very important both for commoners and nobles. At least, that’s what Bai Wei believed.\n\nEven the mathematics necessary to find the weapons was a quantification of luck. So, choosing a weapon was a test of luck, regardless of whether you attempted to calculate their positions like Mister White would.\n\nAlthough luck couldn’t really be forced, selecting a high-class xenogeneic weapon would really impress King Bai. It was very important to his sons and daughters.\n\nHan Sen kept looking around. When they reached a peak and walked right up to a small grave, he stopped.\n\nThe grave was only a meter high, and the tablet was breaking. But Han Sen was able to replay the process of creation with his Purple-Eye Butterfly, which revealed that a powerful deified sword resided within. It had to be a sword that once belonged to a deified king.\n\n“This is it.” Han Sen pointed at the little grave.\n\n“What is in the grave?” Bai Wei didn’t move. She looked at Han Sen.\n\n“Who knows? Perhaps it will be something that makes your wish come true.” Han Sen laughed.\n\nAfter Bai Wei heard him, she stared at the grave for a while. Then, she turned around to leave.\n\n“You don’t want to open it?” Han Sen asked Bai Wei in shock.\n\n“I trust your judgment, but please, find another grave for me. I would like a King class weapon, if possible,” Bai Wei said seriously.\n\nHan Sen nodded. He kept leading Bai Wei. He started to look at Bai Wei differently.\n\nAlthough Bai Wei was the daughter of a king, she wasn’t loved and she hadn’t been raised with a silver spoon. She wouldn’t have many chances to receive a deified item. Now that there was one in front of her, she was willing to give it up. Not many people could do something like that.\n\nThe Grave of Soldiers and Kings was a test for all the princes and princesses. Although choosing a good weapon didn’t actually mean you were better than others, the weapon would still draw attention.\n\nIf Bai Wei took a deified weapon, many eyes would turn toward her. It was difficult to guess how people would react. Even if they knew that Bai Wei had only gotten the weapon because of luck, they might still resent her for it. Perhaps Bai Wei would become hated.\n\nBai Wei gave up on the prospect of getting a deified weapon, planning to settle for a King class weapon instead. It would keep others from becoming intensely jealous of her, and at the same time, it’d be enough to give Bai King a decent impression of her.\n\nConsidering her current situation, this was probably the best choice for her.\n\n“It seems that Bai Wei is very ambitious,” Han Sen thought to himself.\n\nIf a person was careless, they would simply have taken that deified weapon. Bai Wei’s choice proved she was very ambitious, and that actually worried him.\n\nHan Sen kept walking until he reached another crown grave. He pointed at it and said, “Try this one. Perhaps you will get something you like.”\n\nBai Wei didn’t hesitate. She pushed the grave open, and the gravestone cracked, revealing a rectangular box inside.\n\nBai Wei opened the box. A large golden sword lay within. She grinned widely.\n\n“This is the sword that a King used to become deified. It is the King class Gold Phoenix Greatsword. You are really good!” Bai Wei said after merely glancing at the sword. She looked straight at Han Sen, taking stock of him.\n\nBai Wei had always looked up to Han Sen, but even so, Han Sen’s performances never failed to surprise her.\n\n“It was just luck.” Han Sen laughed. He looked around and said, “It is now my turn to pick a weapon. I can pick a weapon from any gravestone that doesn’t have a crown on it, correct?”\n\n“Yes, you can. And you don’t have to worry about people finding out what weapon you take. The weapons the Royal Guards select do not have to be registered. No one would pay attention. Plus, aside from the royal relics, it’s almost impossible to find deified weapons,” Bai Wei said.\n\nHan Sen nodded and then kept walking. He kept looking at every grave.\n\nOrdinary graves were just boxes of useless treasure. Most of the items were average quality at best. Picking out a good one for himself would be much harder than it had been for Bai Wei.\n\nHan Sen walked for two hours before coming to a stop before a specific grave. Nothing about the grave seemed special, but after Han Sen took a look, he pushed it open without hesitation. There was a little box inside the grave.\n\nThe box was small, only around the size of a hand. It looked too small to hold any powerful weapon.\n\nHan Sen didn’t look surprised, though. He opened the box and took out the ring it possessed."
}