{
    "chapter": 2653,
    "title": "Star Beetle",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2653",
    "text": "It really had been a coincidence that Liyu Zhen ran into Han Sen at the star tree. He had only just received the order to go there and take the test. He was there to take charge of the star tree in its current master’s absence.\n\nLiyu Zhen had received a piece of news that few others knew. Once the star tree’s elder left on his journey, he might never come back. If Liyu Zhen took the star tree now, it was likely that the star tree would forever belong to him. That was why Liyu Zhen was so hyped when he arrived there. Watching over the tree temporarily wasn’t a very important task, but becoming its permanent care-taker…\n\nBut when he found Han Sen already standing before the tree, he thought about how rude Han Sen had been to him at the lake. He was just a silkworm, and even so, he dared to offend the Very High’s Second Brother to his face. This was a chance to teach the whelp a lesson, or so Liyu Zhen thought. This wasn’t an opportunity that he could allow to pass him by.\n\n“Out in the rest of the universe, you might be some kind of generational prodigy. I can understand why you might believe you have a right to be so arrogant. But amidst the Very High, you are lower than dirt. If you don’t know that already, there is a high chance you won’t survive your tenure with us. I’m just trying to be nice so that Exquisite won’t end up being dragged down with you.” Liyu Zhen smirked to himself.\n\nThe old man then glanced at the tree around him and said, “If this is the way that we’re going to proceed, why don’t you two remove the bugs from the star tree?”\n\n“Remove bugs?” Han Sen asked, raising an eyebrow. This massive holy tree needed insect extermination? That was surprising, to say the least.\n\nBecause Han Sen had just learned of the tree’s existence, he didn’t know that part of the tree guardian’s job was to remove bugs from it every now and again. Otherwise, the bugs would eat and destroy the three’s fruit. That was what Liyu Zhen would have to do if he took over the job, anyway.\n\nIf Liyu Zhen hadn’t been present, Han Sen’s challenge would likely have been something different. However, because of the unique circumstances, the elder had decided that this test would be appropriate for both of them.\n\n“While we are performing this test, you cannot use treasure or any other special powers. You need to use your own strength to remove the bugs. And while you are doing so, you cannot bring any harm to the star tree. If you damage the tree, you will receive no reward. You will, however, be given punishment,” the old man said warningly.\n\n“Uncle, what kind of bugs are we removing?” Han Sen asked the old man politely.\n\n“There is only one type of bug that dares come close to the star tree,” the old man answered. “It is called a star beetle. You will know them when you see them. I will give you a day. You will pass if you can remove one thousand bugs. Each hundred you remove will account for one star fruit.”\n\nHan Sen was delighted to hear this. He had been worried that even if he did his job correctly, the old man wouldn’t allow him to collect any star fruit. Now that he had been given terms and conditions, he could rest easy. This was the best way to conduct business.\n\n“We start now. Tomorrow, at this time, you must return here. The bodies of the star beetles can stay on the tree. They will be cleared afterwards,” the old man said.\n\nHan Sen and Liyu Zhen bowed to the old man. Then, they both flew to the top of the star tree. Liyu Zhen looked at Han Sen and used Galaxy Teleport. He vanished into the tree while Han Sen had to continue flying up.\n\nThe star tree was a goliath. Each star fruit looked more like an asteroid. Han Sen flew as fast as he could, but it still took him an hour to get to the top of the tree.\n\nLiyu Zhen had started killing bugs a long time ago, but the tree was simply too large. Han Sen couldn’t see where Liyu Zhen was. So, he had to look for the bugs alone.\n\nSeeing the star tree up close, Han Sen noticed that the star tree’s leaves really did look like jade. The giant fruits were crystal-clear.\n\nBecause the old man’s request was very strict, Han Sen couldn’t do any damage at all to the star tree. Therefore, he didn’t dare touch the tree. He kept flying around it.\n\nSoon after, Han Sen found a bug lying on a branch of the star tree. It looked as fierce as a dragon, and it was the size of an adult bull. Its armor was sky-blue. The light coming from its shell shimmered and glittered like a tapestry of stars, and its face looked like the face of a stag beetle. It had eight claws, and it had a weird horn that was like a pincer.\n\nIt looked much more polished than an actual stag beetle, though. Its body was crystal blue, and it shone. It was hard to imagine it was considered a pest.\n\nThe old man had given him the order to remove the bugs without damaging the tree. Han Sen looked at the bug from afar, but he didn’t dive right in to kill it. He observed the bug with his Purple-Eye Butterfly first.\n\nWithout a doubt, the bug was King class. Judging from its lifeforce and presence, Han Sen was able to predict that it was a third or fourth-tier King. Such a creature wouldn’t be difficult for him to deal with.\n\nHan Sen wasn’t in a rush to do anything. He looked at the bug and thought to himself, “He said I cannot hurt the star tree. That means I cannot hurt it while I fight. I need to kill this bug in one blow so that it can’t damage the tree itself by attempting to fight back.”\n\n“It’s an empty-type xenogeneic, so its body doesn’t have an element. It is a xenogeneic based purely on raw strength. That means its shell must be extremely hard, far harder than those of xenogeneics of a similar level. Taking down a creature like this in one hit will be difficult,” Han Sen thought to himself.\n\nAfter observing the creature for a while, he was unable to discern any potential weak spots. Its entire body was clad in that starry shell. To kill the bug, Han Sen knew he would have to break through that surface.\n\n“If there are no weak spots, then I will just have to break it open with brute force. But using brute force will still have the same risks if I miss. If I don’t kill the bug instantly, and it struggles, it will likely harm the bark and the leaves on the star tree,” Han Sen thought, continuing to observe the beetle intently.\n\nLiyu Zhen, meanwhile, had reached the tree one hour before Han Sen had. And before he arrived, he already knew a lot of information about the beetles. Liyu Zhen knew their weak spots, and he knew how to kill them effectively.\n\nAfter finding a beetle, Liyu Zhen started taking it down. Liyu Zhen hadn’t practiced the Very High Sense, but the Very High had many geno arts. There were many top-notch geno arts available to learn. Liyu Zhen was a King; one of the best within the Very High, in fact. With many geno arts at his disposal, it wouldn’t be difficult for him to kill a King class beetle.\n\nThe beetle’s shell was extremely hard. Ordinary King class fighters of the same tier would have a hard time breaking through its shell, but Liyu Zhen only needed a few punches to destroy the beetle. He moved with insane speed.Liyu Zhen had found a few dozen beetles to kill before Han Sen had even reached the tree.\n\nPlus, when Han Sen found the beetle, he didn’t immediately attack. He stayed where he was, observing them for a while. By the time Liyu Zhen had killed a hundred beetles, Han Sen hadn’t even started fighting one.\n\n“Why isn’t Daddy doing anything?” Bao’er was holding Exquisite’s hand and looking into a mirror while she spoke.\n\nThe image in the mirror displayed both Han Sen and Liyu Zhen. Liyu Zhen had already killed one hundred beetles, but Han Sen had yet to do anything.\n\n“He is thinking about how to kill the star beetles,” Exquisite said.\n\n“What would he need to think about? Even Daddy’s fingers are enough to crush those little bugs,” Bao’er said curiously.\n\nExquisite didn’t answer, but the old man said, “He’s thinking about how to avoid harming the star tree if he moves to attack the bugs.”"
}