{
    "chapter": 1906,
    "title": "Hopeless",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1906",
    "text": "“This is the life a woman should have. I’ve wasted my life; I should have gotten rich instead.” Lu Xiaomei was as pretty as the next snobbish woman. She was reveling in the high-tier service, and she was almost in tears.\n\nBao’er called for a high-class massage, food, and drinks she had never tried before. She showed Lu Xiaomei what it felt like to be royalty.\n\nThis little witch can actually be quite cute. It is only just a kid, after all. Perhaps the creature is innocent, at times,” Lu Xiaomei thought. She observed Bao’er as she sipped on a drink.\n\n“Miss Lu, are you enjoying this service?” Bao’er was holding onto a bottle of juice as she sipped it with a straw.\n\n“Yes, I love it! This place is great. Your family has very good taste.” Lu Xiaomei had another sip of wine and felt so good.\n\n“I am glad you like it. You can come whenever you like.” Bao’er smiled.\n\n“Really?” Lu Xiaomei’s eyes looked bright.\n\n“Of course. I have already prepared a VIP card for you.” Bao’er clicked her fingers.\n\nQuickly, a waitress rushed over with a plate. She walked in front of Lu Xiaomei and put down the dish. Politely, she told her, “Miss Lu, this is your very own VIP card.”\n\nLu Xiaomei accepted the card, then saw a bill. The waitress said, “And yes, this your bill for the day’s services.”\n\n“A bill?” Lu Xiaomei’s face stiffened. When she looked at the bill, she almost fainted. She couldn’t even pronounce the sum, but with all the numbers, she knew it was more than exorbitant.\n\nThe muscles in Lu Xiaomei’s face twitched. She looked to be in a far worse state than someone crying their eyes out. “Bao’er, you gave me all this! Wasn’t this all a treat on you?”\n\nBao’er’s eyes opened wide, and she said with shock, “I am just a kid! I don’t have any money. I asked if this was what you wanted, and you said yes. You had me order all this.”\n\n“D*mn! This little thing must be doing all of this on purpose!” Lu Xiaomei almost coughed up blood. Bao’er’s cute face had turned into a demon mask.\n\n“I don’t care! I didn’t order all this. I am not paying.” Lu Xiaomei jumped up.\n\n“What are you saying? You’re not paying?” Bao’er looked at Lu Xiaomei with shock.\n\nLu Xiaomei wished to say there was nothing Bao’er could do but pay it herself, when all of a sudden, two eight-foot-tall women stepped into the room. They stood in front of her.\n\nLu Xiaomei looked at their beefy arms and hastily took back her words. She replaced them by saying, “I don’t have enough money to afford this.”\n\n“That’s okay. You are my teacher. So, why don’t you sign this paper, and then we can make this bill all go away.” Bao’er smiled and pulled a contract out of her little bag. She put it in front of her teacher, as if this was all going according to a scheme she had already planned out.\n\n“D*mn! She prepared for this.” Lu Xiaomei was grinding her teeth as she looked down at the contract.\n\nIt was a contract that required her to relinquish her very self. There were more than one hundred unfair terms on the contract, and if she signed it, she would be wholly owned by Bao’er.\n\n“I am not signing this, even if you kill me!” Lu Xiaomei said through gritted teeth.\n\nBao’er smiled. “Miss Lu, what are you talking about? I have a decent club, and I won’t hit you. But the stuff you have just enjoyed, the gambling you’ve done, even the look on your face when shopping… It has all been recorded. You like the teacher Mister Luo, don’t you? He’s handsome and rich, yes? He is even chasing you, you know. I’m thinking I should show him all the footage, and present him with your unpaid bill. The elegant image you have been clinging onto for so long will be gone with the wind. Think about that for a moment, and then reconsider whether or not you wish to sign this.”\n\n“Hellspawn! You are hellspawn! The stuff you have is so expensive. A cup of wine costs thirty thousand! This is a scam!”\n\n“The luxuries you have been enjoying were all imported from other planets. They are the best of the best, and some of them were even shura delicacies. Of course they are not cheap. If you’d like, you can check the prices on Skynet. If you happen to find that our prices are too high, we will certainly price-match.” Bao’er smiled.\n\nLu Xiaomei struggled a bit. She signed the contract because of the handsome Mister Luo. Then she started to cry. Bao’er patted her on the shoulder and said, “Don’t worry. Work for me for fifty years, and you’ll have paid off your debt. The contract will also be erased at that point.”\n\nIt would have been better if Bao’er hadn’t said anything. Now the woman really wanted to cry.\n\nLu Xiaomei began walking out of the club. Fortunately, Bao’er had already arranged for an aircraft to come and pick her up. If she hadn’t, she wouldn’t have had the money to get home. Everything she had belonged to Bao’er now.\n\n“You’ve gone off course. You should go to the Eastern Lake,” Lu Xiaomei said.\n\n“I’m sorry, who’s driving this aircraft again?” the driver asked snarkily, looking at her through his sunglasses.\n\nLu Xiaomei was furious. “Yeah, you are just the driver! Let me out so I can walk home.”\n\n“Sure.” The driver stopped the aircraft and landed.\n\nLu Xiaomei got off the aircraft and kicked the door closed. She said, “You are all bad people! This karma will come back to bite you one day.”\n\nShe turned and left. She eventually saw a familiar form walking nearby. It was her Prince Charming. It was Mister Luo.\n\n“After having bad luck for so long, finally, something good! My Prince Charming, here I come!” Lu Xiaomei walked towards Luo Yushu.\n\nBut just as she was about to greet him, she saw the woman with him. The woman was dressed sexily and holding his arm. She leaned close to him.\n\n“Luo Yushu, who is this woman?” Lu Xiaomei was so angry that she didn’t even care about maintaining her image. She grabbed his arm and pointed at the woman.\n\nLuo Yushu was shocked. The woman then said, “Luo Yushu, who is this woman?”\n\nLuo Yushu’s face changed, and he pushed Lu Xiaomei away. He explained to the woman, “Honey, listen to me. She works in the kindergarten with me. She keeps hounding me for my love, despite me constantly pushing her away. She has never stopped, and even now, she follows me around.”\n\n“Luo Yushu, what are you saying?” Lu Xiaomei was so angry. He was the one who kept chasing her, and she couldn’t believe what he was now saying.\n\nThe woman looked at Lu Xiaomei, rolled her eyes, and said, “You are just a teacher! And yet, you want to steal a man away from someone like me? Are you crazy? I can give this man pocket money, the likes of which you will never earn in your lifetime. Maybe when I grow tired of him, you’ll get your chance.”\n\nAfter that, the woman walked forward and pushed Lu Xiaomei back. She kept herself from falling, but she still dropped everything she was holding in her hands.\n\n“Apologize to me, and then pick everything up.” Lu Xiaomei was so angry, she wanted to throttle the woman.\n\n“Are you crazy? Get lost! I told you I am not interested in you.” Luo Yushu looked annoyed, and he also pushed her. He did not want her to hurt the woman he was currently with.\n\nWhen Luo Yushu pushed her, Lu Xiaomei fell back with nothing but anger and hopelessness.\n\nSuddenly, an arm grabbed her waist. It steadied her shoulders, then her body.\n\nShe opened her eyes and realized it was the driver with sunglasses.\n\nShe wished to say something, but the sky suddenly drew her attention. Many aircraft were suddenly headed towards them. In a minute, the vehicles had parked all around them, making the place very crowded.\n\nMany men, dressed in black with sunglasses, got out of their vehicles. They looked like gangsters as they gathered around.\n\n“What are you people here for? What do you want?” The woman and Luo Yushu began stepping back.\n\nLu Xiaomei looked at the aircraft around them: King, Steel, Silver, Ghost, Starry, Star, Miracle. They were all special editions that not just anyone could buy. Having a single one of them meant you were one of the super rich elite.\n\nNow that there were so many of them there, the woman and Luo Yushu were frozen. The men looked intimidating in their black clothes and sunglasses. It made the couple’s legs grow soft.\n\nThe men dressed in black ignored the woman and Luo Yushu. They all walked in front of Lu Xiaomei and said, “Second Lady.”\n\nLuo Yushu and the woman widened their eyes as if they had seen a ghost. They could barely stand on their feet.\n\nLu Xiaomei was just as dazed, too. She had no clue what was going on.\n\n“Second Lady, Miss Bao’er asked us to come and pick you up,” the driver said to Lu Xiaomei. And then, he looked at the woman and Luo Yushu and said, “Did these two bully you? I can kill them for you, if you’d like.”\n\n“Sorry, I didn’t mean to do that! I will pick the stuff up. Please forgive me!” The woman’s legs were wobbling, and she raced to collect all the items Yu Xiaomei had dropped.\n\n“She forced me, Xiaomei. I did this for our future together,” Luo Yushu said.\n\n“Go to hell!” Lu Xiaomei grabbed her bag and smacked him in the face with it. He hit the deck, so she went ahead and kicked him in the nuts. He writhed and screamed in pain.\n\nThe woman saw Lu Xiaomei looking back at her next. She slapped herself.\n\nPat! Pat! “It’s my fault. Please forgive me!”\n\n“Let’s go.” Lu Xiaomei gritted her teeth, and no longer paid them heed.\n\nThe driver opened the door to the aircraft, and there, Lu Xiaomei saw Bao’er. She cried and went over to hold her, saying, “Bao’er…”\n\n“Don’t cry.” Bao’er stroked her head and tried to comfort her.\n\n“Thank you, Bao’er!” Lu Xiaomei couldn’t help but cry a little. She did her best to hold back her tears and look at the child with gratefulness.\n\nYou are welcome. I used two hundred and twenty-three aircraft to help you. The fuel for each comes to a sum of around seventy-eight thousand. With the wages for the drivers, and the damage…” Bao’er fiddled with a calculator and whipped out another contract.\n\n“Hellspawn! You hellspawn!” The aircraft echoed with Lu Xiaomei’s screams."
}