{
    "chapter": 196,
    "title": "Ten Years of My Life",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_196",
    "text": "Huangfu sat up and said, \"In principle, the two sacred-blood ones had to be shown at the auction. But if you want it, I can sell it to you beforehand. In that case, we would have to trade with the estimated price. I am not the sole owner of the business and can do nothing about that.\"\n\n\"How much is it?\" Han Sen asked again.\n\nHuangfu took out her comlink and showed Han Sen the pricelist.\n\nWhen Han Sen saw the price of the harpoon, he said bitterly, \"230 million, that I cannot afford that.\"\n\nAll his property added up to more than 60 million, and he had three warframes. He did not plan to sell Silver Killer and the blue SKTS. Even if he sold the other SKTS, it would be an additional 70 million, which would still cover the price of the harpoon.\n\n\"The estimated price is certainly very high, mainly because this time Son of Heaven will be attending,\" Huangfu said. \"If you really want it. I could give you an employee discount, after which it would be 180 million.\"\n\nHan Sen then understood the immense profit margin in the beast soul industry and also learned how much a sacred-blood beast soul was worth.\n\nWith all his sacred-blood beast souls, he would become very rich if he sold them all.\n\nSeeing Han Sen remain silent, Huangfu said, \"If you still don’t have enough, I have a proposal, so that you take the harpoon without spending a penny.\"\n\n\"What proposal?\" Han Sen was slightly surprised.\n\n\"If you are willing to sign a contract and work for our company for two years, then the three-blade harpoon can be paid as the salary to you,\" Huangfu said slowly, looking at Han Sen.\n\nHan Sen hesitated, and then laughed. \"I did not know that I would be worth 100 million per year.\"\n\nHuangfu said, \"Even if you are the spokesperson of SKTS, I would not pay that kind of money to hire you. But after I saw your ability in Devil Desert, I know you will be a great help for us to do business in other shelters. Do you want to join us?\"\n\nThe reason why she went through the troubles to come to Blackhawk was to hire Han Sen.\n\n\"Thank you, sister. But I can’t agree to the terms.\" Han Sen did not hesitate to refuse her.\n\nAlthough her people would travel to other shelters and run into advanced creatures, for business’s sake, they would avoid risks and that was not what Han Sen wanted.\n\n\"Do not rush to refuse. You can think about it. We can negotiate your salary as well.\" Huangfu did not give up because of Han Sen's refusal.\n\n\"Sister, I am really sorry.\" Han Sen was very determined to turn her offer down.\n\nHuangfu did not expect Han Sen to be so direct. But since she was there already, she would not easily give up.\n\n\"Well, let’s change the subject then. Whenever you change your mind, you can always come to me.\" Huangfu opened a bottle of wine and poured it into their glasses.\n\nTaking a sip, Huangfu held her glass and said, \"As a member of the company, I have finished the work talk, and now we can talk about private matters.\"\n\n\"What are the private matters?\" Han Sen looked at her puzzled.\n\nHuangfu suddenly hugged Han Sen's arm and asked with a charming smile, \"Brother Han, do you have a girlfriend? If not, would you consider me?\"\n\nHan Sen spewed the wine he just sipped on Huangfu.\n\nThen he quickly took some paper towel to wipe it off her, but felt something was wrong. Under the paper towel were the magnificent boobs, which were bouncing when he wiped them.\n\n\"You...\" Huangfu’s cheeks turned crimson. She did not think it would turn out like this.\n\n\"I'm sorry. I'm sorry. I did not mean it.\" Han Sen took his hands back quickly but reluctantly.\n\nHuangfu bit her lip, and gave Han Sen a fierce stare, covering her wet blouse with her hands.\n\nHan Sen quickly took off his jacket and put it on Huangfu, covering the great view.\n\n\"Sister, now it’s late and we should get back. We can talk next time we meet,\" Han Sen said.\n\nThey were in a military school. And if Huangfu yelled \"help,\" he would be doomed.\n\n\"Until next time.\" Huangfu did not want to stay either. She did not want to sacrifice herself, but was only teasing him.\n\n\"It’s not so easy to escape from me.\" Leaving the private room embarrassed, Huangfu thought of the places where Han Sen stroked and her face was red like a piece of red cloth.\n\nHan Sen walked away and looked at his hands. \"That was magnificent.\"\n\nHuangfu was a calculating woman. And Han Sen was very sharp. When he touched her boobs, she had a sudden urge to kill him. Although she tried to hold it back, he still sensed it.\n\nAnd Han Sen also glanced at her comlink, which was blinking, and was likely to be recording.\n\nIf he did anything else and she taped it and showed it to Ji Yanran, he would be seeking small gains at great cost.\n\n\"No, it should be seeking big gains.\" Han Sen corrected himself in his mind.\n\nJi Yanran’s were not small either, but somewhat smaller than Huangfu.\n\nHan Sen went back to his dormitory and saw Shi Zhikang talking.\n\n\"Sen, great timing. Did you know there is a new exchange student who’s a babe?\"\n\n\"Exchange student?\" Han Sen pretended to be surprised.\n\nShi suddenly looked excited and said, \"Yes, a babe. She is beautiful, especially her... anyway, Huangfu Pingqing is now the absolute busty queen. Whoever sees her is so overwhelmed. If I could touch them just once, I am willing to give ten years of my life...\"\n\n\"Ten years...\" Han Sen subconsciously looked at his right hand, and thought, \"That is not OK, I will have to sacrifice so many years of my life.\""
}