{
    "chapter": 1827,
    "title": "Showing of Tusk",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1827",
    "text": "Yisha told Han Sen he had to prove himself if he wished to obtain more resources. So, Han Sen wanted this opportunity to show off. Now that this man had willingly delivered himself on a platter, Han Sen wasn’t going to let this chance slip away.\n\nThe man, who was named Gauss, looked at Han Sen angrily. If Han Sen had been using the Earl horse knife, he assuredly wouldn’t have been as enraged as he was now.\n\nBut Han Sen wasn’t using the horse knife, and neither was he using the knife he had been keeping with him. He just picked up a random blade off the ground. It was insulting, and that only fueled Gauss’ anger.\n\n“I want to see how cocky you can get.” Gauss brought out his own pirate knife. It was just a little bit shiny.\n\nThat was a Viscount weapon. He had managed to find it after the fourth rain. He was just a Baron, though, and he couldn’t make use of all its power. Still, the knife itself had a grand sharpness to it. With Han Sen now making use of an unranked knife, it’d likely crumble and break if the two knives collided.\n\nHan Sen didn’t really care, though. He swung his knife and thought it was pretty great for what it was. It was stable to wield, and it was definitely the sort of knife you’d use for chopping.\n\n“Why are you standing there? I thought you were going to teach me a lesson. Come on!” Han Sen said to Gauss.\n\nGauss’ face looked grim. Without saying a word, he stepped forward and tried to attack Han Sen. The pirate knife came like a shadow, trying to ensnare Han Sen like a net\n\nGauss’ knife skills were good. The power and speed showed off a high level of experience.\n\nHis technique was no weaker than Teeth Knife, as well. Teeth Knife was not just focused on prowess, though. It was the technique itself, and how it revolved around that teeth power, that made it stand out.\n\nBut Gauss was going after Han Sen. Han Sen might have looked young, but he was like an ancient beast Han Sen’s skill and experiences could not be remotely compared to what Gauss had endured in his lifetime.\n\nThe scary thing was that they were both Barons, yet Han Sen’s fitness was far higher than Gauss’ or any other Baron’s. There might have been some who were as strong as Han Sen, but they didn’t belong to the Rebate. No Rebate Baron had that level of power.\n\nSeeing Gauss’ knife net coming down to land on him, Han Sen stepped forward. He held up his knife and let the net fall onto it.\n\nGauss was shocked. His skill was called Shadow Knife, and rather than creating a real net, it made illusions. Many shadows fell from the sky, but one of them would be lethal.\n\nNormal people would not be able to tell which was the real shadow and which were fake, so most would retreat and attempt to block. This was the first time he had seen someone so willing to come against it where they stood. You would need a lot of confidence to stick to your guns like that\n\nAnd all the shadows Han Sen bumped into were illusions, too. He somehow avoided the real knife.\n\n“How did he know where my real blade was?” Gauss was shocked. He moved his body with the desire of striking again.\n\nBut it was too late. The others watched as Han Sen leaped through the net, raced over to Gauss, and drew his knife like a cobra strike.\n\nThe sides of Gauss’ neck had fanged cuts in them, as if he had actually been bitten by a snake. Blood seeped out of the bite marks.\n\nGauss held onto his neck as he stumbled back. His face turned pale.\n\nThe woman that accompanied him looked shocked. She couldn’t use Teeth Knife herself, but she recognized it. Han Sen was using Tusk. All it took was one meager strike to heavily damage Gauss.\n\nIn Narrow Moon, Gauss had to be in the top five of his class. His Shadow Knife was not as good as Teeth Knife, but it was still fairly infamous. Gauss also had a Viscount weapon, and the woman struggled to believe he had been unable to block Han Sen’s attack.\n\n“Let’s leave.” Gauss stared at Han Sen as he clutched his bleeding neck. He turned to leave.\n\nHe knew if Han Sen had attacked any deeper, he’d have been a dead man.\n\nWhen Gauss had left, Black Steel turned to Han Sen. “When you fought me, you didn’t use all your power.”\n\n“Weren’t you doing the same?” Han Sen smiled and dropped the knife back on the ground. He went on to say, “Let’s go. We should see if we can find a better knife. The knife rain itself will be harder to deal with than those people were. It’ll be terrible if I don’t get a good one. Oh, and if you can, could you teach me how to identify knives?”\n\n“No.” Black Steel refused. Then he walked forward to continue their search for a decent knife.\n\nHan Sen shrugged his shoulders and followed Black Steel. He saw the weapons all about and noticed that they didn’t radiate any power. All he could see was that they each looked different.\n\nBlack Steel hailed from a family of blacksmiths. Before the sixth round, though, he found a Viscount weapon.\n\nBlack Steel gifted the Leaf Knife to Han Sen. When Han Sen held it, he thought it felt different from the others. The texture was different.\n\nIn a hall that looked palatial, a Rebate man slowly approached and looked at Knife Queen. “Why take a student like that?\n\nThat’s not very you.”\n\n“Moon-Wheel King, why should you care about which student I accept?” Yisha responded evenly.\n\nMoon-Wheel King smiled. “You don’t have to answer to me on what students you accept, but you gave out resources that belonged to the Rebate. For this, you must provide an explanation.”\n\n“Is my student not worthy of a spot in the space tunnel?” Yisha said.\n\n“Your student might be worth hundreds of slots, but he is an outsider. Things aren’t so simple. Do you really want to raise him?” Moon-Wheel King asked.\n\n“That is my business. Don’t worry about it.” Yisha looked cold.\n\n“I just want to remind you of our rules. Don’t forget them. No one controls the entire race. Not you. Not I,” Moon-Wheel King said slowly.\n\n“I know better than you do. There’s no need for you to remind me.”\n\n“Good.” Moon-Wheel King smiled and then left.\n\nSeeing him leave, Yisha frowned. The things he said could not have been just him talking. Other kings must have been whispering in his ear; otherwise, he wouldn’t have bothered coming.\n\n“Han Sen, it is all down to you now, and how far you can go.” Yisha sighed.\n\nEven now, Yisha was not entirely sure whether or not she should commit to developing Han Sen."
}