{
    "chapter": 1036,
    "title": "Alu-Alu",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1036",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nSomehow, Han Sen’s Aero activated. He felt incredibly light, as if he could shoot off into the skies at any given moment.\n\nAs Han Sen continued his observation of the birds, he suddenly heard a rumble. He turned around and saw a wall on the left side of the hall rise up. Inside, there was a room.\n\nA three-meter-tall spirit was standing inside, and just a mere glance was all it took to recognize how monstrously powerful he was.\n\nHe possessed three eyes, all of which gleamed silver like the spirit’s hair. They looked alive and dripped with excitement.\n\n“A hundred-thousand-years. I, Xie Qing, am free once more!” He wasted no time, calling out at the top of his lungs. He was oozing a fever-like excitement.\n\nHan Sen watched the spirit with great surprise.\n\nWhen he arrived there, his Dongxuan Aura had been unavailable. As such, he had been unable to detect the presence of the spirit.\n\nIf the spirit had been trapped there for such a long period of time, there must have been something special about him.\n\nHan Sen wasn’t afraid, though. And he wouldn’t be, even if the spirit was a king spirit. He could always use his super king spirit mode, after all.\n\n“What are you looking at? Get over here and bow before me!” The spirit, who proclaimed himself to be Xie Qing, commanded.\n\n“Are you talking to me?” Han Sen asked, in shock.\n\nHe had mistaken Han Sen, a human, for a spirit. That was quite the error of judgment, not something likely to be done by a king spirit.\n\nHan Sen believed, if he had indeed been trapped down there for a hundred-thousand-years, the spirit would still believe humans to be primitive wildlings. Perhaps such a mistake was warranted, and maybe he didn’t even know anything about humanity occupying the shelters at all yet.\n\n“Are you a creature?” Xie Qing frowned. Perhaps he had been trapped in there too long.\n\n“No; I’m a spirit. I’m just special.” Han Sen held his fist as he talked, and he continued, “I am San Mu, my king.”\n\n“You are just a royal spirit, aren’t you? What is so special about you, exactly?” Xie Qing eyed Han Sen with suspicion. Still, there was a glimmer of a certain satisfaction, having heard Han Sen refer to him as a king.\n\n“Did you open my cell and free me?” Xie Qing King asked Han Sen.\n\n“I was simply walking around here, admiring the place. The wall opened up of its own volition,” Han Sen explained.\n\nXie Qing King looked at the room and said, “That cheap turkey! He used me to clear the invaders of this place. He played me like a d*mn fiddle, and I waltzed right into his trap!” Xie Qing King said, as he looked at Han Sen. “You said your name is San Mu? Follow me! When I claim the treasure, left behind by that turkey, I’ll give you a small portion as a reward.”\n\n“Thanks.” Han Sen bowed.\n\nHan Sen preferred peace. There was no need for him to create any more enemies if he could avoid it.\n\nPlus, the king spirit had not shown an ounce of hostility. Therefore, there didn’t seem to be any particular need to kill him.\n\n“Is that a baby?” Xie Qing King asked, as he looked at Bao’er.\n\n“Yes, it is my daughter. Her name is Bao’er,” Han Sen said.\n\nXie Qing King responded, “You are so weak. Why would you even waste time having a baby?”\n\nHan Sen thought it obnoxious. Powerful people always felt like only they should have babies.\n\nXie Qing King observed the hall as they went, seemingly lost in thought.\n\nXie Qing King walked across the hall to its other side and said, “This way. It’s high-time we checked out the turkey’s treasury.”\n\nHan Sen guessed the turkey he was referring to was Phoenix Emperor. Believing that the spirit indeed knew the way there, he saw no problem following him.\n\nBut in the next second, Xie Qing King’s fist blazed with a silver light. Then, he broke a wall that had been decorated with a number of avian symbols.\n\n“Alu-Alu-Alu!” Xie Qing King shouted, as he continued to punch the wall. He punched through a meter-thick wall of solid stone.\n\nHan Sen was shocked, at what the spirit had just suddenly managed to do.\n\nEarlier, he had tested it himself with his new Phoenix Sword. With a strike, he could only plunge it a single inch into the wall.\n\nFurthermore, Han Sen had been afraid of traps, so he had spent most of his time in the shelter with much care. This spirit seemed to be a little on the reckless side.\n\n“What are you doing over there? Come here and stay close.” Xie Qing King frowned, and then he went on to mumble, “I can’t believe I brought a dumb*ss with me.”\n\nHan Sen did not pay much heed to the insult he had been given, and he just followed as the spirit wanted him to.\n\nAfter exiting the hall, they came to a branching corridor.\n\nHan Sen wondered which way the spirit might decide to go, but again, he just started to chant “Alu-Alu.” Then he smashed the wall ahead of them with his fist.\n\nIn this way, they went on for some time. Han Sen stayed close behind, as Xie Qing King broke down wall after wall. He imagined the spirit would eventually get tired of doing that, but he never seemed to. He just kept on going, wall after wall.\n\n“He’s pretty cool,” Han Sen said to himself."
}