{
    "chapter": 1158,
    "title": "Night Treasure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1158",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen could not wrap his head around it, which was disappointing to him.\n\nHe thought the rock would be a tangible treasure he could take with him and somehow utilize, but as far as he could tell, it was just a large slab of rock hewn from an even bigger slab of rock. After a three-year investigation of its origin piece, Han Sen had not discovered anything inherently special about it, either. It was just a tough stone, for all the intents and purposes he could fathom.\n\nNot content with what he had found thus far, he decided to dig deeper. And so he did, swinging his shovel in a near-manic fashion.\n\nThe little Metal Eater remained there with him, staring. Its cute face suggested it was trying to figure out what Han Sen was doing and what drove him to behave in the way he was.\n\nAs long as the little creature did not squeal or bring other members of its family over, Han Sen did not mind its presence there. Perhaps being in its good books would help, even.\n\nWith his Devil Pill and his strength, Han Sen was like a human backhoe, and he was a few meters deeper into the earth in no time. Eventually, he found something else.\n\nIt appeared to be a rag, buried deep in the soil. Unfortunately, his shovel had pierced right through it.\n\nHan Sen pulled it out of the soil and was surprised to see it was fairly long.\n\nIt was shaped like a flag or banner, but it lacked any designs or symbols.\n\n“Can someone explain to me why I keep on digging up useless stuff?” Han Sen was getting disheartened by the constant stream of lackluster results. Regardless, he decided to summon Dragon King and ask him, “Do you know anything about these two thingies?”\n\nDragon King briefly examined the rock and shook his head, but when he looked at the flag in Han Sen’s hand, he said, “Oh, you’ve found a Night Flag! It bears the symbol of the Night Empress.”\n\n“Don’t bullsh*t me! Why would an empress make a flag out of a flimsy material that tears with such ease?” Han Sen said.\n\nDragon King frowned and said, “You don’t know anything. Do you see this? It was stitched from Night Silk; it just seems to have lost its energy, that’s all.”\n\n“Because it was buried for too long, maybe?” Han Sen asked.\n\n“Night Silk comes from the root of an emperor tree. Even if you threw it in a fire and kept it stoked for a thousand years, if you removed it, it’d come out undamaged.” Dragon King seemed confident, and he went on to say, “Night Empress’ bannerman, upon waving the flag, could even change day into night on a whim, if commanded to.”\n\n“Well, this can’t be it. This has to be some cheap, back-alley knockoff created by some wannabe cosplaying spirits. Look.” Han Sen pulled the fabric in both hands and tore it even more.\n\nDragon King just shook his head, indicating he did not know why it was so weak, either.\n\nHan Sen tossed the flag away and went back to digging. After a while, the hole started to collapse.\n\nHan Sen flew up quickly to avoid being buried. When he peered back down to where he had been digging, the ground had opened up to reveal a cave.\n\nHan Sen poked his head inside and discovered the cave wasn’t too big.\n\nThe place was semi-circular, like half a giant bowl buried far beneath the surface soil of the sanctuary. Upon further examination, Han Sen learned it really was a large bowl. And by his digging, Han Sen had unwittingly broken a part of it.\n\nThere, also, Han Sen discovered human remains. The clothes had almost wholly decomposed, and only the skeleton remained.\n\nDragon King was shocked to see this, and he blurted out, “I was half-expecting to see a king spirit, not a bannerman.”\n\n“How do you know it’s a bannerman?” Han Sen asked.\n\n“His clothes, see? It’s a uniform that appears to have been crafted from Night Silk; it was custom for bannermen to wear such garments.” Dragon King flew over to the body and continued, “This is a Night Bannerman. His forehead has an eye socket, see? Night Bannermen were Dark Cyclopses.”\n\n“Weird. You told me she gave thirteen coins to her favorite people. Why would a bannerman be given one?” Han Sen frowned.\n\nDragon King explained, “When she ascended to the Fourth God’s Sanctuary, the faction she had established collapsed. Lotus Queen worked her hardest to achieve what she has a hold of now, and as for the thirteen king spirits… they went missing. I, nor anyone else, know what became of them.”\n\nHan Sen approached the body and started to poke around it, seeing if there was anything he could loot. He was more than fine with looting the corpse of something that was non-human.\n\nIt was indeed Night Silk, but again, Han Sen was able to break the cloth with ease. The uniform was in tatters by the time Han Sen was done rifling through the pockets.\n\nHe was able to discover a few things.\n\nThere was an empty stone bottle, an old cloth, and a black cloak.\n\nEverything was rotten there, except for the cloak. It appeared to have been created from basic linen, despite its spotless condition suggesting it should be something else.\n\nDragon King, when he saw the cloak, continued to be on the observative ball. He shouted, “Oh my days! Why in the Sanctuaries would the Night Cloak be here, of all places?!”\n\n“Is this good, then?” Han Sen asked.\n\n“Night Empress wore this cloak herself. It was one of her favorite treasures.” Dragon King couldn’t keep his eyes off the garment.\n\n“Really? I can’t see anything special about it, personally.” He wasn’t quite willing to believe Dragon King’s outlandish claim.\n\n“If you could tell what this thing does, then it wouldn’t be the Night Cloak.” Dragon King paused to compose himself, and then explained, “Before she became an empress, she wore this cloak to go to Sky Palace. There, she assassinated Nine Emperor and achieved the title of empress for herself.”"
}