{
    "chapter": 2708,
    "title": "No Choice",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2708",
    "text": "“Leave me here and go on.” Han Sen could see that Exquisite’s face was drenched in sweat, and the energy flows in her body weren’t circulating correctly. He knew she had used Galaxy Teleport too many times. Her body had a limit, and she was almost tapped out.\n\nBut Exquisite ignored what Han Sen told her. She thought for a minute, then said, “I have found a way. We will teleport to Bao Lian. Bao Lian won’t let himself be trapped in the same God Spirit Storm he placed on you. So, if we followed where he went, we might be able to find a way to erase the power he put on you.”\n\n“That is useless. We won’t be able to find him now.” Han Sen shook his head with a tired smile.\n\nExquisite teleported away again, and her eyes slowly changed color. Her eyes darted here and there, but she couldn’t latch onto an image of Bao Lian.\n\n“Stop searching. He must have left the god area. He wouldn’t allow himself to go down with us,” Han Sen said. He had already figured as much, and this simply confirmed his suspicions.\n\n“There must be a way.” Exquisite’s face looked different from how it usually did, and that was because she was out of options. She could not control a place like the god area.\n\n“Seriously. You should go. The God Spirit Storm is coming after me, and I’m the one that challenged Bao Lian to a deathmatch. This is my responsibility,” Han Sen said.\n\nExquisite shook her head. “You are my silkworm. I’m not going to let you die.”\n\n“I thought that to the Very High, silkworms are just instruments to you. If I was to die, you would just find another one,” Han Sen said, meeting Exquisite’s eyes.\n\nExquisite shivered. It was just as Han Sen said; silkworms were little more than tools used in the progression and ascension of the Very High. And Han Sen wasn’t the only person who thought that. The Very High who studied the Very High Sense thought that silkworms were nothing more than toys of the universe. They looked at most people and creatures of different races like that.\n\nRight now, Exquisite was caught in an inner conflict. According to what she had been taught by her people, her course of action was clear. She should simply leave and select another silkworm.\n\nBut for some reason, Exquisite didn’t want to do this. She knew it wasn’t helping, but she kept teleporting Han Sen away, again and again.\n\nShe didn’t go to Li Keer, either. Doing so would have been pointless. It would just force Li Keer to flee with them, and things would continue to go downhill.\n\n“He is such a powerful silkworm. I will never find another one like one. If I’m to succeed in this life, I need someone like him. I must do what I can to save him.” Exquisite said all this to herself. Every time she teleported, she looked for a way in which she might be able to help Han Sen.\n\nBut no matter what she tried, there didn’t seem to be a way out of this predicament. There was nothing she could do to escape. Although the Very High were considered incredibly powerful, only a deified could sort this out. Exquisite was far too weak right now.\n\nExquisite’s aura became more and more disrupted, and her eyes were deeply bloodshot. Her face was colored a deep scarlet. Han Sen knew she had reached the end of her rope. She looked exhausted.\n\nHan Sen felt so touched by her dedication, but he was also in a hurry. For reasons that he didn’t dare think about while she was nearby, he needed Exquisite to leave him alone for a moment.\n\nBut Exquisite was too stubborn to leave him by himself. Her lifeforce was messed up, but she still used Galaxy Teleport to haul Han Sen around.\n\nAfter using Galaxy Teleport again, Exquisite fell into a coughing fit. Blood speckled her lips. She had used too much energy.\n\n“I’m really grateful for your determination, but you should leave. I will find a way to survive,” Han Sen murmured, supporting Exquisite’s shaking body as she coughed.\n\nExquisite wiped the blood from her mouth. She looked at the sky and saw the black clouds and the thunder. Her face was expressionless as she said, “If I cannot even save my silkworm’s life, how can I unlock the full potential of Sky and Man Combine Together?”\n\nWhen he heard her say that, Han Sen felt even more worried. Despite their dire situation, Exquisite was still refusing to leave.\n\nAs the God Spirit Storm formed again, Exquisite grabbed Han Sen and used God’s Wander to teleport away.\n\nBut this time, when they reappeared, Han Sen realized they weren’t far enough from the God Spirit Storm to reset the cycle. Exquisite had simply used up too much of her power, and she didn’t have enough juice left in her. Jumps like this wouldn’t take them far enough.\n\nExquisite noticed they were still under the same God Spirit Storm, and her face went grey. She tried to use more power to teleport again, but as soon as she moved, she coughed up even more blood.\n\nHer body was too exhausted to use Galaxy Teleport any longer.\n\nAs Exquisite’s body shivered and shook, Han Sen felt sick. If Exquisite had left, he could have easily sorted out this situation. But Exquisite’s strong will was causing him more and more trouble.\n\nEven so, Exquisite’s determination touched Han Sen deeply. After all, the whole reason Exquisite had stayed by his side was because of her desire to save him.\n\n“How many people exist who would truly sacrifice themselves on behalf of another? The Very High are a very complicated race, but why do people claim they are heartless?” Han Sen thought to himself.\n\nExquisite sensed what Han Sen was thinking, and an unreadable expression passed over her face. She looked at the sky and the God Spirit Storm coming, but she couldn’t move away.\n\nExquisite suddenly turned to him. “Han Sen, I’m afraid we won’t be leaving here alive today.”\n\n“We aren’t going to die,” Han Sen said quietly. He used the small jade figure to stop the sync of his seven senses. Exquisite could no longer feel his mind and emotions.\n\nExquisite kept talking as if she hadn’t heard what Han Sen had said. “I used to think that my little sister’s choices were ridiculous. I thought that the Very High Sense was the pride of the Very High, the legacy of our race. Little Sister wasn’t proud of our legacy. She always found ways to get around practicing the Very High Sense, too. She even got lazy, and I could never understand why.”\n\nBefore Han Sen could respond, Exquisite carried on by saying, “But now I seem to understand; having a heart that connects to the entire universe feels rather empty. The Very High forget about love. This teaching has been with our race for as long as we can remember. But despite all that, each one of us is just another creature of the universe. We aren’t machines. Sometimes, having a little heart can be quite attractive.”\n\n“You don’t have to practice the Very High Sense,” Han Sen said.\n\nExquisite shook her head. “I have no choice. Your fate within the Very High is determined for you when you are born. Li Keer didn’t have a choice. I didn’t have a choice. I thought Liyu Zhen was sad, considering that he would never have the chance to practice the Very High Sense. But now I envy him and the others. If I had the choice, I would prefer to be like them. I don’t want to practice the Very High Sense. I want to be like a normal member of the Very High.”\n\n“But that doesn’t matter anymore,” Exquisite said coldly, watching the God Spirit Storm sweep toward them. She sounded very calm. She almost sounded relieved. Either way, she didn’t fear death."
}