{
    "chapter": 1257,
    "title": "Fighting Fire With Fire",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1257",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nEmblazoned across the red shield, Han Sen noticed the faint outline of a fish. It was like a shark, but it was even more fearsome looking than that. Behind the head of this image, there was a tentacle-like limb that reached over. From this tentacle, something hung.\n\nHan Sen thought it was a human hanging from the tentacle. It was quite the unnerving picture.\n\nThe aquatic monster’s outline was large, and it encompassed the entire altar that was behind it, like some wretched sentinel.\n\n“Is this an image of the King of the Blood River?” Han Sen wondered, as the trio were slashing against the barrier that repelled their attempts to attack the third statue. Now, they acknowledged their power was not enough.\n\nThe shield had ten gene locks powering it, that much was for sure. Ordinary powers weren’t going to scratch it, let alone cut through it.\n\n“Let’s see who can hit harder, then.” Han Sen commanded his followers to stop attacking, then he activated his super king spirit mode.\n\nThe holy, white light began to gleam. Han Sen’s body shone like a deity of light; one with a coin between his fingers. The number on the coin began to ascend, one by one; a signal of its increasing power.\n\nThe fishman continued gathering its power, too, as Han Sen did the same on the opposite side of the barrier.\n\nBoth of their powers were like the rumbling and thunder from a couple of volcanos preparing to erupt. The sheer volume of energy that whirled throughout that chamber was frightening.\n\nThe fishman started to tremble. The power cradled in the basketball-sized sphere of water was equivalent to the amount needed to sunder entire mountains.\n\nBoom!\n\nThe fishman lobbed the orb of water like a hydrogen bomb, leaving its legs trembling with exertion.\n\nHan Sen’s body was also trembling with the power he had been summoning into the coin. Its number had now reached an all-time high, hitting twenty-one. The moment the sphere left its bearer’s hands, Han Sen let the coin fly.\n\nWithin the tiniest fraction of a second, the orb and coin collided in mid-air.\n\nThe power unleashed was crazy, and the shockwave caused by the impact was enough to send Little Angel and Disloyal Knight flying away.\n\nAmidst this carnage, Han Sen saw the coin pierce through the orb of water and cause a massive shockwave.\n\nThe coin did not stop there, however. It carried on through towards the fishman’s head, obliterating it. And in the immediate aftermath of that, the suction of the coin began to pull everything towards it like a magnet.\n\nThe altar was broken, and its remains all flew towards the coin as if it were a black hole.\n\nThe red shield had been shattered, and the fishman was no longer visible.\n\nBoom!\n\nJust as it looked like everything was over, everything was cast away in one last bout of chaos. Then, to accompany the ruin, the water that had previously been held back, began to pour inside.\n\nHan Sen quickly grabbed the final red gem before the entire place flooded.\n\n“Obtained Blood River King’s Battle Geno Essence.”\n\nHan Sen heard the same announcement play.\n\nThen, he grabbed Bao’er and started to make his daring escape. The first thing to grace his eyes, following the dash from that bloody arena, was the glory of moonlight. It made for a delightful return to the surface.\n\nHan Sen saw a very clear lake before where he stood now, and it did not at all seem associated with the Blood River.\n\nHan Sen flew around with Bao’er, but there were just mountains skirting the lake. There were no signs of that grand river.\n\nLittle Angel and Disloyal Knight emerged from the lake, and when he confirmed there to be no immediate danger, he returned them for the time being.\n\nHan Sen landed on the plush ground near the lake and noticed the jue had been following him. It was now near his feet. The fire inside it had depleted, and it went back to looking fairly ordinary again. Now, it looked like little more than an antique.\n\nWhen Han Sen picked it up, there was nothing more curious about it. It seemed to be what it looked like.\n\nHan Sen decided to pour another drink into the jue.\n\nThen he took a sip. It tasted just as good, but nothing wild or crazy occurred like it had last time. No more spooky symbols flared across his body, either.\n\nHan Sen wouldn’t mind killing a few more statues to obtain Battle Geno Essences, though.\n\nWhile the jue was still able to formulate the delightful sacrificial wine, it was no longer able to begin the sacrificial ritual.\n\nHan Sen summoned Dragon King. He was very knowledgeable when it came to peculiarities of the Third God’s Sanctuary, and Han Sen had frequently used him as an encyclopedia. Perhaps there was a chance he’d know what the jue was.\n\n“What do you want from me?” Dragon King still had no body, and every time he was summoned, it cost him a little bit more of his true self. Needless to say, this upset him.\n\n“Do you know what this is?” Han Sen knew he was upset, so he didn’t beat around the bush and asked him directly.\n\nDragon King looked at it, and his mood perked right up. He shouted, “Holy crap! Where did you get this from?!”\n\n“Is that a good surprise or a bad surprise?” Han Sen wasn’t sure whether the item was good or not."
}