{
    "chapter": 123,
    "title": "Hand of God Duel",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_123",
    "text": "With the explanation from Shi Zhikang, Han Sen got the gist of things.\n\nIn the beginning, Shi was playing against Birdy. Shi was rather poor at this game and hardly ever won on Battlenet, so he bragged a little after he had won several rounds against Birdy.\n\nShi had good manners, so he just bragged about himself and said nothing bad about his opponent. Even so, Birdy was mad and asked Mangod to avenge her. That was fine as well. Shi did show off and that was the consequence.\n\nHowever, Mangod cursed and said Shi was a dumbass. And Birdy ridiculed Shi as well.\n\nShi was not the type to let it go easily and was thus involved in a quarrel against the two. But after all, his gaming skills were limited and had no confidence when talking back to Mangod, which made Shi simmer with anger.\n\n\"Sen, help me kill destroy this disgusting couple. I’m so mad,\" Shi raged.\n\n\"Right away.\" Han Sen turned his comlink on and entered the game.\n\n\"Just you wait. I called my brother to kick your ass, and we will see who the dumbass is,\" Shi saw Han Sen entering the game and said to Mangod.\n\n\"Ha-ha, whoever comes will be equally useless. The brother of a scum must also be scum. I can beat as many scums as I want,\" Mangod said arrogantly.\n\n\"Well, just you wait.\" Shi urged Han Sen to log in.\n\nThe reason Shi was playing was that his application to join Hand of God Society was turned down. Although Zhang Yang and Lu Meng were accepted, they did not join either for his sake.\n\nFeeling sorry, Shi wanted to improve through practice and try to apply again later. After all, in addition to Ji Yanran, there were lots of pretty girls in that society and it would be a shame if they did not join.\n\nThat was why he was spending quite a lot of time on this game. Not expecting something like this to happen, he was furious and was counting on Han Sen to avenge him.\n\n\"Ha-ha, it does not matter who you called. Brother Long is the backbone of Hand of God Society, and top 20 in the contest last year,\" said Birdy proudly.\n\n\"Sweet sister, we have to be low-key and leave them some hope. Ha-ha…\" Wang Long grinned.\n\nIt was a rare opportunity for him to show off in front of a girl, so he had to do well. Wang Long was full of confidence.\n\nHe was a key member of Hand of God Society and knew every good player on campus. Even if he didn’t know them in person, he would recognize their ID. If someone better than him showed up, he would know and the person would probably recognize his ID as well and show him respect.\n\nSoon, Wang Long saw someone entered the room and checked the ID name. He almost burst out a laughter.\n\n\"My-girlfriend-is-Ji-Yanran, what a loser! What kind of loser would name himself that? He’s asking for trouble.\" Wang Long asked, \"This is your friend?\"\n\n\"Yes. You got a problem?\" Shi was not that confident. Last time when he was trying to register, Hand of God Society did have a good player named Wang Long. Although he knew Han Sen was good, Wang Long seemed to be one of the leaders in the society and was in top 20 on campus, so he could be considered a pro. Shi was not sure if Han Sen could beat him.\n\n\"Nothing. I intended to play casually, but now I see his ID, I have to kick his ass.\" Wang Long then sent Han Sen an invite.\n\nHan Sen did not hesitate to click on \"agree,\" and the two entered the game.\n\nBirdy who was watching ridiculed, \"He must be so horny that he named himself that. What a shame.\"\n\n\"We still don’t know who the shameful one is,\" rebutted Shi. Although he was not certain about the result, he would not let a woman throw mean comments at his brother.\n\n\"The result is clear. You scums could never win Brother Long. Well, maybe you can in your dream in another lifetime,\" Birdy said contemptuously.\n\nShi gritted his teeth and did not speak. If he cursed, he would be stooping to her level.\n\nAnd Shi was not entirely sure about the result. Wang Long was a top 20 player after all, it was questionable if Han Sen could beat him.\n\nWang Long was ready to teach Han Sen a lesion. And since it was a lesson, he could not limit his hand to the spots on his own side, but must make his opponent unable to touch any spot.\n\n\"Boy, it’s not your day. With such an ID, I will change my surname if I don’t beat you up.\" Wang Long saw the spots appear and reached out to the spots on the other side.\n\nBut just when his hand was out, he was surprised to see his opponent already hitting that spot. He soon decided it was just pure luck and he just needed to keep going.\n\nBut then everything happened after made his face freeze. And Birdy was simply dumbfounded.\n\nEach time Wang Long reached out, Han Sen had already hit the spot he was aiming for. And he had got zero point after a dozen attempts.\n\n\"Damn, I met a master.\" Being anxious, Wang Long gave up on hitting Han Sen’s spots and focused his own side.\n\nBut it was too late, the final score was 100 to 29. Han Sen got everything, and Wang Long only got 29 on his side and missed 71.\n\nSeeing this score, Birdy’s face darkened while Shi Zhikang laughed and texted, \"This is what you call top 20? Sister, you are fooled. One hundred to twenty-nine. If such a player could be top 20, then Hand of God Society must suck as well. Sister, listen to me. If he is lying to get money from you, that’s okay. When you haven’t lost your body to him, just stop...\"\n\nBirdy was quiet and Wang Long was pale. He immediately invited Han Sen again and thought maybe he simply used a bad strategy last time. Maybe he lost because he was aiming for the spots on the other side. He wanted to prove himself, otherwise it would be too big a shame.\n\nHan Sen clicked on \"agree\" and the two were at it again. Wang Long used all his efforts on his own spots and did not even look at Han Sen’s side. However, as Birdy observed, the difference in speed was so great that it was like bicycle versus motorcycle. Even an idiot could tell the two were not on the same level."
}