{
    "chapter": 301,
    "title": "Another Nest",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_301",
    "text": "The ghost butterfly boomerang made a curve in the air and flew toward the target.\n\nYang Zikun couldn’t help smiling. He could also make the boomerang fly in such a curve. However, it was impossible to hit the bull’s eye on the targets in the back with a curve like this. The two targets were so close together that a curve was never steep enough for the boomerang to hit the bull’s eye.\n\nIn a second, the boomerang was already next to the first target, and then it made a sudden turn to circle around the first target and hit the second one.\n\nEverybody was shocked. Without remote control, they had never seen a boomerang following such a strange trajectory.\n\nYang Zikun was also dumbstruck. However, because the target in the front was blocking people’s sight, no one could tell where the boomerang hit on the second target. Without a word, Yang Zikun quickly ran to the targets and pushed the target in the front away, exposing the target in the back.\n\nEverybody widened their eyes. The Z-steel ghost butterfly boomerang was in the exact center of the second target, not even slightly skewed.\n\nYang felt even more shocked and took down the Z-steel ghost butterfly boomerang, placing it in his hands and watching it closely.\n\nIt was a delicate but simple design, without any special parts. Obviously, Han Sen made the curve completely relying on the shape of the boomerang and his own skills.\n\nYang walked to Han Sen with the butterfly boomerang in his hand and said, \"I am convinced that you have great boomerang skills with this butterfly boomerang. I will listen whatever you say.\"\n\nHan Sen smiled and said, \"It seems that you are not completely convinced and think I have an advantage with this butterfly boomerang. That’s okay. I can give this one to you, and whenever you could reach my level, I will take you to Dark Swamp.\"\n\nYang Zikun’s eyes lit up, \"Do you mean it?\"\n\n\"Do I look like a liar?\" Han Sen smiled and said.\n\n\"Rest assured, I will be able to do what you did in a month,\" Yang Zikun said confidently.\n\n\"I sincerely wish you success.\" Looking at Yang Zikun, Han Sen thought to himself, The boy thinks the shape of the boomerang is all it takes. In fact, that was only a part of the reason. Indeed, the ghost butterfly boomerang is very important, but the key still lies in the combination of the yin and yang forces, which I learned from the spinning spear and Yin Yang Blast. Since you have never learned those, it would be impossible for you to reach my level.\n\nHowever, Han Sen did not want to ruin Yang Zikun’s confidence. It was a good thing that the young man was diligent, which would also save the special squad a lot of effort to cultivate him.\n\nWhen Yang Zikun had stayed longer in God’s Sanctuary, advanced meat would be provided to him. And when he had a better geno point count, it would be less risky for him to go to Dark Swamp.\n\n\"Captain, I did not imagine that you have great skills at boomerang as well.\" Yang Manli walked to Han Sen and gave him a rare compliment.\n\nHan Sen looked at her, pretending to be surprised. \"Did I hear this right? Are you paying me a compliment?\"\n\nYang Manli blushed a little and said quickly, \"I have reported to the management and will soon go to Second God’s Sanctuary. You will have a new deputy very soon.\"\n\n\"Thank you for your hard work in the last two years,\" said Han Sen cordially. Yang Manli had taken care of most business of the special squad, especially during the time he went AWOL, for which Han Sen owed her gratitude.\n\n\"First God’s Sanctuary does not deserve too much of your time. You don’t belong here,\" said Yang Manli and left.\n\nHan Sen knew this meant Yang Manli had recognized him as a leader.\n\nHan Sen sighed and thought to himself, \"Indeed, I don’t belong here. However, there is something I must get in the place. Before getting it, I will not leave.\"\n\nSeeing his previous enemies, friends, opponents, and lover became evolvers one by one, Han Sen did not feel that he was slower than anyone else. The reason he squatted was to jump higher.\n\nAs long as he evolved with his super geno points maxed out, Han Sen would definitely do better than everyone else in Second God’s Sanctuary. The difference in their goals determined how far they could go. The others could not even see where Han Sen was going.\n\nSince Han Sen came back, he had been working hard on Heresy Mantra and Panorama. Unless there was an opportunity to hunt sacred-blood creatures, Han Sen would not waste any time.\n\nEven so, just by joining other hunting campaigns, Han Sen had gained another seven sacred geno points, making his sacred geno point count 73, which was not far from 100.\n\nThat was not Han Sen’s end goal. He still only had 19 super geno points so far. It had been half a year since Han Sen started to feed the cloud beast, which had become a sacred-blood beast three months ago. It was still evolving and growing. Han Sen estimated that he still need another half a year for it to become a super creature, which was to say it would take one year for the black crystal to turn the creature into a super one.\n\nOne year was too long for Han Sen. He did not want to wait for more than a decade to evolve, which was why Han Sen wanted to hunt super creatures. However, Han Sen was still trying to complete the third phase of Heresy Mantra and he needed time to finish practicing Panorama. It will still take him some time to get ready to face super creatures.\n\nWhen Han Sen was about to go back to Blackhawk and practice Panorama in Gladiator, he suddenly heard some astonishing news.\n\nSomeone discovered a recently exposed nest in the mountains nearby."
}