{
    "chapter": 1046,
    "title": "Fight It",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1046",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Hide in the lake and only come out when I call you,” Xie Qing King commanded, as he saw the red inferno that was consuming the sky.\n\nHan Sen spared no time in agreeing, and so he quickly set about returning to the lake. He could feel a horrible power and presence headed his way, and it was better if he did not have to be the one to face it. That, and the fact he had now come to trust Xie Qing King, made him happy to oblige the request that he return to the restorative waters of the lake.\n\nXie Qing King was always alone. He never took on spirits, and neither did he ever contract creatures.\n\nHe had only recently been released from a hundred-thousand-year imprisonment. This incarceration changed him, and this is what led him to take on Han Sen as a protege. Unfortunately for him, Han Sen hadn’t been entirely honest about his identity.\n\nAs Han Sen watched the red sky ablaze with a violent firestorm, he suddenly saw a fireball come hurling towards them.\n\nThe fireball was then joined by an additional three. And as they came, they toppled trees and relit the already fire-ravaged land. Only the lake was still cool.\n\n“They’re not fireballs! That’s four super creatures!” Han Sen was worried, and he feared for Xie Qing King’s wellbeing. He had no idea if he could deal with such a threat.\n\nBut before he could voice any concerns, Xie Qing King had rushed ahead to meet the fiery felons. He re-entered the lake, but not without grave worry. If Xie Qing King fell, or if the fire-wreathed ravens came for him, Han Sen did not know whether or not he could make it out alive. He was still fairly weak, so he wouldn’t be in a prime condition to escape.\n\nXie Qing King’s body gleamed like a beacon of silver light, and he flew to engage the four renegade stars.\n\nAs Han Sen watched the violent suns, he could barely see the shape of the ravens inside the burning plasma of their power. But still, they were massive, and their wings had to be at least a hundred meters long. They looked as if they’d be able to incinerate the coldest, most frozen lands.\n\n“These guys are all stronger than that sheep king, for sure.” Han Sen gasped in shock.\n\nXie Qing King was not at all fazed, though. The orbs spewed wretched fire as the birds within cawed callously, but he did not fear them.\n\nThe landscape turned from black to red, and Han Sen felt as if he was living inside an active furnace. The fire was so hot, even the rocks of the mountainsides began to melt.\n\nFortunately for him, the lake remained cool and unaffected by the whirlwind of fire that encompassed it.\n\nStreaks of flame overwhelmed Han Sen’s vision of the sky, until there was nothing but a manic red blur above the surface of the lake. In the occasional lapse, he could catch sight of mountains crumbling, but that was it.\n\nHan Sen could now only hope that Xie Qing King would emerge victorious. The spirit was communicative and friendly, but the birds weren’t. If the spirit was killed, Han Sen would be unable to talk his way out of that situation, for sure.\n\nThe fire that ripped through the sky looked as if it could bring the entire world down.\n\nThe atmosphere was burning fiercely, and seemed like even gold could be melted within a few seconds of entry there.\n\nFortunately, Han Sen had maxed out his fire geno points and practiced Phoenix Flame. If he had not, he would have been cooked alive for just poking his head above water.\n\nSuddenly, Han Sen heard a raven unleash a screech. One of the orbs came hurtling down like a meteorite, crashing into a nearby mountain. Following its descent, the mountain started to crumble and cave in on itself, half-burying the fiery bird-beast.\n\nThe bird king’s body was crushed by the rubble, as lava streamed out of it like a substitute for blood.\n\nWhen Han Sen squinted to get a better look of the king, he noticed it was missing a wing. It looked as if it had been ripped off. There was also a deep gash right across its throat.\n\nThe bird king was still alive, but it could not get up. It let out the occasional dying screech, but that was all it could do.\n\nHan Sen thought to himself, “That’s a super creature. Should I finish it off?”\n\nThe temptation was difficult to resist. He knew doing such a thing was reckless, as the tornado of fire was still continuing to tear up the encompassing landscape. He didn’t even know if he could withstand a lick of those flames.\n\nThe other three bird kings were raging even harder now, too, to pick up the slack left by their fallen companion. The fires lashed the sky even harder, picking up trees and rocks, throwing whatever they could all about.\n\nAs the bird died and the flames subsided, the lava that was its blood began to solidify.\n\n“YOLO!” Han Sen placed Bao’er in the water and ran out of the lake. He dashed and danced between the raging fires to reach the dying bird king.\n\nHan Sen had Aero to aid his evasions, but that was about it. He was still too weak to use it for fighting, and he didn’t have a bow to shoot it from the safety of the lake, either.\n\nHan Sen just had to get in close and deliver a firm slash with his Phoenix Sword.\n\nAs he raced through the blazing fields, he felt as if he had taken a dip in a pool of lava. He activated Phoenix Flame for increased resistance, but the atmosphere around was still blisteringly hot.\n\n“This is frightening, to be honest. If anyone else took a step out here, they’d be burnt to a crisp,” Han Sen thought, as he made his way to the fallen bird.\n\nThe fact that there had been four of the birds made the fire so terrifying. Had there been only one, Han Sen thought he might have stood a chance of taking it down.\n\nHe possessed Phoenix Flame and maxed out fire genes, and for now, it was enough to keep him safe as he sprinted towards the dying bird king."
}