{
    "chapter": 160,
    "title": "My Mother Says Girlfriends Are for Cheeky Guys",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_160",
    "text": "Ji Yanran bowed her head and bit her lip. She had mixed feelings and had never dreamed that she would feel this way.\n\n\"Sister, shouldn’t you honor the contract now?\" Han Sen pouted.\n\n\"You cannot expect me to do this in public.\" Ji Yanran looked like she was drunk with her crimson cheeks.\n\nHan Sen’s heart suddenly raced. He widened his eyes and said, \"Do you want get a room?\"\n\n\"Shut up!\" Ji Yanran threw her cup at Han Sen and turned away.\n\nHan Sen caught the cup and quickly followed her. He walked side by side with her and touched her arm with his.\n\n\"What?\" Ji Yannan snappily glared at him.\n\n\"A couple should walk like this.\" Han Sen put Ji Yanran's hand on his arm and said with a smile.\n\nJi Yanran’s cheeks were flushed, but she did not pull her hand back. She rolled her eyes and said, \"Cheeky!\"\n\n\"My mother said girlfriends are for cheeky guys,\" said Han Sen without shame.\n\nJi Yanran was trying to say something when she saw a few students approached them. She quickly lowered her hood like a frightened little rabbit. Holding Han Sen's arm tightly, she used it to cover her face.\n\nAlthough Ji Yanran hid herself well, the students still came over to greet Han Sen.\n\n\"Han Sen! Are you Han Sen?\"\n\n\"You are my idol.\"\n\n\"Your game was so great! Your skills are amazing!\"\n\n\"...\"\n\nThese freshmen talked excitedly to Han Sen, who had become a celebrity at Blackhawk.\n\n\"This is your girlfriend?\" Soon they noticed the Han Sen had a girl next to him, but did not recognize Ji Yanran since she was hiding her face.\n\nJi Yanran now wanted to find a hole on the ground and escape. She could not leave and did not want to stay.\n\n\"Yes, my girlfriend. She is shy and does not like to speak,\" Han Sen said with a smile.\n\n\"Quiet girls are great...\" commented the students, and Han Sen was very happy to chat with them.\n\nAt this time, Ji Yanran was tightly holding his arm, and he could feel the softness surrounding his arm, which he enjoyed very much. Han Sen hoped he could prolong the conversation as much as possible.\n\nBut the students were very polite and did not want to disturb them. Han Sen had to let them go.\n\n\"You did that on purpose!\" Ji Yanran pinched Han Sen on the waist after the students had gone far.\n\n\"What's wrong with that?\" asked Han Sen.\n\nJi Yanran was speechless. Han Sen took her hand and continued to walk.\n\nIt was the middle of the night. They did not run into anyone else before they reached Ji Yanran’s dormitory building.\n\n\"Sister, you will not go back like this, right? The contract has not been fulfilled yet,\" Han Sen bitterly said.\n\nJi Yanran rolled her eyes at him and reached out a hand. \"Give me the contract.\"\n\nHan Sen obediently gave her his contract. She took the contract back, blushed and said, \"Close your eyes.\"\n\nHan Sen followed her command.\n\nJi Yanran took a deep breath and fought back her desire to escape. With her heart racing, she stood on her toes, pressed her pink and tender lips on his lightly, and quickly turned away.\n\nIt was too late. Before her lips could leave his, his hand held her waist and his other hand slipped into her silky hair and hugged her beautiful neck.\n\nJi Yanran was suddenly in Han Sen’s arms and her lips were pressed against his.\n\nJi Yanran's body was stiff at first, and then slowly softened. Her hands helplessly clutching Han Sen’s shirt, she stepped back uncontrollably as her legs became weak.\n\nHan Sen just had the best experience and would not let her off the hook. He kept up with her and pressed her body against a column of the building.\n\nThe two just had the first taste of love and was lost in ecstasy. Suddenly, they heard a crisp female voice, \"Friends, at least you should find somewhere less public before you continue.\"\n\nJi Yanran heard this voice and was suddenly terrified. It was the voice of Qu Lili, her good friend and roommate.\n\nHer first reaction was to push Han Sen away, but she could not do that since she would expose herself.\n\nJi Yanran quickly buried her head in Han Sen’s chest, her face on fire. She also blamed Han Sen secretly for putting her in this awkward position.\n\n\"Sister, why don’t you go to bed now that it’s late? Do you want to join us?\" Han Sen knew Ji Yanran was shy, and covered the back of her head with one hand, blocking Qu Lili’s sight.\n\n\"Shameless!\" Qu Lili stomped on the floor and ran back to her dorm room.\n\nAfter Qu Lili went up, Ji Yanran brought the heel of her shoe hard on Han Sen’s foot and ran into the building, leaving Han Sen clutching his feet.\n\nJi Yanran did not dare to go back to her room right away. She hid in a restroom for a long while before she returned to her room.\n\nQu Lili saw Ji Yanran was back and said, \"Sweetie, did you see that nasty couple downstairs?\"\n\n\"What nasty couple?\" Ji Yanran pretended to be making her bed, her face crimson.\n\n\"The couple that were making out in front of our building. OMG, are they horny! And the guy is so shameless, he even said… forget it. I can’t even repeat that. And the girl must be such a slut!\" Qu Lili said madly.\n\nJi Yanran was so shy that she wished she could become invisible, but she had to acted like nothing had happened."
}