{
    "chapter": 943,
    "title": "Defending the Shelter",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_943",
    "text": "\"This is...\" Old Huang and everyone there looked at the Dragon-Blood Snake in wonder. They thought it was some small, average pet beast soul.\n\nHan Sen let the pet do the explaining for him, by having it unleash its gene locks.\n\nWhen the first gene lock opened, the Dragon-Blood Snake's body grew to the size of a tiger.\n\nWhen the second gene lock opened, the Dragon-Blood Snake's body grew to the size of a bull.\n\nWhen the third gene lock opened, the Dragon-Blood Snake's body grew to the size of a golem.\n\nWhen the fourth gene lock opened, the Dragon-Blood Snake's body grew to the size of a giant beast.\n\nWhen the fifth gene lock opened, the Dragon-Blood Snake's body grew to the size of a dinosaur.\n\n\"A pet beast soul with five of its gene locks opened?!\" The plaza gathering had quickly become an audience, and they were each amazed by the mutant pet.\n\nThen, the Dragon-Blood Snake hissed and grew in size one more time. Its red-scales glistened as it became a terrifying beast of gigantic proportions. It looked ready to murder any that offended it.\n\n\"Six gene locks? The best possible mutant pet one can claim?!\" Someone in the crowd shouted.\n\n\"Old Huang, with this snake... Do you think we stand a chance of repelling those who seek to remove you from your home?\" Han Sen posed the question.\n\n\"That just may be possible.\" Although he tried to hide it, his loosely bottled excitement began to overflow.\n\nAlthough the spirit shelter that opposed them had many creatures, it was very unlikely there'd be a creature amongst them with an open gene lock tally anywhere close to the snake's.\n\nMutant creatures could open six gene locks at the most, but that did not mean it was achievable for all mutant creatures.\n\nAnd now, it wasn't only Old Huang who got excited, as hope of a future in their shelter returned to the crowd.\n\n\"This mutant creature can at least kite three creatures for us, and with us there, valiantly fighting alongside it, we may just pull through!\"\n\n\"Yes; let's fight and prove to that spirit we're not to be messed with.\"\n\n\"We're not leaving this place; f*ck those spirits!\"\n\nAside from a few of the elders, everyone who saw the snake had a change of heart they were keen to vocally express.\n\nOld Huang told everyone to calm down soon after, however, and then told Han Sen, \"I would like to ask you a few questions, Han Sen. And I would like you to answer my questions seriously and truthfully. This is a matter of life and death.\"\n\n\"I will gladly answer your questions,\" Han Sen said in response.\n\n\"Where did you come here from? Did you travel here from another shelter?\" Old Huang asked.\n\n\"Yes.\" Han Sen nodded.\n\nHearing this, Old Huang also nodded. Then he asked, \"If we succeed, will you remain with us?\"\n\nEveryone understood what Old Huang was implying.\n\nEven if they could withstand the attack, Han Sen's absence after that would mean they'd have no more manpower if something sought to retaliate. They would still be vulnerable.\n\nFighting now would be pointless if it meant they'd only fall in the future.\n\nEveryone looked at Han Sen, hoping he would choose to stay.\n\n\"I will leave,\" Han Sen answered.\n\nEveryone looked disappointed. It felt as if their new-found hope had been dashed across the rocks.\n\n\"I appreciate your honesty.\" Old Huang did not hold it against Han Sen and understood why he'd leave.\n\nHan Sen was a famous person of much renown. He had a Dragon-Blood Snake with six of its gene locks open. He was destined for a place greater than the little shelter he had stumbled upon. He was bound for someplace far grander, for sure.\n\n\"I have not finished. I said I will leave, but only under these two conditions; firstly, we claim that royal shelter. Secondly, if we fail, I leave the snake behind,\" Han Sen said.\n\nEveryone looked surprised, and in response, Old Huang asked, \"Do you speak the truth?\"\n\n\"If you don't believe it, I can give you the snake now.\" Han Sen was not afraid of any potential theft, and didn't think they'd refuse to return it. Had they sought to, there was nowhere they could run off to. They were in the middle of the woods with a small army of creatures preparing to wipe them off the face of the sanctuary. To do so would be futile.\n\nIf the people did not stand and fight for their shelter, they'd most likely run off into the forest. And gauging the strength they possessed, Han Sen believed they did not have the mettle to survive in that domain.\n\nHan Sen knew the end result if they chose to flee, so he felt compelled to help them.\n\nHan Sen would use this opportunity to raise his mutant geno point tally, too. It was far more difficult to do when flying solo, after all.\n\nThe people there weren't that strong, but many could challenge and rival mutant creatures in strength.\n\nIf Han Sen could use this opportunity to obtain a royal shelter, it would be a terrific result, as well.\n\n\"Little Han, you are the president's son-in-law, so of course we believe you.\" Old Huang was not stupid, and he most certainly would not have kept the snake.\n\nNow, following Han Sen's promise, everyone readied themselves for a fight and geared up in the best armaments they possessed.\n\n\"So, which shelter seeks to destroy you? And what is its master?\" Han Sen hadn't been told the name of the shelter that sought to conquer them, so he asked for elucidation.\n\n\"It's Thorn Shelter, and its master is Thorn Baron. She is a royal spirit, and she is wickedly powerful,\" Old Huang said.\n\nHan Sen was surprised to receive this answer, and so he said, \"Ah, then we are in the regions that belong to Thorn Shelter?\"\n\nHan Sen became the de facto leader of the shelter for the time being, and others relied upon him to establish and organize their defenses and tactics for the coming battle. He was capable, when it came to leading others; he might not have had what it took to command large armies, but a group of about thirty people was within his comfort zone.\n\nHan Sen was able to use his formations to effectively coordinate the others.\n\nAt first, others did not trust Han Sen, but after some more practice with the formations, they listened and paid greater heed. They soon realized the true talent he had, and so they were all able to work together in greater cohesion and synergy.\n\nThree days later, the spirit army had yet to arrive. Han Sen traveled to a nearby knoll, to see if he could spy any movement."
}