{
    "chapter": 3061,
    "title": "Favor for the Savior",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3061",
    "text": "Li Bing Yu’s will was very strong. She awoke from her coma very quickly.\n\nThe moment she opened her eyes, Li Bing Yu saw Han Sen’s smiling face. She remembered what she saw before she passed out and immediately jumped from the ground, staring at Han Sen.\n\nLi Bing Yu remembered Han Sen had been wrapped up in a red fire. It was like a God Spirit had descended. One punch sent the blood ghost spirit flying.\n\nShe looked at Han Sen. At first, she was shocked, but now she was just confused. That confusion was now changing to a more complicated emotion.\n\nIf this was really Ghost Kill, she would think Han Sen was strong. She would not have been able to understand what being strong meant. Li Bing Yu was different. Her real identity was one of the nine leaders of Wu Wei Dao Palace. Her knowledge was much more extensive than Ghost Kill.\n\nA rare gene race like the blood ghost spirit had been punched once and sent flying by Han Sen. Seeing the situation as it was now, the chance that the blood ghost spirit had been killed by Han Sen was in the range of 80% to 100%. That was something the word “strong” could not describe.\n\nEven in Wu Wei Dao Palace, that kind of elite was very rare to see.\n\nA character who had that sort of frightening power but was not famous was very hard to believe.\n\nHan Sen looked at Li Bing Yu and asked, “Are you OK?”\n\n“Who are you for real?” Li Bing Yu asked as she intensely stared at Han Sen.\n\n“My name is Han Sen. Do you not remember me? Oh, no! Did you hit your head? Do you remember we followed Peaceful to Ancient Big God Mountain…” Han Sen kept speaking and using his fingers to touch Li Bing Yu’s forehead. He checked out her pupils, trying to confirm if her brain was rattled.\n\nLi Bing Yu was angry. She smacked Han Sen’s hand away and coldly said, “Stop making fun. If you were able to beat the blood ghost spirit, how are you a nobody? Furthermore, why did you make me unconscious?” Han Sen spread his hands and explained. “I really am just a nobody. There is nothing I can do about that if you do not believe me. I only knocked you out to heal your wounds. It would have been very painful if you were awake. I was unable to numb your body, so I had no choice but to knock you out so you would not have to feel the intense pain.” He looked sincere.\n\nLi Bing Yu remembered she had been badly injured, and the blood ghost spirits’ power had overwhelmed her body. It covered her God Spirit Blood-Pulse.\n\nNow, the blood ghost spirit’s body was no longer inside her. The wounds she had incurred were already healed. Clearly, Han Sen had helped her get rid of the powers of the blood ghost spirit.\n\n“Where is the blood ghost spirit?” Li Bing Yu looked strange as she hovered around, unable to locate the body of the blood ghost spirit.\n\n“He ran,” Han Sen casually said as he stood up. “If you are OK, then we should get out of here. Peaceful escaped, and we do not know what or where this hidden god pulse is. We should return to Ancient God City first.”\n\n“Hang on.” Seeing Han Sen turn to leave, Li Bing Yu flashed and prohibited his departure. Her pretty eyes stared at Han Sen.\n\n“What is going on?” Han Sen smiled.\n\nGhost Kill thought, “Although things have not gone to plan, this is a good chance for me to get closer to him. I cannot let this opportunity slide.”\n\nThinking of this, Ghost Kill looked calm. She looked at Han Sen and slowly said, “I, Ghost Kill, never want to owe someone anything. You saved my life, which means my life is yours.”\n\n“Why would I want your life?” Han Sen laughed.\n\n“It is up to you, but I do owe you my life,” Ghost Kill seriously said.\n\n“Then, how are you looking to pay me for it?” Han Sen looked at Ghost Kill with interest.\n\nGhost Kill did not think twice. She immediately said, “From now on, I will follow you. If anyone seeks to do you harm, they can only do so over my dead body. I will save your life, no matter what the cost.”\n\n“There is no need for that trouble. People can’t really pay back the life-saving thing. If you use your body with me, you won’t have to die. So, why don’t you just do that?” Han Sen smiled and looked at Ghost Kill as he spoke.\n\nGhost Kill’s expression changed. She gnashed her teeth and said, “You might have saved my life, but that does not mean you must humiliate me.”\n\n“Never mind. If you don’t want to do that, then there is no point in you following me. Let’s go our separate ways.” Han Sen turned around and walked away. He did not want someone like Ghost Kill around him, so that was why he said what he had.\n\nGhost Kill’s expression kept changing. She gritted her teeth and followed. She did not say a word as she tailed him.\n\nHan Sen knew the lone sky dragon was still out on the prowl. He had exhausted a lot of power earlier. He did not have any more power left to break the world’s rules as they stood. So, he was not able to combat the lone sky dragon by himself. He had to find another way.\n\nThe blood ghost spirit and the gold wing peacock king were stronger than the lone sky dragon, but they were just juveniles. They were unable to fight the lone sky dragon just yet.\n\nThe stone palace was not very big. After having a mosey around, they were not able to find another exit.\n\nLi Bing Yu crouched on the ground and investigated the dead body. She was unable to find anything. She figured Han Sen had probably searched it while she was unconscious. She just didn’t know what it was he might have found.\n\nHan Sen buried the skeleton and said, “There are no other exits. Do you have a way to walk around where the lone sky dragon roams? We need to avoid where the blood ghost spirit lies too if we are to get out of here.”\n\n“There is one way we can attempt.” Li Bing Yu pointed her finger. A mole-like gene race was summoned. Its body was twice as big as an ordinary mole. Its claws were like metal.\n\n“This is a king-class, land-pulse mole. It has powerful digging and locator powers. Perhaps it can lead us out.” While Li Bing Yu was talking, the land-pulse mole was already digging around the stone palace.\n\nHan Sen and Li Bing Yu followed it. The land-pulse mole kept digging the stone. Not long later, it dug a hole in the wall and started drilling\n\nThere was a cave in front of where it drilled. It was not just drilling aimlessly.\n\nThey followed the land-pulse mole for half a day before walking out of the cave above the surface. They were no longer in the jade lion valley.\n\n“Follow me.” Li Bing Yu scanned the environment and started going in a specific direction.\n\nHan Sen was not interested in exploring Ancient Big God Mountain. He just wanted to return to Ancient God City. He wanted to do some research and figure out the contents of the book and see what he could find.\n\nHan Sen had a feeling that the notebook had some very important information. Its secrets might have more information on how Qin Xiu had entered the universe.\n\nIt was a shame the ancient language he used to know could not be used for the ancient language of this world. He needed some other information to figure out what the notebook said."
}