{
    "chapter": 2781,
    "title": "The Whole Race Mutates",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2781",
    "text": "But when the strike landed on the newly-emerged Flower God, only the being’s clothes were damaged. The creature itself merely staggered backward, then lunged at Bai Wanjie again.\n\nEveryone was shocked. They knew what the Flower Gods were like. Even if they were very good at making geno fluids, their battle powers were lame and their bodies lacked strength. There wasn’t a single deified in their entire race.\n\nRight now, the Flower God had been able to absorb Bai Wanjie’s strike and remain totally intact. This was a truly frightening thing to witness.\n\nBai Wanjie’s body flashed. He swung another fist that brought a black hole with it. He sucked the Flower God into the black hole. Everyone nearby could see that the black hole was about to close and exile the Flower God into space.\n\nBut suddenly, a purple flower opened. It appeared in the mouth of the closing black hole and wedged it open. The power of the black hole strained to close itself, but it couldn’t make any headway.\n\nThe purple flower came further and further out of the pit. It looked like a creepy face that was smiling.\n\nThe next second, a pair of hands came out of the purple flower and ripped apart the black hole. And then, the entire purple flower emerged from the remains of the black hole.\n\nEveryone was shocked. That creature had used the raw power of its body to tear a black hole to shreds and fight its way back to reality. That was a very scary physical power.\n\n“Oh, no! How can the Flower God possess such a scary body?” Everybody watched as the Flower God fought back against Bai Wanjie, and it wasn’t showing any signs of weakness against its enemy.\n\nBai Wanjie cycled through a few dozen geno arts as he attempted to repel the foe, but he wasn’t able to heavily damage the Flower God’s body.\n\n“Violet, since when have the Flower Gods added such a powerful deified to their ranks? Congratulations…” a deified elite said to Violet with a cold smile.\n\nViolet shook his head. “This is an Earl class Flower God. He is just a very ordinary person. He shouldn’t be deified, and I do not know where such power came from.”\n\nThe deified elite started to say something else, but his face suddenly changed. Someone screamed aloud, “All the Flower Gods are coming out of the earth!”\n\nHan Sen could see what was happening down below, and indeed, all the Flower Gods were fighting their way out of the soil.\n\nA single one of these creatures was hard to deal with, but now, tens of thousands of the buried monsters were emerging. If they were all as scary as Bai Wanjie’s enemy, then the situation had just taken a rather horrifying turn.\n\nBut the elites didn’t think that was likely. It simply wasn’t possible. If a race all became deified, then deifieds wouldn’t be special anymore.\n\n“I want to see what is going on with these guys,” a deified elite said while generating a substance chain. It became a scary bolt of lightning that arose from the ground to strike a Flower God.\n\nBoom!\n\nThe lightning slammed into the Flower God, blowing the creature’s armor to bits. But the body of the Flower God was still sound. It was crystal clear like jade and wholly untarnished. The head of the Flower God possessed a flower that appeared to be blooming at just the right moment.\n\n“This guy… is he deified, too?” The faces of the elites were growing pale. Dragon One and Dia Robber felt like something was wrong.\n\n“Fall back! Something is wrong with these things,” Dia Robber called for his people to retreat.\n\nBai Wanjie was even more certain that they needed to leave. He jumped out of the fray, looked around, and saw the girl in the sky. He flew up to her and shouted at the little girl, saying, “Great Aunt, something is wrong. This is too dangerous. We have to go!”\n\nBut before Bai Wanjie could drag the girl away, the Flower God he had been fighting with leapt after him.\n\n“Argh!” A King was torn in half by a Flower God woman. His blood and guts were spilled everywhere, leaving a chilling pool of viscera on the colorful field.\n\nRight now, the Flower Gods that came out of the ground all had deified powers, regardless of their age or gender. And they didn’t speak after they emerged, either. They were enraged, and they mindlessly attacked anything in front of them.\n\nPang!\n\nXie Qing King punched a Flower God man in the face. The force of his blow rebounded, and Xie Qing King was sent shooting away like a meteor. The bones in his hand were shattered.\n\n“F*ck! What the hell is going on? How can this guy have deified power and speed?”\n\nHis voice was drowned out by other sordid screams.\n\nThe whole of the Space Garden echoed with the sounds of terrified cries. Deified elites like Dragon One could barely keep their own fear in check. The Kings weren’t faring too well, and they were falling one by one to the Flower Gods. They weren’t fast or powerful enough to fight back, and neither could they flee.\n\nThe Flower God people had all sorts of flowers on their heads. They were killing everyone they could reach.\n\n“Where is Violet?” Han Sen ran next to Xie Qing King. He swung his fist and punched away the Flower God that was coming for Xie Qing King.\n\nThe Flower God that was punched by Han Sen—although it flew away with a cavity in its chest—didn’t even seem to notice the pain. It was like the creature didn’t know that it had been injured. It just got up and started running back at them.\n\n“I don’t see him. He was right here, but now he is gone!” Xie Qing King said as he fell back away from the fight.\n\n“Something is very wrong with the Flower Gods. We shouldn’t stay here, though. We should get out of here as soon as we can.” Han Sen pulled Xie Qing King away, wanting to lead him out of the Space Garden.\n\nPang!\n\nHan Sen tried to fly out of the Space Garden, but he hit an unseen barrier. It bounced him and Xie Qing King back.\n\n“Oh no! It is a space wall. Without the key to open the space wall, we cannot get through. Brute force won’t get us through, no matter how much power we throw at it,” Han Sen said with a frown.\n\n“D*mn it! If I became deified, I could punch them all to death and we wouldn’t have to flee,” Xie Qing King said with a streak of bitter depression.\n\n“Now isn’t the time to whine about what we can’t do. We have to find Violet. He’s the only person who can get us out of here.” Han Sen used his Dongxuan Area to the max of his abilities. He scoured the whole of the Space Garden, trying to locate Violet.\n\nIt was a mess down there. Every elite was in a similar situation to Han Sen, and none of them could escape. They had to fight the Flower Gods or die trying.\n\nBut the Flower Gods all held the power of deified elites. They were all so strong. The King class nobles didn’t stand a chance against such powerful enemies. They were being torn apart where they stood.\n\nEven deified elites, against the ten thousand Flower Gods who were coming after them, were in grave danger.\n\nLone Bamboo stood by himself, wielding a jade sword. He moved quickly through the Flower Gods, and wherever the jade sword went, a Flower God was slashed and sent soaring.\n\nBut even though his sword was powerful, he still couldn’t kill the Flower Gods with it.\n\nLone Bamboo wasn’t the only one who was struggling, either. Bai Wanjie, Dia Robber, and Dragon One were faring terribly, too. No one was able to kill a Flower God."
}