{
    "chapter": 1851,
    "title": "Center of Narrow Moon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1851",
    "text": "Han Sen was interested in those paintings. He kept looking at them, fascinated by the depiction of Rebate being slaves. But in the paintings, Han Sen could not see what beings had enslaved them.\n\nThe carriage, and the slave masters that it held, were all enveloped in bright light. So much so, you could not identify the beings inside it.\n\n“You! Open the door.” Captain Wood pointed at one of the Barons as he spoke.\n\n“I’m sorry!” That Baron suddenly kneeled, planted his face down to the ground, and started to kowtow. He did it so vigorously, his forehead began to bleed.\n\nKatcha!\n\nCaptain Wood cut the Baron’s head clean off, and emotionlessly spoke to another one of the Barons. “You! Now you go and open the door.”\n\nThe Baron’s legs were shaking. He didn’t beg as the previous Baron had. Instead, he slowly approached the door of the palace. His trembling legs brought him closer and closer to the door, and when he was near enough, he extended his shaky hands. With little to no strength, he pushed against it. The door did not budge.\n\n“Use strength!” Captain Wood shouted.\n\nThe Baron shoved forcefully against the door, but still, there was no response.\n\n“Deep Blue Viscount, how did Chiron Earl enter?” Captain Wood asked Deep Blue Viscount.\n\nDeep Blue Viscount, ever since he had returned to this place, had looked quite pale. His lips shivered as he tried to speak, saying, “He merely pushed the door and it opened. He did nothing special.”\n\n“He didn’t do anything? Come on, man. Think about it harder,” Captain Wood quietly requested.\n\nDeep Blue Viscount’s entire body was shaking like mad. His facial expression screamed out the fact he was hiding something. And inside, whenever he thought about it, he wanted to faint and drop down to the ground.\n\n“I guess I do know what happened,” Gu Qingcheng said with a sigh. She used the voice only Han Sen and Xie Qing King could pick up.\n\nHan Sen nodded. He knew what she was thinking, too; but it was simply too cruel.\n\n“What’s going on?” Xie Qing King was too lazy to think about it, so he quietly asked them to spell it out.\n\nGu Qingcheng said, “If I am not mistaken, Chiron Earl brought more than just Deep Blue Viscount. There might have been six ordinary Rebate.”\n\nXie Qing King did not want to realize what she was suggesting, but he was a smart man. He understood and said, “Are you saying Chiron Earl brought the ordinary Rebate intentionally for some reason? Their only use could have been in opening this door. Does that mean Deep Blue Viscount is some sort of key or sacrifice?”\n\n“That must be the reason it,” Gu Qingcheng said coldly.\n\nGu Qingcheng knew this, but Captain Wood was not dumb, either. He stared at Deep Blue Viscount and said, “If you tell me the truth, I will let you live. If you lie, you are going to be a sacrifice.”\n\nDeep Blue Viscount’s body shook even more now. With a trembling voice, he said, “We need the blood of four Rebate to open this door.”\n\nWhen Deep Blue Viscount said that, the Rebate Barons were shocked. They immediately tried to run. Aside from them, only Captain Wood and Black Steel were Rebate. Everyone knew what would happen to them now.\n\nCaptain Wood didn’t look at the Rebate Barons that were escaping, though. Four of the Marquise did so for him. They swiftly moved to grab the escaping Barons. Then, all four of the captured Rebate were thrown in front of the palace door.\n\n“How do we do this?” Captain Wood saw Deep Blue Viscount shaking like mad.\n\nDeep Blue Viscount, with his still-shaky voice, said, “Make them kneel in front of the gate, and then cut off their heads. Their blood should be absorbed by the gate.”\n\n“Mister, help!”\n\n“F*ck! I am going to fight you.”\n\nThe four Rebate begged for their lives. Others were mad. Some of them wished to kill themselves. But no matter what they wished to do, they could not move.\n\nCaptain Wood unleashed a power before any of them could move their fingers. They were kneeling before the door now.\n\n“Don’t kill me! I am Knight River King’s man!” a Rebate Baron shouted.\n\nWhen he shouted that out, the other three Barons started shouting, too. They were all well-known, at some level.\n\nCaptain Wood ignored their pleas, though. He grabbed the scared Deep Blue Viscount and brought him in front of the door. He made him kneel with the four Barons.\n\n“Captain Wood! What is this? I told you what you wanted to know,” Deep Blue Viscount was terrified.\n\nThere are four Rebate Barons, and you said you need four. Isn’t that quite a coincidence?” Captain Wood said coldly.\n\n“Mister, I did not lie! You really only need four!” Deep Blue Viscount shouted.\n\nCaptain Wood looked up to the painting on the wall and said, “Kill.”\n\nThe four Marquise moved to cut the heads of the Rebate off. Five in total, with Deep Blue Viscount included.\n\nHan Sen and Gu Qingcheng frowned. This was just like the sanctuary. If you were weak, you would only end up getting bullied.\n\nDeep Blue Viscount and the others were all killed. Then, Captain Wood withdrew his power. The five headless bodies were still in a kneeling position, as the necks squirted out blood that spray-painted the door.\n\nThe blood began to float up and stain the markings across the door, before being wholly absorbed. The five headless corpses continued to squirt blood ceaselessly. It was a creepy thing to see.\n\nThe Barons had killed before, but seeing this, it made their legs grow soft.\n\nKatcha!\n\nThe five bodies shriveled up as all their blood was drawn into the door. The bronze door turned red, and then, it made a sound.\n\nIt was just a sound, though. The door did not open.\n\nThe five bodies were all dried-up now, lying on the ground. They were like husks, devoid of any fluid.\n\nYou! Go and open the door.” Captain Wood pointed at one of the Barons.\n\nThe Baron was so scared that he wet his pants. But even so, he still walked toward the door, shivering constantly. He pushed the red-bronze door open.\n\nThe bronze door opened, and light spilled out of the gap. When the group saw what lay inside there, they were quite surprised.\n\nInside, there was a small replica of Narrow Moon. Each moon had its own orbital ring, and in the center of them all, there was an orb. Like a sun, it gleamed brightly. That was at the center of the purple-bronze palace."
}