{
    "chapter": 266,
    "title": "Aegean Sea",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_266",
    "text": "Blackhawk's opponents in the next few rounds were not strong teams, which gave them more opportunities to practice.\n\nWith their newly gained confidence and Han Sen's incredible spinning arrows, Blackhawk became the champion of this year's archery tournament.\n\nEvery media was crazy about the new champion team and used all kinds of words like \"Blackhawk miracle,\"\"new emperor,\" and \"incredible archery skills,\" making Han Sen the new star among all the military school students.\n\nNow, all the military schools knew that Blackhawk had an archer as good as Jing Jiwu.\n\nWhen the archery school team returned to Blackhawk, they received the utmost welcome and the school rewarded them handsomely. Their performance was also recorded in the school yearbook. This was the first time Blackhawk had won a championship in the Military Academy League.\n\nIf the current rules allowed one player to participate in multiple items, the President of Blackhawk would want Han Sen to sign up for each and every item.\n\nThe individual game in the archery tournament was not a real competition, but an exhibition match among the 10 most popular archers.\n\nWith Han Sen's fame and spinning arrows, he won the first place without any doubt. Although this glory was much less than winning as the team, it gave Han Sen extra academic credits.\n\nThe spinning arrow was a creation by Han Sen using the reference of the beetle knight' s spinning spear, and the theory of Yin Yang Blast.\n\nDuring the three months when Han Sen fought the beetle knight, he learned nothing other than this skill, which led to his victory in the duel against Jing Jiwu.\n\nEven so, he was very lucky to win. If he were to do it again, Han Sen was not sure if he could still beat Jing Jiwu.\n\nThe championship of Blackhawk was the one and only miracle.\n\nThe sky was blue and the beach was warm.\n\nA beauty with skin as fair as milk, long legs and beautiful curves were dipping in the water wearing nothing but bikini.\n\nLying under the beach umbrella, Han Sen could not move his eyes away from Ji Yanran in bikini.\n\n\"Life is good!\" Watching Ji Yanran's alluring figure, Han Sen felt that God loved him.\n\nJi Yanran really kept her promise and took him on a vacation, which was beyond Han Sen's expectation. Ji Yanran even took care of asking for leave from school.\n\n\"I'm such a charming guy.\" Han Sen took off his sunglasses and looked at his own reflection in the lens, appreciating his handsome look.\n\n\"Why don't you go swimming?\" Ji Yanran returned to the beachside and asked Han Sen.\n\nHarry pulled her into his own arms, held her tiny waist, and whispered into her ear, \"We have four days and three nights, for which I need to save some energy.\"\n\nJi Yanran suddenly blushed and pinched Han Sen's waist. While Han Sen was complaining, she ran away to another chair.\n\n\"Why is no one here? You didn't rent the entire beach, did you?\" Harry looked around and was curious why he never saw other tourists here.\n\n\"When have you ever heard such a thing as renting a beach?\" Ji Yanran rolled her eyes and said, \"This is a private beach, so of course there is no one here.\"\n\n\"You own the beach?\" Han Sen was surprised.\n\n\"I don't,\" Ji Yanran grinned and said, \"but this planet belongs to my uncle.\"\n\nHan Sen choked on the water he just drank.\n\nHe knew that Ji Yanran was from a rich family, but did not imagine they would be so rich.\n\n\"Wonderful! As long as I'm with you, I would not need to work ever,\" Han Sen smiled and said.\n\n\"You wish! In my family, only sons can inherit family businesses. Now I can still use the family resources, but when I am married, it's all up to you,\" Ji Yanran curled her lips and said.\n\n\"You have such a strong desire to marry me! I haven't even decided if I want to do that yet.\" Han Sen pretended to be surprised by her.\n\n\"Hah!\" Ji Yanran suddenly became angry from embarrassment and threw herself at Han Sen.\n\nWith a sly smile on his face, Han Sen grabbed her hand and pulled her back to his arms, kissing her alluring lips.\n\nJi Yanran struggled a little and gave up, enjoying the kiss as well.\n\nHan Sen's hand moved between Ji Yanran's waist and butts, as he hesitated if he should have this gorgeous girl right here on the beach.\n\nSuddenly, with the sound of a whistle, Han Sen saw an ancient yacht sailing over. Han Sen had only seen such a thing in movies.\n\nJi Yanran immediately stood up from Han Sen's arms. As the yacht came into the pier, a young man of about 25 years old came down with a few bodyguards and walked towards the couple.\n\nSmiling, the young man waved to Ji Yanran from afar, \"Ji Yanran, it's been awhile since you visited us.\"\n\n\"Brother, I'm a military school student now and don't have too much time.\" Ji Yanran introduced Han Sen to the young man, \"This is my schoolmate Han Sen. Han Sen, this is my brother Ji Lingfeng.\"\n\n\"Brother,\" Han Sen called Ji Lingfeng directly.\n\nJi Yanran blushed. Ji Lingfeng paused and smiled, \"Han Sen, are you the one who beat Jing Jiwu in the archery tournament?\"\n\n\"Yes, that's me,\" said Han Sen casually.\n\n\"So impressive! No wonder Ji Yanran would bring you back.\" Ji Lingfeng cast a glance at his sister.\n\nJi Yanran blushed and pouted. \"Brother, did you come to pick us up or did you come to chat?\"\n\n\"We'll talk on the ship then.\" Ji Lingfeng took the couple on board, and then the yacht sailed away into the ocean.\n\n\"Han Sen, do you know any drinking games?\" Ji Lingfeng sat down in the lounge and put two bottles of wine in front of Han Sen.\n\n\"Some,\" Han Sen said with a smile."
}