{
    "chapter": 1270,
    "title": "Blue Blood",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1270",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen saw the man was nearing the top of the mountain. He was very close to the vine now, and Han Sen was eager to see just how the man expected to retrieve the fruit.\n\nThe rockclimber was within arm’s reach of the vine, and he reached his hand out to grab it.\n\nThe purple vine was like a berserk super creature, and for the man to try and grab it with his hands, Han Sen thought he was either incredibly daring or incredibly stupid. It was a crazy stunt, either way.\n\nWhen the man grabbed hold of the vine, the vine had no reaction, though. In fact, it was as docile as any garden-variety plant.\n\n“How is that possible?” Han Sen wondered as he rubbed his eyes.\n\nThe man, clutching the vine, now began to climb with a greater acceleration.\n\nNone of the vines moved, and it was as if they were all asleep.\n\n“It’s no wonder the empress wanted him to take the fruit. How does he do that? Is the vine not hostile to humans? Can I do that, too?”\n\nThe empress could have found any human easily, if the vine did not care for the intrusion of humans. But then again, she had come to this person specifically. And the manner of her retrieval of him was rather curious, and indicative of them sharing a history together, in one way or another.\n\n“So, how does this man make the vine docile?” Han Sen could not wrap his mind around it.\n\nThe empress continued to watch the man, despite the bluster of the rampaging fish, and a smile now crept across her face. She actually looked happy.\n\nThe man had been climbing so slowly on purpose. And now, after reaching the vine, he went at a remarkable pace, given the tricky act of rockclimbing. He went straight up towards the Aqua Fruit the fish king had aimed for.\n\nHan Sen and the empress now watched with bated breath, keenly wondering if the man could take the fruit.\n\nThe man was not in a rush to take it, that much was clear. But he plodded up at a steady pace and put his arms out. With one of his grizzly fingernails, he ran a finger across the upturned palm of his other hand and cut across it.\n\nHan Sen was shocked when he saw the blood.\n\nThe man’s veins were blue, and so the blood should have been red.\n\nBut this man’s blood was blue, and it came as quite a shock to Han Sen.\n\n“Blue blood? Is he Han Jinzhi?” Han Sen was extremely surprised, seeing the blue blood run from the self-inflicted wound.\n\nThen, the man ran his cut palm across the fruit and painted it with the blood.\n\nWhen the fruit came into contact with the blood, it began to tremble and shake as it absorbed the liquid. Then, its glow began to shine brighter.\n\nWhen the blood was all gone, the man moved to grab the fruit.\n\nSuddenly, the fruit flashed a blinding light. It surprised Han Sen and brought visible shock to the empress. The man grabbed hold of the light as if it were an object, and then, with his other free hand, he pulled the fruit.\n\nThe fruit had no hostile reaction.\n\nThe empress, seeing his success, called out to the man and said, “Bring it down!”\n\nThe man did not hesitate to follow her command, and he began his descent. The empress was still ignoring the fish king, and now, she brought the entire throne over to the man.\n\nBy this point, the fish king knew it was not able to beat the empress. It gave one last look at the Aqua Vine before turning tail and swimming downstream in retreat.\n\nHan Sen was shocked. It was a strange turn of events, and it seemed as if they had all only come for this one fruit. No one dared touch the other six.\n\n“Give me the fruit,” the empress said as she approached the man.\n\nThe man ignored her and kept climbing back down the mountain.\n\nThe empress looked mad, and her impatience was clearly getting to her. Still, she held her tongue and did not say anything more until he had finished his descent.\n\n“Can I have it now?” the empress was finally able to ask.\n\n“Where is what you owe me?” The man reached his free arm out to the empress.\n\nThe empress brought something out and held it in front of the man. The man grabbed what he was owed and gave her the fruit, as promised. Then, upon her throne, she left.\n\nHan Sen was surprised. The empress had an incredible amount of power, and she didn’t have to give him anything. She could have robbed him and gone on with her day. She respected the terms of their agreement, and this made Han Sen believe the blue-blooded man possessed an untold power.\n\nThe empress had given him a wooden bottle. He opened it and drank the contents.\n\nHan Sen wished to know what was inside.\n\nSuddenly, the man began walking in his direction. It made Han Sen wonder whether or not he knew about his presence there.\n\nThe man walked into the forest and frowned, noticing Han Sen hiding.\n\n“Drop the fruit and you may leave with your life,” the man said."
}