{
    "chapter": 2585,
    "title": "Purple Copper Jian",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2585",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nElysian Moon was as strong as a King class could be, but her full-power attack hadn’t even left a mark on the stones. The rock of that place was far sturdier than they could have imagined.\n\n“Little red bird!” Han Sen called.\n\nThe little red bird understood what Han Sen wanted to see from it, so it shot out its phoenix fire to burn the rocks around the purple copper jian.\n\nSurprisingly, it took half an hour of constant flames before the rocks even started to be affected. They began to turn red. If Han Sen tried to use the phoenix fire to melt the rocks into molten juice, God only knew how long that might take.\n\nGu Qingcheng looked at the burning rocks and said, “The Black Hole Spider has consumed many planets and stones. The spider must have eaten many high-class metals and special materials over the years, but its digestive system has failed to break down some of them. Anything that cannot be digested has come together to form these stones. If these rocks have withstood the digestive system of the deified Black Hole Spider, it’s easy to imagine how frighteningly strong this material might be. An ordinary deified won’t have an easy time damaging these deified stones.”\n\nElysian Moon nodded to show agreement with what Gu Qingcheng just said. The Black Hole Spider was a deified xenogeneic that was at the butterfly rank. If a monster like the spider couldn’t digest a material, then Han Sen’s people wouldn’t be able to break it down either.\n\nFortunately, the little red bird could slowly burn its way through the stones. With effort and patience, a clump of steel could be ground into a needle. Clearly, those were the qualities that they needed here: effort and patience.\n\nAs the little red bird was still spewing its blazing fires, another gale of wind erupted from the purple copper jian. That wind scattered the phoenix fire everywhere, blowing it back across Han Sen and the others. Many pained screams erupted.\n\nThe little red bird stopped spewing its phoenix fire, but it was too late. The flames had already left hair and eyebrows blackened and singed. They weren’t badly injured, though. They just looked a little haggard now.\n\n“This purple copper jian keeps releasing gales of wind. We can’t burn through the rocks to get to it. Is there another way?” Han Sen looked at Gu Qingcheng and the others.\n\nEveryone swapped glances with each other, but no one could come up with any ideas.\n\n“Then, we will try to take it one by one,” Han Sen said. He summoned his peacock king soul robe and walked up to the purple copper jian. A rainbow light covered his hands as he tried to pull out the weapon.\n\nThe jian’s mysterious patterns glowed with purple light, and then a scary storm flared from the purple copper jian. It blew everyone away.\n\nHan Sen held onto the jian. He lodged his feet against the rocks, and he tried to pull the purple copper jian free. After trying his hardest, though, he couldn’t get it to budge. If anything, the storms of the jian became even stronger. It made Han Sen’s feather robe and hair billow.\n\nBoom!\n\nHan Sen could no longer withstand that scary storm, so he was blown away. He bounced off a few rocks, but the wind was so strong that it continued to push him until he was thrown out of the cave.\n\nA while later, Han Sen flew back in. The storm in the cave had finally calmed down.\n\n“Ning Yue, give it a try. Maybe you’ll have greater success,” Han Sen said to Ning Yue.\n\nNing Yue shook her head and retreated a step. She said, “If you guys cannot do it, then I surely cannot.”\n\n“Just give it a shot. If you don’t, I’ll throw you to the snakes,” Han Sen threatened.\n\nThat storm wouldn’t hurt anyone. It would toss them around, but it wouldn’t kill them.\n\nNing Yue had the protection of her green sword. The storm didn’t harm her. Perhaps she would be able to truly pull out the purple copper jian.\n\nNing Yue felt awful. She was so scared, but after Han Sen’s threat, she reluctantly moved forward. Slowly, she placed her hands on the purple copper jian.\n\nPang!\n\nNing Yue only had to touch the jian for the scary storm to return and blow her away. The power of the green sword didn’t protect her this time. Ning Yue rolled around for quite some time before coming to a stop.\n\n“I told you I didn’t want to try, and yet you forced me!” Instead of getting up, Ning Yue sat where she had landed, her hair a jumbled mess. She almost cried.\n\nHan Sen felt a headache coming on. No one there was able to pull out the jian. Normally, if a treasure seemed to be truly unobtainable, Han Sen would leave it be.\n\nBut now, if he didn’t take that purple copper jian, he wouldn’t be able to take out the monsters. They would be trapped in this cave. That was a miserable thought.\n\n“Dad, do you really want that purple copper jian?” Bao’er asked, tugging on Han Sen’s sleeves.\n\n“Yes, we need that purple copper jian. Do you have any ideas?” Han Sen asked Bao’er happily.\n\n“Just pull it out,” Bao’er said.\n\n“If we were able to pull it out, we wouldn’t be standing here doing nothing,” Elysian Moon said.\n\nNing Yue cried and said, “Yes, this thing is so weird! When you touch it, the wind comes and it cannot be repelled.”\n\nBao’er blinked and jumped toward the purple copper jian. She reached out her hand to grip the jian’s handle. As she did, everyone readied themselves to weather the storm. They didn’t want to get blown away again.\n\nBut after Bao’er’s little hand grabbed the handle, no storm came. Bao’er held the purple copper jian tightly and then pulled it out as if she was unearthing a carrot. The purple copper jian hadn’t shown any indication that it would move for anyone else, but it slid out easily in Bao’er’s grip.\n\nNing Yue and the others stared with wide eyes, unable to believe Bao’er was able to do what she had just done.\n\nBao’er pulled out the one-meter-long purple copper jian completely. It turned out to be taller than her. She delivered it to Han Sen and smiled. “There you go, Dad.”\n\n“Bao’er, you are so good. Dad will buy you ice cream later.” Han Sen took the jian, a wide grin stretching his mouth.\n\nStrangely, when the jian was below the rocks, it would unleash storms whenever it was touched. Now that Han Sen was holding in his hand, there were no storms.\n\nHan Sen looked at the purple copper jian. It was the same as the one he viewed through his Purple-Eye Butterfly. It was 1.2 meters long, its blade was square, and it was crafted out of some sort of purple copper. It was quite heavy. On all four sides of the tool, there were strange symbols.\n\nBut those weird symbols were different from the strange symbols on the handle. Han Sen tried putting his power into the purple copper jian to see if he could activate it.\n\nIt was a surprisingly smooth process. After the power of the Dongxuan Sutra entered the purple copper jian, its symbols lit up. Then, it glowed with purple light.\n\nHan Sen was pleased to see the light shining from the activated weapon. If he couldn’t use it after retrieving it, that would be very frustrating. It seemed as if he had worried too much about it.\n\nThe purple symbols on the jian lit up. Everyone in the cave could feel that the jian’s true power wasn’t actually wind. It didn’t resemble the power that had been released from its handle, at least.\n\nBuzz!\n\nThe jian’s purple light grew stronger, then slowly transformed into purple flames. The purple copper jian became enshrouded in fire, and the intense purple fire followed Han Sen’s hand and started to spread across his body."
}