{
    "chapter": 1708,
    "title": "Entering the Ruins Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1708",
    "text": "“It’s nothing too exciting. That is the remains of a Nine-Life Cat. It is their leftover genes,” Old Cat said with a slight tone of\n\nawkwardness.\n\n“Does that mean there is more than one?” Han Sen asked.\n\nOld Cat hesitated for a moment, and then said, “There aren’t many.”\n\n“What’s going on?” Han Sen frowned. Old Cat wasn’t answering fully and forwardly, and it was clear he was hiding something.\n\nOld Cat retreated into thought before speaking next. He said, “It’s not a big secret Only rare Nine-Life Cats can leave behind something like that. And to the best of my knowledge, there are only ten.”\n\nHearing him say this, Han Sen’s mind drifted back to Zero, who had the exact same thing. He still went on to ask, “How many are there in the sanctuaries?”\n\n“Just one. It was from Human Emperor…” Old Cat suddenly stopped short.\n\nHan Sen heard half of what he said, and immediately, his face changed. He looked at Old Cat and asked, “Human Emperor visited the Nine-Life Cat? Nine-Life Cat comes from the outside, so the Human Emperor got out?”\n\nOld Cat smiled and said, “I guess, but he didn’t go out with his powers intact.”\n\n“What does that mean?” Han Sen asked.\n\n“If I told you I helped him out, you wouldn’t believe me. So, it would be best if you stopped asking. And if you ever do make it out, you’ll hear it from him. But if you can’t make it out, such knowledge is useless to know,” Old Cat said.\n\nHan Sen was shocked. He had no idea that an Alpha Human had made it out of the sanctuaries.\n\n“Is he still alive, then? Can you at least tell me that?” Han Sen asked.\n\n“I don’t know. When I came here, he wasn’t dead. But predicting if someone is dead or alive out there is now something anyone can do. Even me.” Old Cat shook his head.\n\nHan Sen thought about this for a while and said, “How did you even get into the sanctuary? As far as I know, aside from the crystallizers, no others were able to get inside.”\n\nThat was what concerned Han Sen the most. If the creatures from the outside could enter, just like Old Cat seemed to have, then that could spell out something pretty bad.\n\nOld Cat seemed to see through Han Sen’s thoughts, and answered, “If nothing could get in, then how could Feathers be here?”\n\nHan Sen’s face changed. Old Cat, with a cocky expression on his face, went on to say, “But don’t worry, if the crystallizers hadn’t killed themselves, it would have been difficult for other races to enter. I came in when the crystallizers opened the sanctuaries. And yes, the crystallizers are practically all dead. They can’t kill themselves anymore to open doorways.”\n\n“Did you destroy the crystallizers?” Han Sen asked, looking at Old Cat.\n\n“Do I look like I’m capable of such an act?” Old Cat revealed his claws.\n\nHan Sen ignored the mocking and asked him, “Well, could other creatures have made it through?”\n\nOld Cat nodded. “There were others, but I don’t know them. Now come on, I’ve told you everything you wish to know. Will you follow me now?”\n\n“Why don’t you tell me what for? Maybe I’ll consider coming.” Han Sen smiled.\n\n“Breaking a promise made to the Nine-Life Cat isn’t a very wise move to make. Think about it.” Old Cat squinted his eyes.\n\n“I said I’d consider coming along. I didn’t say I’d come or not come.” Han Sen smiled again.\n\nOld Cat was a professional liar, and Han Sen wasn’t willing to put absolute stock into everything he was being told. And right now, there was every chance he might be getting sold out.\n\nOld Cat saw that Han Sen really wasn’t moving, so he went on to explain the ruins.\n\nOld Cat had discovered another lab with another race there. It hadn’t woken up like the Feather had, but just in case, he wanted to bring Han Sen for help.\n\nOld Cat explained that if nothing happened, he would take the item. If something bad happened, then any treasures they found would be shared.\n\nHan Sen asked him what he expected to find, but the cat’s explanation made no sense to him. It was like some sort of bone that was similar to the one Han Sen retrieved before.\n\n“What is the point in getting such a bone?” Han Sen couldn’t figure out what that other bone was for, so now was as good a time to ask as any.\n\n“They’re useless in the sanctuaries, but out there, they’re highly sought after by all. If you can get out, you’ll find out for certain.” Old Cat didn’t really explain anything.\n\nHan Sen mulled the idea over some more, but ultimately decided to follow. He was quite curious about discovering another race, anyway.\n\n“So, do the sanctuaries only have one of these items, brought here by Human Emperor?” Han Sen asked.\n\n“It should be just one, assuming Human Emperor did not lie,” Old Cat said.\n\nHan Sen asked Old Cat how Human Emperor had managed to get the bone, but he didn’t receive an answer. Old Cat was afraid of telling him.\n\nHan Sen was planning on going alone, but Xie Qing King overheard them and wanted to go along. Han Sen wouldn’t mind some extra help, and Xie Qing King was nearing Emperor status, too. He’d be very good to have along.\n\nBut before setting out, Han Sen returned to the Alliance. He took the glove, but left the crystal shoes for Ji Yanran in case something happened during his absence.\n\nThe three of them entered the relics Han Sen had been to before. Han Sen thought the lab was the one he had previously visited, with the Feather inside. But even though Nine-Life Cat was taking them to the same ruins, that was not the lab they were headed for.\n\n“Where did you find this thing?” Han Sen frowned.\n\n“There are three other labs, and I found what I seek in one of the others. I know my way around, and if it doesn’t wake up like the Feather did, we should be safe.” Old Cat spoke as he led them forward.\n\nThey walked around the ruins for a while before reaching their destination. When they entered, it looked just like the one Han Sen had previously visited. There were many tools and crystal tanks.\n\nThe laboratory was damaged, though. The room was in bad shape, and much of the equipment was broken. Many crystal tanks had broken, too, leaking their fluids everywhere. There were a number of rotten bodies and bones scattered all about."
}