{
    "chapter": 1152,
    "title": "A Super Creature That Loves Food",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1152",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAfter an extensive session of testing, Han Sen was able to confirm the Thorn Scorpion glyph imbued his attacks with a lethal venom.\n\nThe toxins were extremely corrosive, but they had to contact blood to work. Once Han Sen came into contact with a creature’s blood, it’d boil and fizz like acid.\n\nAll he would have to do was make an enemy bleed, and then he could allow the toxins to work their magic and taint the rest of the bloodstream. If the foe’s toxic resistances were low, it’d be dead in no time at all.\n\nHan Sen loved the concept of this glyph, but the power was not very compatible with the Invisible King Scorpion’s power. With this discrepancy, Han Sen could not tell what would happen if they were combined.\n\nAfter a period of thinking it over, Han Sen put the idea aside for the time being. He wanted to see if he could stumble across a better beast soul before making a final decision. If there was no greater choice, he’d use the gem on the glyph.\n\nBack in the shelter, Han Sen asked Moment Queen to drive the shelter through the Thorn Forest.\n\nHan Sen tried teaching Bao’er and Zero how to play the xun. He spent many sessions with Zero, but Bao’er was flat-out uninterested. The first time she was given it to hold, she lobbed it away. Fortunately, Han Sen was quick enough to catch it.\n\nBao’er loved animals, though. The white bear, rabbit king, red bird, and even the Blue Dinosaur were now subjected to her bullying.\n\n“I hope my real kid won’t turn out like that,” Han Sen thought to himself.\n\nIf Queen wasn’t out hunting, she was spending her time practicing hyper geno arts in the shelter. Han Sen half-believed she was a machine; one that could not turn off, at that.\n\nIf she turned out to be a machine, Han Sen wouldn’t be surprised.\n\nQueen’s figure was as voluptuous as ever; perfectly sculpted as if through masterful design. Whenever she exercised, her boobs bounced vigorously and almost unnaturally. Their physics were hypnotizing to watch, and it was something Han Sen believed only robots designed for that purpose could achieve.\n\nQueen’s face was unwelcoming 24/7, too. She certainly had the warmth of a cold-blooded cyborg.\n\nZero was far gentler, by comparison. She cooked, cleaned, and even took the time to massage Han Sen. Her only downside was her lack of speech, as she was fairly silent on a day-to-day basis.\n\nMoment Queen continued to think Han Sen was an enemy, and she was now giving him the silent treatment.\n\n“It looks like Ji Yanran is the only normal woman in my life,” Han Sen said to himself, before his thoughts lusted over her.\n\nThe underground shelter, after five daily jumps, finally reached the super creature Moment Queen had mentioned.\n\nHan Sen went out looking for it, heeding the instructions Moment Queen was now willing to give. There were no super creatures around, but he did find many empty anthills.\n\nThere were many lumps and mounds in the earth of that area, all with the telltale signs of having previously housed ants. Han Sen counted at least a dozen of them, but they had all been de-capped and their denizens removed.\n\n“A super creature must have come through here. Look, it has eaten all the ants. Let’s go further,” Han Sen said.\n\nIn their travels, Han Sen noticed many more anthills. But they too had been stripped bare, absent of tenants.\n\n“This guy is a hungry feller! He must have eaten every single ant in a ten-mile radius,” Han Sen commented, as he observed yet another empty mound.\n\n“I don’t think they’re anthills,” Moment Queen said.\n\nHan Sen turned around, and in-between the thorny vines, he saw a beehive that was approximately the size of a three-story tall building.\n\nBut that too was absent of occupants, and the hive itself looked as if it had been damaged pretty severely.\n\nHan Sen examined it closer and noticed many of the scuffs and destructive markings across the beehive were similar to those that had mangled the anthills. The creature that did this could have very well been the same one.\n\nHan Sen then smelled something very sweet permeating the air. He saw liquid, and it was honey. The drop of honey was on the nest, and everything aside from that drop of honey had been consumed.\n\nHan Sen walked around and found more beehives, all of which were in a similar condition.\n\n“This guy is even hungrier than I thought! He has eaten every single ant and every bee in a fifty-mile radius.” Han Sen frowned.\n\n“Perhaps it is making babies,” Moment Queen chimed in to say.\n\nHan Sen nodded, thinking she could be correct. He knew that super creatures who were pregnant usually ate a lot.\n\n“Let’s go back. We can’t mindlessly wander; we should return and formulate a proper plan,” Han Sen said, then started walking back to the underground shelter, as he didn’t wish to stray too far from it.\n\nBut soon after, he saw something crawling out of the undergrowth. It was a green pangolin that was around two feet long. It was emerging from a pair of bushes, and it seemed to be in search of something.\n\nHan Sen was delighted. It looked very small, but Han Sen was able to sense that it was indeed a super creature.\n\n“Is that the super creature you mentioned?” Han Sen asked.\n\nMoment Queen tilted her head and said, “That does look similar, but it is far smaller than what I saw.”\n\nHan Sen wished to say something, but before he could, the creature scurried away and disappeared into a burrow.\n\nHan Sen immediately regretted he had not taken advantage of that opportunity and leaped forward to slay it. Following it underground was not a good idea.\n\nSuddenly, though, the creature came back out carrying something."
}