{
    "chapter": 2786,
    "title": "Fallen God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2786",
    "text": "Bzzt!\n\nIn that green, ripped space, a giant thing that looked like the temple of some ancient god emerged from the crack.\n\n“The Geno Hall!” The creatures of the universe, seeing the Geno Hall appear before them, looked confused. They raised their heads to stare uncertainly at the mysterious Geno Hall. No one had any idea why it had shown up.\n\n“The Geno Being Scroll fights finished up not too long ago. Why is the Geno Hall appearing again?”\n\n“I bet some elite triggered the door for another lantern fight.”\n\n“I don’t think so. Last time, when Kong Fei fought, there was a different feeling permeating the atmosphere. This feels like something else entirely. Back then, all the stars arose. But now, it looks like there is a wound in the universe itself. It feels different from the way it felt before.”\n\n“Yes, what is going on with the green crack? This is incredibly strange. I have never heard of something like this before. Seeing the green crack, I feel kind of sad. I want to cry. What is going on?”\n\nOn the peak of Empty Mountain, there was a woman with a holy horn rising from her head. She was standing next to a beast with green fur. They were looking out across the universe’s green crack. Their gazes were oddly intense.\n\n“It has finally appeared again. It has been a billion years since I was last able to witness the sadness of a god. I miss the era of Mountain Leader, the man who could go against the sky and kill gods, break the doors, and mark his place. He became a god spirit. It has been a billion years since someone did something like this. Today, I am able to witness god’s sadness once more,” the green-haired beast said. He looked at the sight, an oddly conflicted expression on his face.\n\n“I don’t know who could go against the sky and slay a god right now, though. And even claim their god spirit seat.” The horned woman frowned.\n\n“This is a good thing no matter who has done it. It proves that the Geno Hall’s suppression is not infallible. Those gods are no longer omnipotent opponents. We can slay them and take their thrones,” the green-haired beast said. It looked at the sleeping gold beast and said, “This might be Empty Mountain’s chance. With Little Mountain Leader here, nothing can prevent Empty Mountain from rising.”\n\nHearing the three words “Little Mountain Leader,” the woman’s serious face showed a rare smile. “The blood of the Little Mountain Leader isn’t pure, so its potential is unpredictable, but it can certainly become a true god. And then, it will be able to go against the sky and become something even greater. It will go into the Geno Hall as Mountain Leader did. People will then know that Empty Mountain is still here, and the race is composed of invincible blood.”\n\nInside a scary red dwarf, there was a hidden palace. Within that palace, there were many creatures that looked like humans. They were staring at the god’s sadness in space.\n\nIf Han Sen had been there, he would have been shocked to find God’s Retribution amongst them. He was a member of Blood Legion.\n\n“What we knew would happen has finally come to pass. For the first time since Sacred, a war of gods has finally started anew. It is a shame that we haven’t sufficiently prepared yet.” A man with blue eyes stared at the sky and sighed.\n\n“Although we aren’t yet prepared, it isn’t as if we don’t stand a chance. Blood Legion has remained hidden for too long. It is time to fight the god spirits in the sky.”\n\n“Perhaps.” The blue-eyed man looked at the green crack in the distance. No one could tell what he was thinking.\n\nOn a small planet that belonged to the Thousand Treasures, an old man who was holding a cloth flag frowned and looked up at the green crack in space. He spoke to himself, saying, “This shouldn’t be happening. Time isn’t yet up. The Geno Hall’s bindings should still be in place. Was someone able to kill a god right now? Weird… That shouldn’t be possible.”\n\nOn countless mysterious places in the universe, scary elites stared at the green crack and the Geno Hall that was slowly appearing. All of them were thinking about different things. Some were very excited. Some were suspicious. Some of them were only watching. They were watching in the hopes of finding out who had managed to kill a god spirit and take the god spirit’s place.\n\nThe Geno Hall had completely revealed itself now. The whole universe went pitch black, and only the green light shone in space with its beautiful vacillations.\n\nThe door of the ancient, mysterious Geno Hall looked like it hadn’t been opened for a billion years. Today, it was finally opened again.\n\nThis was different from Kong Fei’s lantern fight. And it was different from Ancient Water God’s fight to break through the door. This Geno Hall’s door was completely open. Any creature from any corner of the universe could see what was inside the door now.\n\nInside the door was a giant statue that looked like it had been made from jade. Although it was just a statue, it was too intimidating to be described. The mere sight of it weighed on the mind like an anvil. When creatures with weaker minds looked at the statue, they found themselves kneeling before they even knew what had happened.\n\nBut right now, blood was trickling down from the statue’s eyes. The sight filled everyone who saw it with sadness. It was intimidating, but it didn’t feel as threatening as one might have expected.\n\nWith many creatures watching, that statue slowly came out of the Geno Hall. A webwork of cracks covered it.\n\nWhen the statue passed the threshold of the Geno Hall’s door, it shattered into a countless number of pieces that scattered everywhere.\n\nThe sky shook as if a thunderstorm was rocking space itself. It was like the sky was crying over the death of a god spirit.\n\n“Who will be the new god spirit?” Sky Palace Leader squinted his eyes. He stared at the Geno Hall with its open door.\n\nA statue had departed the Geno Hall. There was an empty god slot up there now, and there was guaranteed to be a new master to claim the space. Sky Palace Leader wanted to know who, in that era, could go against the sky and slay a god.\n\nThe other people of Sky Palace felt the same way, too. They all stared at the Geno Hall door, and they waited for the elite who killed a god spirit to ascend to their rightful platform as a new god.\n\nBut after waiting for a long time, they still hadn’t seen a new being fly toward the Geno Hall to claim their seat. A voice boomed from the Geno Hall, sounding clearly across the nothingness of space. “Sky Vine Radish has fallen. The god’s personality is lost. Whoever has the personality of Sky Vine Radish can claim the god spirit’s seat.”\n\nEvery person in the universe was shocked. A god spirit had fallen, and the god’s personality had vanished. They had never heard of something like this happening before. The elite that killed Sky Vine Radish should have taken their god personality to the Geno Hall and become a god themselves.\n\n“What does it mean for a god’s personality to be lost? Does it mean that the elite killed a god spirit and didn’t take the god’s personality?”\n\n“No way. Such a powerful thing. Why did he not take it?”\n\n“Maybe the elite died alongside Sky Vine Radish.”\n\n“It is possible.”\n\nThe hearts of many people were pounding in their chests. If the elite and the god really had died together, then anyone could find where the god died, claim the personality, and become a god themselves.\n\nAs people all across the universe found their minds racing, the door shut, and the Geno Hall returned to the nether. But the sadness in the sky still lingered like a green mark. It didn’t fade."
}