{
    "chapter": 2700,
    "title": "Sea Palace",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2700",
    "text": "Their heads were like those of a buddha, and their tails spread like butterfly wings. Their bodies were really fat and round. Other than their black and white coloring, they looked a little like lion head goldfish. They were swimming calmly around inside the Four Sheep Cube, undisturbed by their rough exodus from Underworld Lake.\n\nBao’er was squatting near the Four Sheep Cube. She put her hand down into the water, wanting to touch the fish. The fish were only a few inches below the surface of the water. She put her arm into the water up to her shoulder, but still, she couldn’t touch those two goldfish.\n\nHan Sen frowned. He pulled out his Ghost Teeth Knife and thrust at the white fish below the water. The white fish was so close to the surface of the water, but when Han Sen thrust the knife in, the blade sank completely into the water without getting any closer to the white goldfish.\n\nThe two fish inside didn’t seem to know what was going on. They continued swimming around slowly.\n\nHan Sen frowned. Ghost Teeth Knife generated a dangerous knife air that flew into the water once more. While that demonic-looking Fang knife air was capable of tearing through the fabric of space, it was unable to touch the white goldfish.\n\nThe white goldfish was still swimming around slowly. It didn’t seem even remotely shaken by Han Sen’s attacks, and the few inches of water above it was like the length of an entire solar system. No matter how scary Han Sen’s knife air was, it couldn’t go through the water to touch the fish inside.\n\n“This Four Sheep Cube is so weird,” Han Sen thought to himself. He reached out, grabbing the cube and toppling it onto its side. Water began pouring out of the top of the statue.\n\nWater burst out like a flooded river overrunning its banks. The water poured out so quickly that it looked like it was going to form another lake, but the water level within the cube didn’t seem like it was being reduced.\n\n“What is this thing?” Han Sen thought, disturbed. The Four Sheep Cube was far too strange. Not even he could see or understand what it was.\n\nIf the statue was deified, it was still strange that Han Sen couldn’t get a power reading from it. And if it was just an ordinary object, it shouldn’t have been able to hold an ocean’s worth of water.\n\nHan Sen was lost in thought, so he didn’t immediately notice that Bao’er had climbed to the top of one of the bronze sheep heads. She used her foot to stomp on it.\n\nClearly, Bao’er was more than capable of holding a grudge. She remembered each and every time the sheep had mocked her as they fell back into the lake of clouds. So, she wanted to step on the heads of the sheep to unleash the anger she had been harboring all that time.\n\nBut when she started stomping the head, she heard a “katcha katcha” noise. The sheep head had been raised, but it was pushed down by Bao’er’s furious blows. The sheep head was lowered, as if it was about to take a bite of grass.\n\nBao’er was shocked by this, too. She hadn’t thought the Four Sheep Cube was fragile enough to break after being stomped on.\n\nHan Sen jerked his head up, immediately noticing the strange scene. The bronze sheep head had been stomped down by Bao’er, but the other three heads were still raised.\n\nAn ominous feeling rolled through Han Sen’s stomach. Before, when he struck the statue, he thought it was a very hard object. He had been unable to leave a single mark on the object. Bao’er, however, had almost broken one of the heads when she stomped on it twice.\n\n“If Bao’er didn’t use some special power to do that, then the cube…” Before Han Sen could finish his thought, he saw the swimming goldfish suddenly accelerate.\n\nAs the two goldfish swam, the water started to splosh and spin until a whirlpool formed.\n\nHan Sen realized this was bad. He grabbed Bao’er and turned to teleport away. He wanted to get as far away from the Four Sheep Cube as he could. But after picking up Bao’er, he realized he was too late. A powerful force of suction reached out of the cube and grabbed him and Bao’er. They fell into the whirlpool and quickly sank.\n\nThe 16 pigs got pulled in, as well. They were spun around inside the whirlpool alongside Han Sen and Bao’er.\n\nHan Sen held onto Bao’er as he tried to escape, but the world around him had turned into chaos. When he finally managed to regain control of himself and pull himself out of the water, he froze. The Four Sheep Cube sat quietly beside him, and the two goldfish were once more swimming placidly through the water. The vortex had disappeared, and the sheep head that Bao’er had stomped on looked ordinary again. Just like the other three sheep heads, it was raised. Its eyebrows were lowered and its eyes were half-open. It looked as if nothing had happened.\n\nThe 16 small piggies emerged from the water, too. They lay on the frame of the cube as they shook the water off of their skin.\n\nNothing seemed to have changed, but the environment around them was completely different. Han Sen and the others had been on the shore of Underworld Lake only moments before, but now they were someplace else. As he looked around, Han Sen didn’t even think that they were still in Outer Sky.\n\nThey were standing near a range of palaces. Unlike the palaces that could be found in Outer Sky, however, these palaces hadn’t been constructed atop mountains. Rather, they were built across the surface of a nearby sea.\n\nAll kinds of different palaces stood across the seemingly endless sea. They were like islands, spread out across an infinite ocean. This place wasn’t anywhere to be found in Outer Sky.\n\n“What is this place?” Han Sen looked around. Aside from the palaces, there was nothing much to see. There didn’t seem to be any living beings around, either.\n\nThe sea below them looked infinitely deep, but it wasn’t like an ordinary sea. The sea wasn’t blue; it was transparent like a crystal, and there were no waves. The water looked strangely quiet and still.\n\n“Dad, the sun is weird.” Bao’er lifted a finger to point at the sun in the sky. She looked at it with curiosity.\n\nHan Sen hadn’t noticed the sun, but now that Bao’er was pointing her finger at it, he looked and became just as shocked.\n\nThe sun was releasing light and heat, but it was so weird. Even calling it a “sun” was something of a misnomer. It was more like a clock in the sky.\n\nThe clock face held three needles, varying in length and thickness, which obviously represented seconds, minutes, and hours.\n\nAlthough there were no numbers on the clock, the position of the needles seemed to be showing that it was 12 o’clock.\n\n“A palace on a sea of silent water, where the sun is a clock… What kind of place have we come to?” Han Sen thought warily. He didn’t trust this place.\n\nThe palaces floated calmly on the surface of the sea, although nothing seemed to be holding them aloft. Even the Four Sheep Cube was floating unaided on the surface. Everything around them was so quiet. Since they had arrived, Han Sen hadn’t noticed a single sound or movement from their surroundings.\n\nThe two goldfish inside the cube were swimming. They seemed to be playing in the water.\n\nAs he looked around at the palaces spread across the sea, Han Sen wondered what he should do next. But as he did, he suddenly heard a sound from far away.\n\nDong! Dong! Dong! Dong!\n\nIn that moment, the air was filled with the sound of tolling bells. Han Sen turned his head up to the sky to get a look at the sun-clock. The three needles on the sun were pointing to the very top. For a normal clock, that either would mean it was 12 AM or 12 PM."
}