{
    "chapter": 2309,
    "title": "Phantom Ghost King Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2309",
    "text": "Bai Canglang took his four guards with him as he marched away. He turned hard eyes on Red Sleeve and said, “Who told you that you could cast a deadly attack on Han Sen?”\n\n“Maybe we can overlook the fact that Knife Queen rejected your offer, but for that Duke to disobey your wishes? I just wanted to make an example of what can happen to anyone who dares to cross you,” Red Sleeve said as she lowered her head.\n\n“I can take care of my own business. Don’t do that again, or I’ll see to it that your life ends there.” Bai Canglang grunted coldly, and then he said, “It was fortunate that you were unable to kill him. Not even I would be able to pull enough strings to get you pardoned for murdering someone in King’s Garden.”\n\n“I was being reckless. Please punish me.” Red Sleeve quickly bowed.\n\n“Whatever. Just don’t do it again.” Bai Canglang waved his hand and began to search for another primary root king dragon.\n\nBecause primary root king dragons showed up in different locations every time, the royal children were forced to search a new king dragon out every time they wanted to train. The only other option was to never leave the king dragon, even when the tree wasn’t releasing golden light.\n\nHan Sen and Bai Wei climbed back atop their primary root king dragon. They waited there for another chance to be taken underground.\n\nLuckily, only the royal children were permitted to access the King’s Garden, and there weren’t many of them. King Bai only had one hundred children.\n\nHan Sen and Bai Wei had some luck. Aside from Bai Canglang, they encountered no other royal children.\n\nNo one showed up over the next ten hours, and Han Sen thought that their training might go smoothly. But then he noticed someone flying quickly toward him.\n\n“Bai Wuchang!” Han Sen said, startled by the man’s sudden appearance. It was the same man he had met in the space station.\n\nBai Wuchang was clearly coming to see Han Sen. Bai Wei blanched when she saw him coming, but by then it was too late to run.\n\n“Han Sen. Why did you not come when I asked?” Bai Wuchang hung in the air, staring down at Han Sen.\n\n“I never agreed to come.” Han Sen raised his hands as he spoke.\n\nWhen Bai Wucheng heard Han Sen, his face did not move a muscle. His features were as still as stone, which gave him a great poker face. “In that case, how about you and I fight right here?”\n\n“I am Bai Wei’s guard, not some stadium gladiator. I will not accept…” Before Han Sen could finish, Bai Wuchang swung his knife at him.\n\n“Sh*t! Is everyone in the Extreme King this unreasonable?” Han Sen pulled out Ghost Teeth Knife to block Bai Wuchang’s sucker strike.\n\nClang!\n\nThe knives collided. Bai Wuchang was slashing downward, while Han Sen was pushing up. Purple and white knife airs came against each other. The knife airs broke and spread out everywhere.\n\nBecause Han Sen was standing atop the king dragon’s head, the shattered knife air hit the primary root king dragon and woke up the sleeping beast.\n\nThe primary root king dragon roared. Its body rose, and its golden dragon scales shook as it swung its head.\n\nThe primary root king dragon couldn’t release its power, but even its physical strength was terrifying. The power of its head-swing was capable of breaking the fabric of space. It created a teleportation and shadow effect, leaving behind afterimages of its head as it moved.\n\nHan Sen, Bai Wuchang, and Bai Wei were thrown off.\n\nBai Wuchang barely seemed to notice. He slashed at Han Sen from the air again.\n\nHis knife was like ice. The blade was very cold, but the power it exuded seemed minimal. It didn’t unleash ice power. It was very weird.\n\nHan Sen’s Ghost Teeth Knife came against Bai Wuchang’s knife twice, and neither of them appeared to have an advantage over the other. The primary root king dragon roared and tried to consume them.\n\nHan Sen flapped his wings and teleported. He wanted to get away from that angry primary root king dragon, but Bai Wuchang mindlessly rushed after him without a care in the world for anything else.\n\nBai Wuchang kept chasing him, and the king dragon kept trying to consume them. It made Han Sen angry. He pushed his Jadeskin and Blood-Pulse Sutra to the max. He focused on Bai Wuchang, who was drawing near, and slashed towards him.\n\nDong!\n\nBai Wuchang was a Duke, too. Han Sen’s blow landed on him and knocked him away. He fell a few thousand meters before he came to a stop.\n\n“Good! Good! Good! Now I see why you are considered to be on the same level as Lone Bamboo. You did not disappoint me!” Bai Wuchang wasn’t angry, but happy. He smiled.\n\nBut his face was way too stiff. The smile looked strangely forced as a result. It made people feel uncomfortable whenever they saw it.\n\nWhile they were talking, a cold white air erupted from Bai Wuchang’s body. The cold air turned into an icy fire that gave off no heat.\n\nWith the cold fire burning, Bai Wuchang’s body started to look transparent within his white armor. He was like a translucent phantom.\n\n“Phantom Ghost King Body! Han Sen, get back.” Bai Wei ran in front of Han Sen and placed him behind her. She spoke to Bai Wuchang, “Brother Wuchang! You are a prince. Attacking my Royal Guard like this will damage your reputation. People like Han Sen aren’t worthy of being your enemies.”\n\nBai Wei knew Bai Wuchang’s true capabilities. The king body of an Extreme King was usually activated at King class.\n\nIt was one of the reasons that Bai Wei was looking forward to King class.\n\nThis was true for all of the Extreme King, with the sole exception that was Bai Wuchang. When he was a Viscount, his king body awoke.\n\nHe was very talented. In the Extreme King, where everyone was so rich and powerful, he was a genius of extreme rarity. He usually didn’t need his king body to beat opponents of the same level, though.\n\nWith his Phantom Ghost King Body, he could challenge King class elites. Since Bai Wuchang had activated his Phantom Ghost King Body against Han Sen, it was evident that he was taking this fight quite seriously.\n\nThe rules of King’s Garden applied to all the royal children, but Bai Wuchang didn’t seem to care. He was completely ignoring the King’s Garden rule that forbade murder.\n\nBai Wuchang’s eyes danced with excitement. It was as if he didn’t see Bai Wei at all. He stared at Han Sen and said, “Come on! Fight me!”\n\n“Is this guy insane?” Han Sen sighed. He felt as if he was a magnet for nutcases. Before, Barr wanted to kill him. And now, Bai Wuchang. Han Sen wondered if there was something special about his body that made him attract such crazed individuals.\n\nBai Wei started to say something, but Bai Wuchang was already slashing downwards. In his eyes, it was as if she did not exist. He came swinging at Han Sen.\n\nBut Bai Wei stayed in front of Han Sen. She was going to take the blow instead."
}