{
    "chapter": 2564,
    "title": "Crocodile God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2564",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nLi Keer and Exquisite were feeling something beyond shock; as they watched Dollar make kill after kill, they were growing numb. They couldn’t wrap their heads around how Dollar was doing this.\n\nHe had used the Very High’s teleportation ability to beat a member of the Very High. Even Exquisite, whose face was forever cold and expressionless, looked shocked.\n\nIn fact, when they encountered the last two crocodiles, Exquisite had given up trying to steal the kills from Han Sen. She resorted to paying attention to how Han Sen moved. She wanted to learn how he moved faster than her.\n\nTo her surprise, Exquisite confirmed that Han Sen’s God’s Wander really was a beginner variant. It should have been slower than hers, yet for some reason, it didn’t look slow.\n\nThe fact that he seemed to be using the skill in an ordinary manner made Exquisite feel rather strange. A while later, Exquisite finally unearthed the truth.\n\n“This planet’s gravity doesn’t seem to affect him.” Han Sen’s teleportation ability wasn’t actually faster than hers, but it was unhindered by the gravity that hampered her. Han Sen used the ability at the same speed that he would anywhere else in the universe.\n\nExquisite’s theory was correct. Han Sen used the Dongxuan Area to stop the universal cogwheels of gravity. The planet’s gravity wheel no longer affected him, but Exquisite was still under its thumb. That resulted in her becoming slower than him.\n\nThe Dongxuan Sutra was similar to the Very High Sense, but they had been developed in different directions. As a result, the Very High Sense lacked this ability.\n\n“Power that can ignore the effects of gravity? That is very interesting.” Exquisite nodded. There were geno arts like that in the Very High, but she hadn’t chosen to practice them. So, she wasn’t surprised.\n\n“It looks like this place isn’t giving him a reason to display his true power. I need to wait until the Crocodile God shows up.” Exquisite hadn’t expected this to be an ideal place for Han Sen to demonstrate his true power, anyway. She hadn’t come here to watch Han Sen slay some demon crocodiles. She wanted him to square off against the Crocodile God.\n\nKing class xenogeneics weren’t easy to find, and the three of them only located a dozen demon crocodiles.\n\nBecause of the planet’s gravity and scary temperature, King class fighters that couldn’t teleport would be in a lot of danger if they came there to fight Chain Demon Crocodiles. And if it had been an easier place to hunt, there wouldn’t have been many Chain Demon Crocodiles for Han Sen to slay.\n\nAfter Han Sen killed seven demon crocodiles, another half-day of travel failed to bring them any more xenogeneics.\n\n“It looks like the demon crocodiles are getting wiped out by our efforts. Are there any other places with Kings?” Han Sen asked, still wanting more.\n\n“Since we’re already here, let’s walk around the planet just in case we’ve overlooked something,” Exquisite said.\n\nHan Sen readily agreed to that. It was rare to find King xenogeneics, so he needed to ensure he killed all the creatures they were able to find.\n\nThe three of them continued to scour the planet, and after a short while of walking, they discovered another demon crocodile. This time, however, Han Sen didn’t immediately strike.\n\nAfter all, Li Keer and Exquisite had brought him there. He would feel bad if he took every single kill. So, he decided to leave one for them to take out.\n\nExquisite seemed to look on Han Sen’s generosity with contempt. When Li Keer noticed Han Sen not moving, however, she knew exactly what he was thinking. She teleported forward and slew the Chain Demon Crocodile.\n\nLi Keer was weaker than Exquisite, but killing fourth-tier Chain Demon Crocodiles was a trivial task.\n\nAfter killing the crocodile, they saw some movement out in front of them. It looked like a bubble of lava rising to the surface of the planet, as if something was about to emerge from down below.\n\n“More demon crocodiles?” Han Sen asked, glancing in that direction. Then, he saw a demon crocodile appear.\n\nBut this demon crocodile looked different from the other demon crocodiles. It looked similar to the others, but this demon crocodile seemed smaller than usual. It was the size of an ordinary crocodile, and it didn’t have any wings.\n\nOrdinary demon crocodiles had red, metallic bodies. This one, however, was pitch black. If its body hadn’t been releasing a strange glow of some sort, it would have looked just like a normal crocodile at a passing glance.\n\nHan Sen observed the demon crocodile with narrowed eyes, and a wave of tension rolled through his body. He only felt this way when he was in danger.\n\nAs Han Sen observed the small demon crocodile, he remembered the behavior of the bronze furnace. He was able to guess what this creature was.\n\n“I thought it was the gravity and heat that frightened the bronze furnace. I guess there really is a deified xenogeneic here, huh?” Han Sen wasn’t terribly shocked about this. On the contrary, he was rather happy. Another chance to kill a deified xenogeneic was the best thing he could hope for. Han Sen was close to becoming deified himself, so he needed to collect as many deified xenogeneic genes as he could.\n\nIf he became deified, he wouldn’t be able to enter the core area. So he had to kill as many core deifieds as possible while he still could.\n\n“Careful. This looks like a deified demon crocodile,” Li Keer warned them.\n\nExquisite didn’t say anything in response. She had detected the Crocodile God’s presence a long time ago; the Very High Sense was better than the Dongxuan Sutra in this regard.\n\nThe Dongxuan Sutra could only sense what was in the area. The Very High Sense was about the sky and practitioner becoming one. When Exquisite stood on the planet, she could see everything on that planet clearly. She didn’t have to use an area to discover what was around her.\n\nAnd she was only using the Very High Sense at a very low level. If she reached the top level possible, she would be able to see and detect anything across the whole universe.\n\nOf course, that was just a theory on what a perfect version of the Very High Sense could do. No one in the Very High had ever become that proficient with it.\n\nThe Very High Sense focused on one’s senses. The sense-detecting ability was greater than the Dongxuan Sutra’s, but its ability of control was weaker than the Dongxuan Sutra. They both had their pros and cons.\n\nHan Sen observed the Crocodile God. The crocodile’s eyes looked like the eyes of a lion as it stared at them.\n\nIt might have just been the shape of the crocodile’s face, but the creature seemed to be staring at Han Sen and his companions with scorn. It also looked as if it didn’t care for their presence. That was especially true of its very small eyes. Its gaze was snobby and patronizing.\n\nAs Han Sen was about to move, the Crocodile God released a black light. That light was like a black hole that encompassed the entire planet.\n\nHan Sen’s body felt as if it was sinking. There was a loud noise, and he fell. He hit the planet’s surface with his limbs outstretched.\n\nHan Sen wasn’t the only one who had slammed into the ground in an undignified manner. Li Keer and Exquisite fell, too. They crumpled to the ground in very awkward postures. They no longer looked like elegant women.\n\nHan Sen cast all his powers to try and stand up, but it felt as if the strength of his abilities was being sucked away by a strong magnet. He was unable to get back to his feet. He couldn’t even lift his head off the ground.\n\nLi Keer and Exquisite were in a similar situation. They were unable to move.\n\nThe three of them were stretched spread-eagle on the ground, and they all watched the small crocodile come over to them."
}