{
    "chapter": 2946,
    "title": "Expensive Life",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2946",
    "text": "Han Sen did not have many high expectations. After all, its mother had a soul that weighed a measly 26 kilograms. The small goldfish’s soul would likely be less than half of that.\n\nBut the fate monument’s number managed to hit three digits, and it was increasing fast. The numbers were rising like mad. A second later, it hit four digits.\n\n“The soul is so weird. They are blood-related, but the weight of the soul has a massive difference.” Han Sen was shocked.\n\nNine Thousand King, who was nearby, said, “Although the soul is very ancient, under ordinary circumstances, it is hard for anyone to see souls. Only xenogeneic treasures like the fate monument can look into the soul you have. The weight of the soul is very hard to explain. Some low-level creatures have a very heavy soul. Some high-level creatures have a very light soul. Even if they are born from the same mother, their souls can be vastly different. It is hard to tell the rules and what determines the weight of a soul.”\n\nHan Sen nodded. He looked at the small goldfish’s number jumping up. After a while, the small goldfish’s soul number came to a stop at 7,493.\n\nNine Thousand King saw the little goldfish’s soul test come to a stop and sighed. “A 7,000 soul? It still has a lot to go before hitting 10,000.”\n\nAncient Abyss Grandmaster said, “What a shame. If one of us can hit 10,000, perhaps we can get out of this.”\n\nHan Sen looked at Ancient Abyss Grandmaster and asked, “Ancient Abyss Grandmaster, have you conducted your own test?”\n\n“Our people have already tested. There have been a few hundred to a few thousand. No one reached 10,000. If one of us had managed to do that, we wouldn’t have been trapped here.” Ancient Abyss paused before saying to Han Sen, “Now, there is only you and your daughter than has not conducted the test. I hope one of you can have a 10,000-kilogram soul so we can leave. Otherwise, we are all trapped here.”\n\nHan Sen nodded. He pricked his finger and drew out a drop of blood. He threw it at the fate monument.\n\nHan Sen’s blood was red. It was red like a ruby. It landed on the fate monument and shattered. The fate monument absorbed it. The entire monument turned into a crystal ruby.\n\nThe numbers on top of the monument showed up. They were jumping so fast. The numbers increased and quickly hit three digits.\n\nNine Thousand King saw Han Sen’s soul was over a thousand. He looked jealous as he said, “Mister, you have an expensive life. You have reached four digits so fast. It looks like hitting 10,000 will not be difficult for you.”\n\n“You overestimate him,” Sky Palace’s first seat coldly said.\n\nThe other people did not know about this, but he did. Han Sen was a creature from the sanctuaries, and he had seen Han Sen’s talents. His genes were not stable, and his talents were just average.\n\nAlthough the weight of the soul had nothing to do with one’s genes or talents, the rules of the sanctuaries would hurt the soul. Not many people knew that.\n\nSky Palace’s first seat wanted to force his way into the sanctuaries. He had been hurt before by it, so he knew all about it.\n\nMany race elites knew the crystallizers had escaped to the sanctuaries. Under the rules of there, they would not believe the soul of a crystallizer could be greater than 10,000 once they left.\n\nAncient Abyss Grandmasters and the others stared at the fate monument’s number. This could free them. They were hoping Han Sen’s soul could exceed 10,000.\n\nNine Thousand King heard Sky Palace’s first seat and felt a bit angry. He coldly said, “Mister’s life is very expensive. Cheap people like you cannot measure it.”\n\n“Oh, really? I would like to see how expensive his life is.” Sky Palace’s first seat spoke gently, but his face made Nine Thousand King very mad. He wanted to kill him with his hands.\n\n“Five thousand…” an Extreme King could saw that Han Sen’s soul weighed above 5,000, which gave them hope.\n\n“Eight thousand…” Ancient Abyss’ eyes started to change.\n\nAfter nine thousand, even Sky Palace’s first seat’s eyes looked strange. Clearly, he had a hard time believing that Han Sen, a person who had come from the sanctuaries, possessed such a heavy soul.\n\n“Weird. The rules of the sanctuaries claim they will reduce your soul. He comes from the sanctuaries. Why would he have such a heavy soul?” Sky Palace’s first seat frowned.\n\nThe number kept on jumping. It was getting very close to 9,999. The few deifieds of the Extreme King held their breath. They stared at the number on the monument. They hoped the number would jump even faster to reach the breakthrough.\n\nFinally, as everyone watched, the four-digit number reached nines across the board. It became 9999. At the same time, the number on the fate monument stopped.\n\nIt had instantly stopped, but in the eyes of the deifieds, it felt like a century.\n\nIn the next moment, the number on the stone monument jumped. This time, the number did not increase. Instead, the numbers returned to zero.\n\nEveryone was shocked. A deified Extreme King said, “What is going on? I thought once you reach 10,000 kilograms you are allowed to escape the suppression of the fate monument. Why has the soul’s weight suddenly returned to zero?”\n\n“There is no way Han Sen’s soul is just 9,999. He only needed one more to reach 10,000.”\n\n“Go and look behind the monument. See if Han Sen’s soul is there.”\n\nEveryone went around the back of the monument for a look. Suddenly, the fate monument was shining brightly. The fate monument was dyed red because of Han Sen’s blood. It released 10,000 bright lights. It was like 10,000 glistening waterdrops were flowing out.\n\nThe whole ground started to shake. The 10,000 lights of the fate monument were rising. They left the ground and floated in the air.\n\n“Roar!”\n\nEveryone was shocked when they heard the fate monument make a sound like a beast roaring. It was like a tiger or a dragon. Everybody next saw the red fate monument turn into holy white. A white, jade looking Holy Kirin beast came out of the sky. The holy light on it was like a sun. It lit up the entire dark area.\n\nThe broken floor… The ruined buildings… All the broken machines… With the Holy Kirin’s very bright, holy light, Han Sen and the others saw everything clearly.\n\nAside from that, fairy-looking shadows were floating across the ruins. These fairy bodies were half-transparent. They looked like blue jelly.\n\n“These are space charms.” Han Sen suddenly remembered the description of them from Nine Thousand King."
}