{
    "chapter": 1101,
    "title": "Humans and Spirits Are Happy",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1101",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nPeople who hadn’t seen Han Sen fight before were in shock. The rainfall of coins was insane.\n\nSu Xiaoqiao was excited when he saw the coins be unleashed. He had witnessed their might before, but he still harbored wariness. He wasn’t entirely sure they’d be as effective against such a powerful spirit.\n\nFei Yu King noticed Han Sen’s lack of speech, so he immediately drew his bow. The weapon was bathed in a white light.\n\nWhoosh!\n\nCountless white arrows were fired upwards, targeting the individual coins. A loud flurry of noises came from the air, as each and every arrow was shot down.\n\nThe humans were all in shock, not expecting such a quick and efficient retaliation. They quivered in the hope that Dollar would not lose.\n\n“What is The King doing? Those coins are rubbish.”\n\n“His inability to inefficiently fight Fei Yu King is to be expected.”\n\n“The skill is useless.”\n\n…\n\nThe spirits did not think the coins were very good. They might have looked impressive, but that was about it. Their actual effectiveness in battle against such a foe was nil, they believed.\n\nIt appeared as if Fei Yu King wanted to shoot down all the coins, but what he wanted to do was blow them up. But strangely, the arrows fell with the coins attached.\n\n“How?” His nine gene lock power should not have been rendered worthless like that.\n\nIt would have been ridiculous to believe The King had opened eight gene locks.\n\nBut the coins were not stopped, and they continued to fall like rain. Each drop went with the grace of a warming holy light.\n\nIt was too late for Han Sen’s opponent to dodge, so he merely fired more arrows in a final bid to stop the coins.\n\nThe coins fell, but they were quickly replaced as Han Sen summoned more. It was now a storm of coins, and before it was over, the coins were no longer like rain. They were like a waterfall, and they quickly and brutally buried Fei Yu King.\n\nHumans and spirits alike were in shock.\n\nFei Yu King wished to fly away, but the coins were incredibly heavy.\n\nHe was shocked. He had wholly underestimated The King and the coins he commanded.\n\nHe wanted to shake them off, but he couldn’t. Each one was like a mountain that wished to trap him.\n\nFei Yu King was most efficient with speed and archery, so he didn’t have to fight Han Sen face-to-face.\n\nHe underestimated The King, so he had gone into battle casually and without worry.\n\nRoar!\n\nFei Yu King shouted like a beast, one that was stuck and unable to escape the trappings of a hunter. He wished to shake them off so he could fly away, but there was nothing he could do.\n\nHe managed to get airborne, but after a few meters of slow flight, he was grounded again. And then, he began to sink into the stage.\n\nHis body looked as if it was ready to burst under the frightening pressure of all those coins.\n\nPang!\n\nFei Yu King was on his knees.\n\nEveryone was shocked by what was happening. A nine gene lock king spirit was unable to stand up and fight Han Sen, and was instead on his knees before him. His body was cracking like glass.\n\n“Dollar is too f*cking strong!” Su Xiaoqiao shouted.\n\n“I can’t believe he beat a king spirit so easily.”\n\n“If he was joining Divinity’s Bout, he must have come prepared. It would have been silly to doubt him.”\n\n“King spirits are nothing compared to our Dollar.”\n\n…\n\nA lot of spirits were sharing a similar glee and happiness, too. They knew how strong Fei Yu King was.\n\n“The King completely owned Fei Yu King!”\n\n“With a wag of his finger, he beat a nine gene lock king spirit. Can you believe it?”\n\n“Hail to The King, baby.”\n\nEven the faces of the emperors had changed.\n\n“What? He was like us, wasn’t he? Supposedly, he had only three gene locks open. How can he beat Fei Yu King a mere few years after?” Thunder-Devil King exclaimed in confusion.\n\nFlower Empress said, “How did he accomplish such a feat?”\n\n“He is frightening. How many gene locks did he open in just a few short years?” Heavenly Empress said, with a surprisingly dour expression and tone of voice.\n\nBoom!\n\nFei Yu King was completely crushed by the coins, and he exploded.\n\nBlood and feathers danced in the air, as a jellified body remained like a heap of rubbish on the floor.\n\nSha!\n\nThe coins disappeared, leaving behind only the feathers and blood.\n\nA nine gene lock king spirit had been destroyed, just like that.\n\nSeeing Fei Yu King respawn, everyone suddenly became silent.\n\nWhen Han Sen left the stage, the humans and spirits woke up from a daze.\n\n“Dollar beat a king spirit! Is it time for humanity to grow strong in this place?”\n\n“Hail to The King, baby!”\n\nHumans and spirits alike were happy for Han Sen’s victory. They both believed him to be on their side."
}