{
    "chapter": 3068,
    "title": "Omen",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3068",
    "text": "“Old Liar, I am hungry.” On the streets, there was a pretty little girl who looked like a doll. She was pulling the sleeves of the old man next to her. Her eyes were wide open as she looked at him. She made sure to make herself appear extra pitiable.\n\nHer face looked like she was starving, and she had a lack of clothes. It was like she was abused. It made others want to take pity on her and cry when they heard the stories she told. The corners of the old man’s eyes twitched. A half a day ago, Bao’er ate the most expensive meal in the most expensive restaurant and had emptied his wallet of every penny it contained. Even he was starting to believe it. He wanted to smack his mouth and curse himself for being useless. He could not even raise a little girl well.\n\n“My little kid, ever since you’ve been with me, your mouth has not stopped moving,” the old man depressingly said. “With the way you eat, even if there was a mountain of gold and a mountain of silver, it’d be eaten by you. How did that Han Sen used to raise you?”\n\n“Dad would not let me starve. If you are saying you cannot afford to take care of me, I am going back.” Bao’er looked grumpy. She turned around, ready to leave. “Little kid, I concede. I will take you someplace nice to eat,” the old man said while dragging Bao’er with him.\n\n“Old Liar, don’t you dare try and lie to me.” Bao’er squinted at the old man.\n\n“I would lie to everyone else, yes, but you?” the old man asked. “You just need to wait here for a bit. I will take you to eat something very nice and spicy. You can eat whatever you want there. I promise you you’ll be full.” “You are very nice, Old Granddad.” Bao’er smiled a lot. She held the old man’s hand and behaved very cutely.\n\n“This girl… It does not make sense. How could she have been raised to this age… How did that bastard Han Sen grow you so big?” The old man was speechless.\n\n“By the way, Old Liar, I thought you ran out of money.” Bao’er looked at the old man and blinked as she spoke to him. “Eating food does not require money all the time.” Bao’er was holding a flag while he walked across the street. He went searching for something. Not long later, he bent over and picked up a stone that was sharp and fist-sized.\n\nHe pulled Bao’er along as he kept walking. When they came to a T-junction, he looked to his left and right. He then put the sharp stone on the corner that turned.\n\nBao’er blinked and asked, “Can we get money to eat this way?”\n\n“Of course, tasty stuff will come here right now,” the old man said. He pulled Bao’er forward to walk with him. Not long later, they stopped near the street. He put down the flag and placed a yellow cloth on the ground. He pulled out a chair and sat on the cloth. He closed his eyes and rested.\n\n“Old Liar, is this going to work?” Bao’er waited for a while, but nothing tasty appeared.\n\n“Do not rush. It is on its merry way.” The old man’s eyes did not open. He looked calm as he spoke to her.\n\nAfter a while, the street suddenly had chickens flying and dogs jumping. They saw a guy riding a gold, big crab gene race. It was skittering around the street, making the street all dirty.\n\nSeeing this big, gold crab that looked like a tank come close to them, the old man’s eyes and lips suddenly became very thin. He then blew out air and made a strange noise. When the big gold crab heard that sound, its crazy moving body came to a halt. The person atop the beast looked rather excited. The gold, big crab came to a stop. It was a sudden one, so the man was thrown right off. It looked like a dog eating sh*t. His head went in front of the fortune-teller old man with a shock.\n\nThe old man looked at the young man who had fallen with his ass sticking up and said, “Old man, I have seen your forehead go dark. Did your head suffer a stroke of misfortune? Today, you will be suffering a curse.”\n\nThe young man picked himself up off the ground. He wiped the blood off his nose, looked at the old man, and coldly said, “Old man, how dare you to start talking to me. Do you have any idea who I am?”\n\nAfter that, the young man reached out his hand to punch the old man. The old man did not move. He coldly said, “If I am not mistaken, you just experienced changes that can make a sad man very happy. You have an opportunity before you.”\n\nWhen the young man heard that, he was shocked. The fist that was going to strike out was lowered.\n\n“Old man, who sent you here? How could you know everything about me?” The young man stared at the fortune-telling old man and checked him out.\n\nThe fortune-telling old man shook his head. “I do want to save people, but people are always so ignorant. Never mind.”\n\nAfter that, the fortune-telling old man picked up his shop. He took the little girl with him as he left. In the meantime, he said to himself, “God is jealous of geniuses. What a shame…”\n\n“Hang on, what did you mean, old man? At least, tell me. Otherwise, I am going to break your old teeth. Then, you will never talk crap again.” The young man reached out his hand and stopped the two from leaving.\n\nThe fortune-telling old man sighed and said, “I am afraid you will not believe me even if I do tell you. How about this? I will give you one tidbit. You do not have to pay for it. If it is useful, it will be a pleasure of mine. If it is not useful, neither of us loses a thing.”\n\nAfter that, the old man took out a rope and gave it to the young man.\n\n“What do you mean?” The young man accepted the rope with suspicion. It seemed to be an ordinary rope. It was less than 9 feet long with small threading.\n\nIf it was not for the fortune-telling man telling him what happened, with that young man’s attitude, he would have hanged the old man with the rope. The old man said, “Put the rope around your waist and put the other on the gene race. Then, you will find out.”\n\n“Fine. I will see what you are up to. If this is a waste of time, I am going to come back and break your stupid mouth. Someone come here and keep an eye on this old man.” Because of what the young man shouted, a few big men appeared. They prohibited the old man and the young girl from leaving.\n\n“I have stuff to do. If it does not work, when I come back, you are very dad.” After the young man said that, he jumped atop the crab’s back. Following the instructions given to him by the old man, he tied one end of the rope to his waist and the other end onto the gold crab. He took the crab and sought to leave.\n\n“Hang on. Pull the rope one foot and seven inches shorter.” The fortune-telling old man stopped the young man.\n\nThe young man did not really believe him. No matter what happened today, no one would have been able to see it. There was no way for others to know. The fortune-telling old man spoke correctly, which had made him scared. It was hard to believe, which was why he thought he should give it a go.\n\nThe young man pulled the rope shorter and thought, “After I am done, if this stupid rope does not do anything, I am going to break his mouth.”\n\nJust as he just tied up the rope, the gold crab turned around and started to spin extremely fast. The young man fell from the crab’s back. The young man’s eyes opened wide. He saw himself almost fall on the ground. His waist felt tight. He was only half a foot away from the ground hanging by the rope.\n\nThe young man had a closer look. He quickly broke out into a cold sweat. There was a sharp rock five inches away from his left eye. If the rope had not pulled him when he fell, he could have been blinded.\n\nHe thought about the consequences of the rope. The young man’s legs went soft. He had a cold sweat. He felt like it was too close.\n\nA few young men surrounded the old man and girl. Many people saw this. The young man, who had gone around the corner, had come back. He was running and screaming, “Old Fairy… Old Fairy… Old Fairy you are like a god…”"
}