{
    "chapter": 992,
    "title": "The Reversed Dragon Scale",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_992",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nMoment Queen’s heart pounded in her chest as she watched Bao’er hit the floor with the ring in gleeful childplay. She wished to snatch it back.\n\nBut if she showed any interest in the ring, she knew Han Sen would take it away from her for good.\n\nBao’er continued to play with it, and Moment Queen hoped she’d soon lose her interest in it.\n\nAs Bao’er swung her arms around, with her fist clenching the ring, it looked as if it’d slip out from her grasp, any second.\n\n“Bao’er, that belongs to the dead. You shouldn’t do that.” Han Sen was afraid she’d end up eating the ring.\n\nBao’er was stronger than anyone he knew, but on a certain level, she was still a baby. He still felt compelled to be as protective as any reasonable parent should.\n\nWhen Moment Queen heard him speak, she hoped Han Sen would tell her to discard the ring.\n\nShe knew she still had to act cool and not show any interest, so she held back for a while and just watched Bao’er.\n\nBut then, Bao’er stopped messing about and just sat there. She fiddled the ring between her fat, wrinkly baby-fingers. It seemed as if she was actually considering whether she should keep it or throw it away.\n\nSuddenly, she raised her hand as if to prepare a throw.\n\nMoment Queen’s glee and excitement immediately returned, and in her heart, she started shouting, “Throw it! Yes, throw it!”\n\nBao’er’s hand raised the ring… and stopped. She didn’t throw it, and the baby’s crooked face suggested she was still deep in thought over whether or not to keep the ring.\n\nMoment Queen’s face turned dim again. Soon, Han Sen would find the scale. And when he did, her opportunity of nabbing this ring for herself would go, too.\n\nBut then, Bao’er pulled back her raised arm, as if to finally throw the ring away.\n\nThis delighted Moment Queen. But the rollercoaster of emotions showed no sign of slowing down, as Bao’er’s arm dropped with the ring still in her possession. Moment Queen’s mind was furious, screaming, “Just do it!”\n\nFinally, Bao’er came to a decision. Her face looked serious, and she seemed ready to throw it in Moment Queen’s direction.\n\n“Yeah, that’s it. Come on, baby. Come on.” Moment Queen opened her arms, as if to gesture that she should really throw it her way, and prepare to catch it.\n\nBao’er’s face dropped its babylike glee, though. She was serious, like a baseball player, preparing to throw the game-saver.\n\nSeeing Bao’er ready to throw, Moment Queen’s hands opened wide. The baby’s arm launched forward but… no ring left the clutch.\n\nBao’er smiled to Moment Queen like a little demon. She stood up, with the ring firmly in her hands, and ran over to Han Sen.\n\nBao’er climbed on top of Han Sen’s back and forced the ring on him.\n\nHan Sen accepted the ring and smiled at Moment Queen.\n\nMoment Queen, after seeing their impish smiles, knew she had been tricked.\n\nHan Sen must have known there to be something special with the ring a long time ago. To test her faithfulness, and whether or not the ring was a worthy item for the taking, he pranked her.\n\n“*sshole! *sshole father! *sshole daughter!” Moment Queen’s mind was an inferno of raging hatred, particularly so when she realized she had been tricked by a baby.\n\nHan Sen took the ring. He didn’t know what good it would do him, if any, but if Moment Queen wanted it that badly, then he knew he’d be better off with it.\n\nHan Sen did not say anything, though. He ignored Moment Queen and continued searching. He lifted up the armor and saw a scale that looked like that of a fish. It almost looked like a shell.\n\n“Brother Dragon, you’re very dead, aren’t you? That means you won’t be needing this, right? Don’t worry, skeletor, I’ll make good use of it. You have my word. And who knows? I might make you famous again,” Han Sen said to the withered husk, as he plucked the scale from its bony torso.\n\nPerhaps it was because the body was dry, but he had no problems taking the scale.\n\nWhen his fingers felt the scale, it was cool to the touch. The scale was white and semi-transparent.\n\n“Moment, is this the reversed scale you mentioned?” Han Sen asked.\n\n“Yes,” Moment Queen coldly answered.\n\n“Is there anything else around this place worth taking?” Han Sen asked, with a tone of slight mocking.\n\nMoment Queen wanted to kill Han Sen. If it wasn’t for the ring, he wouldn’t even have learnt about the scale, either.\n\n“No,” Moment Queen coldly said.\n\nDragon King died because of his attempt to level up. It was not his tomb or shelter, so it was likely she was telling the truth and there really was nothing else worth taking.\n\nFinding the ring was lucky enough. And it was only through the emperor’s stubbornness it was there for Han Sen to claim.\n\n“Well, if there’s nothing else for us here, we should take our leave.” Han Sen then returned the way he had come, and placed the angry Moment Queen back in the Sea of Soul.\n\nWith Bao’er up front, leading the way, the return trip to the shelter did not take long. Resting in his hall, Han Sen fiddled with the ring and scale he had retrieved.\n\n“Moment Queen wanted this thing pretty badly. I wonder what it does, exactly?” Han Sen couldn’t discern what made either item special.\n\n“Well, treasure is treasure. And besides, I’ve been needing a ring to pull my bow.” Han Sen then placed the ring on his finger.\n\nWhen he wore it, though, the red of the ring seemed to come alive. It glowed menacingly, and the sound of a roaring dragon boomed through the hall."
}