{
    "chapter": 2536,
    "title": "Very High",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2536",
    "text": "In that instant, the faces of Bai Wan Jie and all the royal knights grew pale. They all knew that what had just happened wasn’t a dream. Hundreds of Kings and half-deifieds had summoned and unleashed their power.\n\nBut without moving, Han Sen had erased everyone’s power in the blink of an eye. What he had done was scarcely believable.\n\nLi Keer’s face changed, too. She couldn’t wrap her mind around what had just happened, and she stared at Han Sen where he sat casually. There was no way that she could have done what he just did so easily.\n\n“The No Taboo skill… you are of the Very High!” Bai Wan Jie suddenly said to Han Sen.\n\n“I’m not one of the Very High. I am human,” Han Sen said simply.\n\nAlthough Han Sen denied it, Bai Wan Jie did believe he was one of the Very High. He raised his hand and said, “If you are one of the Very High, then this is beyond my ability to handle. But the Extreme King will demand an explanation from the Very High’s elder.”\n\nAfter that, Bai Wan Jie waved his hand, and his royal knights formed ranks and left with him. Not a single one remained.\n\nHan Sen was shocked. He didn’t know what was going on. He had already used his gold general, and he was ready to kill them if he had to. But when he canceled their powers, he had simply used his Dongxuan Area. He didn’t know what was wrong with Bai Wan Jie. After declaring that Han Sen was one of the Very High, the man had stormed off like a sulking child and threatened to tattle on Dollar to the Very High.\n\nLi Keer didn’t know how to process what had just transpired. She felt numb. She could no longer predict what might happen next. Bai Wan Jie believed Dollar was one of the Very High.\n\nThere was a Very High present, but that Very High was Li Keer, okay? She felt rather indignant that Bai Wan Jie had assumed Dollar was the Very High.\n\n“You cannot blame Bai Wan Jie for his assumption, though,” Li Keer thought glumly. “The powers Dollar used are similar to my No Taboo of the Very High. But while the two powers might be similar, they aren’t exactly the same.”\n\nLi Keer had planned to reveal herself as one of the Very High, suppress Bai Wan Jie, and pull Dollar out of the fire. But by assuming that Dollar was a Very High, Bai Wan Jie had stolen her thunder. It made her—the real thing—become quite speechless.\n\nIf she said she was one of the Very High now, the effect she expected would be gone. Han Sen wouldn’t owe her anything, and it’d just make things awkward.\n\n“You are one of the Very High?” Li Keer asked, looking at Han Sen and pretending to be shocked.\n\n“I’m not one of the Very High. Didn’t I tell you I was human?” Han Sen said in annoyance.\n\nLi Keer laughed. “If you were one of the Very High, just the name would shock anyone. The Very High are the first race in the universe. If I was one of the Very High, I would be proud to reveal it.”\n\n“I don’t know anything about the Very High,” Han Sen grumbled. “I am human and I am proud of it!”\n\n“Right.” Li Keer thought to herself, “I have never even heard of humans before. How can he compare himself to us?”\n\n“Let’s just go,” Han Sen said, standing up.\n\n“Give me the core gene.” Li Keer reached out her hand.\n\n“What core gene?” Han Sen pretended to be shocked as he looked at Li Keer.\n\nAlthough he had the Sea Sky Eye core gene, he hesitated to give it to her. He wondered if it was really a worthwhile trade to swap it for the final part of Li Keer’s Galaxy Teleportation teaching.\n\nThis was the primary material for creating a Sky Eye defensive system; he wouldn’t find another one. This was the only material of this type that he would be able to use in trade.\n\nThere was also the fact that Han Sen had used the Gold Robot General to steal the Sea Sky Eye. If he gave it to Li Keer, that meant divulging his association to the gold general. If word about this got out to the Extreme King, nothing would stop them from coming after him.\n\nAlthough Han Sen wasn’t afraid of provoking the Extreme King, there was no need for him to do something that wouldn’t earn him a benefit.\n\nLi Keer smiled and said, “My power isn’t incredibly strong, but I can be insightful. I have another skill that is akin to Galaxy Teleportation, and I’m very good at reading situations. I have seen you control the Gold Armor General to steal the Sea Sky Eye and the Sky God Pillar. I also watched you exit the Gold Armor General. Are you going to break your promise?”\n\nLi Keer was just bluffing Han Sen, though. Of course, she hadn’t seen Han Sen exit the Gold Armor General.\n\nHan Sen was shocked. Li Keer should have been playing chess here the entire time. If she was able to tell what happened in the fight, she couldn’t have been bluffing.\n\nBut Han Sen didn’t believe she had really seen him come out of the Gold Armor General. He had used his Dongxuan Area to keep the universal cogwheels around him from moving. If someone was watching him, he should have been able to feel it.\n\nBut Li Keer was smart. When she saw Han Sen looking so shocked, she knew she was right. She looked at Han Sen with surprise, and said, “I was just guessing. It really was you, huh?”\n\nHan Sen shrugged slightly. He neither denied nor admitted it. He pulled out the Sky Eye Core gene and presented it to her.\n\nIf Li Keer had guessed this, then there was no point in him denying it. Although the Sea Sky Eye was good, Han Sen didn’t even know how to build a Sky Eye. It was pointless for him to hold onto it.\n\nPlus, Han Sen was very interested in the final part of Galaxy Teleportation. So, he decided to make the exchange with Li Keer.\n\nEven if Li Keer told people that he had stolen the Sea Sky Eye, it wouldn’t really affect him. No one knew who Dollar was, anyway.\n\n“How did you do that? You can control the Gold Armor General?” Li Keer looked at Han Sen as she moved to take the Sea Sky Eye.\n\n“Where is the final part of Galaxy Teleportation? We make the trade at the same time.” Han Sen pulled his hand back, not allowing Li Keer to take the Sea Sky Eye.\n\nLi Keer hesitated. She wasn’t really all that interested in the Sea Sky Eye. The item could make a fake Sky Eye, but it wouldn’t have the power of the original. It would be great if it could copy just sixty percent of a real Sky Eye’s strength. Maybe the weaker Extreme King might have been interested, but the Very High didn’t need such a bauble.\n\nBut if Li Keer didn’t make the trade, they might have to go their separate ways. And that was something Li Keer did not want.\n\n“The next part is complicated. You didn’t even finish the first part of Galaxy Teleportation, so you wouldn’t understand even if I told you the final part. But that is okay. I have time, and so I will teach you slowly,” Li Keer said with a laugh.\n\nLi Keer didn’t ask Han Sen to hand the Sea Sky Eye over, which made him feel a little more comfortable with the arrangement. He took Li Keer with him to continue hunting xenogeneics.\n\nBefore Han Sen traveled far, Dragon One and Dia Robber flew over to them. Dia Robber looked extra happy as he said, “Brother Dollar, you must be one of the Very High! How can you be so strong?”\n\n“I worry too much. If Brother Dollar is one of the Very High, it doesn’t matter how brave Bai Wan Jie is: he will never dare to hurt a hair on your head,” Dragon One said.\n\nHan Sen and Li Keer looked weirded out upon hearing this, but they were reacting for very different reasons."
}