{
    "chapter": 2436,
    "title": "Girls Should Not Fight",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2436",
    "text": "The white-haired man looked at the little red bird in his hand. It kept squirming, thrashing its wings as it tried to escape the grasp. He spoke to himself, saying, “You really have phoenix and fish bird genes? And it is still so young? Who could do something like this?”\n\nBao’er looked at the white-haired man. She blinked and said, “Are you going to bully a kid and her pet?”\n\nWhen the white-haired man heard Bao’er, he turned to her and smiled. Raising his hand, he freed the little red bird. It flapped its wings and quickly hid behind Bao’er, too afraid to reveal itself.\n\n“What is your name?” the white-haired man asked Bao’er.\n\n“Bao’er, Han Bao’er,” Bao’er answered seriously. Aside from the times when she was with Han Sen and Ji Yanran, she was rarely so honest.\n\n“Not bad. Say hi to your father for me.” The white-haired man nodded to Bao’er, then turned to leave.\n\n“What is your name?” Bao’er asked, looking at the white-haired man’s back.\n\n“Tai Yi.” The white-haired man didn’t look back. He kept on walking. After a few steps, though, his body began to disappear into a ripple in space.\n\n“What are you doing?” Bao’er asked.\n\n“Calling in a debt. It’s time that I get back something that doesn’t belong to them.” The white-haired man’s voice echoed through the cosmos, drifting from an increasing distance until it vanished entirely.\n\nFalling Leaf was left trembling. She had never seen someone use a teleportation skill while still sending back their voice. Even King Bai couldn’t do something like that.\n\nAs Falling Leaf recovered from her shock, someone cried out, calling for aid.\n\n“Help!”\n\nThey turned around, and a girl wearing pink clothing was running through in the middle of the fight. She sprinted toward them, screaming and sobbing.\n\nA Duke xenogeneic worker was chasing after her. It had no weapon, and it was reaching for the woman with its bare hands.\n\nBased on how she was moving, the woman seemed stronger than the Duke worker. But she also looked terrified, and she ran recklessly without the will or courage to look back.\n\nBao’er cocked her head curiously as Ning Yue approached. She remembered Ning Yue, and no matter how much she tried, she couldn’t connect this Ning Yue with the powerful person she used to know.\n\n“Help me! Bao’er, help me!” Ning Yue pleaded, running forward like a dog with its tail between its legs.\n\nFalling Leaf was about to stop Ning Yue, but Bao’er hastily told her. “Let him come.”\n\nNing Yue stumbled clumsily into the ruins of the room, and when she got there, she hid behind Bao’er, still shaking. “Too… Too scary! Save me, Bao’er!”\n\n“Ha! Little Miss Ning Yue, you should be much stronger than that lame Duke. What are you afraid of?” Bao’er laughed, looking at Ning Yue as if she was eyeing a fun new toy.\n\nTremors still ran through Ning Yue’s body. Her face looked pale. She really seemed to be rattled.\n\n“Fighting—fighting is wrong! Murder is even more wrong… Plus, I am such a beautiful girl…”\n\n“Ha!” Bao’er couldn’t help but laugh. Her eyes smiled like a crescent moon, and she stroked Ning Yue’s hair. “Right, right. You are so right. Pretty and cute girls like us shouldn’t be fighting and killing.”\n\n“I know, right?” Ning Yue frantically nodded her agreement. She still looked to be on the verge of a nervous breakdown.\n\nFalling Leaf didn’t agree at all. She swiftly used her dagger to cut the Duke’s head off.\n\n“What happened? Why is this happening? Does this have something to do with that man?” Falling Leaf looked around. The killing was taking place everywhere, and she didn’t seem to know where to look.”\n\nMore creatures were toward them. Falling Leaf warned them loudly to stay back, but they didn’t listen to her words, and so she had to fight and cut them down.\n\n…\n\nHan Sen and Miss Mirror were still having a stand-off. Neither of them had yet made the first move.\n\n“Me or her. You can only pick one.” Miss Mirror eyed Han Sen, her grip on the broken sword still tight.\n\n“Let’s leave here together. This place is so scary; it will be safer if we go someplace with more people.” Han Sen smiled.\n\n“Safety depends on what kind of partner you have. I don’t want to haul a ticking time bomb around with me, not knowing if it will explode at any moment,” Miss Mirror said.\n\n“Then how about you keep going on ahead by yourself, and I will turn back with the girl. Is that okay?” Han Sen said after a moment of thought.\n\n“No. Do you want her to bring harm to my Spring Rain?” Miss Mirror frowned.\n\n“Then I will wait here with her and not go anywhere,” Han Sen said.\n\n“No. If you cannot do it, then I will do it for you,” Miss Mirror said. She swung her sword at the girl in Han Sen’s arms.\n\nMiss Mirror had become King class, but her will and intelligence were still deified. Her slash appeared like a rainbow, not straight, but mysteriously curved. It made it very difficult to tell where the sword was headed.\n\nHan Sen’s movements were also difficult to predict, but after a couple of attempts to evade the attack, he was still unable to dodge Miss Mirror’s sword. He threw his palm out to intercept the broken sword. He touched its hilt, but not its blade.\n\nThe broken sword could cut through a requiem tree, so it was far too sharp to counter directly. Han Sen wouldn’t use his own weapon to block the blow. Even a deified treasure might be destroyed by the broken sword.\n\nBut when his palm struck the hilt of the broken sword, a sharp pain seared through his chest. A wave of power sent him flying and made his ribs groan under the strain. He tasted blood in the back of his mouth.\n\n“What’s going on? Something injured my chest. Is this my own power?” Han Sen thought to himself, but Miss Mirror’s broken sword came slashing toward him again.\n\nMiss Mirror was proving why she had been such a powerful deified elite. Her sword skills far exceeded Han Sen’s abilities, and she was still extremely strong.\n\nAnd her sword skills were uncanny. No matter how much Han Sen varied his movement patterns, he couldn’t avoid the strike. It was kind of like a Falsified-Sky attack, but this attack lacked Causal powers.\n\nPang!\n\nHan Sen had to reach out his hand to counter the attack. Like last time, his hand struck the hilt of the broken sword. Another impact thudded into his chest and sent him flying.\n\nMiss Mirror followed him like his own shadow. She kept trying to strike that girl that Han Sen held in his arms.\n\n“Is this your Mirror Spirit Body?” Han Sen asked as he retreated.\n\n“Yes. Even as a King class, I can kill you easily. So don’t test my patience,” Miss Mirror said warningly.\n\n“So your Mirror Spirit Body can only return attacks that I deal? That’s not very impressive,” Han Sen said.\n\n“Maybe it’s not amazing, but it’s enough to kill you,” Miss Mirror declared.\n\n“You’re willing to kill me?” Han Sen couldn’t fall back anymore. He wouldn’t be able to avoid the next attack, and he couldn’t counterattack Miss Mirror or the broken sword. He turned around and used his body to shield the girl from the blade.\n\n“Don’t think that I won’t kill you,” Miss Mirror said with obvious annoyance, as she stopped her sword."
}