{
    "chapter": 1835,
    "title": "Recruiting Members",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1835",
    "text": "The magnetic fields of Planet Eclipse were a mess. There were frequent magnetic storms, so most tools did not work there. And there were many mountains on the planet, which rendered its landscape a complicated one. It was a harsh place to live.\n\nMany years ago, an Earl had earned permission to develop this place. He built a base in a region known as Mirror Lake, and using that place as a hub, he went out and killed many xenogeneics.\n\nBut in under a month of being there, the Earl led an expedition into the mountains and never returned. Not a single one of those members had come back breathing.\n\nThe Rebate, of course, sent others after them to pursue an investigation. One Duke spent months in the mountains, searching for what might have become of them, but he found neither hide nor hair of the Earl and his team. He eventually had to stop.\n\nEver since then, no one had wanted to go to that planet\n\nWhen Han Sen took over, he wished to make use of the base the Earl had built, for starters.\n\nThat encampment was a relatively safe place, when compared to everywhere else on the planet And there only seemed to be Baron and Viscount class xenogeneics in the immediate vicinity to contend with.\n\nAs long as Han Sen did not venture into those treacherous mountains, he wagered he’d do just fine.\n\nStill, killing Baron and Viscount xenogeneics was never an easy task, especially for a Baron.\n\nBecause Planet Eclipse’s xenogeneics were so diverse, there could be a variety of different species in one small area. They didn’t operate like ordinary xenogeneics, which kept to themselves or stayed in groups of their own kind.\n\nThe situation was made more difficult because of the abilities they possessed. There were too many risks, so if Han Sen wanted to hunt there, he’d have to enlist many people to join him. He could only compete if he was very strong.\n\nRecruiting some members was the first thing Han Sen needed to do.\n\nHan Sen did not expect that he would find anyone good, though. Primarily, he would just be recruiting others for show. His real help would come when he brought Xie Qing King and the others into this universe.\n\nAs long as they didn’t travel to the mountains like the Earl did, and used the defenses provided by the pre-established base, they could develop the planet over the course of the next three years fairly safely.\n\nHan Sen didn’t want to think about the prospect of paying taxes just yet, and he didn’t have to. The next three years were tax-free, after all. He’d allow Xie Qing King and the others to get accustomed to the geno universe first, and perhaps bring them up to Viscount\n\nQueen sent out a flying ship and enlisted some men to go with Han Sen for protection. It would be a sour thing to hear if Han Sen was killed.\n\nQueen kept the Ghost Teeth Knife in the palace, because it was not ideal for Han Sen to carry around a knife he could not yet use. It wouldn’t help him, and there was a higher chance of the blade getting him killed than anything.\n\nHan Sen took the ship back to the warzone. There were still some areas on Planet Kate that were safe. Han Sen went there and tried to enlist some of the Kate.\n\nKate and humans shared quite a few similarities. It was easier for them to communicate and live with each other than it was with others.\n\n“The Kate are a weak race, even compared with others of the weak race echelon. Is there any point in recruiting them?” Duke Icebird asked. She was helping Han Sen get his foot in the door, but she wasn’t fond of his decisions.\n\nShe didn’t want to interfere too much with Han Sen’s business, though. And Knife Queen had already told her not to influence Han Sen’s decisions too much. Han Sen was given free rein to recruit who he wanted to. She shouldn’t really help or advise him on such matters.\n\nThe ship landed in one of those safer regions, and Han Sen told the men to start recruiting those they could.\n\n“Duke Icebird, you can handle matters from here. I will go out and poke about, and see if I can find some other members,” Han Sen told him.\n\n“Queen said we are only here to protect you on the ship,” Duke Icebird said coldly.\n\n“I can take care of myself.” Han Sen waved and left the airship.\n\nHan Sen walked around in the city and noticed that it was a mess. People moved furtively and often ran off when anyone else approached. Many of the shops and houses were now completely empty. The streets were quiet.\n\nHan Sen decided to enter one of the vacant buildings. He found a room that looked fairly private, and then he brought out Little Invisible and placed him on the windowsill.\n\n“Wait here and alert me if anyone shows up,” Han Sen told Little Invisible. The creature then appeared, nodded, and made itself invisible again.\n\nHan Sen used his Blood-Pulse powers and went back to the sanctuary. When he was back home, he summoned everyone and explained the situation regarding Narrow Moon. Xie Qing King, Gu Qingcheng, Little Angel, and all the others expressed a desire to go.\n\nHan Sen hadn’t been inside the building for long, but someone had been following him. He ran into the room that Han Sen had teleported from.\n\nThe person looked inside the room, but he did not see Han Sen. He circled the room a few times, but he could not find anything.\n\n“Weird! How could I lose him?” The man looked glum. He was an Earl that was a renowned tracker. He felt pretty bad about losing his tail on Han Sen. He did not know how to explain to Duke Icebird how he had managed to lose Han Sen.\n\nIcebird Duke had said she wouldn’t protect Han Sen, but Queen had told her that she had to no matter what That was her task.\n\nThe shadow looked around the abandoned building and found nothing, so he left.\n\nHan Sen decided to bring Gu Qingcheng first. She was a very calm person, and he knew he could rely on her to not cause any trouble.\n\nHan Sen looked at the window and asked, “Little Invisible, did anyone come?”\n\nLittle Invisible revealed itself, and then the colors of its body began flickering like a movie screen. It showed Han Sen what it had seen.\n\nHan Sen saw the person who entered and knew it was the Earl.\n\n“So this is the geno universe? It’s different from the sanctuaries.” Gu Qingcheng moved her body and felt strange. She wasn’t used to the new atmosphere yet\n\n“For the time being, this place is safe. Generate your geno armor here, and I will stand guard,” Han Sen said.\n\n“Good.” Gu Qingcheng had eaten so many geno fruits that if she had not forced herself to avoid it, she would have generated a geno armor a while ago.\n\nQuickly, Gu Qingcheng found herself wrapped up by a bronze set of armor. Once she began generating the armor, the process flowed smoothly. Her second evolution had begun.\n\nNot long after, Han Sen saw a bronze sword appear in front of her. Her geno armament was a sword, a fitting contribution for her focus on sword skills."
}