{
    "chapter": 2171,
    "title": "Guarding the Door",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2171",
    "text": "After leaving Planet Blade, Han Sen did not see the woman again. He asked Black Steel about her, and he was told that Extreme King had indeed sent someone there. But aside from Moon Wheel King and the other Kings, no one had been granted an audience with her. Her identity was still a bit of a mystery to them.\n\nHan Sen had a bit of an interest in the entities of Extreme King now, especially after witnessing the punching skill employed by that woman. Their levels and bodies were of a similar capacity, but that punch she unleashed was truly frightening. Han Sen had many geno arts, but he believed the only one that could effectively combat her was Break Six Skies.\n\nAnd in regards to using his Super Spank powers, Han Sen could only use that while he was Dollar. If he used it as Han Sen, he might be recognized. After all, that was like a signature power of Dollar. It wasn’t something Han Sen would use on a whim.\n\nBut ever since that first encounter with the Extreme King woman, Han Sen hadn’t seen her again. It was likely she might have left Narrow Moon.\n\nHan Sen went to Cold Palace just before the first day of the month, planning to wait there until the next day rolled around. If Yisha had asked him to handle this matter, he knew it had to be something special. Due to that, he did not want to risk running late or being careless.\n\nHan Sen settled himself on the porch in front of the stone house. The porch was clean, as if it had been frequently visited and used. It was far cleaner than the stone house, and it looked as if Yisha sat in the same place he was right now when she kept watch over the construct.\n\nHan Sen sat on the porch and observed the stone door, waiting for twelve o’clock to come. He didn’t see anything inside the house.\n\nTime passed, and eventually, the clocks struck twelve. At that moment, Han Sen felt the temperature drop.\n\nHan Sen looked at the stone house, and he immediately noticed that the chill air was coming out of the house itself.\n\nThe stone building was releasing a cold air that was actually quite overbearing.\n\nNo matter how cold it became, though, no frost appeared on the walls. The stone house looked like it always did. The only difference was the coldness it was exuding.\n\nAs Han Sen observed with curiosity, the stone building’s door began to open soundlessly back into the house. It revealed a cave-like entrance that was completely dark.\n\nWhen Han Sen looked closer, he realized that it really was a cave. There was a cave inside the stone house, and the chill was creeping out of that black space.\n\nThe chill now swept out in full force, gushing through the open doorway like a tide. It froze the nearby rivers and even the waterfall. The ice crept up the grand waterfall, turning the entire river into a solid chunk.\n\n“That’s a very strong frost air,” Han Sen thought in shock. The Cold Palace Guardian tablet, which was attached to his waist, had also started to glow. It protected Han Sen from the chill draft, separating him from it.\n\nHan Sen wished to use the cold air to practice Jadeskin, but the tablet was keeping the chill air from touching him. He wanted to put the tablet away, but all of a sudden, noise sounded from the stone cave.\n\nHan Sen looked towards the stone cave. It was obscenely dark. Even Han Sen’s vision could not pierce that impenetrable veil of darkness.\n\nBut he was still able to hear something moving around in there. Not long after, a body emerged from the dark. It was half a meter tall.\n\nHan Sen stood there stiffly, trying to guess what it was. Weirdly, the thing looked like a toad made of green jade.\n\nA series of red symbols were inscribed across its green back. Its body was very cold, and when it appeared, the temperature fell so fast that it was difficult to imagine. Everything around the beast was immediately covered in ice. The mountains, the rivers, the plants, the trees, and all the animals were frozen. It seemed like space and time had frozen, as well. The world became so quiet when the toad appeared that even the wind stopped.\n\nOnly the Cold Palace Guardian tablet on Han Sen’s waist was shielding him from that cold power. It allowed Han Sen to move as he wanted to.\n\nHan Sen was shocked, though. “Is it a deified creature? I didn’t know Narrow Moon had a deified creature. Does something this powerful actually serve Narrow Moon?”\n\nAs Han Sen pondered its presence, the green toad fully removed itself from the stone house. It looked like a slippery thing as it slid out of the doorway and turned to look at Han Sen. It noticed the Cold Palace Guardian’s tablet, then ignored him. It ventured over to the frozen waterfall.\n\nHan Sen felt as if he was in a lot of danger. “It is fortunate I didn’t put the tablet away. I do not know if my Jadeskin can resist this much cold power. And this thing only seems to recognize the tablet. The fiend would probably kill anyone who wasn’t wearing it. That must be why everyone needs a tablet to come here.”\n\nThe jade toad hopped its way beneath the waterfall, and the ice around it began to melt.\n\nIn the blink of an eye, a small pool of water formed beside the toad. The waterfall remained frozen, so there was no more water coming down to fill the basin.\n\nThe green toad then dove into the water and quickly disappeared from sight.\n\nHan Sen did not know how deep that water was. He could only see the first hundred meters, and he had no idea what lay at the bottom.\n\nAfter the toad sank into the water, no further sign of the creature emerged. Han Sen was supposed to be on guard, and he did not know when he could expect the toad to reappear.\n\n“Yisha wanted me to guard this place, but why? So I could watch a toad go for a dip?” Han Sen pondered this entire scenario, but he couldn’t come to any satisfying conclusions.\n\n“I don’t care. I don’t know when the deified toad will come back out, so I’ll make the most of this and use the cold air to try to refine my Jadeskin.” Han Sen cast Jadeskin, and his entire body became an icy figure. He then set the tablet down beside him.\n\nAs soon as the tablet left Han Sen’s body, he felt the true power of the cold air suddenly pound into him. In no time at all, he knew it would freeze his body and solidify his blood.\n\nHan Sen was shocked by the power. His Marquise Jadeskin granted him the ability to freeze others, so his resistance to the cold should have been extremely high. But now, he could hardly withstand a single ounce of the chilling power that the toad had unleashed. It was difficult to comprehend.\n\n“A very powerful deified creature.” Before Han Sen became completely frozen, he grabbed the guardian tablet and put it back on his belt. A cold light gleamed across his body and separated him from the cold air.\n\nSome of that cold air remained in Han Sen’s body, though. The guardian tablet’s power was like a shield. It was unable to clear out the cold air that was already within him.\n\nHan Sen felt very cold, and numbness began to creep through his limbs and into his chest. He quickly used Jadeskin again, refining the cold air that had invaded his body."
}