{
    "chapter": 2971,
    "title": "Well Lotus",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2971",
    "text": "What he said was kind of soft and hard. It also made sense. If he was an ordinary person who could not get the true god class Light Well Lotus, he would not make things any worse by offending the Extreme King.\n\nBut Han Sen was very determined to get the true god class Light Well Lotus. He was not going to leave now.\n\nHan Sen did not speak. He looked at the primitive class Light Well Lotuses around and waved his lance. He broke the Light Well Lotus.\n\n“Deified Xenogeneic hunted. Light Well Lotus: deified xenogeneic gene found.”\n\nAll the Light Well Lotuses were cut by Han Sen. Many announcements played in his head. Han Sen collected the Light Well Lotuses he cut down and threw them into his Destiny’s Tower.\n\n“Deified Xenogeneic hunted. Light Well Lotus: deified xenogeneic gene found. Deified beast soul obtained.”\n\nAfter killing a hundred Light Well Lotuses, he finally received the beast soul announcement. He looked into his Sea of Soul.\n\n[Deified beast soul Light Well Lotus: Bai Sema-type (incomplete)]\n\nHan Sen was not in the mood to take a look at what the Light Well Lotus bai sema could do. He continued slashing all the Light Well Lotuses around. He received 213 Light Well Lotuses. Out of them all, he only received one beast soul.\n\nAfter he got all the Light Well Lotuses he could, he went back to the giant Light Well Lotus. He looked at the Extreme King old man and said, “For Bai King’s sake, if you leave now, I will not kill you.”\n\nThe Extreme King old man’s expression changed. “You are being such a bully! Are the Extreme King really that easy to bully?”\n\n“Does that mean you are not going to leave?” Han Sen looked at the old man as he spoke.\n\n“I am not leaving. What are you going to do to me?” The old man opened the green metal umbrella and coldly laughed.\n\nHan Sen’s eyes looked weirdly shiny. He stared at the old man’s eyes and slowly asked, “Do you think that umbrella will safeguard your life?”\n\n“Maybe I cannot beat you, but if you want to kill me, this lotus will be destroyed,” the old man said with certainty.\n\n“Really?” One of Han Sen’s eyes suddenly released some weird light. His eye turned a blood-red color.\n\nIn the next second, Han Sen had already gone right through the light of the green metal umbrella. He entered the old man’s eye by using the Blood-Eye Evil Eye beast soul eye skill.\n\nBlergh!\n\nBlood was coming out of the Extreme King old man’s right eye. Even the back of his head had a bloody gaping hole. Han Sen was holding the Sky Vine Radish God Lance when he reappeared behind the Extreme King old man.\n\nGreen sprouts grew out of the old man’s wounds. They kept absorbing the Extreme King old man’s lifeforce.\n\n“Argh!” The old man held his eye and screamed. He wanted to swing the green metal umbrella he possessed. He had only moved an inch when Han Sen’s lance cut off his arm.\n\nThe old man was terrified. He used his other hand to pick up the one that had been lopped off. He then picked up the green metal umbrella and flew away. He disappeared in the sky at the speed of light.\n\n“Go home and tell Bai King I used my life to get this,” Han Sen said to the elder as he fled. “I deserve it.”\n\nBai King knew that the Holy Baby was Dollar, and he had almost got the Holy Baby killed. Han Sen used Dollar’s identity to take the Light Well Lotus as a demand for respect.\n\nHan Sen wanted the Light Well Lotus, but he did not want the Light Well. Han Sen looked at the giant Light Well Lotus. He used the Sky Vine Radish God Lance to strike its root.\n\nWith the power of the Sky Vine Radish God Lance, Han Sen slashed it a dozen times to cut it.\n\n“Deified Xenogeneic hunted. Light Well Lotus: deified xenogeneic gene found. Deified beast soul obtained.”\n\nHan Sen was very happy. He did not expect to get another beast soul. He had a look inside his Sea of Soul.\n\n[Deified beast soul Light Well Lotus: Bai Sema (perfect)]\n\nSeeing the word “perfect,” Han Sen was made even more thrilled. It was a perfect-class beast soul. It was equal to a true god class beast soul. He still did not know what the Light Well Lotus bai sema was for.\n\nHan Sen put the giant Light Well Lotus inside his Destiny’s Tower and summoned the Light Well Lotus bai sema.\n\nSurpassing Han Sen’s expectations, the Light Well Lotus bai sema beast soul was quite different from the bai sema beast soul he had before. It was not a bai sema with Han Sen’s body for a center.\n\nThe shadow of a Light Well Lotus was in front of Han Sen. That Light Well Lotus was the center. It opened up a holy light bai sema that was 30,000 feet long. It covered the entire area.\n\nHan Sen stood inside the bai sema, but he did not feel his speed or power receive a boost. He did not detect any defensive properties within the Light Well Lotus bai sema either.\n\nSeeing the Light Well Lotus’s shadow release a holy light, Han Sen jumped. He used the Sky Vine Radish God Lance to cut his finger. He had a deep wound. In the Light Well Lotus’ bai sema, the wound on Han Sen’s finger quickly healed. The damage was instantly reversed.\n\n“Healing bai sema.” Han Sen was delighted by this discovery. A bai sema like that was very rare, and it was a true god class bai sema on top of that. It was very effective. Even though his body could heal fast, the sort of healing power he had now must have been the best throughout the entire universe.\n\nHan Sen tried it out a few times. He soon discovered a major problem. The Light Well Lotus bai sema’s healing holy light did not concern itself with the differences between friend and foe. It did not matter who it was inside. The bai sema would have graced them with its healing power.\n\nHan Sen thought, “That means I have to be careful when I make use of this. Otherwise, it may become a shield for the enemy.”\n\nHe took all of the Light Well Lotuses with him as he departed the Light Well. The news concerning Dollar attacking the Light Well spread across the entire universe.\n\n“The world is messed up. Even the Extreme King were robbed.”\n\n“With the god palaces appearing, it must be a sign of chaos. The universe is not going to be stable anymore.”\n\n…\n\nIn the Extreme King, Bai King heard what the blind old man had to say and sent him away. He sat alone and said, “I am afraid that kid is not going to stop.”\n\nAfter remaining silent for a bit, Bai King summoned an officer. He told the officer, who was a messenger, to deliver a message for him. “Wherever Dollar goes, our people cannot stop him. Let him take whatever he wants.”\n\nThe messenger froze for a while after hearing what Bai King said. He could not react. Ever since he had been born, he had not heard the Extreme King issue orders like that."
}