{
    "chapter": 2771,
    "title": "You Can Eat This",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2771",
    "text": "“You. Answer this question.” The phoenix turned to another King class noble. That person was also a student of Elder Nader, and he was asked the same question.\n\n“Master…” The guy seemed to be on the verge of tears. He spoke to Elder Nader with a trembling voice.\n\nElder Nader’s face turned green. He had brought many of his students there to explore the new xenogeneic space. He hadn’t expected them to run face-first into a true god. Such a being was a truly terrifying existence. He knew this was going to be bad.\n\nBut this student was behaving with such weakness. He was a King class elite with Destroyed blood. And yet, he sounded weaker than some low-ranking outsider.\n\n“Answer my question.” The flames across the phoenix’s body exploded, covering the skies and the earth with a white flame. The eyes of the bird stared down at the Destroyed King with demonic intensity.\n\nThe Destroyed student looked pale, and he hurried up to answer, “I would listen to my partner. If she wanted me to live, I would live. If she wanted me to die, I would die.”\n\n“What a wimp.” The phoenix grunted callously. It opened its mouth and drew in a breath. Just like the other two creatures, the Destroyed King’s body was reduced to nothing but ash.\n\nEvery person’s heart sank. It was obvious that the phoenix was playing with them. No matter what they answered, they were going to die.\n\n“If you want to kill me, kill me. I’m not answering your crappy bird-brained question,” shouted a nameless King when he saw the phoenix looking down on him.\n\n“If that is what you desire, then I will do it.” The phoenix was still acting very high-class and elegant. It lowered its head, opened its beak, and inhaled. The King dissolved into dust.\n\nHan Sen’s heart sank. He had been hoping that the phoenix’s question was similar to the wishes offered by the gods. He had suspected that if he didn’t answer the question, the phoenix might not be able to hurt him. But after watching the death of the most recent victim, it was evident things weren’t like that.\n\nDragon One and Bao Lian’s faces looked grey, and sweat had beaded across their faces. They thought their feelings would be reflected in Han Sen, and that they would feel hopeless.\n\nThe phoenix asked the same question to another few creatures, but no matter what they answered, the results were the same. They all had their life forces ripped out of them.\n\nThe powerful Elder Nader was a transmutation deified, but he could only watch the events unfold. He couldn’t resist or do anything about it.\n\nEventually, the phoenix came before Elder Nader. Elder Nader’s three heads and six eyes stared back at the phoenix. It looked as if he wanted to attack the phoenix, but his body was bound too tightly by the branches. He couldn’t even move, let alone fight. He couldn’t even wiggle his fingers.\n\nThe branches hadn’t just trapped his body. If the situation was that simple, then his elite transmutation powers would have allowed him to turn a simple exhale into an end-of-the-world thunder god. He wouldn’t be rendered helpless by mere physical restraints.\n\nBut now, Elder Nader couldn’t exert any strength. He wasn’t even sure if his power had been contained or drained entirely.\n\nAs everyone waited for Elder Nader to die, the phoenix turned its face away. It turned around, and its raptor-like gaze locked onto Han Sen and the two others on the ground next to him.\n\nThe hearts of the three began to bound. Before they realized what was going on, the phoenix flapped its wings and flew down the mountain.\n\n“Oh no.” Han Sen suddenly felt sick with fear. Why had that phoenix suddenly changed its mind, leaving a deified elite to fly toward them instead?\n\nThe faces of Dragon One and Bao Lian turned green. Losing all sense of decorum, Dragon One shouted at Bao Lian, “Mr. Bao, if we don’t fight, we don’t stand a chance!”\n\nBao Lian’s face darkened with frustration. “You think I don’t want to fight? Have you been paying attention? The power gap is too significant. Even though my King body isn’t suppressed, I can’t seem to use its power. There is no chance of fighting back. Aren’t you a Dragon? Don’t you call yourself the bravest race? Don’t you guys have high resistance to any kind of power? Can you break the suppression on me so that I can activate my King body? Perhaps that way we can get out of this mess.”\n\nDragon One sank against his bonds. “If I could break free, do you think I would remain here trapped?”\n\nThe discussion was pointless. The two of them were locked-down there, and neither of them could get free. Dragon One could see that Bao Lian was useless, so he shouted at Han Sen, “Dollar, if you can escape, take us away now. Do it before it is too late.”\n\nHan Sen shook his head. Even if he used his super god spirit body to escape, it would only last a second. Once that time was up, the phoenix’s power would be back to suppressing him. He was a dead man, either way.\n\nThere was nothing that the three of them could do to escape. And by now, the phoenix had reached them. It landed ten meters away from the three and looked at Han Sen.\n\n“No way. There are so many creatures you can eat, but you choose to eat me? I am not Tang Sanzang. What are you staring at me for?” Han Sen felt so depressed. He prepared to activate his super god spirit body. Although his chances of escape were low, it was worth a shot.\n\nHan Sen was going to wait until the phoenix asked its question, and as soon as it started speaking, he would use his super god spirit body to teleport away. Perhaps he would survive, somehow.\n\nBut when the phoenix opened its beak, it didn’t ask a question. The scary suction pulled on Han Sen’s body.\n\n“Oh no… It’s all over.” Han Sen thought in sudden despair. It was too late for him to use his super god spirit body now.\n\nHan Sen thought he was going to be turned into dust, but that wasn’t what happened. His body flew through the air toward the phoenix.\n\nBefore Han Sen realized what was going on, the phoenix flapped its wings and shot up into the air beneath Han Sen, catching him on its back.\n\nHan Sen was sitting on the white fire, but it didn’t feel hot. It was a very warm, relaxing sensation. He felt as if he was sitting in a hot spring. The phoenix’s body had a seemingly limitless lifeforce. The feeling rushed through him, and it made his body feel like old wood receiving life again. His cells were active, and they began to multiply at a much faster rate.\n\n“What is going on?” Han Sen was confused.\n\nBao Lian, Dragon One, and many of the other creatures that were wrapped up in branches were looking quite confused. They couldn’t believe this was happening.\n\nThey all thought Dollar was going to bite the dust. They would never have guessed that he would end up riding the phoenix. They all stared at Han Sen in shock, unsure what sort of reaction they should give.\n\nAfter the phoenix placed Han Sen on its back, it flapped its wings and returned to the wooden bridge.\n\nHan Sen sat atop the phoenix’s back. He could tell that the phoenix didn’t hold any hostility toward him.\n\nThe phoenix dropped back onto the bridge, landing in front of Elder Nader, who was tied up like a cocoon. The bird’s resonating voice played in everyone’s head again.\n\n“You can eat this,” the phoenix said. All around Han Sen, the jaws of the onlookers fell open.\n\nEven though the phoenix hadn’t used Elder Nader’s name, it was obvious that the bird thought the Destroyed would be tasty and nutritious. And he wanted Han Sen to eat the man."
}