{
    "chapter": 1872,
    "title": "Gana: Part 2",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1872",
    "text": "“You go in there and make sure Dragon Lady and Meng’er are protected.” Han Sen spoke to Wang Yuhang at a low volume.\n\nWang Yuhang knew that he was currently weaker than the average commoner in the geno universe. There was no point hanging around with Han Sen, so he did as he was instructed and returned to the cave.\n\nHan Sen was crouching just outside the entrance of the cave. He collected a bunch of vines and grass to conceal himself, while he kept an eye on the local vicinity.\n\nHan Sen eventually saw two shadows emerging, coming up the path towards the cave. One of them had the upper- body of a human and the lower-body of a snake. It looked like a female serpent. She moved her body, approaching.\n\n“Gana.” Han Sen was shocked. In such a barren place, catching sight of a Gana was rather rare.\n\nNext to the Gana was a person with the head of a cow. It was different from the one Han Sen had seen before. This one was definitely a female, and its chest had two steel orbs. It looked scary.\n\nHan Sen perused a summary of the various races that could be seen on Planet Crooked Rock. He knew that the one with a cow head belonged to a race called Kao. They were a fairly populous race on this planet.\n\nThere were so many of them on the planet because they owned a large portion of it. Although the Gana were in control of the planet, their numbers were lower.\n\nIt was not uncommon to see a Kao as a subordinate of the Gana, but this seemed to be a little different to the usual.\n\nThe Gana was in chains, with her hands clasped tightly in cuffs. The Kao behind her had a spear, and it was pointed right at the Gana’s back. It seemed as if the Gana was a prisoner.\n\n“Gia, do you have any idea what you’re doing?” The Gana woman kept on moving, but she looked angry when she spoke.\n\n“Miss Guna, I know exactly what I am doing. You are worth a lot of money, and after I sell you, I can make a happy life for myself on any planet I select,” the Kao woman with a steel chest said.\n\n“Gia, I had no idea this is the sort of person you were. We raised you up, and we treated you like family. And now this is what you do? You’re just going to up and sell me? You are cold-blooded.” Guna nibbled her lips as she spoke.\n\n“Family? Stop pretending that nonsense. You Gana always treat us Kao like slaves. We’re just something that can produce milk for you. We give you everything. And what do we get in return? A compliment? Let me tell you right now; that is worth nothing.” Gia gave a cold smile.\n\nGuna continued biting her lips, and she did not respond. Gia spoke again, though, saying, “And don’t you dare play any sort of tricks. If you do, I can guarantee you’ll suffer.”\n\n“Who are you selling me to?” Guna asked.\n\n“It does not matter. It’s just a race that can pay a generous sum.” After that, Gia pushed Guna. “Move. Go into that cave for now. The buyer will soon be here.”\n\nHan Sen was still crouched in the vines. He thought he was having quite the stroke of misfortune, learning that the cave was the supposed place of the trade.\n\nHan Sen didn’t say a word. He just erased all traces of his presence and remained shrouded amidst the vines. He clutched the handle of Ghost Teeth Knife, too.\n\nWhen Guna reached the entrance, her beautiful eyes looked to the vines Han Sen was hidden beneath. She looked straight at Han Sen, and she seemed very surprised.\n\nHan Sen was shocked, and he thought to himself, “Very powerful senses, for sure. I hid my presence, yet she can still see me?”\n\nBut Guna kept acting casual and continued moving forward. She behaved as if she had only looked that way without meaning to. She didn’t look at Han Sen again, but as she approached the cave, she moved closer and closer to him.\n\nAfter a few seconds more, Guna passed right by Han Sen. Han Sen, still in the vines, did not move an inch until Gia was also in front of him. Then he leaped forward. With Ghost Teeth Knife, he rushed out and tried to plunge it into her back.\n\nGia was very powerful, though. She could have very well have been an Earl. Han Sen still couldn’t utilize Ghost Teeth Knife’s full strength, and as a result, he probably wouldn’t have been able to damage her bones. So, he had to take aim and strike at the most tender portions of her body.\n\nWithout any buffs, Han Sen had to use his own strength to activate all of Ghost Teeth Knife’s power that he could. Ghost Teeth Knife’s blade was like a fang, and it stabbed Gia’s waist without remorse.\n\nHer hide was thick, though. She wasn’t wearing armor, but even so, Han Sen was only able to drive ten centimeters of the blade into her back. Compared to her barrel-thick waist, he had only managed to plunge it in at around thirty percent of what was necessary. It most certainly wasn’t enough.\n\nGia had been ambushed, but despite that, she had no intention of fleeing. The attack seemed to enrage her, and she paid little attention to the wound she had incurred. She lifted the spear in her hand and gave it a hefty swing.\n\nHer spear was three meters long, and its shaft was as thick as a man’s arm. Its top possessed a flame that strangely resembled the shape of a cow. Its swing was frightening to see, and it looked as if it’d tear the atmosphere in two.\n\n“Careful! Don’t touch the horn power. She is brilliant when it comes to breaking armor!” Guna shouted from the cave. Han Sen did not plan on fighting. He jumped a few meters back and avoided getting struck by the cow flame.\n\nPang!\n\nGia missed, and the rocks beside Han Sen were broken by that flame. Missing enraged Gia even further, and she came charging at Han Sen for a follow-up.\n\nGuna was currently in the cave, and she couldn’t run. She was not worried about Gia, as the Kao was focused on killing her assailant—Han Sen.\n\nGia did not think Han Sen was the buyer, as the buyer had not been informed of the trade location yet. He couldn’t know they were here.\n\nIf he did indeed belong to the buyer, it made no sense that the buyer would send someone so weak. If someone had the sort of money to buy a Gana, they were most likely a Duke or Marquise. One of them could kill Gia easily.\n\nGia was confused, but her spear lacked hesitation. The horn powers she wielded came rushing towards Han Sen again.\n\nHan Sen led Gia up to the cave’s entrance.\n\nHe had run too far, and he thought Gia would stop chasing him because of Guna. Han Sen was afraid Guna would venture too deep and ruin the leveling up process of Dragon Lady and Meng’er.\n\nWang Yuhang was also in there, but he was weaker than the lowliest commoner. Even with Guna being chained up, the likelihood of him beating her was next to none.\n\nHan Sen and Gia were both planning to fight right where they were.\n\nGuna saw Han Sen, and she was able to determine that he was weak and no greater than a Viscount. She expected that Gia would kill him fairly quickly. So, with a limited amount of time, she pondered how she would best escape where she was.\n\nThat being said, despite Han Sen’s apparent weakness, Guna was able to tell how fast he was. Gia’s attacks weren’t even able to ruffle his clothes."
}