{
    "chapter": 970,
    "title": "Red-Eye Rabbit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_970",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nRustle. Rustle. Rustle.\n\nAs the bushes rustled, a white shadow leapt out.\n\nHan Sen was frozen. From the red eyes, he believed a horrid monster had been watching him. But that wasn’t the case at all; all that emerged was a white rabbit. Aside from its ruby eyes, it mostly looked like an ordinary rabbit… save for it being about three-feet-tall. It was like an oversized teddy bear.\n\nStill, Han Sen knew not to drop his guard. He had seen many cute creatures in the past, ones that had turned out to be cruel, vile, and terrible beings that only sought to do him harm.\n\nHan Sen could tell that it was a mutant creature. How many gene locks it had opened, however, he hadn’t a clue.\n\nHan Sen’s fitness had yet to reach even the heights of his Dragon-Blood Snake. To compete with this rabbit, he knew he’d have to rely on his super king spirit mode.\n\nThe rabbit used its hind feet to jump over to Han Sen, and Han Sen immediately readied himself to summon the Dragon-Blood Snake.\n\nBut curiously, the red-eye rabbit only nabbed the food Han Sen had been cooking. It opened its mouth and began gnawing and nibbling on whatever it could get.\n\nHan Sen then thought to himself, “How dare you eat my meat! And on that note, when in the sanctuaries did rabbits decide to start eating meat?! And you’re only a lowly mutant creature; how dare you.”\n\nThe rabbit’s actions infuriated Han Sen, and he quickly turned his fist into a fiery phoenix. Without delay, he swung it towards the mischievous critter.\n\nPang!\n\nThe rabbit seemed to have an aura of protection around it, like a crystal-casing that was invisible to the naked eye.\n\nWhen the phoenix flame came into contact with it, the fire spread out everywhere, all along the orbish-aura. Not a single hair of the rabbit was singed.\n\nHan Sen was shocked. He was incredibly strong when it came to the use of fire, so he was taken aback to learn that he could not shatter its protection.\n\nHe sat up again, and saw that the rabbit was totally unfazed by what Han Sen had attempted to do. Because of its lack of concern, it continued eating the food Han Sen had worked for. And for this, his anger only increased.\n\n“You bastard!” Han Sen’s body became enwreathed in a black flame. Repeatedly, he punched the glass-like casing that protected the rabbit from harm.\n\nMultiple phoenix’s shattered against the protective casing that housed the rabbit, but it was all in vain. The ground around the rabbit was somewhat sunken, due to the deflection of fire, but this charred, upturned soil was the only result Han Sen was achieving.\n\nHan Sen’s shock continued to heighten. He thought to himself, “Has this thing opened six gene locks, as well?”\n\nThe red-eye rabbit continued to nibble the food without interruption, but at this point, Han Sen realized there was something very wrong with it.\n\nThe glassy-aura that protected it was entirely transparent, but if you looked closely on the side, you could see a layer of shimmering light.\n\nIt was kind of like a halo, and Han Sen counted seven of them. That must have meant the rabbit had opened seven gene locks.\n\n“Is it a sacred-blood creature?” While this might have been so, Han Sen had sensed that it was weaker than a sacred-blood creature.\n\nThe rabbit was clearly an enigma, and so Han Sen decided to lay off the punching for a bit and contemplate the curiosity that was stealing all his food. Without knowing how strong it was, and whether or not it might turn hostile, he knew he had to calm down somewhat.\n\nAll Han Sen had seen of its power was the protective shield it possessed, and yet he was already amazed by the strength of it. It’d be foolish to push the creature further.\n\nNot willing to punch the rabbit anymore, Han Sen could not do much of anything. He stepped back and merely gave it a stern look.\n\nSurvival of the fittest was the number one rule when it came to life in the sanctuaries. The rabbit was clearly the fitter one between them, so there was nothing Han Sen could do to prevent it from taking his food.\n\nHan Sen decided to walk the perimeter and scope out whether or not there were other creatures nearby.\n\nAfter traveling briefly, he stumbled across a canyon. He was at the top, and when he leaned over to take a peak, he saw many more red-eye rabbits.\n\n“Why are there so many of them?” If all of them were sacred-blood class, the power they’d have was sure to be insane.\n\nUsing his dongxuan aura, though, he was able to determine that they weren’t sacred-blood creatures. In fact, they were quite weak.\n\nThey must have been the weakest critters Han Sen had ever seen during his time in the Third God’s Sanctuary.\n\nHan Sen believed their fitness had only reached three hundred, or thereabouts. Whilst they might have dominated the Second God’s Sanctuary, here, they were nothing but creatures of prey.\n\n“No way! Even if my food thief is a rabbit king, there can’t be such a clear difference in strength between it and its kin. Can such weaklings have a sacred-blood king?” Han Sen snuck down the ravine to get a closer look, as he mulled the strange scenario.\n\nHe did not alert the rabbits; he merely walked down and observed.\n\nThe red-eye rabbits there were far smaller than the one that had stolen his food. In fact, they looked like regular rabbits you’d see scurrying about farmlands. They did not look like creatures hailing from such a dangerous sanctuary.\n\nHan Sen walked an additional ten miles, following his descent. The number of rabbits was incredible, and he had easily seen a thousand of them in that time. And not a single one of them was hostile, or even of primitive class.\n\nHan Sen did not believe they could hide the truth about their energy flow, so he decided to attack one rabbit with all his might.\n\nThis rabbit also had an invisible barrier of protection. But this rabbit was weaker, and Han Sen was able to break through the forcefield and kill it.\n\n“Ordinary Creature Red-Eye Rabbit killed. No beast soul gained. Consume its flesh to gain zero to ten ordinary geno points randomly.”"
}