{
    "chapter": 2679,
    "title": "Close Call",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2679",
    "text": "“Haha! I knew Shale wouldn’t lose. Did Mo Fang and Han Sen seriously think that they could fight Shale?” Li Xue Cheng was so excited that he couldn’t help but cackle.\n\nRelief washed over Liyu Zhen. If Shale were to lose, their lives would become very difficult in the near future.\n\nExquisite and Li Keer were worried now. Shale was very strong, and even though he wasn’t deified, it would be a very tall task for Han Sen to achieve victory.\n\n“Shale, you are going to regret this,” the Fox lady spat spitefully at Shale. She was the only person who hadn’t been punched. She stared at Han Sen for another moment, then left.\n\nShale’s face was impassive. He returned to sit where he had been, and then, his body returned to its normal size.\n\nSeeing that everyone nearby had been chased off by Shale, Han Sen felt safe once more. He took his time recovering, but after that fight, no one dared to disturb them again.\n\nThe ten hours went by fairly quickly. Once Han Sen had returned to peak condition, he stood up and looked at Shale. The leonine man was still calmly sitting in the same position. He looked very peaceful with his eyes closed.\n\nIt seemed as if he could feel Han Sen’s gaze land on him, because Shale opened his eyes and asked, “Did you rest well?”\n\n“I am completely recovered,” Han Sen answered.\n\n“Then let us begin.” As Shale turned his full attention on Han Sen, the red ball of light appeared around his body again. His body expanded quickly under the light’s influence, returning him to that shape of a lion-headed demon god.\n\n“Mutant class born-deified xenogeneic? No wonder he has a ten armor talent.” Han Sen examined Shale’s power, and he went on to think, “Even though he has dropped to half-deified, he will still be difficult to deal with.”\n\nHis eyes had been closed, but Han Sen had still been paying close attention to Shale’s fight earlier. He knew Shale’s body was no weaker than his own. And the guy’s combat abilities were also good. Despite the brevity of the fight, Shale had been able to analyze the movement of his opponents in detail. That kind of fighting talent would be a challenge to Han Sen.\n\nHan Sen didn’t say anything, though. Instead, he lifted his hands as if they were a pair of knives. He cast Under the Sky and Teeth Knife.\n\nShale didn’t fall back. He moved forward, swinging a fist in the same moment. Their fists and palms began to collide against each other in the air. The shockwaves of their strikes detonated across the valley like fireworks.\n\nThe fight between the two of them seemed like it would go on endlessly. The fitness of the two fighters seemed to be on par. It was hard to determine which of the two would reign supreme.\n\n“The raw physical strength of their bodies is quite scary, but I think Han Sen has a frightening edge. After all, he is just a ninth-tier King. If he became half-deified, the power of his body would far exceed Shale’s. I wonder how a crystallizer was able to develop a body this sturdy. Scary, isn’t it? Are the geno arts he practiced that powerful?” Open Sky Elder murmured to himself.\n\n“I think so. Not even our Very High bodies can satisfy the fitness requirements of his geno art. It would undoubtedly be much harder for other creatures of the universe. Han Sen’s learning of it must have been some sort of fluke.” Qiyu Elder had a wry smile.\n\n“All I can say is that this kid is very lucky,” Open Sky Elder said with a laugh.\n\nPang!\n\nFists and palms collided. Giant shockwaves of turbulent power sent Shale and Han Sen tumbling away from each other.\n\nAfter Han Sen regained his balance, he used his hands to slash forward. Countless knife silks appeared in the air. The knife silks were so numerous that they seemed to fill the surrounding area.\n\nHan Sen slashed forward, sending the knife silks across Shale’s body. Because they came from every direction, Shale didn’t even stand a chance of dodging them.\n\nShale’s eyes flashed, and he suddenly punched the ground. The ground collapsed, and even nearby mountains started to crumble. Rocks fountained up around Shale’s fist to intercept the knife silks.\n\nKnife silks and rocks struck each other. Many layers of the knife silks destroyed themselves against the rocks, and only a few of them made it all the way to Shale. He waved his hand to break what remained.\n\n“It has been so long since I met an enemy who anticipates my next move,” Han Sen sighed.\n\n“That’s what I was going to say, as well. I have to say, you really haven’t disappointed me.” Shale’s eyes were brimming with passion.\n\n“But you’ve disappointed me. I was thinking I could get first place easily, but it currently feels impossible.” Han Sen felt a bit thirsty, and he licked his lips. That was one of his habits. When he faced things he had no confidence in dealing with, he frequently did this.\n\n“Life is disappointing sometimes,” Shale said, a moment before swinging his fist again.\n\nHis punches were very simple. However, they didn’t remind Han Sen of a complicated technique that had been developed into a simplified form. Instead, Shale used a raw, basic punching skill. A skill like that could be found amongst any of the smaller races.\n\nBut Shale had taken that basic punch up more than a few notches. He had practiced the skill to a level that was too much for Han Sen to deal with.\n\nHan Sen cycled between a few knife skills and punching techniques. Each of them was a top-notch geno art. Some of them were from the Rebate, whereas others came from Sky Palace. Each style he used was unique.\n\nEvery time he used a new skill, Han Sen felt like he had gained the advantage. For a moment, at least. Then Shale always swooped in to take that advantage away.\n\nPlus, Shale used the same punching skill the entire time. He didn’t alter his own skills until he became familiar with Han Sen’s geno arts. Then, he changed his punching skill just enough to counter each of Han Sen’s techniques.\n\n“F*ck this guy! He wasn’t just born deified. He was born a battle master, as well. He is far too sensitive to the delicacies of combat. I only have to use the same skill on him twice before he learns how to deal with it. Who is this f*cking guy?” Han Sen had never seen such intimidating battle talent.\n\nShale and Lone Bamboo were different. Because Lone Bamboo had experienced far too much in his lifetime, he could adapt and control his style perfectly. He could easily learn the geno arts of other people, and every technique he used was top class. Shale didn’t bother actually learning the geno arts of others. He simply made himself more powerful and brute-forced his way through all obstacles.\n\nIt was like his one skill could break down a thousand skills. It wasn’t that the skill depended on power; power was only one part of it. Rather, Shale could apply his skill creatively enough to counter all sorts of different attacks. Shale had a powerful mind, and that was the source of his ability to counter his opponents.\n\n“He has a powerful body with incredible endurance, not to mention a problem-solving mind. This guy is giving me a headache!” Han Sen experimented with many geno arts, but he couldn’t defeat Shale.\n\nBut Han Sen was different from Mo Fang. When Mo Fang used the same geno art twice, Shale could pick up on the flaws. But even when Han Sen used the same geno art multiple times, Shale was unable to see the errors.\n\nThat surprised Shale a great deal. He could see the flaws in Han Sen’s execution, but when Han Sen used the same skill again, something kept Shale from exploiting those mistakes.\n\nShale tried to target the weaknesses in Han Sen’s geno arts several times, but his attempts always failed. He had never experienced a situation like this before."
}