{
    "chapter": 148,
    "title": "Super Biological Warframe",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_148",
    "text": "\"Sacred-blood phantom ant killed. Beast soul of sacred-blood phantom ant gained. Eat its meat to gain zero to ten sacred geno points randomly.\"\n\nThe sacred-blood phantom ant finally collapsed in front of Han Sen. Hearing the voice in his mind, Han Sen just wanted to laugh out loud. Another sacred-blood beast soul, and it was an armor as good as his black beetle armor.\n\n\"Sen, awesome. Is it a sacred-blood creature?\" Lin Beifeng trotted back and asked Han Sen.\n\n\"It sure is,\" Han Sen said with a smile.\n\n\"Sen, did you gain its beast soul?\" Lin stared at Han Sen and asked.\n\n\"Yep.\" Han Sen did not lie. Since Lin had seen the mutant beast soul armor, he would recognize the sacred-blood version. There was no need to deny it.\n\n\"A sacred-blood beast soul! Honestly, did you sleep with Lady Luck?\" Lin grabbed Han Sen’s shoulder and shook him violently.\n\nBut Lin did not try to purchase the sacred-blood beast soul and meat. After Lin calmed down, Han Sen smiled and said to him, \"Lin, I also need the sacred-blood beast soul and meat badly, so I can’t share. You can take more meat of the mutant ants if you want.\"\n\nLin Beifeng rolled his eyes at Han Sen. \"What do I need that for? Sell them? Do I look poor to you?\"\n\n\"Maybe you can take it back to see if you could trade it for a mutant beast soul.\" Han Sen laughed.\n\nLin Beifeng said, \"After I saw the mutant phantom ant beast soul armor, I don’t want any other mutant beast soul now. I’m not necessarily able to trade it for a beast soul, even if I am, I am simply not in the mood.\"\n\nLin stared at Han Sen and said, \"I don’t want anything else. But if you want to sell that sacred-blood phantom ant armor, you must come to me first.\"\n\nLin Beifeng had considered this thoroughly. Han Sen would enter Second God’s Sanctuary soon and by that time, he still had the opportunity to get the sacred-blood phantom ant armor.\n\n\"OK, this I promise you. If I want to sell it, I will ask you first,\" agreed Hen Sen readily.\n\n\"It’s a deal.\" Lin reached out his hand and wanted to pinky swear.\n\n\"This is too childish, right?\" Han Sen was embarrassed.\n\n\"I do not care.\" Lin entwined his little finger with Han’s, while murmuring, \"Whoever breaks the promise will have ten wives and no penis.\"\n\n\"S*#! That is devious.\" Han Sen quickly got rid of Lin’s finger.\n\n\"That’s what it takes.\" Lin laughed.\n\nThen the two cleaned up the rest of the mutant phantom ants, which were about 500 in total. Most of them ended up in the worm king’s belly, which was probably bottomless.\n\nHan Sen dried and saved 100 phantom ants as Meowth’s food. And all the rest was fed to the worm king.\n\nIn addition to the five he ate, Lin Beifeng was not the least interested in the mutant meat. Han Sen asked him to take some back, but he declined. Lin repeatedly begged Han Sen to inform him immediately once Han Sen wanted to sell the sacred-blood phantom ant armor.\n\nHan Sen assured Lin that he would do that.\n\nLin Beifeng watched Han Sen ate a whole pot of sacred-blood phantom ant stew and drank the liquid up, feeling upset.\n\nAnother five sacred geno points gained. Han Sen had a staggering 45 sacred geno points, almost half of the max. And Han Sen had only entered First God’s Sanctuary about a year ago.\n\nTo comfort Lin Beifeng, Han Sen gave him the mutant phantom ant armor first. So as soon as Lin was back in Steel Armor Shelter, he immediately brought the warframe he was talking about to Han Sen.\n\nSure enough, it was just a silver alloy box the size of a suitcase. Although heavy, it was still hard for one to imagine that it contained a warframe more than 12 feet tall.\n\nIn God’s Sanctuary, there was no way to test this warframe, but Han Sen believed that Lin Beifeng would not deceive him for a mutant beast soul. Hence, he left God’s Sanctuary with the case.\n\nIt was night when Han Sen teleported back to school. He paused and went to the 7th warehouse with the super biological warframe.\n\nThe warehouse was empty. Han Sen opened the case the way Lin Beifeng taught him.\n\nA light beam was projected from the case and scanned Han Sen’s body. \"Scan completed. Analysis completed. Super biological warframe Silver Killer unlocked.\"\n\nThe moment the case was opened, liquid like mercury mixed with colorful particles flowed out of the case. The entire case then became part of the liquid and flowed toward Han Sen. Soon, he was covered in that liquid.\n\nThat feeling was hard to describe. It was like the Ironman putting his armor on, but a bit different in that all the parts were constructed by the particles.\n\nSoon a silver humanoid warframe more than 12 feet tall appeared where Han Sen was standing and Han Sen was sitting in a tight cockpit.\n\nHan Sen could only praise the great power of science and technology. A small case of less than one hundred pounds could become such a huge warframe. And its weight was also matching the tonnage of a regular warframe.\n\n\"Unfortunately, human science and technology are completely useless in God’s Sanctuary. Or else human would have dominated God’s Sanctuary already, and all the creatures would have been wiped out.\" Han Sen sighed.\n\nIn fact, the reason why Han Sen had this idea was that he was still in First God’s Sanctuary. If he evolved and went to the higher phases, he would change his mind.\n\nHan Sen tried to drive the Silver Killer, which was indeed powerful as Lin Beifeng said. Such a small warframe was actually more powerful than a heavy one like Builder, and of course much more flexible.\n\nAs long as the operational level was there, Silver Killer could perform all the movements a person could.\n\nLike Lin Beifeng had said, except for the lack of weapon system, Silver Killer was perfect.\n\nOf course, the more difficult the operation, the greater the burden on one’s body. Most people would have a hard time controlling their own bodies on a rollercoaster. So, to operate a warframe at a high speed was not something anyone could to.\n\n\"After all, it was only a prototype from the military laboratory, so it was impossible to equip it with a weapon system. Or else they would not give it to Lin.\" Han Sen was content. Although there was no weapons system, Han Sen could install some individual weapons himself, such as laser sword, laser gun and particle gun.\n\nIn short, Han Sen was more than satisfied with Silver Killer. If it was not for Lin Beifeng, he could never have a warframe like this for a mutant beast soul."
}