{
    "chapter": 3005,
    "title": "Trade of Luck",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3005",
    "text": "Pang!\n\nHan Sen felt as if his body had hit water. He was following the stream, continuously rolling in its flow. He did not know how far he had rolled. He stabilized his body and came out of the water. He realized he was emerging from a lake. He saw many grass fields around and clear blue skies overhead. The lake was so clean that it was like a mirror.\n\nThe sky was reflected in the water. It made people feel as if they were swimming in the sky.\n\n“What is this place?” Han Sen knew that it was not a simple place since he had fallen there through strange means. He had likely fallen through some teleport. Otherwise, he would not have ended up in that lake.\n\nHe went to a place that was like a mountain. There were many mountains and dense woods around him. No matter how he had fallen, he would not have found himself in a field.\n\nHan Sen looked around. He noticed space was different from before. He was no longer in the same system.\n\nHe wanted to get up, but the red and blue blood were causing too much of a conflict in his body. His limbs were numb. He could barely control himself.\n\nHan Sen knew that if this continued, he would lose complete control of his body. He knew his body would guide him to do something he could not control.\n\nHe gnashed his teeth. He used his shaky hands to grab the medicine Han Jinzhi had given him. He popped the lid and drank the liquid.\n\nNow, he needed to heal himself like a dead horse. He could not allow himself to lose control.\n\nHan Sen still did not understand things very much. He did not understand why the blue blood inside his veins gave him a desire to kill Bao’er. He had no such feelings for Bai King or Sun Moon God Ape.\n\n“Is it because of the xenogeneic battle body or Bao’er herself?” Han Sen suddenly could not think of the answer. Han Sen drank the medicine, which tasted like spring water. It expressed all the bloody air. The effect was better than a pill that stopped diarrhea. Blood-Pulse Sutra was running at an insane pace. Without the blood air, it finally stopped running\n\nNo matter if it was the blue blood or the Nine-Life Cat tattoo, it was like a fire had been put out. Everything quieted down. “It works!” Han Sen got control of his body again, but then he felt depressed.\n\nWhen Blood-Pulse Sutra stopped, his body had no more power to run. No matter the geno art or Blood-Pulse Sutra he tried to cast, nothing worked.\n\nThat meant Han Sen’s body had true god class power but no special skills to use.\n\nRight now, Han Sen could jump very high, but he was unable to fly. He could punch a star, but his fist had to touch a star to do that.\n\n“This is bad. I cannot fly now! How else can I go to the cold planet?” Han Sen felt a bit sad.\n\nHan Sen was able to risk using the Blood-Pulse Sutra power again. Yet, he was that afraid after using the Blood-Pulse Sutra, he would end up activating the blue blood power again. If that happened, he would be in trouble.\n\n“It looks like I will have to see if my Super God Spirit mode can break the blue blood power.” Han Sen ceased hesitating. He tried to use his Super God Spirit mode.\n\nBoom!\n\nA bright, white light was on Han Sen’s body. It made him go into Super God Spirit mode. His entire body was like a God Spirit in space. All of the powers returned to Han Sen’s body.\n\nBecause of Wan’er, the Super God Spirit mode only lasted a short amount of time. Han Sen quickly returned to his normal body.\n\n“I cannot remove this weird situation affecting my body.” Han Sen noticed he was still unable to use any gene power. On top of that, his blood was still blue.\n\n“It looks like I must go to the cold planet.” Han Sen planned to go to the cold planet. Even if Super God Spirit mode could remove his blue blood, he still wanted to find Han Yufei and ask her what was going on.\n\nNow, he could not remove the blue blood restrictions. That meant he really had to go.\n\n“Han Yufei should be the woman who was trapped in Two Worlds Mountain. If I know her face, then she was in Two Worlds Mountain. Finding her should be easy, but how do I go to the cold planet?”\n\nHan Sen rested for a while. He let his body recover before using Super God Spirit body again. That way, he could use all kinds of geno arts. At that moment, he used Dongxuan Area to scan the planet. He looked at the star map to review the geography.\n\nThe results disappointed were disappointing. It was just a primitive planet. There were creatures, but they were low-life creatures. There was not a single creature with intelligence that could talk.\n\nIt was the same with the planets around him. Han Sen was not familiar with those planets. Aside from this planet, no other planet had life or civilization of any kind.\n\n“That means I can only risk using Galaxy Teleportation.” Han Sen was glad his Super God Spirit mode could be used. Otherwise, he would be jumping around in space. He would not know when he would reach the cold planet if he did that.\n\nHan Sen rested on the grass for a while. After he recovered his energy, Han Sen used the Super God Spirit mode again. He used its moment of time to make use of Galaxy Teleportation.\n\nBecause he was unable to confirm the location and distance, he used luck to teleport. He did not know which way to go or where the desired location was situated.\n\nHan Sen prayed, “Please, God, be nice to me. Let me teleport to a planet with intelligent life.”\n\nPatong!\n\nSuper God Spirit mode lost its effect. Han Sen fell out of Galaxy Teleportation. He felt as if he had fallen into water again. “Am I having some extremely bad luck with water? Why do I keep falling into water?” Han Sen dragged himself out of the water. After looking around, he did not know what to say.\n\nHe had fallen into water, but he did not fall into a lake or river. It was not a sea or a bathtub. He had fallen into a big pot.\n\nIt was a very big, steel pot. The pot was 12 feet wide and about 21 to 24 feet tall. It was half-filled with water. Some other things were floating in there. There were chives, ginger, garlic, and chili.\n\nHan Sen’s started to salivate. He licked it. He felt a numb and spicy taste overwhelm his mouth.\n\n“Holy crap! Why did I teleport into someone’s hot pot? What is he doing, cooking numb and spicy fish?” Han Sen looked around. He discovered the pot had a lot of green and red chilies, and many other spices he could not even recognize.\n\nThe red and green chilies were all bigger than his head. It was not some normal species.\n\nHan Sen wanted to get out of the pot. When he looked at the bottom of the pot, he froze.\n\nThe pot had more than just spicy chilies. There was something alive in it. Han Sen knew it was something living.\n\n“What is going on? Has the god list fight’s No. 8 Empty Dragon King become a crayfish in a spicy hot pot? No. He is Numb and Spicy Dragon King now!” Han Sen looked at the living thing at the bottom. He did not know what to think."
}