{
    "chapter": 1243,
    "title": "Good Man’s Standard",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1243",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen exited the virtual community and saw Bao’er sitting in front of him. Immediately, she leaped into Han Sen’s chest, loudly proclaiming, “I’m thirsty!”\n\n“I’ll go and get you some water,” Han Sen said, heading for the water dispenser.\n\nBao’er then stroked Han Sen’s head fondly, whispering to him, “I want ice cream, too.”\n\n“Of course you do.” Han Sen knew what she wanted before she even said it. There was no way Bao’er would hang around waiting for him if she only wanted water.\n\nHan Sen went to the Sapphire Ice Cream Store. She wouldn’t eat ordinary ice cream, only the expensive homemade ones produced there. Fortunately, Han Sen had a lot of money, so it wasn’t a strain for him to purchase her ice cream every now and again.\n\nHan Sen saw Han Yan on the street on the way there, as she had recently enlisted at the Blackhark Military Academy. Although she been invited to join many other, better academies, she had rejected them all.\n\nHan Yan had her mother’s appearance, but because she had been practicing the Falsified-Sky Sutra, she carried herself with a unique aura.\n\nOthers would believe she looked incredibly holy, but to Han Sen, that was nothing new and he was used to it.\n\nThere was a distance between them, and Han Sen couldn’t get to her quickly. When he eventually got close enough to bark a greeting, he saw a lot of young people around her playing instruments.\n\nThere was a handsome guy playing a guitar at the center, serenading. He was singing about her, and the music was obviously being played for her as well. Han Yan was walking as this occurred, and it was almost as if the others were chasing her with the music.\n\nWhen the song was over, the boy put his guitar away and raced ahead to kneel in front of her. Then, he presented her a bouquet of roses. “Han Yan, I am very fond of you. Would you please be my girlfriend?”\n\nThe other guys were chattering amongst themselves, in hushed chants that whispered, “Say yes! Say yes!”\n\nHan Sen felt very angry, watching this. Now he could understand what Ji Ruozhen had spoken about in his speech.\n\n“That cheap *sshole! Using cheap flowers to try to seduce my sister. I’m going to beat him up!” Han Sen was still a distance away, so he wished to fly over. Not being able to right now, though, he opted for the next best thing. He started to cross the railing, to get there sooner.\n\nHe knew it was illegal to do that, and he’d be forced to study the traffic laws for ten days if caught, but that was the least of his concerns for now.\n\nWhen just one of the legs crossed the railing, Han Yan took the flowers in her hands.\n\nThe anger that had been simmering inside Han Sen began to boil and swell, and he said to himself, “I treat you like a princess! I take you everywhere you want and give you whatever you want, how can you be tricked with just a few measly flowers?!”\n\nEveryone around was clapping, and then the boy moved in for a hug.\n\n“You dare? You dare?!” Han Sen was fuming with rage, by this point.\n\nBut Han Yan then extended her arms forward, with the bouquet of flowers resting across the palms of her hands.\n\nHan Yan smiled and said, “The flowers are beautiful, but I want a boyfriend who is a good man. I want a man who can display his love and affection without the need for something material to represent it.”\n\n“My parents are noble, and I am going to max out my geno points. I will become a demi-god, one day!” the boy hastily replied.\n\nHan Yan said, “Rich or poor, strong or feeble, that does not matter to me. Only if you are a good man, will I love you.”\n\n“Then tell me, what makes a good man?” The guy asked.\n\nHan Yan answered, “It is simple, and all the requirements and standards I seek reside in the one person I myself admire the most.”\n\n“Okay, and who is that?” the boy asked.\n\nAll the boys listened in, as they all secretly wished to make her theirs, too.\n\nHearing Han Yan say she did not want money confused them. So, they each paid extra attention to learn what it would take to make them suitable suitors.\n\nHan Yan smiled and said, “It is my brother. If anyone can beat my brother as a person, then they are a good man. And such good men are men I would have no qualms dating.”\n\nThey all knew who her big brother was. He was the fearless conqueror of an emperor class shelter in the Third God’s Sanctuary. Acknowledging such crazy requirements, they all felt hopeless.\n\n“Do you mind if I keep the flowers?” Han Yan asked.\n\nThe boy, startled from out of his daze, swiftly raised his sunken head and said, “Of course, they are for you!”\n\n“Thank you.” Han Yan took the flowers and then left.\n\nHan Sen brought his leg back after witnessing all this, and he did so with great joy.\n\n“Alliance traffic law violation detected. You are in breach of law 6385, in an attempt of crossing the rail. Punishment requires a supervised study of the traffic laws for the duration of twenty-four hours. Follow the navigation beacons that will lead you to the traffic department.” The computer near the railing notified Han Sen.\n\nFortunately, Han Sen did not cross the rail completely. If he had, he’d be locked up in study for ten days. Not even the president could get out of a jam like that.\n\nHe had to start his study in three days, so he decided to carry on with his current objective, and that was to take Bao’er to the ice cream store.\n\nWhen Han Sen crossed the bridge, he saw someone approach. Seeing this person, he was flabbergasted."
}