{
    "chapter": 2441,
    "title": "The Screen Is Gone",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2441",
    "text": "Wan’er struck too fast for Han Sen to dodge. His fast reflexes moved his head far enough back that she didn’t strike him directly, but her fingertips still tore into his face.\n\nThree deep gashes were torn into Han Sen’s face. The clefts were so deep that his skull became visible through them.\n\nHan Sen was shocked. He was still in his super god spirit body mode, but Wan’er’s fingers had damaged him anyway. This was the first time something of the sort had ever happened.\n\nLuckily, he managed to dodge most of her attack. Otherwise, his entire head would have split open like a cut watermelon.\n\nHan Sen instinctually started to return to the sanctuaries. His super god spirit body couldn’t block Wan’er’s power if she chose to attack him again, so he couldn’t escape by traditional means if she wanted to fight him.\n\nBut Wan’er didn’t attack him again. She stood where she was, unmoving. She looked at the blood on her fingers, which was Han Sen’s blood.\n\nA little life came back to her eyes, and her golden power began to fade.\n\n“Do we affect each other?” Han Sen thought happily. He gritted his teeth and grabbed Wan’er’s arm. He examined her.\n\nAs Wan’er’s body came closer to Han Sen, her gold color faded much faster.\n\nWhen he saw that Wan’er wasn’t resisting, Han Sen pulled her into his arms. When their bodies were in physical contact, Wan’er’s golden power vanished completely. Her eyes looked fully cognizant for the first time.\n\n“Good brother, it’s so nice to have you here,” Wan’er mumbled against Han Sen’s chest. She was lying forward against him, and she slowly closed her eyes.\n\nAfter she spoke, Wan’er’s body went soft. Her consciousness drifted away as it had before.\n\nHan Sen frowned and looked at the girl in his arms. Her lifeforce was weaker than it had been the previous time, when she was in a coma. Now, her lifeforce was like that of a dying old woman. She no longer had the vitality of a teenage lady.\n\n“Does this mean that using the golden power costs her the strength of her lifeforce?” Han Sen looked at the lady thoughtfully as a variety of emotions shifted across her expression.\n\nThis girl was the only person Han Sen had ever encountered who could threaten him in his super god spirit body mode. It might have been a good idea to get rid of her, but there were so many unknowns about the girl. A lot of questions had been raised by her existence, and she did seem to harbor some sort of connection to Han Sen. He really, really needed to figure out what was going on here.\n\n“As long as she is next to me, she can’t make use of that scary power. So, I suppose I don’t have to be too afraid. I need to figure out what she is before I do anything drastic.” Han Sen sighed, set the girl down, and then looked across the hall.\n\nThe hall had only been home to the statue, and Han Sen looked around for a while, but he didn’t find anything useful there. And the materials that composed the hall were too tough to be broken through, so Han Sen couldn’t search any further.\n\nHan Sen did find a piece of red crystal that was around the size of his hand, though. It was inside the remains of the red eyeball. He put it in his pocket, then went back the way he had come.\n\n“Now that the statue has been destroyed, I wonder if the red-eye condition is still in effect.” Han Sen went back the way he had come to take a look.\n\nBut when he reached the place that he had left Miss Mirror, he didn’t see her there.\n\n“Did she go back to camp? That really isn’t her style.” Han Sen frowned, then began walking a little faster.\n\nEven if the red-eye power infecting Miss Mirror had vanished, she wouldn’t simply go home. She would have stayed where she was and waited for Han Sen to return so she could grill him thoroughly over what had happened.\n\nPlus, the pieces of the shattered tree egg were still lying around. If Miss Mirror had decided to leave, she would have at least taken the pieces of the tree egg with her. They were a valuable treasure.\n\n“It’s good that she is gone, then. That means all of these tree egg shards are mine.” Han Sen picked up a piece and started to put it away. As he did, he noticed how nice the chunk of egg smelled. But there didn’t seem to be any lifeforce within the pieces of egg. And furthermore, there was no semblance of power. This definitely wasn’t what Han Sen had expected.\n\n“No wonder Miss Mirror left these behind. They’re already useless. Did Wan’er absorb the powers of the tree egg while she was inside it?” Han Sen guessed. He couldn’t think of any other explanations.\n\nHan Sen kept walking back the way he had come. He didn’t encounter any more trouble. Wan’er was still in her coma, and her body was so weak that it looked like the final tether of her life would break at any second.\n\nHan Sen didn’t know why the girl had been reduced to such a condition. If this continued, she wouldn’t last long.\n\nStrangely, though, Han Sen found no evidence of the wall of pictures on his return trip. The wall seemed to have just vanished into thin air, without a trace.\n\nHan Sen continued walking back toward camp, and when the first statue came into view, he froze. Miss Mirror was lying in front of the statue, and a woman was kneeling beside her. The woman was praying to the statue of a thousand hands and a thousand eyes. It was one of the four Kings. It was Red Cloud.\n\nThe scene before him was the same as the sixth picture depicted on the screen’s mural. It gave Han Sen a chill.\n\n“What is going on?” Han Sen was confused. He looked at Red Cloud and Miss Mirror, unsure what was happening.\n\nMiss Mirror’s presence was still there. She wasn’t dead, but she seemed to be badly wounded as she lay on the ground. She obviously wasn’t doing well.\n\nRed Cloud knelt before the statue like a sincere believer. Her eyes were closed and her hands were folded as she prayed.\n\n“No way! Red Cloud never saw the statue. And didn’t Miss Mirror tell her to watch over the base? Why is she here? Did the red-eye power become contagious? That means Bao’er and Ning Yue are in danger.” Anxiety grew in the pit of Han Sen’s stomach, and he started jogging forward.\n\nBefore Han Sen reached the statue, Red Cloud opened her eyes. Her eyes were the color of blood, and they contained two pupils each. That was the look people had when they were stricken with the power of the Blood Eye Evil God.\n\nUpon seeing Han Sen, Red Cloud looked murderous. She picked up the broken sword, but instead of striking Han Sen, she turned and thrust the broken blade into Miss Mirror’s chest.\n\nHan Sen’s heart jumped, and he used his Jadeskin Area to freeze Red Cloud.\n\nRed Cloud was only King class, so she was unable to defeat Han Sen. The red-eye powers were running through her too strongly for her to know what she was doing. She couldn’t block Han Sen’s power, and so she ended up frozen.\n\nHan Sen walked up to Miss Mirror. He crouched, looked at her, and smiled.\n\n“Miss Mirror, why are you lying around at a time like this?”\n\n“Use your sword to break the statue,” Miss Mirror said quietly through gritted teeth. Her eyes were still a deep red.\n\nHan Sen could feel that the statue still had that red-eye power, but it wasn’t as strong as the statue Wan’er had destroyed earlier. It didn’t make him want to run deep into the city. It just wanted him to go to the statue itself.\n\nClearly, although the Blood Eye Evil God had been killed, this statue still had some of that Blood Eye Evil God power."
}