{
    "chapter": 2889,
    "title": "Every God Helps the Buddha",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2889",
    "text": "“Destroyed Leader!” Han Sen recognized him and frowned.\n\nDestroyed Leader was a true god class elite. His power was very great. He was No. 13 on the geno god list.\n\nHan Sen knew the Very High might send someone to trouble him, but he thought it would be someone from the Very High. Instead, it was Destroyed Leader who had been sent.\n\nDestroyed Leader slowly walked forward. His blurry light was brighter and brighter.\n\nThe Destroyed Leader had three heads. One represented light, and one represented darkness. The other one represented the soul. The three powers combined into one called Big Destroyed God Light.\n\nDestroyed Leader’s Big Destroyed God Light had already reached the max level. It had become Big Destroyed Blurry God Light. It was one of the geno arts that made the most destructive powers. It was almost indestructible.\n\nDestroyed Leader’s head that represented light looked kindly as he said, “Han Sen, the Buddha should not be destroyed yet. You should go back while you still can,”\n\n“If you do not leave now, you will die.” The eyes of the head that represented darkness looked murderous. They wanted blood.\n\n“It is time to leave now,” the head that represented the soul said.\n\nThe three heads spoke in a different tone of voice. Destroyed Leader’s Blurry God Light expanded. It was headed for Han Sen. If Han Sen did not leave, he would probably be attacked.\n\nAll the Buddha were happy. They had not expected things to take such a wild turn. The Buddha did not have a good relationship with the Destroyed, yet they were actually helping them.\n\n“Today, I am going to erase the Buddha from the list of higher races. It does not matter who gets in my way.” Han Sen was in space. Countless streams of knives spun and surrounded him. It was like the galaxy was protecting his body. He stared at Destroyed Leader. He did not look as if he was going to retreat.\n\n“Then, go and die!” Destroyed Leader’s three heads used a different tone of voice to say the same thing. The Big Destroyed Blurry God Light was shooting toward Han Sen. It was too fast. There was no time to dodge.\n\nPang!\n\nThe Blurry God Light hit Han Sen’s evil-looking, purple metal shield. The eyes of the evil-looking pretty lady engraving on the shield started to open. The Blurry God Light was frozen by her vision. It was like a great galaxy had frozen in space.\n\n“Today, the crystallizers must become a higher race. No one can stop me.” Han Sen raised his shield and walked toward the Buddha’s race lantern.\n\nBig Destroyed Leader’s Big Destroyed Blurry God Light was strong, but it could not shatter the Shield of the Medusa’s Gaze. All of the Big Destroyed Blurry God Lights froze in space. They did not deal any damage to Han Sen.\n\nBurning Lamp and the Buddha were falling back. They were close to the race lantern, but they looked terrified. Destroyed Leader, who achieved 13th place on the geno god list, was already there, but he was unable to stop Han Sen’s advance. They could not believe it.\n\nSeeing Han Sen almost come before the Buddha’s race lantern, a scarier presence ripped space and appeared. It was powerful.\n\n“The geno god list’s No. 17, Kill Ghost… Geno god list’s No. 21, a true god from the tribulation race… The geno god list’s No. 39, Northern Light Alpha.”\n\nMany scary existences went into space. They all arrived within a single second. A dozen scary elites had come. Some of them were on the god list whereas others were not on it. Regardless, the powers each of them had already reached true god class.\n\nBurning Lamp was as much shocked as he was happy. He bowed before the elites and said, “Amitabha! You are all here to help the Buddha survive this. The entire race of the Buddha appreciates this. We will never forget your kindness.”\n\n“The Buddha are friendly to us, so it is only right that we help,” Northern Light Alpha coldly said. The other scary elites did not say anything. They all just stared at Han Sen.\n\nBurning Lamp was shocked. He did not remember the Buddha being on good terms with Northern Light Alpha, but he did not care about that now. He spoke the Buddha catchphrase and said, “Amitabha! Please help me kill this thief.”\n\n“I did not expect the Buddha had that many strong ties. During this crisis, many elites are coming to help.”\n\n“Don’t you guys think it is a bit weird? So many elites are showing up to help the Buddha, but not the Extreme King.”\n\n“Now that you mention it, it is pretty weird. The Buddha have always seemed to rely on the Extreme King, so there should be no reason for the Extreme King to just sit back and watch. There are so many elites helping out the Buddha, but none are Extreme King.”\n\n“No matter what the case may be, Han Sen has no chance of defeating the Buddha and lighting up the crystallizer’s lantern with the aid of those scary elites.”\n\n“What a shame. Han Sen is so powerful. He could have brought the crystallizers up to crack the top 10. It would not have been difficult. Unfortunately, he picked the Buddha, who are not a high rank, and caused so much trouble.”\n\nEveryone was talking about the situation. Northern Light Alpha looked at Han Sen and said, “Han Sen, do the Northern Lights a favor and back off now.”\n\n“What if I don’t back off?” Han Sen coldly looked at all the true god elites. He remembered them all.\n\n“If you don’t back off, you will die.” Kill Ghost looked like a shadow. He used an extremely sharp voice to shriek his sentence.\n\nMany elites surrounded him. Many scary presences were in space. It seemed Han Sen was surrounded by a lot of beasts. He was in danger.\n\nEveryone sensed that the scary elites wished to kill Han Sen. If Han Sen took one more step forward, he would likely be killed.\n\nAgainst a dozen true god class scary existences, Han Sen only had his Shield of the Medusa’s Gaze. No matter how strong it was, it could not fend off a dozen true god elites attacking him together.\n\n“Why is this happening?” Exquisite was shocked. The Very High had yet to reach there, but many elites were already troubling Han Sen.\n\nLi Keer had an odd expression as she said, “This seems so weird. Let’s not talk about other races, but the tribulations themselves are known to have a grudge against the Buddha. They were supposedly enemies. Why have they gone there to help the Buddha?”\n\nSky Palace Leader was confused too, but he quickly realized why. He slightly contorted his face and said, “It looks like these scary people do not want the crystallizers to become a higher race. Otherwise, with the energy of the Buddha, why would so many true gods help out?”\n\nYisha did not say a word. Her eyes were filled with worry. Now, it was not about Han Sen being able to defeat the Buddha. She did not know if he could even retreat."
}