{
    "chapter": 2803,
    "title": "Eye Change",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2803",
    "text": "The old man and Bai Wanjie were in shock. The Extreme King’s Overbearing Eye was a supremely important item for the Extreme King. If something happened to it, it would affect the Extreme King a lot.\n\nPang!\n\nThe black and white eyeballs burst out of the sockets. They were each around the size of a football. Half of each was white and half of each was black. They carried a black and white light that was beaming out madly.\n\nThe old man was shocked. His body burst with a silver flame that came out of him like a tsunami. He had to become a roaring demon to suppress the black and white eyeballs.\n\nAfter a minor touch, the old man’s power vanished. The old man’s demonic power was erased into nothing greater than dust. The Extreme King’s Overbearing Eye went right in front of Han Sen.\n\nHan Sen’s body was set free. Before he realized what was going on, the Extreme King’s Overbearing Eye went into his left eye.\n\nOne was not able to imagine what kind of scene this was. A ball the size of a football went into Han Sen’s left eye. His eyes were quite big compared to humans, but they were not as big as footballs.\n\nSeeing the black and white light explode, the Extreme King’s Overbearing Eye went into Han Sen’s eye. It made his eyes look like they were erupting like a volcano. It released black and white flames.\n\nUnder that huge amount of pain, Han Sen could not help but hold his eyes. His hands were unable to prevent the black and white light from exploding.\n\nBai Wanjie and the old man were in shock. They did not know what to do, so they just stood where they were. They looked at Han Sen in mid-air. He was just cupping his hands. The black and white light surged out from the gaps in his fingers. It turned everything around them black and white. It was like a comic without color.\n\nBoom! Boom! Boom!\n\nThe entire King’s Kingdom shook a little as if something had broken.\n\n“Oh, no!” Bai Wanjie’s face turned green. He looked glum. He almost had tears forming. Apparently, something had changed with the Extreme King’s Overbearing Eye. It had a problem with King’s Kingdom’s defensive system.\n\nBefore Bai Wanjie could think of something more, he saw a few people land nearby. All of their bodies had a scary presence. One of them was the Extreme King’s king.\n\nBai King looked at Han Sen, who was floating in the air with his left eye spewing out a black and white flame. He looked at the old man and asked, “Old Iron, what is going on?”\n\n“My Lord…” The old man was going to say something, but Bai Wanjie interrupted.\n\n“Father, it was my fault.” Bai Wanjie kneeled before him and explained what happened.\n\n“Go and get Mister White.” After Bai King heard this, he did not pin any blame on Bai Wanjie. He only spoke to an Extreme King elite.\n\nThe Extreme King elite nodded and quickly disappeared. A moment later, his body reappeared. He had brought Mister White with him.\n\n“Bai, greetings, My Lord.” Mister White bowed to Bai King.\n\n“Mister White, can you explain what has happened here?” Bai King looked at Mister White. He sounded gentle, but there was an inescapable pressure hidden within that was difficult to explain. If he was asking a man with a low level of will, even if the man did not make a mistake, he would be expected to kowtow to Bai King.\n\nMister White looked at Han Sen, who was floating in the air. He had an ironic smile on his face. He bowed to Bai King and said, “It is my fault. Please punish me.”\n\n“Why would you say that?” Bai King casually asked without moving.\n\n“I told Mister Crown Prince that the Extreme King’s Overbearing Eye could break this xenogeneic’s two extreme bodies,” Mister White said with a wry smile. “I did not expect this xenogeneic would be able to attract the Extreme King’s Overbearing Eye. This was my fault.”\n\n“Oh, how did you tell the crown prince?” Bai King asked.\n\nMister White explained what he had told him. He sighed and said, “It was my mistake. You can punish me instead.”\n\nBai King ignored Mister White. He looked at Bai Wanjie, who was kneeling. “Did Mister White tell any lies in his story?”\n\n“No,” Bai Wanjie quietly said with his head lowered. His entire body was quaking.\n\n“If it was like that when you discovered how strange the sin meter was behaving, why did you not stop it?” Bai King asked.\n\n“I…” Bai Wanjie was suddenly speechless. Mister White had warned him many times that he shouldn’t rush things, but all he could think about was the Space Garden and the god’s personality. He did not heed the warnings he had been given.\n\nHe knew if he did not explain this, he would have committed a serious crime. He might have even lost his crown prince seat.\n\n“Father, there is one thing I would like to talk to you about in private.” Bai Wanjie gritted his teeth as he spoke.\n\n“Say it.” Bai King did not move, but there was some sort of invisible power spreading that filtered out everything else around.\n\nBai Wanjie did not dare hide anything. He told him everything about Han Sen and his thoughts regarding it.\n\n“Did that really happen?” When Bai King heard him, he looked at Han Sen, who was still mid-air, in shock. Clearly, the god’s personality thing had surprised him a good deal.\n\n“It was me being dumb. I was too greedy…” Bai Wanjie lowered his head as he spoke.\n\n“If you were not ambitious and someone not decisive, you would not be my son.” Bai King changed his tone. “But the way you go about things is still immature…”\n\nBefore Bai King finished, they suddenly heard a sound. Patong! They saw Han Sen fall from the air. He fell to the ground of the hall. His left eye no longer had a black and white flame in it, but he was not entirely his usual self. His left eye looked ordinary. There was a white eyeball with a black pupil. Comparing it to other eyes, this eye had no layers. The white eyeball and black pupil were really distinct. It was white like snow and black like ink. It did not look lively. It was like a lifeless eye.\n\n“My Lord, it was me who did not watch carefully and made the Extreme King’s Overbearing Eye suffer this accident,” the old man apologized. “Please punish me.”\n\nBai King waved his hand to stop the old man from talking. “There is no need to do this, Old Iron. You have been guarding the Extreme King’s Law Hall for a long time. You have always been good to us. This is not your fault, so do not blame yourself.”\n\nBai King looked at Han Sen and walked over to him.\n\nHan Sen felt terrible. He had no idea what would happen next. Something this huge had happened. Even Bai King had come. Han Sen felt like something really bad was going to happen to him soon.\n\nAs he watched Bai King approach him, Han Sen was very glum. He thought, It looks like I am going to have something bad happen to me no matter what. I might as well strike first.\n\nAfter thinking that, Han Sen got up off the floor. He straightened his body and puffed out his chest. He opened his eyes wide and stared at Bai King. He was not going to bow down."
}