{
    "chapter": 1927,
    "title": "Opening the Knife",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1927",
    "text": "Black-Moon King stood quietly on top of the mountain. He drew out a knife.\n\nHan Sen thought a King class knife would radiate, but the knife in his hands did not. This was a knife that was narrow like a crescent moon, but it was black, and it did not reflect a speck of light. It was as dark as the night.\n\nHan Sen looked at the knife and figured that it was probably only about three feet long. He wondered why it would have to be ground and sharpened on a mountain-sized whetstone.\n\nBlack-Moon King had not added the finishing touches yet, so he put his hand on the mountain. And then, the yellowish mountain produced waves of water. The waves rose at the bottom of the mountain and surged up towards the top, headed for the peak. They gathered atop the peak, and atop a rock there.\n\nThat rock had a deep groove, and when the water waves reached it, they poured down into it.\n\nBlack-Moon King stood in front of the watery stone. He held two knives and looked very serious. It looked as if he wasn’t holding two knives, but instead, two sacrifices.\n\nThe black blade was planted on the rock by Black-Moon King. The knife was fifteen degrees away from the rock, and at that angle, he began to grind it.\n\nWhen Han Sen was in the Alliance, he became interested in blacksmithing. He wasn’t, however, interested in forging knives. Z-Steel products had to be refined to make them sharp, although beast soul weapons needed nothing of the sort.\n\nBut creating a knife and refining it in the geno universe was different. A weapon that had been created from xenogeneic materials could fix itself. That was, assuming it hadn’t been too badly damaged. But overall, there was no need for maintenance and refinement. They looked after themselves.\n\nThis was the first time Han Sen had seen a xenogeneic weapon being created. While he wondered what the point of the refinement was, a light sparked between the knife and the whetstone.\n\nThat light was as warm as the sunrise. When you looked closely, the black blade had teeth marks on it.\n\nBlack-Moon King continued refining the knife, his movements slow and methodical.\n\nThe grinding was like the moaning of a newborn baby.\n\nHan Sen was shocked. This was obviously not as simple as refining a Z-Steel blade, so Han Sen was glad he had come to watch the event.\n\nEveryone watched intently as Black-Moon King continued grinding the knife. No one spoke, as they were worried they might interrupt his focus.\n\nOn its third pass over the whetstone, the black knife began to glow with a strange light. It looked like a jagged moon rising. The warm and clear light was coming down, and it gave the onlookers a chill. Everyone felt like they were naked under the glare of that light, and they imagined it had shaved off all their hair.\n\nAfter the fourth pass, another tooth appeared on the moonlike knife.\n\nEvery time Black-Moon King ground the knife against the whetstone, a moon-tooth rose. They were small to begin with, but a full moon soon started to take shape. And then, a broken moon. And then, it disappeared.\n\nThe moon above the mountain kept changing. A lot of cold moonlight came down. It was like Narrow Moon and the moonlight were interacting with each other.\n\nIt was hard to see when the moon and the shadows combined. It was like the whole world only had the knife and the moon left. It made people feel as if they were intoxicated.\n\nThe grinding sounds reverberated in the audience’s ears. Every time the knife scraped across the stone, moonlight came down from the sky to imbue the knife with a greater brightness.\n\nFrom dark to bright, from bright to dark. The strange scene began to fade, and the knife was sharpened. There was no more knifelight to observe. It was black, like absolute darkness.\n\nAt this time, Black-Moon King pulled the knife away from the whetstone. It seemed to have been finished.\n\nThe water waves on the mountain got smaller and smaller, and disappeared. The mountain returned to its yellow color. Han Sen felt strange about this, and he thought, “Has he finished grinding it?”\n\nAs Han Sen was thinking about this, Black-Moon King began walking down the mountain with the knife. He walked in front of the pavilions that Han Sen was watching from.\n\nHan Sen could feel nervousness rising from the Kings around him. Maybe there was some excitement; either way, it all seemed so strange.\n\n“Moon Wheel, can you open the spirit of this knife?” Black-Moon King held the knife in both hands as he bowed sincerely before Moon Wheel King.\n\nMoon Wheel King stood up and said, “If I can open the spirit of this knife, I would consider it an absolute honor.”\n\nAfter that, Moon Wheel King exited the pavilion and walked with Black-Moon King. He accepted the knife from him carefully. Rebecca and Du Lishe watched their father go to open the spirit of the Narrow Moon blade. They looked excited, as the other Kings looked disappointed.\n\nBlack-Moon King handed the knife to Moon Wheel King. With great seriousness, he said, “Please use your Moon Wheel powers to open this.”\n\nEveryone was in shock, and Han Sen had no idea what was going on, so he just watched intently.\n\nMoon Wheel King nodded and took the blade in his hands. His body began to glow with moonlight. Black-Moon King fell back to the pavilion.\n\nHan Sen looked at Moon Wheel King. He had heard Moon Wheel King was as strong as Yisha, but Han Sen didn’t really know much about him. And when Han Sen spoke with him, he didn’t seem remarkable at all. He was like your average, middle-aged man.\n\nBut he was now holding that prestigious knife, tasked with unearthing the knife’s power. He was basking in the elegance of radiant moonlight. He was like an angel that had just come from the sky, and not a single speck of dust could ever fathom touching him.\n\nThe moonlight floated into the black weapon. Its body soon lit up.\n\nIt was not quite shining, as it was just moonlight. There was no sign of fire, but it felt gentle. It was quiet and warm. Bzzt!\n\nEveryone’s knife began to buzz. They all wanted to hop out of their scabbards.\n\nHan Sen looked at Ghost Teeth Knife. It did not make any noise, but it looked hostile. It didn’t seem to be fond of its same kind.\n\nThe moonlight started to get colder and colder, and all the knives in Narrow Moon were crying. It was as if they were really welcoming the birth of a new King.\n\nBut Han Sen’s biggest point of interest did not rest with the King class weapon. It was all about the power Moon Wheel King had inserted into it. Moon Wheel King’s power was pure, unlike Yisha’s. Moon Wheel King’s power was soft. It did not feel intimidating, and it would be easy to ignore.\n\nHan Sen didn’t dare underestimate that power, though. In fact, he felt more alert than usual.\n\nBut the reason Han Sen focused on Moon Wheel’s power was not because he was strong; it was because the power reminded him of Moon, the geno art Yisha had given him."
}