{
    "chapter": 1067,
    "title": "Really Rich",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1067",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBefore he did anything else, Han Sen wanted to collect as many purple crystal cores as he could. When the operation’s timer ran out, it’d draw suspicion if he was to remain and not leave.\n\nBut he had plenty of time, and for the next four days, he stayed in his beetle and went around collecting as many purple crystal cores as he could find. On this fourth day, he discovered quite the staggering landmark: it was a giant hole in the ground, or rather, a crater left by some meteorite.\n\nIt was fifty miles in length, and after a preliminary scan, Han Sen was able to detect the presence of more architectural ruins at its center. This must have been the heart of the entire crystallizer region they had come to examine.\n\nSave for that one temple Han Sen found, there was nothing complete there anymore. Everything around was in various states of decay.\n\n“It looks like something horrible befell this place. And judging from the crater, that might be literal,” Ji Yanran said, as she stared at the monitors.\n\n“What could cause something like this?” Han Sen thought the crater was rather ominous, and it was teetering on the brink of being absolutely frightening.\n\nThe crystallizers weren’t known for cheap construction. They built their civilizations to last, and their structures were incredibly hardy. Average buildings of theirs had been known to withstand atomic bombs.\n\nBut the city there was in absolute ruin, and the landscapes all around were ravaged and desolate.\n\n“There must be a trace or lead we can follow up on. We should go out in search for it,” Ji Yanran said.\n\nHan Sen scanned the ruins with the gizmos in his beetle, but he couldn’t find anything to indicate what had caused the devastation.\n\nWhat Han Sen was able to detect, though, was the presence of more purple crystal cores. There were lots of them, and Han Sen hypothesized the region they were in now had to be some sort of warehouse for them.\n\nHan Sen used the beetle to dig them up, and with the abundance that were there, it took a few hours to collect them all.\n\n“We are going to be rich! There’s over a thousand of them.” Han Sen was very enthusiastic over the result.\n\nHan Sen poked about some more, but couldn’t find a lode that contained as many as the one he had just unearthed.\n\nWhen Han Sen returned from that place, though, everyone had left already. It was supposed to be a ten-day operation and now, with the timer expired, people were happy to leave.\n\n“D*mn. I was going to kill those punk shuras.” While that was disappointing, he didn’t let it weigh on him. The riches he had found more than made up for the lack of shura-killing.\n\n“We have to go now. If we remain any longer, it might draw suspicion.” Ji Yanran looked at the vast number of cores they had collected, and went on to say, “What are you planning to do with them?”\n\nJi Yanran knew Han Sen wasn’t the sort of person to so willingly hand out what he had collected.\n\n“I’ll think of something. But you should take a few of them with you.” Han Sen then took Ji Yanran back to her spawn point.\n\nAfter that, he rode his beetle back to where he had spawned in.\n\nHe put away the black beetle, which reverted to the size of a small green beetle, and gave it a scan. Nothing could be detected, and certainly not the massive amount of purple crystal cores that were still inside it.\n\nAfter pocketing the beetle, he teleported back. Everyone was there, waiting.\n\nHan Sen handed in eleven of the crystals, and after a scan, he was free to go.\n\nThe researchers did frisk and find the little beetle, but it released no energy. Therefore, they did not care.\n\nFeeling relief, Han Sen was happy he was able to get away with the motherlode, scot-free.\n\n“You and Ji Yanran are our best soldiers, no doubt,” General Reg complimented Han Sen, following the hearty load he had delivered.\n\nLooking over towards the shura, their faces seemed glum. He wondered what had happened to them.\n\nBack on the aircraft, Bai Yishan told Han Sen that they had not managed to collect many at all.\n\nThey claimed it was because there was something wrong with their teleporter, and so everything they had prepared had been rendered useless. As such, they were only able to bring back one or two each.\n\nOne of the shura had managed to collect three, but there were none with a higher amount than that. The name of the shura who had collected these was Gu Na.\n\nThe shura were initially happy with the amount they retrieved, but their faces quickly turned sour when they saw Ji Yanran return with eight. Their faces practically curdled when they later saw Han Sen come back with eleven.\n\n“I shouldn’t have handed in that many. It may seem a bit suspicious,” Han Sen thought to himself.\n\nFor a dozen cores to make the shura incredibly jealous, Han Sen realized the items were more precious and valuable than he initially thought them to be.\n\nWhen his thoughts returned to the fact that he had collected well over a thousand, though, his heart started to pound with an uber amount of excitement.\n\n“First off, I need to find out what exactly these purple crystal cores are.” Han Sen made that his primary objective.\n\nBut before Han Sen went off to find out what they were, Ji Yanran approached him with the knowledge already secured. And she was well aware he had kept the rest of the purple crystal cores they had collected.\n\nThe roulette no longer worked now, and it prevented anyone else from entering. That, combined with the shura already knowing, meant the Alliance had no reason to withhold the information from Ji Yanran.\n\nWhen Han Sen heard what she had to say, he started to cackle like a madman.\n\n“A thousand? I’m going to be rich! I’m going to be really rich!”"
}