{
    "chapter": 1318,
    "title": "Strange Demigod",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1318",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen waited for Dragon King to finish his speech, but he struggled to believe the validity of the tale he had just been told.\n\nIf Ancient Devil Emperor wanted to fight a demi-god, would it even be possible for him to be careless enough to allow a subordinate to not only stealing his kill, but take the Demi-God Geno Core, as well?\n\nAnd if Asura was able to get away with doing so, on the circumstance of what could be considered dumb luck, how could he have been strong enough to turn against Ancient Devil Emperor, so much so that it influenced others to betray their supposed leader, too?\n\nFurthermore, Ancient Devil Emperor already had a Demi-God Geno Core of his own. Why would he risk everything by using it to slay another demi-god, just so he could obtain another?\n\nJust like the jue Han Sen possessed, they weren’t artifacts that boosted the abilities of a person in any way.\n\nDragon King and Yaksha, up to this point, had not spoken a single word concerning the betrayal. Although Dragon King had now stepped forward to elucidate a few minor details, the majority of the mystery Han Sen had long sought to uncover still remained fogged and unlearned.\n\nHan Sen’s mind was clogged with a number of questions, just as it always was. And he earnestly hoped Dragon King would be willing to give him the answer he wanted most.\n\nBut it seemed as if he had overstepped his own boundaries, because he had reeled back now and quit being so talkative.\n\nHe was Han Sen’s servant now, though, so Han Sen wasn’t going to stop prodding him for more answers. After learning the few tidbits he had, Han Sen was hungry for more. He decided to ask, “How did Asura manage to kill a demi-god? What did he get out of doing that?”\n\nDragon King’s lips trembled and tripped over each other, holding in words that weren’t quite willing to part his vocal box. He looked away for a moment, as if to consider what exactly he should say. When he was ready, he turned back to look at Han Sen and said, “It’s complicated. The entire thing is like a feverish dream when I remember it now. Truth be told, we weren’t entirely sure whether or not it was a demi-god we had actually killed.”\n\nHan Sen wasn’t really sure what to make of that, so he pushed for more and asked, “Didn’t you just say you summoned one? How can you not know you summoned a demi-god, when you went through the necessary steps for the summoning of a demi-god?”\n\nDragon King was still remaining mum about the crux of the issue, skirting around the subject as best he could.\n\nHan Sen was worried Dragon King would buckle. It was obviously a difficult subject for him to talk about, and it was impressive he had given up as much as information as he had. Han Sen didn’t want him retreating back into some sort of shell and refusing to say more.\n\nDragon King said, “Mister Ancient Devil used the core to summon a demi-god, but it was… weird.”\n\n“What was so strange about it?” Han Sen enquired.\n\nDragon King said, “Mister Ancient Devil planned on summoning a weak demi-god. He could learn the strength of a demi-god by examining their altar before he committed to the summoning ritual.”\n\n“He had more than one Demi-God Geno Core, and eventually, he settled on one for the sacrifice. The altar, however, was so weak that it was unable to consume a super creature that was offered in sacrifice; alive, leastways. And this weakness was reflected in the demi-god himself, when he was fully summoned.”\n\n“No matter how weak demi-gods are, they must have a fitness of at least five thousand. That’s right, isn’t it?” Han Sen asked.\n\nHan Sen had learned about demi-gods through the Ji family. The Fourth God’s Sanctuary’s weakest creatures had a fitness level of five thousand, and that was the bare minimum. Survival in such a place, for any human, was a trial and a half.\n\nGrandpa Ji told Han Sen that even if he did manage to obtain a greater fitness number than five thousand, he should never underestimate the creatures and spirits of that place.\n\nEven if they were weak in the Third God’s Sanctuary, they’d be no laughing matter in the Fourth God’s Sanctuary.\n\n“He was going to use our collective power and geno treasures to kill a demi-god. Even if we were unable to kill the demi-god we summoned, making it bleed and collecting its blood would make the venture worthwhile. After all, it was a being that inhabited the Fourth God’s Sanctuary we were summoning, and it was only natural for us all to be afraid and nervous with the task at hand. But when that demi-god appeared before us, it was already on the precipice of death. Killing it would have been an easy job for any one of us.”\n\n“Whoa, you guys were that lucky?” Han Sen was surprised to hear they were that fortunate.\n\n“Lucky?” Dragon King gave Han Sen a strange look before proceeding to say, “None of his plans were of any worth, so Asura stepped forth and killed it. Then, he took his power! It was like the savage twist of a knife, and suddenly, there was division in the ranks and contention amongst the generals. A fight broke out, and it resulted in the utter ruin of Ancient Devil Shelter.”\n\n“It sounds like Asura did a good, old-fashioned kill steal. I don’t really see what the big fuss is about. Couldn’t you guys have just talked it out?” Han Sen was a little underwhelmed, learning this was the answer to the mystery he had long wished to be revealed.\n\nDragon King looked at Han Sen strangely once more, and he told him, “I said the demi-god looked weird, didn’t I?”\n\n“Yeah, weird. As in, it’s weird this emperor we summoned is dying weird, right?” Han Sen said.\n\n“It would have been lucky if that had actually happened.” Dragon King paused and sighed for a brief moment, before explaining, “Before the demi-god died, he said something that chilled our very bones.”\n\n“Okay, and what did he say?” Han Sen asked. He wished Dragon King spoke a little faster, as it aggravated Han Sen when every word and syllable was delivered so slowly.\n\n“He said he was God.” Dragon King’s voice trembled to speak that final word.\n\n“God?!” Han Sen had heard a lot about some figure proclaiming itself to be God, and he didn’t think Dragon King was preaching about the Big Cheese of Christianity when saying this.\n\nIt sounded just like the God figure Han Jinzhi was said to have met."
}