{
    "chapter": 1051,
    "title": "A Card",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1051",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen conceded and decided to oblige Xie Qing King’s desire. Once they exited there, they would travel to Sword-Furnace Shelter together.\n\nFor Han Sen to allow this, though, he had to have something in return. For Xie Qing King to remain at Sword-Furnace Shelter, he would have to aid Han Sen in taking down Holy-Sword Shelter.\n\nAfter their discussion, Xie Qing King remained in the lake to heal. As he did, Han Sen went off on his own to search for the treasure ahead of him. When he was feeling better, Xie Qing King said he’d follow.\n\nHan Sen was initially concerned about venturing through the strange land alone, but now that he had received his new beast soul, he was more comfortable in doing so.\n\nWith his current fitness, he could shapeshift and do battle for a good while before becoming exhausted.\n\nThe only problem with using the gold raven beast soul was the fact that he could only make use of one of the skills he frequently used as a human. All he could use was Aero.\n\nWhen Han Sen transformed, he was essentially a fire super creature. There was a chance he might have even been stronger than Xie Qing King himself.\n\nHe was curious about the nature of the gold raven beast soul, though. The beast soul he received from the sheep was polluted, whereas this one wasn’t.\n\nHan Sen guessed it might have something to do with the fire element.\n\nHan Sen got back to exploring the strange place from above, airborne. After flying for a while, he caught sight of a few creatures that looked like the sheep. He killed one and discovered that they too were inedible.\n\nIt had been a while since he saw Brother Seven, and while he held some worry for his well-being, Han Sen also wanted to find the treasure.\n\nHan Sen spent the next few days flying around, but he could find neither hide nor hair of Brother Seven or the elusive treasure that had led him down there in the first place.\n\nSo he decided to return to Cow Mountain that Brother Seven had once mentioned as a potential rendezvous point.\n\nHan Sen could not find anyone there at first, but then a weird figure caught his eye. There was a cave in the distance, and a dirty person emerged from that dark hole.\n\n“Brother Seven!” Han Sen ran over to the man.\n\n“I knew you’d be back!” Brother Seven immediately placed something in Han Sen’s hand. “I found this in the Phoenix Eye. Take it back.”\n\n“What? Are you not coming back with me?” Han Sen asked.\n\n“I need to return to Holy-Sword Emperor. I can only assume some trust has been lost between us, and I should work on restoring some of it. I could die at any second, remember? But I’m going to tell you about a certain place, and you’re going to have to go there. All the intel I have gathered is there.” Brother Seven repeated this statement a few times.\n\nHan Sen looked at him with admiration. Brother Seven was the sort of fellow you would not meet every day. There were many sides to his character, but all of them good.\n\n“I will take down Holy-Sword Shelter, just you watch. I will give you back your freedom,” Han Sen said with assurance.\n\n“I know you will.” Brother Seven nodded with a smile.\n\nBrother Seven was feeling a jittery hope he had not felt in a long time.\n\n“Come on, let’s get out of this place,” Brother Seven said.\n\nBut Han Sen shook his head and told him, “I’m waiting for someone. You should go on ahead of me.”\n\n“Who can you possibly be waiting for, in a place like this?” Brother Seven asked, humorously.\n\n“Well, it’s not really a who. It’s not a person, per se.” Han Sen explained the events that had led to him encountering Xie Qing King, and the peculiar alliance they had forged.\n\nBrother Seven did warn him, though. He told Han Sen, “You should still exercise caution around him. If he did, by chance, turn on you, you might be too weak to save yourself. And if you were unable to defeat him, I don’t fancy the chances of others.”\n\n“I understand,” Han Sen replied.\n\nHan Sen might have felt this way himself, but he had become a lot more confident in his abilities. If Xie Qing King did try something, he was sure he could respond to the threat appropriately.\n\nStill, Han Sen kept the precautionary words of Brother Seven in mind. It was only wise to stay on one’s toes.\n\nAfter all, Han Sen’s power mostly came from external forces. His actual fitness level was far below what he would have liked.\n\nHan Sen waited a few more days, and eventually, Xie Qing King came to meet him at the exit to that place.\n\n“My Emperor, did you find the treasure you sought?” Han Sen asked.\n\n“No, and I give in for now. I have no idea where that blasted turkey kept their belongings.” Xie Qing King then eyed Han Sen suspiciously, before asking, “And what about you? Did you find something?”\n\nHan Sen shook his head and said, “No, but I fear for my shelter.”\n\nHan Sen did not care if Xie Qing King believed him, because technically he had not lied. He didn’t find anything; Brother Seven had just given him something.\n\nIt was a gold card, shaped like an arrow. There was a phoenix on the front and a woman’s face on the back.\n\nHan Sen had never seen Phoenix Emperor before, so the spirit’s appearance was always up for debate. While the initial assumption might have been that it was a man, it could very well have been a woman. And now, Han Sen suspected it was, and the image of the woman’s face might have actually been a representation of the elusive Phoenix Emperor.\n\nAside from that, Han Sen had also received another treasure, one that had presented itself to him. It was the weird fish-bird, and it had yet to leave Han Sen alone. It insisted on following him, in continued admiration for his Phoenix Sword.\n\nEither Xie Qing King believed Han Sen or he didn’t actually care, but whatever the case may have been, he did not ask again. Currently, he was keen to see Han Sen’s shelter and meet the other humans that were said to be there.\n\nHan Sen brought Xie Qing King there, just as he had promised. He also made sure to warn Lin He and his people to be respectful and avoid doing anything that might infuriate the man.\n\nXie Qing King had promised Han Sen he wouldn’t hurt anyone, but who knew what he might do in a fit of wall-punching rage?\n\nXie Qing King observed the people of the shelter with keen interest, and he was particularly fascinated with their clothing. Over and over, he made requests for Han Sen to show him items that humans frequently made use of."
}