{
    "chapter": 2747,
    "title": "Battle in the Deep Sea",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2747",
    "text": "The water around Han Sen became dark blue, and the color started to drift straight through the substance chains that protected Han Sen’s body. The color was about to touch down on Han Sen’s body like a plume of blue smoke.\n\nHan Sen’s eyes hardened, and his body transformed into icy jade. He lifted a hand and an icy jade substance chain suddenly crystallized large portions of the water around him, freezing the toxic substance chains in place.\n\nOnce the toxic powers had been stopped, Han Sen immediately turned his attention back to Bai Wei and summoned his Immortal Dragon. “Let’s see if the Immortal Dragon’s power can fix a body that’s been affected by a toxic substance chain.”\n\nThe Immortal Dragon felt Han Sen’s command, and it opened its immortal substance chains. A holy light landed on Bai Wei, causing the blue toxic gas around her to fade. In seconds, her skin had returned to its normal, healthy color.\n\nBai Wei gave Han Sen a strange glance. She didn’t speak, though, so Han Sen had to ask, “How do you feel?”\n\nBai Wei shook her head and said, “There is no problem. I’m completely fine, as a matter of fact.”\n\nHan Sen felt more secure once he had heard that. He looked at the sphere of blue ice that he had created around them, and then he threw a punch straight at it. When Han Sen first created the ice, his icy power had followed the path of the toxic substance chains as it went. Now, as he shattered the ice, the force of his punch followed the frozen substance chains back to their origin. At the end of the long trail of icy shards, a scorpion-like xenogeneic lay unmoving on the sea floor. It was like an icy sculpture.\n\nBai Wei gave Han Sen a glance that was even more inscrutable. Han Sen was just a crystallizer. Despite that fact, and even though far fewer resources had been available to him than to her, Han Sen could freeze a deified xenogeneic in a single punch. That power was super rare even in the upper echelon of the Extreme King. Elites of the Extreme King could likely never perform such a grand feat against an enemy of the same level.\n\nHan Sen walked in front of the frozen deified xenogeneic. His fist blurred down, obliterating the creature’s head in a single strike. Under the sheer force of Han Sen’s fist, the incredibly resilient armor of the beast was as weak as a wet tissue.\n\n“Xenogeneic deified killed: Deep Blue Sea Scorpion. Deified xenogeneic gene found.”\n\nAn announcement played in Han Sen’s head once the finishing blow was delivered.\n\n“It looks like deified xenogeneics aren’t that difficult to kill. Once I take down a few more, fulfilling the 100 deified gene requirement will be easy. But this Deep Blue Sea Scorpion is too big. If I have to eat its flesh, I will be casting Consume for many days,” Han Sen thought to himself. Just as he was about to grab the body of the Deep Blue Sea Scorpion and drag it away, something burst through the frozen seawater behind the Deep Blue Sea Scorpion. An enormous mouth appeared and gulped down the Deep Blue Sea Scorpion’s body.\n\n“Oh, sh*t! How dare he steal a kill that I, Han Sen, have earned! Did you eat a bear’s heart?” Han Sen was so angry. He stared darkly at the xenogeneic that had just swallowed his Deep Blue Sea Scorpion.\n\nThe xenogeneic looked like an electric eel. Its body was snow white, and its scales shone like diamonds. Although it wasn’t trying to attack, its body crackled with white lightning that looked like silk as it flickered.\n\nAfter the electric eel swallowed the Deep Blue Sea Scorpion, its hunger still wasn’t satiated. Its eyes locked on Han Sen and Bai Wei like a prison spotlight.\n\nThe next second, the creature exploded with a burst of lightning. A bolt of power flashed toward them, and Han Sen reacted with blinding speed. He generated a substance chain born from Jadeskin to counter the lightning.\n\nPang!\n\nThe lightning discharged violently when it slammed into Han Sen’s counterattack. Han Sen’s hair stood on end as the power swept over him, leaving his clothes charred and pitch-black.\n\n“This guy can’t be a transmutation xenogeneic, can it?” Han Sen was shocked by the fact that he hadn’t completely deflected the lightning’s power. He knew this electric eel was far from ordinary.\n\nThe strike of the electric eel hadn’t killed him, though. It just sent his body spinning through the blue water. That white lightning was incredibly powerful, though. The beast cast another attack, which surged toward Han Sen and Bai Wei like a net of electricity.\n\nHan Sen grabbed Bai Wei and hastily dodged. He also cast the Dongxuan Sutra at the same time, and he unsheathed Ghost Teeth Knife. He used Under the Sky to slash at the electric eel.\n\nThe power that Han Sen could currently emit was enough to defeat an ordinary primitive xenogeneic, but the electric eel’s lightning was able to break his offense with ease. Han Sen’s brow furrowed as he wondered again what level the electric eel was.\n\nBoom!\n\nA flash of lightning that looked like it came from space landed on Han Sen. Han Sen didn’t have time to dodge it. His whole body crackled with the power, and for a split second, it knocked him senseless. His body fell through the water.\n\nBai Wai was in even worse shape, and she only stayed upright because Han Sen was holding her. Her body wasn’t as strong as Han Sen’s. She was wracked with pain, and her electrified armor blackened under the power of the electricity. When Han Sen teleported away with her, the armor couldn’t withstand the additional force, and it disintegrated into dust.\n\n“Argh!” When Bai Wei recovered from the lightning’s paralysis, she noticed that her armor had turned to dust. She screamed and blushed deeply.\n\nHan Sen didn’t have time to admire her. He used God’s Wander to teleport away from the Buried Dragon Sea. They returned to the coast.\n\n“You stay here for now. That xenogeneic is too strong. I’m not confident that I can kill it, so I need to push my luck solo,” Han Sen said, and then he used God’s Wander to return to the deep sea.\n\nAlthough he knew the electric eel was extremely strong, it had swallowed his prey. He wasn’t going to let that go so easily.\n\nThe electric eel had lost track of Han Sen and begun to survey the area in an intense search. When it eventually found him, it immediately unleashed a wild burst of lightning. What seemed like an ocean of lightning was now surging toward Han Sen.\n\nHan Sen’s heart pounded, and a blood-red color swept over his body. It made his skin look like a bloody shell. His body quickly changed, turning him into a half-human, half-demon creature. He looked like some beast that had just crawled out of hell.\n\nIt was the Red Blood Demon beast soul. The beast soul wielded a demonic power, and after Han Sen demonized his body, his strength increased by heaps and bounds.\n\nHan Sen also clad himself in his Peacock King’s soul robe. The two beast souls appeared on Han Sen at the same time, making Han Sen considerably stronger. He summoned power through Jadeskin again and threw a punch to meet the incoming storm of electricity.\n\nHan Sen’s power rushed out, turning everything in front of him into ice. Even the lightning was frozen beneath the sea. It hung in the water, still blazing with light through the ice that encased it.\n\nWhen the electric eel noticed that its lightning had been frozen, it became furious. It opened its mouth and fired out a pillar of lightning like an aurora. Wherever the lightning pillar went, the ice was broken. Nothing seemed capable of stopping the advance of that wicked electricity.\n\nHan Sen stared at the pillar of lightning. He mustered his own power, not willing to fall back. He threw a punch forward, aiming directly for that grand force.\n\nBoom!\n\nThe water exploded away as the two powers collided, forming a vacuum zone in the sea. The lightning didn’t stop, though, and Han Sen’s Jadeskin body could do little to stop the lightning that began surging through his body. He was electrified, and he spasmed and shook like he was doing a breakdance.\n\n“Oh, no! There’s something strange about this electric eel’s lightning,” Han Sen thought, his mouth going dry. Ordinary lightning power shouldn’t have been able to hit him like that."
}