{
    "chapter": 1936,
    "title": "Antiphasic",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1936",
    "text": "“Ming’s wife used her love to feed that cruel demon Ming King. She seduced him to open his mind and become a Buddha King herself. Even that cruel monster could not block it, so how could you?” Speechless felt so very cocky.\n\nDuring the cultural exchange between the Buddha and the Rebate, Speechless had been beaten by Gu Qingcheng. She was not happy about that. When Speechless heard that Han Sen was visiting the Buddha Kingdom, she went looking for him. She badly wanted to exact her revenge badly.\n\nShe planned to bring Han Sen to the Happy Buddha Wall. With the atmosphere in front of the wall being what it was, and with her skills to disturb Han Sen’s will, she knew she would succeed.\n\nSpeechless would not stand for Han Sen becoming one of the Buddha. So, she made him fall in love with her. She was confident with the seed of love she planted.\n\nWith Han Sen’s mind currently shaken, she could take advantage of his dazed state and plant her seed. He would do whatever she bid him to do, and he would listen to her no matter what.\n\nThe skill was called Desire, and there were few people who could practice it with proficiency. Speechless was very talented with it, though, because of her connection to Speechless Buddha King. Speechless Buddha King had practiced happy skills, and she followed his example.\n\nSpeechless’ eyes looked very attractive, and she thought to herself, “Come on. While your will is still a mess, I will nudge you into a situation that will embarrass you horribly when you come to your senses.”\n\nThinking about this made her feel so much better. She casually began to check out Han Sen.\n\nHe actually looked a lot like a Buddha. Han Sen’s face was more attractive than average, but it was too thick to look exactly like a Buddha’s, though. It wasn’t pretty.\n\nBut Han Sen’s talents were shockingly good. They were so defined. Even she was jealous of what he was capable of.\n\nWhat shocked her the most was Han Sen’s eyes. They weren’t pretty, but they were extremely attractive, for a reason she could not pinpoint. Something about them reminded her of a rising phoenix. Those black eyes were an enthralling abyss, and as she stared into them, Speechless suddenly found it difficult to look away.\n\nSlowly, Speechless’ face started to blush. Her own eyes quivered strangely. She came closer and closer to him. Her eyes were so attractive, and her lips drew near Han Sen’s.\n\n“Why do I think he looks different, all of a sudden?” Speechless wondered, and her heart was beginning to race. She suddenly needed Han Sen like she needed to breathe. He looked like the person of her dreams.\n\nSpeechless’ lifeforce was all messed up. A moan passed her lips, as her eyes dropped into a soft look. It seemed as if she wanted to pull Han Sen closer.\n\nHer arms, beneath the white robe, wrapped around Han Sen’s neck. Her lips were going to connect with Han Sen’s lips.\n\nSuddenly, a finger landed on Speechless’ lips. She was hastily thrust out of her daze.\n\n“Don’t try that too much; you’ll become addicted.” Han Sen smiled as he touched Speechless* lips.\n\nSpeechless’ cheeks burst into fire. With another moan, she stumbled backwards. Her heart was all tangled up, and she couldn’t bring herself to even look at Han Sen now. She wanted to dig a hole and hide herself.\n\n“I’m sorry; I have remembered that there is in fact something I ought to do. I will take my leave now. Sorry.” Speechless was in complete shock, and it was obvious she wanted to run away.\n\nHan Sen found it funny that Speechless, of all people, would run off in such a manner.\n\nHis will was like that of a deified being. It was too strong for someone like Speechless to easily manipulate. Speechless’ Desire skill could not shake Han Sen. Her attempt at seduction had backfired, and that was why she ran off.\n\nAfter she left, Han Sen sat down on some stairs and observed the Happy Buddha Wall.\n\nHan Sen couldn’t discern anything particularly special about it. But now that she was gone, he could scan the wall with his Dongxuan Aura.\n\n“I see.” Han Sen looked at it, then deactivated his Dongxuan Aura. It turned out that it wasn’t worth checking out.\n\nJust as he was getting ready to leave, though, a few people arrived. They had come there to see the wall, too.\n\nHan Sen looked at them and noticed how similar to humans they looked—aside from the horns on their heads, of course. Furthermore, Han Sen knew the leader of the bunch.\n\n“Luo Ji? He’s not dead?” Han Sen was surprised.\n\nWhen he met Luo Ji the Demon, he was on Planet Kate. Luo Ji had invited Han Sen to join him at Demon’s Grave. When danger befell the pair, Luo Ji abandoned Han Sen and fled into the desert.\n\nHan Sen hadn’t seen the man since, and so he presumed him to be dead.\n\nApparently the man had survived, and to top it off, he had come to the Buddha Kingdom at the same time as Han Sen.\n\nIt looked as if he had practiced a lot in the time they had been apart. He was faster than Han Sen, and that was because he was an Earl.\n\nWhen Luo Ji saw Han Sen, he too looked surprised. He asked Han Sen, “You are Knife Queen’s student, Han Sen?”\n\n“Yes I am. Who are you?” Han Sen had used his Dollar persona when he first met Luo Ji. The man didn’t know Han Sen was Dollar.\n\n“I am Luo Ji of Demon.” Luo Ji had brought a few Demons with him. He smiled at Han Sen, “You must be here to access the Buddha heaven, correct? How about we go there together?”\n\n“I have other business I must conduct. I am sorry to disappoint you,” Han Sen said and left.\n\nHan Sen knew what sort of person Luo Ji was now, and he knew he wouldn’t cooperate fully with him.\n\n“Disrespectful!” After Han Sen left, a Demon behind Luo Ji spoke.\n\nLuo Ji waved his hand and said, “That man’s genes may not be stable, but his skill is profound. Knife Queen took him as a student, so it is best we do not offend him. This trip to heaven is important to me. We cannot risk failure. Please behave and do not cause me unnecessary trouble.”\n\nYes, sir.” The Demons with him agreed.\n\nHan Sen was walking west, but he didn’t have time to stop and admire the views. He just wanted to return to the city where Burning Lamp Alpha was to deliver a speech. And after that, he wanted to get this heaven ordeal over with so he could return to his wife.\n\nHan Sen spent two days returning to the Buddha city. As soon as he entered, he saw a familiar shadow appear in the crowd.\n\n“Why is he here?” Han Sen stared in shock. But then, the shadow disappeared.\n\nHan Sen walked to the alley where he had seen it, but he found no trace of the man.\n\n“Are my eyes going funny? God’s Retribution cannot be here. There is no way he could come out here without my assistance.” Han Sen retreated into thought, as the entire situation seemed wrong. But the shape of the shadow’s body really did look like him."
}