{
    "chapter": 158,
    "title": "A Great Victory",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_158",
    "text": "Ji Yanran looked blankly at the silver figure in the holographic image, unable to link it to that smiling guy.\n\n\"Is it really him who is driving Silver Killer?\" Ji Yanran was reluctant to accept this fact. How could that guy who joked around all day with her have such incredible operational skills at warframe?\n\n\"Judging from his performance now, his hands must be very fast. So… when we were in that spaceship, he did not cheat? That was what he could actually achieve?\" Ji Yanran suddenly thought of it, her body slightly shaking.\n\nThen her face was flushed on the thought of another matter. She could not help but thought, \"If he really has the skills... then, My-girlfriend-is-Ji-Yanran would be him... \"\n\nJi Yanran was more and more convinced of her guess. With that kind of speed and ID name, who else could it be?\n\n\"That bastard, how dare him lie to me!\" Ji Yanran felt embarrassed. On a second thought, she suddenly found that she was the one who took him for a cheater, while he was always trying to explain. Han Sen had never lied to her.\n\nHe even told her who he was via the ID name, My-girlfriend-is-Ji-Yanran. this ID is not already told Ji Yannan who is he? But Ji Yanran had never made that connect.\n\nThinking of Han Sen and that ID, Ji Yanran blushed a little more. On the thought of the bet they made, her face was burning.\n\n\"Bad, bad, bad.\" Ji Yanran covered her face with both hands and cried in a meek voice.\n\n\"Sweetie, are you okay?\" Qu Lili was stunned by Ji, because she had never seen this girl acting this way.\n\nPeople next to them were also shocked by Ji Yanran’s bashful look.\n\nJi Yanran then realized she was still at the venue of the Hand of God games, surrounded by the members of Hand of God Society. She was mortified and wished that she could become invisible.\n\n\"It's a great victory. Let's remember these two names, Silver Killer and its driver Han Sen. Maybe we're witnessing the rise of another king in the Military Academy League. He is creating history... \"Fang Mingquan’s passionate voice marked the end of an extraordinary single warframe combat.\n\nRemaining on the field were only two warframes, Han Sen’s Silver Killer and Lu Meng’s Victor. All the other warframes had exploded.\n\nLu Meng quit the game and left the ring to Silver Killer, which had just ended its frenzy. More than three or four hundred warframes were blown off by it.\n\nWhen the Silver Killer stepped on the podium and accepted the trophy, thunderous applause lasted a long time. In any case, this was a memorable game.\n\nThe two names, Silver Killer and Han Sen, were also imprinted on all viewers’ minds.\n\nThe group warframe combat did not even begin. After the single combat, all other players were crushed psychologically and thus conceded in the beginning. The team of the Heavy Warframe Society won the championship by default.\n\nAfter the end of the game, a lot of people were still too excited to leave, talking about the crazy game. One hour after Fang Mingquan’s live show had ended, the number of people watching his program even increased.\n\nMore and more people were hoping to see Fang Mingquan’s recording of the game.\n\nAlthough other news stations had also recorded this game, their equipment there was not good enough and the quality of their recordings was poor.\n\nFang Mingquan did not waste a minute before he asked all the staff to edit the footage as fast as they could.\n\nSilver Killer was the center of attention in the edited recording, except in the beginning when it was covered by the Destroyer.\n\nSilver Killer’s movements were so perfect that the staff did not want to give up any frames. So, the final version was more than 30 minutes.\n\nFang Mingquan named the video himself before uploading: \"Best Division Single Warframe Combat Champion—Silver Killer and Its Gorgeous Conquer.\"\n\nThe moment the video was uploaded, it was downloaded and spread at an incredible speed.\n\nAll the people who had watched it could feel nothing but satisfactory.\n\nThey were impressed by the silver warframe that moved like ghost and its violent gunshots. Everyone enjoyed the pleasure of seeing its incredible accuracy and swift slaying.\n\nPeople even became addicted and watched it over and over again.\n\n\"This is a true warframe!\"\n\n\"Have watched a dozen times. I can’t stop now.\"\n\n\"A gorgeous killing feast.\"\n\n\"Which company made this? I want one so much.\"\n\n\"Same here. I need this warframe in my life.\"\n\n\"I want to buy ten of this.\"\n\n\"Do not just look at the warframe. The driver is the key. He is definitely beyond the unevolved level. I bet that you can count the top players like him in the whole Military Academy League with one hand.\"\n\n\"Ha-ha, and he is in the Archery Department and Heavy Warframe Society. The Warframe Society must feel humiliated.\"\n\n\"Funny to think that an archery student is the champion of a warframe game.\"\n\n\"I heard that the Archery Department of Blackhawk was on the bottom of Military Academy League in the previous year.\"\n\n\"I wonder how his archery skills are.\"\n\n\"Of course he is good at archery--he is in the Archery Department.\"\n\n\"He has way too nice skin to drive in such a brutal style.\"\n\n\"I barely saw him miss.\"\n\n\"He is an archery student. How is his accuracy even worth discussing?\"\n\nThe video went viral all over the Alliance quickly. Students from all military schools had seen the video and made a variety of analyses of it.\n\nMost of their conclusion was that Silver Killer and its driver had gone beyond the level of ordinary military school students."
}