{
    "chapter": 1691,
    "title": "Battling Feather",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1691",
    "text": "Fear gripped Han Sen’s throat, but he found himself falling back before Old Cat even made the suggestion. He summoned his Death Armor Swordsman beast soul and transformed into the Death Armor Swordsman.\n\nHan Sen had no choice but to use the beast soul as his fitness was low. And since he was wearing the glove, he could not summon the white armor. He could only summon beast souls.\n\nThe angd-looking creature blurred toward him, while Han Sen was also fast, he wasn’t fast enough to dodge.\n\nHan Sen gritted his teeth and used his hand to protect his chest for a block.\n\nPang!\n\nHan Sen felt as if he had been hit by a train. His body was sent flying, and he went barreling into one of the walls of the laboratory. He broke through the wall and continued flying back.\n\nAfter bursting through a few walls, Han Sen came to a stop. He fell to the ground and spat out some blood.\n\nHan Sen did not have time to wipe his lips, though, and he immediately regained his feet and started running. Old Cat was running, too, and he went right past Han Sen.\n\nHan Sen turned around and saw the red-eyed angel giving chase at a blisteringly swift speed.\n\n“Sh*t! What is that thing?” Han Sen ran as fast as he could, but the being was way too strong. Not even geno armor could bestow the strength necessary to beat it.\n\nOld Cat ran, and as he went, he screamed, “After the crystallizers lost the war, they stole a few children from the higher race. I thought it was only a myth. But look at this! It’s f*cking real! Crystallizers brought Feathers to such places for research, as they wanted their genes.”\n\n“A superior race? What superior race?” Han Sen gnashed his teeth.\n\n“Don’t ask. Just run! It’s going to catch up!” Old Cat shouted.\n\nHan Sen turned around, and the Feather was right behind him. The fist was coming so quickly, strong and fast\n\nHan Sen had already taken a hit, and his chest was still in pain. This time, he’d definitely be unable to dodge. He gritted his teeth and summoned Destiny’s Tower.\n\nPang!\n\nThe feather punched Destiny’s Tower, and the bottom of Destiny’s Tower actually caved in.\n\nDestiny’s Tower had gone through the God’s Door test It was far stronger than it had been before, like geno armor. But even so, the Feather had just punched it. The power required to do what the Feather had just done was breath-taking.\n\nHan Sen had intended to use Destiny’s Tower to absorb the Feather, but the Feather’s punch was enough to knock Destiny’s Tower away. The bottom of it caved-in.\n\nHan Sen gasped and kept on running. The Feather was way too over-powered, and it made for a terrifying foe.\n\nThe Feather kept chasing, while Han Sen used Destiny’s Tower as much as he could to block it The Feather’s punches had made Destiny’s Tower all crooked and twisted. It’d break if things continued like this.\n\nBut Han Sen could not really spare concern over Destiny’s Tower, given the circumstances. He had no choice but to use it to keep himself alive.\n\n“Old Cat, what is this? Can you deal with it?” Han Sen shouted at Old Cat. Even if he sacrificed Destiny’s Tower, an escape did not seem likely. When the tower broke, he would be killed.\n\n“Stop thinking and just run! It’s beyond either of our levels. This thing must have been tortured by the crystallizers. It’s probably weak in comparison to others. If this thing was operating at full strength, you’d already be dead!” Old Cat shouted.\n\nHan Sen wanted to run, but he felt as if he no longer could. Hearing Old Cat say that their foe was that strong, he knew this was the direst of circumstances.\n\n“This guy cannot be a creature from outside!” Han Sen said.\n\n“He is,” Old Cat said without hesitation.\n\nHan Sen was feeling desperate, as there was no safe place he could run to. The Feather punched Destiny’s Tower with an extra hardy hit, and it sent the tower flying away. The Feather was the same as it had been, though. And then, it threw another punch towards Han Sen.\n\nHan Sen used so many different types of movement, but he was incapable of evading the Feather. He gritted his teeth and threw a punch back at the foe.\n\nHan Sen was prepared to borrow strength from every ability he had. The fitness of a super creature was minuscule in comparison to a Feather, after all. He used Yin Yang Blast’s yin power. Even if he was risking having his organs damaged, he had to try to outrun his pursuer.\n\nThe fists collided with each other. And as the fists came into contact, Han Sen readied himself. He felt a scary power come through his right fist, hitting the Feather.\n\nThose two powers created a massive shockwave that toppled all the buildings around them, while Han Sen was entirely fine.\n\nHan Sen’s right hand was glowing. The light shone across his body, and he was completely wrapped up by it. Han Sen felt as if he was full of power. It was almost endless, like an endless river coursing through his body.\n\nThe armor that looked like jade and bone started to cover up his entire body. It almost looked like he was wearing the white geno armor, but he wasn’t. Before Han Sen could get a better look, though, the Feather appeared again. Its fist was raging toward him, and the speed was incredibly fast\n\nHan Sen quickly dodged the Feather, and he was surprised. With the armor that had come from the glove, he could catch up with the Feather’s speed.\n\nFeather threw a punch, but Han Sen was unafraid. He walked forward to it, dodged the fist, and struck the Feather’s belly. This resulted in the Feather looking like a shrimp, shooting backward.\n\nHan Sen was happy about this, but his hand was not relenting. It was going after the Feather. His fists and legs followed like a storm.\n\nWith the armor’s buffing, Han Sen’s strength and speed were now comparable to the Feather. The Feather only had strength, though. It had no skill or technique. This allowed Han Sen to suppress it with ease.\n\n“Huh?” Old Cat saw the changes surge through Han Sen’s glove, and he looked shocked. And then he looked annoyed, and said, “That glove is actually good! I would have gone and gotten it myself, if I had known.”"
}