{
    "chapter": 1866,
    "title": "Son of the Moon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1866",
    "text": "“Bullsh*t! Why did he join the fight? An Earl fighting a Baron? What is this?” An old man that was of a higher rank saw the beautiful man step into the fight. This displeased him a lot.\n\nWhen most average people saw this, however, they did not mind. In fact, they were quite excited to see the beautiful man fight.\n\n“Gao Ji’s attacking! His Dragon Sun knife skill is a Dragon Moan, and not even Viscounts can withstand something like that. Han Sen will surely suffer now.”\n\n“Haha. It’ll be good to squash this outsider’s reputation. If this hadn’t occurred, this entire Moon God’s Festival would have been his show.”\n\n“Knife Queen is so powerful. She selected a very powerful student. It may be difficult, being a Baron, but his luck and talents are very good.”\n\n“Of course. It sounds like you guys thought she only picked him because he’s good-looking.”\n\n“It’s true that he doesn’t look bad. He is suitable to earn respect amongst the beauty of the Rebate, but when compared with us, he is only average. There are many more handsome Rebate men that far exceed him.”\n\n“It is fine if he loses to Gao Ji. He has done well.”\n\nThe Nobles and the commoners were talking. Yisha, Moon Wheel King, and Night River King were in absolute shock. Gao Ji’s Dragon Moan was shocking. It was capable of freezing Viscounts on the spot.\n\nBut Han Sen had proven resilient to it, and he was not affected. Han Sen still gripped his knife, and just as the copper knife was about to hit him, he drew out his Ghost Teeth Knife.\n\nSeeing Ghost Teeth Knife about to slice open Gao Ji’s neck, the observers still had to remember that Earls were Earls. Their speed and reaction times were too fast to comprehend. A green dragon of light swiftly appeared to swallow Gao Ji’s body.\n\nDong!\n\nGhost Teeth Knife hit the green dragon’s shadow. Han Sen tried his hardest, but he was unable to break the shadow of that dragon. Han Sen did not put his knife away, though. He still used his knife to release a purple mist, right next to the green shadow.\n\nGao Ji frowned. He had used his green shadow dragon’s power to shake Han Sen away from him.\n\nThe moonlight of Narrow Moon was like water. The moonlight shone on Han Sen, bathing him in its glow. He was getting stronger, and Gao Ji couldn’t do anything to get away from him. Ghost Teeth Knife was still mauling the green dragon shadow.\n\nWithin that moonlight, Han Sen’s strength continued to rise. Still, he hadn’t accumulated the strength necessary to overcome his opponent. The moonlight buff was strong, though, and Gao Ji continued to use his green dragon shadow, though he still wasn’t succeeding in shaking Han Sen loose.\n\n“D*nnn! A moonlight buff! Is that a blessing of the Moon God?”\n\n“It must be. Did you not hear the Moon God say that Han Sen is the Sun of the Moon? Wherever there is a moon, he will earn a buff by it.”\n\nThat is way too strong. It has buffed a Baron enough to compete against an Earl. This is too incredible to believe.”\n\n“Maybe, but it obviously isn’t fake. This is Narrow Moon, and there is an abundance of moons. The buffs Han Sen can receive here are very strong. Anyone of the same tier who tries to fight him here must have a death wish.”\n\n“Does that mean Narrow Moon has become Han Sen’s territory?”\n\nYes. Otherwise, he would not have been given the title Son of the Moon.”\n\nGao Ji looked glum, unable to shake Han Sen away. So, he decided to go on the offensive and slash towards his opponent. His knife carried a green dragon light and a dragon bone.\n\nHan Sen did not think his title would bear such significance. The moonlight power there was far too strong, so much so that it allowed him to do battle with an Earl.\n\nHan Sen did not retreat. He used Tooth-for-a-Tooth and struck towards the green dragon light. Ghost Teeth Knife came against the fully-powered green dragon knife, and still, it managed to block the green dragon knife.\n\nThey stopped right there, with both knives repeatedly colliding with each other.\n\nKatcha!\n\nA crack appeared on the green dragon knife, which then began to expand and spread across the shadow of the green dragon. It made the green dragon shadow start to look like a shattered mirror.\n\nDong!\n\nGhost Teeth Knife and the green copper knife came against each other again. Gao Ji had to withdraw his green copper knife and reluctantly fall back. His powers were less than the moonlight buff given to Han Sen.\n\nGao Ji looked cold. He swung his knife with a desire to fight, but his face changed when he saw his own blade.\n\nGhost Teeth Knife had dealt a crack to the green copper knife. And soon after, the crack started to spread, until the green copper knife was wrought with an entire web of cracks.\n\n“This is…” Yisha stood up from her seat. With wide eyes, she intently observed the cracks that were rapidly manifesting across the green copper knife.\n\nYisha, Moon Wheel King, and Night River King, who knew about Teeth powers, suddenly felt their faces grow pale. They couldn’t believe what they were witnessing.\n\n“No way…” Night River King looked to be in shock, and he could do nothing but stare at the green copper knife.\n\nKatcha!\n\nGao Ji swung his knife again, but when he put the green dragon light into the green copper knife, there was a sound. And then, the green copper knife shattered into pieces. It was reduced into nothing but bits, surrounded by a horrible purple mist.\n\n“Teeth power.”\n\nEveryone had those two words form in their mind. But even still, it was hard to believe that it was true.\n\nThat was the Rebate’s strongest geno art. It was the strongest skill the entire race of the Rebate possessed. Not many could practice that, not even amongst the Rebate. But now, an outsider had just used Teeth power to defeat a Rebate Earl in battle. The Rebate could not believe this was happening.\n\nEveryone knew Knife Queen was good with Teeth Knife, and everyone knew Han Sen was her only student. Everyone knew Han Sen practiced Teeth Knife.\n\nBut no one thought, or even dreamed, Han Sen could successfully use Teeth powers.\n\nIn the hearts of the Rebate, learning Teeth power would place you amongst the most talented of the whole race. Now, the glory and pride had been crushed by Han Sen. That strike had made all the Rebate shocked. They could not even think straight.\n\n“It is no wonder that Knife Queen took him as a student. It wasn’t just for fun.” Night River King looked dim.\n\n“An outsider can use Teeth power, and that person is Knife Queen’s student. Is he good or bad for Narrow Moon?”\n\nMoon Wheel King was in shock, too.\n\nYisha was the one who was shocked the most, though. Her mind had yet to return to her. “How could he have practiced Teeth power?”"
}