{
    "chapter": 1305,
    "title": "Being Watched",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1305",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nIn great haste, a swarm of Endless Swordfish was headed in Han Sen’s direction. They didn’t come for him, but simply sped past him as if they were attempting to get away from something that lay in the direction Han Sen was traveling.\n\nHan Sen understood their behavior, acknowledging that they were fleeing some unseen menace on the horizon. They weren’t there to cause trouble.\n\nAfter peering into the distance all around him, Han Sen finally saw it: a shadow, accompanied by the sounds of disturbed water. When the Endless Swordfish passed by the Fish King above, the sound of restless waters became louder than ever. And that was when Han Sen saw it clearly.\n\nThe monster was like an octopus. Reminiscent of the kraken, its arms writhed in unrest, hitting the water to create noise as if for fun. The arms and tentacles were peppered with countless suction cups, and it was clear that being grabbed by such a fiend would deny even the mightiest of creatures a chance of slipping its grasp.\n\nThe octopus was blue, and on the other side of its arms were a number of eyes in asymmetrical distribution. The lack of cohesion in the placement of the eyes made the entire beast even scarier to look at.\n\n“Another super creature?” Han Sen was delighted. He didn’t need Life Geno Essences anymore, but he’d never shy away from the possibility of earning another beast soul.\n\nAlthough Han Sen had conquered many shelters and taken over many regions, he knew he wasn’t going to be around in the Third God’s Sanctuary forever. There’d be a time when the protection and mantle for safeguarding the territories would fall to others, and when that time came, Han Sen had to know other humans were strong enough to succeed him. If they weren’t, it’d only be a matter of time before spirits attempted to return and claim what had been lost to human occupation. Having more super beast souls would help even the odds, Han Sen believed.\n\nJust as this kraken looked ready to put up a fight, though, it stopped.\n\nAll the swordfish, by this point, had fled far beyond its reach. And now, staying in one place, the octopus flailed its tentacles and arms around in a rather humorous display. What it was doing, Han Sen wasn’t quite sure.\n\nSuddenly, something grabbed hold of the kraken and tugged it below the water with fierce strength. The octopus looked like a force to be reckoned with, but it was dragged below the waters with surprising ease, then taken deeper and deeper and deeper. It was gone almost as swiftly as it had first appeared.\n\nHan Sen hurriedly called for the Fish King to return to the land above, for he had caught a glimpse of a phantom shadow in the sea.\n\nIn the place the kraken had been, there was now just a red mist sitting above the unnervingly calmed sea. As for the octopus, it had obviously been killed.\n\n“Let’s go.” Han Sen thought it was best not to linger, so with an increase of haste, he instructed everyone to move at a quicker pace. It was frightening, trying to comprehend what manner of being had managed to one-hit kill a terrifying super creature like that kraken.\n\nHan Sen still had the endless presence of the Endless Sea above his head, and it’d be there for a while longer. It was a realm that was as strange as it was dangerous, and the last thing he wanted to do was risk falling into the waters above. It seemed like a death sentence, with that unknown creature lurking beneath the blue.\n\nLotus Empress felt no different, and she much appreciated the desire for an increased speed of travel.\n\nThe shadow did not leave, though. They continued their journey, and whenever they looked up, there the shadow was. It seemed to be following them.\n\nLotus Empress commented on its presence there, saying, “Don’t fight it. Remember, I still have that Night Gem for protection.”\n\n“Do you know what that creature is?” Han Sen asked.\n\nLotus Empress said, “I think so. I’ve heard tales of a wicked monster occupying these waters, and if I am correct in the assumption, that thing up there is what they call Sea Ghost.”\n\n“What can it do?” Han Sen asked.\n\nLotus Empress said, “No one quite rightly knows, but it has an appetite for super creatures, that much is certain. It’s a picky eater, so it doesn’t eat less powerful beings. Many spirits have reported their sightings of Sea Ghost, and how it explicitly enjoys grabbing super creatures and dragging them below the water to feast.”\n\nLotus Empress paused for a moment, as if in thought, and then she went on to say, “But it is supposed to appear in the deeper regions of the Endless Sea. We haven’t traveled that far, and what’s more, we are headed for an island. It shouldn’t be here at all.”\n\n“Did the Fish King lure him here?” Han Sen wondered aloud.\n\n“Maybe. There’s always the chance it’s developed a new fancy for eating humans, and with a powerful human here, perhaps it was a rare opportunity it wished to test its mettle against, not to mention its taste buds,” Lotus Empress said. Whether she spoke in jest, amusement, or unnerving sincerity, Han Sen wasn’t sure.\n\n“Well, if it shows its ugly mug, I’ve got a killing blow with its name on it,” Han Sen said with stern resoluteness.\n\nIf a fight between him and the unseen creature were to begin, Han Sen was at least prepared to take it on. He wasn’t afraid.\n\nBut for a long time, Sea Ghost merely followed them. It refused to show itself, but that just made the tension all the worse. And due to its appearance there, the entire region looked dead. No other life was to be seen.\n\nThe sun was rising now, where it should have been sinking. It came up from the ground, melding with the horizon of the sea above. Nighttime was coming.\n\nThen, an extra-large moon appeared, alongside its retinue of silver stars. Han Sen thought the Sea Ghost would try its luck under the veil of night, but still, nothing came about. It remained where it was, as if it was watching them, studying their every movement.\n\nWith a monster hiding above, Han Sen felt uncomfortable. He felt as if it could swoop down at any moment. Swooping was bad, after all.\n\nAt midnight, Han Sen saw the faint image of a mountain in the distance. It was very tall, and its peak seemed to be poking the sea that was still their sky.\n\n“That is God Mountain. Three hundred miles past that, we will reach the island,” Lotus Empress explained, before Han Sen could ask.\n\nHan Sen then asked, “Can we walk up the mountain? Or will it prove too high and have us dropping up into the sea?”\n\nLotus Empress said, “There are stranger things on that mountain to worry about than the distortion of gravity. Not even emperors dare brave that place.”\n\n“Why? What’s so strange about it?” Han Sen was going to heed her advice and stay away, but he was interested in learning what was supposed to be so scary about the mountain."
}