{
    "chapter": 2287,
    "title": "Holy Town",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2287",
    "text": "That familiar feeling was only present for a single second. When he looked closely at Mister White again, the man was like a stranger once more. He no longer seemed like anyone Han Sen already knew.\n\nWhatever Han Sen might have momentarily felt, Mister White was of the Extreme King. Han Sen didn’t know much about the Extreme King, all-in-all, and there was no one amongst them that he was actually close with. No one would ever claim that Mister White was a close friend of his, either.\n\nThinking of this, Han Sen considered Mister White’s suggestion.\n\nTo be honest, Mister White’s suggestion greatly tempted Han Sen. After all, Han Sen wasn’t entirely sure Yisha could defeat Fox Queen in combat.\n\nAnd even if Yisha won and continued traveling with him, he would have to share whatever treasure he found with her.\n\nThey had a good relationship, and they were close enough to practically be considered family. But at the end of the day, their relationship was still built on the foundation that Yisha had no clue Han Sen was the almighty Dollar. If Yisha found out that Han Sen was Dollar, there was no telling what she might do.\n\nAfter all, Dollar had not been kind to Yisha.\n\nHan Sen decided to go ahead and explore the Sacred Leader’s treasury with Mister White. He didn’t have to plan out everything in advance. He could betray whoever he needed to whenever he wanted to. He could take any item he required when the time to do so arose. If Han Sen needed to leave these two behind, he would do it without a second thought.\n\nIt was a very business-like mindset: they were all striving for personal benefit, and they would only cooperate when they needed to use one another.\n\nHan Sen needed Mister White to guide him safely to where the treasure lay. Mister White needed the relic Han Sen carried. They were both using each other for their own purposes.\n\nAnd when Han Sen found the treasure, even if Han Sen didn’t betray them, it was likely that Crime and Mister White would be the ones betraying him.\n\nOf course, the most important thing was that Han Sen would be capable of betraying Mister White. He just couldn’t do that in front of Fox Queen and Yisha.\n\n“We don’t have time to wait around. If there is a winner of that battle, neither of us will have the chance to explore that city,” Mister White said to Han Sen.\n\nHan Sen went silent. He looked at Mister White and asked, “You guys destroyed the fourth checkpoint. Did you find anything there?”\n\nHan Sen cared about the item in the fourth checkpoint a great deal. There was a high chance that whatever item was retrieved there would prove useful when they reached the treasure.\n\nMister White went silent, then said, “When Fox Queen destroyed the thirty-six stone pillars there, she found the jade flute inside the last pillar.”\n\n“That jade flute didn’t belong to Fox Queen originally?” Han Sen remembered that Fox Queen had been locked inside Ghost Bone’s palace for the longest time. Han Sen had seen no evidence of the flute there, so why would she suddenly possess it now? It made sense that she had gotten it from the fourth checkpoint, but Han Sen was unable to see how the jade flute connected to the other checkpoints and the items they had yielded.\n\nMister White didn’t say anything. He just waited for Han Sen to make a decision.\n\nHan Sen was thinking. He used a finger to point at the skeleton in the chair. “This sea seems special. He dived into this deep sea with the intent of reaching its holy town. That is how he became like this in the first place.”\n\n“I know,” Mister White said simply. “That is why we need the relic you have. It will allow us to reach the holy town safely.”\n\n“Okay. In that case, we will go and explore the holy town.” Han Sen made his mind up.\n\nHan Sen didn’t know where the holy town was, but Mister White obviously did. Han Sen followed him and Crime. They left the white whale and dove deeper, going so far under the sea that they reached the deep sea.\n\nThe sea waves down there were incredibly strong. Clearly, Fox Queen and Yisha were still engaged in combat. It would take a long time for one of them to emerge victorious.\n\nHan Sen wasn’t worried about Yisha’s well-being. With her abilities, even if she was unable to triumph over Fox Queen, he didn’t think Fox Queen had what it took to kill Yisha.\n\nAnd if Fox Queen couldn’t defeat Yisha, then he might as well head for the holy town.\n\nHan Sen had already learned of a way in which he could commandeer and pilot the white whale, but he saw no reason to use it just yet. Perhaps it would prove useful in the future.\n\nWith Mister White’s guidance, Han Sen went deeper and deeper. The further they went, the quieter the sea became. The shockwaves Yisha and Fox Queen were creating didn’t reach those levels.\n\n“If my calculations are correct, then the Sacred Leader’s treasure should be someplace inside this trench.” Mister White pointed to a large underwater trench in front of him.\n\nHan Sen looked down into the trench and saw nothing but darkness. It was like a bottomless abyss. Even using the power of the Purple-Eye Butterfly, he still couldn’t see what lurked within.\n\nWithout too much hesitation, though, Mister White and Crime continued to swim down. Han Sen rode the blood kirin after them. They all headed into the darkness of the deep trench.\n\nA little ways down, Han Sen felt as if something was amiss. The stone plate in his pocket started to burn.\n\nHan Sen pulled out the stone plate, and when he did, the plate glowed with a holy light. It lit up a small pocket of brightness amidst the suffocating dark of that place.\n\n“Just as I thought! Only people who have the relic can enter the place that holds the true treasures of the Sacred Leader.” Mister White seemed to have expected this, and he eyed the stone plate as he spoke.\n\nThe three of them and the beast continued to venture down. The water around them was very dark and creepy. No matter how strong their vision was, they could only see within the small pouch of light that the stone plate provided them. Everything else was pitch-black. Nothing else could be seen, as if the entire world had gone black.\n\nThey didn’t know if this was the work of an illusion or not, but Han Sen could feel countless eyes peering at them from beyond the black.\n\nTime passed. Han Sen had no clue how deep they had dived by this point, but the trench was like a bottomless abyss. No matter how deep they went, there appeared to be no end.\n\nWhen he looked up, he found that it was pitch-black above him, too. The light couldn’t penetrate the sea to such depths.\n\nThey created small waves in the water as they swam, but there was no other movement. Yisha and Fox Queen’s fight didn’t reach them at all anymore.\n\nBecause it was too dark there, even the blood kirin started to feel nervous. It kept releasing quiet moans and groans as it swam.\n\nHan Sen used his hands to stroke the blood kirin’s neck and bring it a bit of comfort.\n\nThe blood kirin had always been so moody and angry, and telling him to be quiet would be harder than making him bleed.\n\nMister White, however, looked calm. Crime was a little nervous, though. It looked like he was feeling the same fear as the blood kirin. They felt as if they were being watched by phantom eyes in the dark.\n\nHan Sen knew for sure that something bad lurked out of sight. If it wasn’t for his hands holding that relic, their small group would have already ended up like the master of the white whale.\n\nSuddenly, it looked like a blurry halo appeared around Han Sen’s feet in the dark. He focused on that little halo.\n\nBut the halo was too blurry, and he couldn’t see it clearly.\n\nMister White and Crime also saw the halo. They looked down and checked it out.\n\nAs their bodies descended, that blurry light became clearer and larger. When Han Sen finally got a good look at what was in that halo, he opened his mouth."
}