{
    "chapter": 3030,
    "title": "Not the End",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3030",
    "text": "“Han Sen, although I do not want to kill you, for Wan’er, whoever stops me must die. If you have any last words, you should say them now. For Wan’er’s sake, if it does not get in my way, I will let you finish it.” Qin Xiu was looking at Wan’er as he spoke.\n\n“I want you to die.” The power in Han Sen’s body madly exploded. He stopped trying to get away from Qin Xiu. He used his power to push Qin Xiu.\n\n“That is a shame,” Qin Xiu said with a sigh. He held Han Sen’s fist. His hand suddenly used power to punch Han Sen in the chest. It made Han Sen’s body fly away.\n\nPang!\n\nHan Sen’s body was like an asteroid traveling through space. It struck a planet and then another planet. In the end, he hit a final planet. He made no more sound. It was unknown how many systems he had traveled.\n\nAfter Han Sen disappeared, Wan’er’s body was glowing with a golden light. She turned into golden-hair lady mode and woke up from her slumber.\n\n“Big Brother…” After her eyes opened, Wan’er saw Qin Xiu. Although she was still in golden-hair mode, she was not raging. Her voice sounded so sweet.\n\n“Wan’er… Hang on a bit longer… Big brother will take you back…” Qin Xiu stroked Wan’er’s golden hair. His eyes looked like they were drunk.\n\n“Yes,” Wan’er said with a nod. She closed her eyes and leaned against Qin Xiu’s chest.\n\n“God, today no one will be able to stop me. Give it up…” Qin Xiu was holding Wan’er. He raised his head to peer upon the geno hall. His body glowed with a red flame. He crushed the very light of the geno hall and almost extinguished it entirely.\n\nThe geno hall, which had never fallen, was being suppressed by that scary power. The walls cracked like dragonflies. The whole of the geno hall was starting to crumble apart.\n\nWhen the geno hall fell, the disasters plaguing the entire universe were worse. It was not just affecting normal creatures either. Even King class elites were significantly affected. The entire world was in bad shape. It was like the universe was going to experience a big bang.\n\nGod stood before the geno hall, but he was unable to withstand the suppression of the blood power. The holy light on his body was becoming weaker. The race lanterns of the geno hall were becoming dimmer. It was like they would be put out any second. The spirits were charcoal. Everything was dying. The faces of Sky Palace Leader and all the other elites looked like dust. Although they wanted to fight, they could not reclaim the battle. They could barely protect themselves. In the shine of the red flame, their bodies almost fell out of deified class.\n\nQin Xiu spoke to the still-suffering God. “God, give up! If you are willing to abandon the geno hall, possess someone, and descend into the universe, you might still live.” “This place is my life,” God coldly said. “If my life is not here, then what is the point of living?”\n\n“You are right. I think so too. If your life blocks my life, then I will have to just take your life.” Qin Xiu stepped forward. A sky full of blood light was marching alongside him. It broke the roof of the geno hall. Stone pillars cracked. Many race lanterns were almost put out inside that hall. The geno hall was unstable. It was as if it was going to break any second.\n\nGod’s body’s holy light was crushed. It was almost put out. Even the bodies of the God Spirits were dim and lifeless. They kept appearing and disappearing. It was like they were preparing to go.\n\nBoom!\n\nMany light pillars arose from space. It was the god palaces splitting up. They landed on all kinds of god temples. Many god lights arose from the god temples. They went through space and melted into the geno hall. It made the geno hall look very bright. God’s God Spirit body was being shined on by many God Spirits. He looked bright again.\n\n“If you guys want to die that much, then you can all die together.” Qin Xiu was holding Wan’er. He was like a demon descending on the geno hall. He walked there slowly.\n\nAlthough it had the support of a sky full of God Spirits’ god power, the geno hall was still unable to withstand the pressure exerted by Qin Xiu. The god hall kept breaking.\n\nThe more the god hall kept breaking, the more disasters that were incurred across the universe. The entire universe was in turmoil. Countless creatures died in the disasters.\n\nIn the universe, the ground of an old, unimportant planet was breaking. A volcano was erupting. It swallowed many forests. Floodwaters rushed across the ground.\n\nAmidst that chaos, there was a totally quiet mountain. All those disasters did not affect that small mountain.\n\nThere was a broken house on the small mountain’s peak. Behind the house, there was a garden with a white-cloth flag. The flag said, “Count all the destinies.”\n\nThe white cloth had been dyed red. Between the black and white, the words “Count all the destinies” stood out.\n\nA man’s body was perched on the top of the flagpole. It had been pierced through the tip of the pole. He was lying there with his limbs spread out. He was looking into space while the pole pierced through him. His eyes looked faithless.\n\nFresh blood left his body. It dripped onto the cloth flag and quickly dyed it red. The person who flew out was Han Sen, who had been punched by Qin Xiu. It was unknown if this was just a coincidence, but he had landed near that old house. The flagpole in the backyard had pierced through his body.\n\nHan Jinzhi was standing in the back garden talking to Han Sen while he looked at the cloth. “Ashes to ashes, dust to dust. The children of other people can enjoy their lives. It is such a shame you were born to be a part of the Han family. You were born to the Han family. If you were just a commoner, you could live safely. But you did not become a commoner. You had to be famous. This is fate. It was meant to be. There is a lot of suffering you must endure, and you deserve it all. I am useless. I cannot save your life, and I cannot change fate. All I can do is try to make changes for you. It still depends on you whether or not you want to change your fate. The people of the Han family cannot solely depend on the sky or earth. It all depends on you. If you do not want to die and still have things you wish to do, use your own power to get up. Walk back and fight for your life. Go and fight for what is left for you to do in this world.”\n\nThe blood from Han Sen’s body bled into the cloth and continued to gush. His blood had almost run out by this point.\n\nHan Sen’s mind was strangely clear. It was just his body that was not listening to him. He felt as if his mind had left his body. It was unknown why Han Sen’s mind had become so clear. The quiet feelings were amazing. It was hard to describe.\n\n“Is this the quietness Han Yufei described?” Han Sen enjoyed that stillness. A power was burning inside him. The white flame burst out from all of his cells. The flag burned in the white light. It was like a torch burning it.\n\n“I knew it… I knew it… This is not the end.” Han Jinzhe’s eyes looked bright. His whole body was shaking"
}