{
    "chapter": 18,
    "title": "Mutant Creature",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_18",
    "text": "\"What are you doing?\" Qin Xuan frowned.\n\n\"I’ll take you out after picking up the corpse of the mutant quartz scorpion you killed.\" Han Sen continued to go inside.\n\n\"There are so many scorpions there. Don’t you need incense?\" Qin Xuan looked at Han Sen, puzzled.\n\n\"Why do men need incense?\" Han Sen came back with a giant blue scorpion about a foot long in his hand.\n\nQin Xuan sighed after looking him up and down, \"I was tricked by you. You have already killed all the quartz scorpions out there, haven’t you?\"\n\n\"Smart girl.\" Han Sen poured the dead scorpions from his bag, which soon piled into a heap.\n\nAlthough Qin Xuan had guessed it, she was still surprised to see that Han Sen had killed so many scorpions.\n\nHan Sen put the corpse of the mutant scorpion in his bag first before he started to fill it with primitive scorpions. There were still a few that wouldn’t fit in there, and he didn’t waste those but ate all the flesh until he had cleaned them up.\n\n\"Primitive quartz scorpion flesh eaten. Four primitive geno points gained.\"\n\n\"I haven’t seen anyone quite like you, willing to eat such disgusting things.\" Qin Xuan had never met someone who had such nice equipment but remained so stingy.\n\n\"Come on.\" Han Sen squatted next to Qin Xuan, wanting to carry her out on his back.\n\n\"Since there are no scorpions anymore, I could just walk out,\" Qin Xuan said.\n\n\"You have promised me a mutant beast soul and couldn’t take that back anyway. Why not enjoy my service with your injured leg?\" Han Sen said.\n\n\"You are right. Why not?\" She bit her bottom lip, got up and carefully climbed onto the back of Han Sen.\n\nWith the armor, Han Sen couldn’t really enjoy the feeling of her body against his. He walked out, carrying Qin Xuan, with his bag in one hand.\n\nShe only weighed about 100 pounds, which was nothing for Han Sen, who had already gained quite a lot geno points. They emerged from the cave in no time.\n\n\"Where are you going?\" asked Han Sen.\n\n\"Back to the shelter,.\" Qin Xuan said.\n\nHan Sen no longer spoke and carried her towards Steel Armor Shelter. After an hour, he let her down.\n\n\"It is not too far away from the shelter now, and people pass by here all the time. Wait for a while, and then ask them to bring you back.\" Han Sen extended an empty hand to Qin Xuan: \"Now, my mutant beast soul.\"\n\n\"I have asked Su Xiaoqiao to send a message. Would you sell me the sacred-blood beast soul and gear?\" Qin Xuan didn’t hesitate before she handed over a mutant beast soul in the shape of a black cat to Han Sen.\n\n\"What is your offer for the golden double-edged axe?\" Han Sen asked.\n\n\"Two million.\"\n\n\"That is a piece of sacred-blood gear, while two million won’t even get you a mutant beast soul.\" Han Sen frowned.\n\n\"Sacred-blood gear is very nice, but you can’t take it to the real world, while beast souls could be used outside God’s Sanctuary. That explains the price. If you would sell a sacred-blood beast soul, I’d give you twenty million,\" explained Qin Xuan.\n\n\"A mutant beast soul, plus two million,\" Han Sen said.\n\n\"A mutant beast soul is out of the question. I’ll give you five million.\"\n\n\"Flesh of two mutant creatures and two million.\"\n\n\"You are asking too much. Final offer, six million. After all, you can’t take it outside,\" Qin Xuan said.\n\n\"Okay, get the money ready. I will tell Xiaoqiao when and where we trade,\" Han Sen said and left with his bag.\n\n\"You really would not consider selling the sacred-blood beast soul? Twenty million is just a tentative offer. We could discuss further,\" Qin Xuan said to his back.\n\n\"No way.\" Han Sen left without pausing.\n\nQin Xuan looked at him leaving and thought, \"His armor was tougher than the quartz scorpion sting. It must also be a sacred-blood beast soul.\"\n\n\"Who was he? He doesn’t look like a soldier.\" She had no clue.\n\nHan Sen went back to his original look and returned to the shelter with his bag.\n\nThere was no one guarding the gate anymore: they had searched for Dollar for so long and found nothing, so they had to give up.\n\nCoincidentally, Han Sen ran into Han Hao and his friends again.\n\n\"Nice to see you again, Ass Freak! You have a full bag with you. How many mutant creatures did you hunt?\" A young man ridiculed him.\n\n\"One.\" Han Sen replied calmly.\n\n\"Ha-ha, you are funny. Could you even hunt primitive creatures? It must be full of black beetles there,\" laughed the young man, leading everyone to burst into laughter. No one believed Han Sen could get a mutant creature.\n\n\"Han Hao, don’t mistake him for anyone. If you knew him, you’d forever have bad luck.\" A young man patted Han Hao on the shoulder.\n\n\"No way I’d know Ass Freak!\" Han Hao looked embarrassed.\n\nHan Sen ignored them and carried his bag back to his room.\n\nHe saved the mutant quartz scorpion and was going to sell Xiaoqiao all the rest. Although he could evolve a creature into a mutant one in half a month with the black crystal, he’d rather use the crystal to get sacred-blood creatures."
}