{
    "chapter": 1331,
    "title": "The Dongxuan Sutra’s Tenth Gene Lock",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1331",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe chef finally made a move, but it wasn’t in the way Three-Eye Emperor predicted. Rather, she moved her empty left hand.\n\nThe hand burst into a limb of bright fire. Swiftly, she looked as if she attempted to grab hold of Three-Eye Emperor’s head.\n\n“Pah! You think you can catch me with that miserable speed?” Three-Eye Emperor, who had managed to avoid her reach, spoke to her with great disdain.\n\nStill, the chef looked incredibly powerful. And it was just her speed, in Three-Eye Emperor’s special vision, where she looked very slow. Three-Eye Emperor readied himself to dodge a potential repeated try, but he suddenly felt as if he couldn’t move.\n\nHe was shocked, and in great wonder why this was, he looked down. And that’s when he saw it: a giant fork had pierced through his entire body. He had been skewered with a dinner utensil at complete unawares.\n\nThree-Eye Emperor had no clue when the fork had appeared.\n\nBut he knew he hadn’t the time to mull this over, for he was as helpless as a chicken wing propped on a skewer above a barbecue flame. And then he realized, she hadn’t attempted to grab his head, at all. She had just moved to grab the fork, and he had misinterpreted her move. This had been a costly mistake.\n\nShe grabbed the handle of the large fork, the prongs of which had firmly pierced through Three-Eye Emperor’s meaty body, and summoned a fire to envelop it. The flames themselves looked particularly hungry, as they began to creep upon Three-Eye Emperor’s clothing and ravage the spirit.\n\nThe flames settled on his flesh and began to sizzle and sear his body. He began to give off a wonderful aroma that tantalized the senses of the nose and got one’s mouth drooling.\n\n“Argh!” Three-Eye Emperor began to writhe on the prongs of the fork in pain. It was agony, feeling himself get roasted alive in open flames. No matter how much he squirmed, he could not free himself. The best he could do was flail with his spear in hand, trying to strike the devilish chef.\n\nThen, the sound of a hungry dragon groaning was heard. Before he could respond and see where it might be coming from, his head was immediately assaulted with an ice cream scoop. Dragon Lady Chef scooped his third eye right out of its socket.\n\nThe chef performed the action with sickening calmness. She was gentle and unconcerned, and she treated ThreeTwo-Eye Emperor as if he was an ordinary slab of meat she had to prepare for dinner. One hand held the large fork, and the other held the utensil of choice. More often than not, the cleaver.\n\nGetting him to a nice golden color, Dragon Lady Chef then began the carving process. She peeled his skin and his flesh off with perfect precision, regardless of how much the roasted emperor tried wriggling around.\n\nThis disgusting spectacle had drawn the attention of quite a few by now, and it made everyone ill. It was horrendous to see, and yet Dragon Lady Chef did not even blink once throughout the entire process. For some gut-wrenching reason, this seemed ordinary for her.\n\nXie Qing King watched her perform and then thought about the food she had frequently produced for him. When he tried to imagine the well-being of the ingredients she had used in past meals, he wanted to hurl.\n\nTwo-Eye Emperor wanted nothing more than to die. The pain was excruciating, and he couldn’t stand it a single second longer. All he could do was writhe around, drowning in the agony and tears.\n\nBut the chef continued doing her thing, lopping and slicing all the perfectly-cooked meat she could. She didn’t seem likely to stop until there was nothing left but his bones.\n\nHis cries rang loud across the expanse, growing in volume. Eventually, he could be heard echoing down the valleys for miles around. Spirits could respawn, yes, but it wasn’t as if they forgot how their deaths came about. It would come as no surprise if they were to learn Two-Eye Emperor never recovered from this ordeal, and he’d be scarred forevermore. This was not something someone could ever forget.\n\nHan Sen, while this was ongoing, was still focused on the fight with No God Emperor and Ruin Emperor. He wasn’t doing as well as he had imagined. No God Emperor hit him over and over, drawing more and more blood each time. It was like he was accepting a lashing.\n\nRuin Emperor beat him until he was black and blue, seemingly enjoying every single punch he could deliver.\n\nHan Sen was up against the two strongest emperors in the Third God’s Sanctuary. While he was perfectly capable with dealing with them, he had submitted to accepting all the pain they could deliver.\n\nJadeskin was strong, but it was not indestructible.\n\nGritting his teeth to withstand the beating, Han Sen did not let the pain affect his mind. He hissed, “Yeah, that’s right! Beat me. Beat me like you beat your fat wife!”\n\nHan Sen wanted this because of the tantalizing feelings he received as he was being hurt.\n\nMost attacks never made him feel this way, but through the pounding given by those two strong emperors, he felt remarkable. He had to feel like he was going to be torn in two, and it took the sort of pain No God Emperor and Ruin Emperor could inflict to make him feel this way.\n\nWith ten gene locks of jadeskin, not even an emperor could kill him, despite the free pummeling he was offering them. It was rare to receive such strong attacks repeatedly, and remain alive and well.\n\nNo God Emperor and Ruin Emperor were able to cycle through a variety of different methods to make Han Sen feel the pain he wanted to feel, and they focused on what hurt the most. And while this was good for them, they didn’t know this was what Han Sen wanted.\n\nOnlookers believed he was getting wrecked and destroyed by the two emperors, but little did they know Han Sen wanted it this rough. He was cherishing every second of the pain.\n\nHan Sen’s Dongxuan Aura had maxed out, but he still hadn’t been able to open his tenth gene lock. But on this day, while receiving the pain they inflicted, he felt his cells become invigorated. There was activity and excitement in his body he had not felt for a long time.\n\nHe thought his cells were as small as they could be already, but after the tenth gene lock finally broke, they became even smaller. And those shattered cells looked incredibly special, beneath the light of the Dongxuan Aura.\n\nHan Sen felt as if the entire world was different now.\n\nWith Dongxuan Aura this way, the entire world seemed foreign and fantastic. It felt new.\n\nHan Sen saw everything in a completely different light. He could observe the smallest detail of the smallest thing in the environment. He could study blades of grass at a molecular level.\n\nThis vision he now had was almost scary. Nothing escaped his attention anymore, and he himself knew no details would go unnoticed.\n\nHan Sen made a comparison in his mind, likening it to the sight of a beautiful woman going at it with another man. Other men would only see the shape of a beautiful woman, but he could not only see every pore and imperfection on her skin, but the bacteria that existed on her.\n\nWith Dongxuan Aura like this, the entire world looked… primitive.\n\n“I can see through everything? Is that what the true meaning of the Dongxuan Sutra seeks to imply?” Han Sen felt as if he had broken through something most remarkable, and while it was brilliant, it made him feel as if he wasn’t human anymore.\n\nRuin Emperor and No God Emperor’s attacks now looked extremely strange to Han Sen. Their bodies were no longer solid.\n\nTheir movements came with a flurry of colored dots around them, which Han Sen had trouble understanding right now. He believed them to be representations of power, or maybe even the smell of the emperors.\n\nIn Han Sen’s vision, it soon became clear they had also been built this way too. He could see right through them, as if they were just vectors and wireframe polygons.\n\n“If I break the structure of these beings, what would happen?” Han Sen thought to himself as he looked on them."
}