{
    "chapter": 104,
    "title": "Not Bad",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_104",
    "text": "On the stage, Yi Dongmu coldly stared at Han Sen and said in a flat voice, \"Well, since you dare to come, then get ready to die.\"\n\nDrawing the dagger from his waist, Yi had a murderous look on his face.\n\n\"Do you think this is some Kung Fu movie?\" Han Sen scoffed inwardly. He didn’t believe someone would actually say such dramatic words in real life.\n\nHan Sen did not reply, but shapeshifted into the bloody slayer, grabbed the hilt of the Shura katana and ran toward Yi Dongmu.\n\nThe bloody slayer had a great speed, and was as fast as a fighter aircraft at its full speed. Instantaneously Dollar was in Yi’s face.\n\nThe viewers all wondered whether Dollar had lost his mind to approach Yi, who was best at close combat. Almost no one could avoid his fatal blow after being approached by him.\n\n\"Wow… Dollar is nuts. He not only approached Yi, but was also using a katana. At least use your spear so that you can keep the distance.\"\n\n\"A misstep by Dollar. He should have come with a bow and arrows. Even if he doesn’t know archery, shooting down from the above is a thousand times better than getting close to Yi.\"\n\nYi’s fans were overjoyed. \"This idiot wanders so willingly into Yi’s lap. It would be hard not to beat him.\"\n\nYi Dongmu sneered and shapeshifted into a mutant monkey more than six feet tall with a thick tail, which greatly improved his strength and speed.\n\nYi Dongmu had a sacred-blood shapeshifting beast soul as well, but it was not similar to the shape of a human body. If he could not use his skills and sacred-blood dagger, the sacred-blood shapeshifting beast soul would do more harm than good.\n\nThere were few creatures that had the shape close to human, and even fewer that looked human. Except for that sacred-blood beast soul in the shape of a lady that was awarded to the Chosen, there was hardly any sacred-blood beast soul that takes human form.\n\nHan Sen's bloody slayer was a precious sacred-blood shapeshifting beast soul because it had a pair of human hands that allowed him to use all sorts of techniques.\n\nYi Dongmu watched Han Sen bolting toward him and gave his dagger a harder grip. He held the sacred-blood dagger backhanded and launched his body at Han Sen. The distance between the two was shorter and shorter.\n\nAll the moves of Yi Dongmu fell in the eyes of Han Sen, who felt every stretch and twist of his opponent had followed his expectation. He could see through Yi as if Yi was no more than a puppet.\n\nBetween two assassins, if one was much better, something like this would happen.\n\nHan Sen knew everything about Yi while Yi didn’t even know Han Sen was good at sneak attacks as well. And that had determined Yi’s loss.\n\nIt did not matter that his speed and strength were both greater than Han Sen.\n\nWhen the two clashed, the katana painted golden by Han Sen moved and was suddenly returned to its sheath. The movements of the weapon were as smooth as floating clouds and flowing water.\n\nThey continued sliding nearly 30 feet in opposite directions before they stopped. Han Sen’s magnificent body was as steady as a mountain, while Yi Dongmu slowly turned around and stared at Han Sen’s back. He stressed each syllable, \"What is that skill called?\"\n\n\"Bladestorm.\" Han Sen replied without looking back.\n\n\"I will fight you again. And next time I will not lose.\" Yi said and walked down the stage. The moment he went down, he fell to the ground with a thump. Blood was welling from a cut in his chest so deep that his bones could be seen.\n\nThe entire First God’s Sanctuary went quiet. Billions of viewers of the match opened their mouths but could not make a sound.\n\nNo one could believe that the result would be like this. They could accept it if it was the other way, but Yi Dongmu who was invincible like a king was defeated by Dollar in one blow, which was hard to swallow.\n\nNot to mention Yi’s fans, even Dollar’s fans had never thought that Dollar could win like this. Even the optimistic ones believed it would at least take Dollar quite some effort to win.\n\nBut no one thought that Yi would lose in such a shameful way and in his strong suit, close combat.\n\nHan Sen turned his head back and looked at Yi Dongmu who was struggling to get back on his feet. He said calmly, \"Not bad. You survived a serious strike from me.\"\n\nHan Sen turned away.\n\n\"Not bad... not bad…\"\n\nThis sentence blew all the viewers’ minds. In the eyes of the public, Dollar’s figure suddenly became more and more grand and brilliant.\n\n\"Dollar...\" Dollars’ fans finally came to realization of what had happened and started shouting and jumping up and down.\n\nThe silence was broken and the entire First God’s Sanctuary became festive. Everyone was talking about this incredible fight.\n\n\"That went down pretty fast!\"\n\n\"Ha-ha, in your face, Yi’s fans!\"\n\n\"Not just the fans, but also the media in the entire Alliance, except for Fang Mingquan’s Contest Center. Y’all thought Yi was gonna win. How about this? He is beat before even getting to top 10... \"\n\n\"Now think about it, Fang Mingquan sure had some vision. His analysis actually made a lot of sense. We were just blinded by Yi Dongmu’s performance and didn’t listen.\"\n\n\"Lin Feng is the visionary one. No wonder he was the runner-up last year. He knew this long ago.\"\n\n\"Ha-ha, it seems this year it will be between Lin Feng and Dollar.\"\n\n\"We really owe Fang Mingquan and Dollar an apology.\"\n\n\"Fang Mingquan was wronged.\"\n\n\"Not bad... ha-ha... what a line...\"\n\nA match that took less than ten seconds had changed Dollar’s image completely.\n\n\"What a line! Next time I have to try it--not bad, you survived a serious strike from me.\" Tang regretted that it was not him who came up with the line."
}