{
    "chapter": 19,
    "title": "The Distinguished and Aristocrats Only",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_19",
    "text": "In the middle of the night, Han Sen placed a bag of dead quartz scorpions and a note at the door of Su Xiaoqiao’s room before knocking a few times. Then he hid in an alley close by and made sure Xiaoqiao took the bag and note inside.\n\nIt turned out to be a nice collaboration, and Han Sen got the six million promised by Qin Xuan and another eighty thousand for the scorpions. He went back to his room with boxes of cash and almost jumped with joy.\n\nEven when his father was still alive, he had never seen so much money at once.\n\nHan Sen left God’s Sanctuary with the money, since the only thing he wanted to do right now was to share the joy with his mother and sister. Their adversity had finally ended.\n\nThe two million he earned before was all used on solving the issue of the old house, and he could eventually have the six million to himself, which was a totally different feeling.\n\nAlthough the money was not even enough for the rich to buy a luxury airplane, for Han Sen it was already the most money he had seen in his life.\n\n\"Mom, Yan, I have something to show you.\" Han Sen pulled them into his room and poured the cash onto his bed.\n\n\"Where did you get so much money?\" Luo Sulan was first frightened instead of being surprised, fearing that her son might have done something dangerous.\n\n\"Mom, I was lucky to have killed a mutant creature and gained the beast soul, so I traded it for this money.\" Han Sen did not dare to tell the truth, afraid that Luo Sulan might get worried.\n\nHe didn’t dare to leak anything about the black crystal, as the precious stone may land its innocent possessor in jail. His whole family could be wiped out if word got out.\n\nLuo Sulan said ruefully, \"Sen, you should not have sold it. It could be of great help to you, and we could always get by... \"\n\n\"Mom, no worries. I will have another chance. I’ve eaten the mutant flesh and gained mutant geno points. In the future, it’ll be much easier for me to hunt, and everything will get better.\"\n\n\"But...\" Luo Sulan still felt bad, as it was not that easy to kill a mutant creature. For ordinary people, it would be great luck to hunt one, just like winning the lottery, so there may never be a second time.\n\n\"Yan is about to start school, and I’m not letting her to go to a public one like I did,\" Han Sen said.\n\nLuo Sulan looked at her children with tears in her eyes, \"It’s all my fault. I didn’t take good care of you.\"\n\n\"Mom, you are a great woman, and you were the one who raised us. Let me contribute a little as well!\" Han Sen picked up Han Yan: \"Yan, let’s go out to eat. You can have whatever you want today.\"\n\nHan Yan’s face lit up: \"I want to eat Sapphire ice cream.\"\n\n\"Sure, let’s go have Sapphire ice cream!\" Han Sen pinched Han Yan's small nose.\n\n\"Sapphire ice cream is too expensive. You don’t need to splurge with the money. Save it to buy some meat...\"\n\n\"Just once!\" Han Sen went out, holding Luo Sulan’s hand.\n\n\"Don’t tell others you have hunted a mutant creature or you sold a mutant beast soul… I don’t want anything bad to happen to you…\" Luo Sulan urged her son. Since Han Sen's father had the accident, Luo Sulan had changed. She no longer wanted Han Sen to be in charge but just to be safe.\n\n\"Mom, relax. I will not say a thing. You keep the money and decide what to do with it.\" Han Sen went out of the house holding his sister with one hand and his mother with the other.\n\nSapphire ice cream was famous throughout the Alliance and was also very expensive. Even the cheapest type cost more than ten thousand.\n\nTheir neighbors’ kids were always having Sapphire ice cream. And Han Sen also had tried it a few times when he was younger. However, when Han Yan was born, they were already bankrupt, so they couldn’t afford such luxuries any more.\n\nHaving the impression that the ice cream was delicious, Han Sen could no longer remember what it tasted like.\n\nWhen the three came to Sapphire, all the seats were taken, and there was a long line to buy ice cream.\n\n\"Let’s go upstairs.\" Before Han Sen entered the store, he saw through the window that the second floor was almost empty, so he thought the ladies could go upstairs and have a seat while he would stand in line alone.\n\nAt the stairs, he was stopped by a waiter.\n\n\"I am sorry, you cannot go up,\" the waiter said.\n\n\"Why? Aren’t there any seats upstairs?\" Han Sen frowned.\n\nContemptuous and impatient, the waiter pointed to a notice on the wall, \"You should have heard about our rule even if you have never had our ice cream before.\"\n\nHan Sen looked at the notice, which said, \"The Distinguished and Aristocrats Only\" and understood what he was referring to. So the second floor was an area exclusively for people with privileges, and ordinary people weren’t even allowed to enter.\n\nNo wonder the second floor had much better decorations yet was so empty.\n\n\"We don’t need to sit down. We’ll just wait here, and you go get Yan ice cream,\" said Luo Sulan, trying to spare Han Sen.\n\n\"I'm going.\" Han Sen smiled and went to the back of the line. He seemed to be indifferent, but was suddenly possessed by an aspiration.\n\n\"What’s so special about the distinguished and aristocrats? Soon I shall have it all and more. The stupid notice will never get in my way again.\"\n\nThere still were no empty seats when it was his turn to buy the ice cream, so Han Sen had to order takeout. Before leaving, he took another look at the notice—\"The Distinguished and Aristocrats Only!\""
}