{
    "chapter": 2217,
    "title": "Ruin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2217",
    "text": "After watching so many insects flee the valley, Han Sen and the others were drawn by curiosity to look back at the crevice. As they watched, a hand emerged.\n\nThe crevice was very small, so it would be very difficult for any being to push a hand through it. But whoever or whatever it was seemed to be unable to get out. After failing to push its way out, the hand withdrew and an eye appeared in the crevice. When it saw Han Sen and his people, the eye retreated and vanished.\n\n“Is that a xenogeneic or a member of the Ice Blue Knights?” Ji Qing asked. The presence of the being had struck them all as being very odd.\n\nThe bugs must have been afraid of whatever it was, and that was why they had all rushed out of the crevice. The bugs weren’t aggressive, and it didn’t even look as if they ate meat.\n\n“Let’s dig into the wall a little and see what’s there.” Han Sen was curious, so he moved over to the wall and pulled out his Ghost Teeth Knife. He slashed at the crack in the stone to make it wider.\n\nThe rock was fairly sturdy, but it was only an inch thick. Beyond it was a hollow of sorts. Han Sen dug out an entrance so that his people could walk into the place.\n\nThe interior of the cave was fairly large. An entire wagon would be able to fit inside comfortably. The cave wasn’t man-made, though; it seemed to be a natural formation. There were many stalactites, and there were many of those purple bugs scrambling across the walls and floor of the cave. Something must have bumbled through the cave and alerted the bugs.\n\n“You guys wait here. I am going to go take a look,” Han Sen said, directing his speech at Huangfu Jing.\n\n“Let’s take a look together,” Ji Qing said with a blink.\n\n“Big Brother, let us go in together. The Demon Bug Bai Semas are with us, so we ought to be just fine.” Han Yan was looking into the cave excitedly.\n\nHan Sen didn’t object because when the hand had revealed itself earlier, he’d quickly scanned it with his Dongxuan Aura. Whatever it was, it wasn’t strong. The being the hand belonged to couldn’t be any greater than a Duke.\n\nHan Sen and his people entered the cave, and Han Yan gleefully moved up front to lead the expedition into the subterranean dwelling.\n\nThere were vast numbers of the bugs all around, and they looked to have scattered when they were approached by that thing earlier. It was easy to see from the movement of the bugs where the creature they were following had gone.\n\nThey traveled fast through the cave, and they saw many more of the bugs running everywhere as they moved. There were many paths to take, and the structure and complexity of the labyrinth were by no means easy to navigate.\n\nThey followed the trail into an even bigger cave, where there was a complete absence of those purple bugs. Strangely, there was no other road to take, and that cave only seemed to be home to black vines and mushrooms. With firm walls composing the rest of the chamber, there didn’t appear to be any other way they could go, other than the tunnel by which they had entered.\n\n“Weird. It should be here. Where has it gone? Did we somehow take the wrong path?” Ji Qing asked, looking up and down the cave.\n\n“We came the correct way,” Han Sen said with certainty. He used his Dongxuan Aura to check the place out, and he looked for the aura and trace molecules of the creature they were searching for. It was still hanging in the air.\n\nHan Sen looked around, and then his eyes locked on a rock that was near a wall. He waved his hand and pushed the rock away. Its removal revealed another small cave that had been hidden behind the stone. An Extreme King man was hiding in there. He had curled up into a ball to squeeze himself in.\n\nAfter he was discovered, the Extreme King man screamed. He then scrambled out on his knees, pleading to Han Sen in a voice that was almost unintelligible.\n\n“Don’t… don’t kill me…”\n\nHan Sen and his companions were quite surprised. They had no idea what had gotten into the man.\n\nThe Extreme Kings they had met in the Ice Blue Knights were noble people. Their rank in society put them above almost everyone else, and they always looked so powerful and stoic, too. This was the first time they had seen a person of the Extreme King in such a mess.\n\n“Who are you?” Ji Qing asked the Extreme King man.\n\n“I… I am a back-up knight belonging to the Ice Blue Knights. Please let me go,” the Extreme King man said. All the while, he repeatedly kowtowed before Han Sen.\n\n“Explain your situation, or we will take you back to the knights.” Han Sen frowned.\n\nThe Extreme King man looked very frightened at that, and he quickly explained everything.\n\nThey heard his story, but they found it hard to believe what he was telling them.\n\nHe was just like Han Sen. He had been brought on as a back-up knight to the Ice Blue Knights. He was an Extreme King, however, and on top of that, he was a captain. His task was very similar to Han Sen’s, in that he was supposed to clear out the xenogeneics that resided around the base. His area wasn’t where they were now, though. He was supposed to clear out a desert elsewhere.\n\nTheir team came across a ruin in the heart of that desert. After calling their supervisor, they were told to wait for the arrival of higher-level Ice Blue Knights, who would then explore the ruin with them.\n\nBut much to their surprise, when the higher-level Ice Blue Knights arrived at the ruins, they didn’t go in and explore. Instead, they slaughtered the entire team that had discovered it.\n\nOne of the weaker knights was a man called Bai Wenxuan. After getting stabbed, he fell into a well. The Ice Blue Knights believed him to be dead, but his body wasn’t entirely done for, despite the injury he had sustained. And so, he remained in the water.\n\nThe well was connected with an underwater system, and Bai Wenxuan stayed there for a long time.\n\nHe didn’t dare exit, for he was afraid of being killed.\n\nBut since the caves weren’t entirely safe, he frequently moved from place to place. He had been chased by a xenogeneic for the past two days, and that was why he had come to this part of the caverns. He saw a light and wanted to get out of the cave to avoid being killed by the xenogeneic, but Han Sen was there, and Han Sen had been able to break his way inside.\n\nAfter Han Sen heard the story, he asked Bai Wenxuan, “What kind of civilization might that ruin have belonged to?”\n\nBai Wenxuan quickly said, “I don’t know. I’ve never seen architecture like that, and I was unable to read the text that we saw.”\n\nHan Sen’s face darkened, and he coldly said, “In that case, we cannot help you. You know that what our teams record is impossible to delete. You have been filmed, and so if I do not take you back, I will be punished.”\n\n“No, you cannot take me back! If they know you saw me, and they see that I’ve been telling you about the ruin, they will kill you, too!” Bai Wenxuan screamed.\n\n“I will be interested to see if they do.” Han Sen signaled for his companions to draw their weapons. It looked as if they were going to kill Bai Wenxuan.\n\n“Sacred!” Bai Wenxuan shouted. “The ruin was a Sacred ruin!”"
}