{
    "chapter": 2737,
    "title": "Ancient Wall",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2737",
    "text": "Exquisite smiled and said, “Although the figure in the drawing is something no one can understand, the picture has the meaning and power of the elder that drew it. Just taking the time to study it will be beneficial for you.”\n\nNow, Han Sen was able to understand. Exquisite and Li Keer wanted to let him experience the true god’s art because it would ultimately benefit them. Through him, they could understand it better and learn things from it. The experience would be beneficial to them all, so it wasn’t a bad idea.\n\nBut the Ancient Wall was a leftover from the Very High ancestors. Ordinary outsiders weren’t allowed to get close. Han Sen and the silkworms could go there for a whole month after leveling up to become deified, but the rules still forbade Bao’er—despite being a family member—from going there.\n\nExquisite and Li Keer would be going to the Ancient Wall with Han Sen, so they couldn’t take care of Bao’er.\n\nHowever, Han Sen asked Bao’er for her opinion. Bao’er was willing to stay at the Star Tree, and so Han Sen allowed her to remain there. With the xenogeneics there, Bao’er wouldn’t be too bored.\n\nWhen the three of them left, the Six-Eared Macaque started to become excited.\n\nThe Six-Eared Macaque was a different kind of xenogeneic. It was intelligent enough that it had pretended to obey Han Sen as its master. But in truth, it had just been observing. It wanted to find a way to escape from the Star Tree.\n\nThe contract placed upon its body was very rigid, and the Six-Eared Macaque couldn’t find any way to remove it. If it escaped without removing the contract, it would still be restricted and oppressed by the forces of the contract. Han Sen could easily take over its mind, even if he was far away from whatever system the monkey had hidden itself in. The monkey would be in agony until it did what it was told.\n\n“If I want genuine freedom, I must break the contract.” The Six-Eared Macaque’s eyes glowed, and it watched Bao’er intently.\n\nThe Six-Eared Macaque already knew Bao’er was Han Sen’s daughter. She was obviously very dear to him. Now Han Sen wasn’t around, and he wouldn’t be for a whole month.\n\n“If I can capture her, I can use her to threaten Han Sen into breaking the contract. Han Sen will have to do as I say.” The Six-Eared Macaque felt that his chance had come.\n\n“The other xenogeneics follow her commands, but there is only one primitive deified in their midst. They have no chance of defeating me. That being said, I don’t have to fight them. I just need to use my fake body, go invisible, and knock her out.” The Six-Eared Macaque was still forming his plan when he saw Bao’er looking in his direction.\n\nThe Six-Eared Macaque was shocked. It thought Bao’er knew that something was wrong, but then he heard Bao’er speak from beyond her smile. She said, “Little Six, I’d like some of this fruit.”\n\nThe Six-Eared Macaque really hated the name Little Six, but Bao’er had called it over. It was the perfect opportunity. The Six-Eared Macaque answered and quickly ran over to her.\n\n“Little Master, what would you like to eat?” The Six-Eared Macaque watched Bao’er carefully as she reclined comfortably. It was thinking, “This is perfect. I don’t even need to be invisible. I will just deliver her the fruit, knock her out, and then stuff her someplace out of sight. That way, Han Sen will be forced to break the contract with me.”\n\n“I want that.” Bao’er raised her finger to indicate the piece she wanted. She was wearing sunglasses while lying down on a chair.\n\nThe Six-Eared Macaque picked up a fruit knife. He cut the fruit into little pieces, took a slice, and brought it over to Bao’er. He stretched it toward her, preparing to make his move.\n\nBao’er looked at the Six-Eared Macaque. She didn’t reach out and pick up the fruit. She smiled and said, “Did I say that I wanted to eat it? Give the food to the other. One each. No more and no less.”\n\nThe “other” Bao’er was talking about would be the little pigs. They followed Bao’er around, eating good stuff all day long, but their bodies never changed. They seemed as static and small as ever.\n\n“I’ll cut your *ss!” the Six-Eared Macaque suddenly shouted. It raised its claws quickly to snatch Bao’er.\n\nAs the Six-Eared Macaque’s claws were about to make contact with the pale, delicate skin of Bao’er’s neck, Bao’er suddenly shone with a white light. The Six-Eared Macaque’s claws hit the light, spraying a fountain of sparks. The monkey’s claws were unable to break through that defense, and its attack had been entirely blocked.\n\nThe Six-Eared Macaque was shocked. It leaned closer to take a look. The light didn’t come from Bao’er. It came from the little pigs around her.\n\nRight now, the 16 little pigs were standing alertly around Bao’er. Their eyes were wide and unblinking as they stared at the Six-Eared Macaque. Mysterious symbols glowed on their foreheads, and light shone from their bodies.\n\nThe holy light of the 16 little pigs combined and transformed into a light shield that trapped the Six-Eared Macaque inside.\n\n“You’re just a bunch of pigs! You can’t stop me,” the Six-Eared Macaque growled. It shone with a golden light of its own, and it slashed the light shield with its now-glowing claws.\n\nSince it couldn’t assassinate its target, the monkey would have to do this the hard way. The Six-Eared Macaque knew Han Sen wouldn’t be back for a month, and it wagered it had enough time to capture Bao’er. And in regards to the xenogeneics and the 16 little pigs, the Six-Eared Macaque cared little for them.\n\nBut when its strike landed, the Six-Eared Macaque noticed that its power wasn’t enough to rip through the shield that encased it. The 16 little pigs were still holding it in place. None of them had gotten hurt. They all just stared angrily at the monkey.\n\nThe Six-Eared Macaque was shocked. It used its power again, hitting the light shield over and over. In growing astonishment, the monkey tried its hardest, but it was unable to break the shield of light. It really was trapped inside.\n\n“Little Six, you are such a naughty boy.” Befuddled, the Six-Eared Macaque watched Bao’er stand up, take off her sunglasses, smile, and walk over to him.\n\nFor some reason, the Six-Eared Macaque felt a chill run down its spine. It had a bad feeling about this.\n\n…\n\nTang Ming’er had only just entered Star Moon Shelter when someone recognized her.\n\n“Tang Ming’er. Are you Tang Ming’er?” A pretty boy wearing armor approached. He was riding a tiger beast soul mount. He was leading a group of knights, but he looked surprised as he stopped in front of Tang Ming’er.\n\n“I am Tang Ming’er. Who are you?” Tang Ming’er looked at the pretty boy. She tried digging into her memories, but she could not seem to recall who he was.\n\n“I am Ning Bu Ao.” The pretty boy got off his mount and looked at her with glee.\n\n“Ning Bu Ao… you are uncle Ning’s son?” Tang Ming’er suddenly remembered. She had seen Ning Bu Ao a few times, but she had only been seven years old at the time. She didn’t remember him too well. The pretty boy in front of her did look like the boy she used to know as Ning Bu Ao.\n\nNing Bu Ao looked passionate as he said, “Ming’er, your timing in arriving in Star Moon Shelter is most serendipitous. Since I am here, I can guarantee no harm will befall you. If you want any type of beast soul, just let me know. I will give you any in my possession. I even have sacred-blood beast souls to give you.”\n\n“Sister Ming’er, you guys chat. I’m tired and need to rest.” A voice sounded near Tang Ming’er. Ning Bu Ao saw she had a little boy next to her.\n\nNing Bu Ao’s brow furrowed. The boy only looked like he was 13 or 14 years old. He didn’t look like he belonged in the sanctuaries just yet."
}