{
    "chapter": 1844,
    "title": "Dead Viscount",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1844",
    "text": "Dead Viscoun\n\nLake had been waiting for Han Sen for a while, but he hadn’t seen him emerge. He could only hear the roaring of a xenogeneic. It made him wonder what was transpiring inside the gully.\n\n“Can Han Sen fight two xenogeneics at once? That should be impossible, because he is only a Baron. He has a King class weapon, but he can’t use all of its strength. With his own strength and speed, how can he possibly last so long against two Viscounts?” Lake was confused over the scenario, but he couldn’t poke his head out and take a look just yet.\n\nLake had seen the silver beast that Han Sen had brought with him. It was lying down near the gully. Lake was not sure what sort of power it possessed, but he didn’t want to be discovered, and so he didn’t get any closer to it to find out.\n\nAfter a while, the gully grew quiet. It was as if everything across the land had gone still.\n\nLake felt relieved, thinking, “It looks like Han Sen was killed by the two xenogeneics. I guess that saved me some trouble.”\n\nAs Lake was thinking of this, someone suddenly came out of the gully. When Lake saw it, his eyes opened wide with immense surprise.\n\n“He didn’t die!” Lake was floored.\n\nHan Sen hadn’t been killed in his fight with the two Viscounts, and on top of that, he looked clean. There was not a single speck of blood on him, and neither were there any visible wounds.\n\n“What happened?” Lake thought of many different possibilities that could explain Han Sen’s miraculous survival, but he couldn’t settle on anything that really made sense given the circumstances.\n\n“Little Silver, I’m hurt.” Han Sen moved out of the gully and spoke to the silver beast.\n\nLake, hearing that, felt relieved. That was a little more normal, at least.\n\nBut Lake saw Han Sen put his hand out to the beast and then say, “I have a few blisters, see? They hurt.”\n\nLake’s eyes were twitching. He wanted to murder someone.\n\nThe silver beast heard Han Sen and then walked over to him. He licked Han Sen’s blisters with his pink tongue. Swiftly after, the burned area was cleared up and the swollen skin smoothed out.\n\n“Is that a xenogeneic with healing powers?” Lake was shocked, as that sort of power was extremely rare in that universe.\n\nIt was common to have talents that could heal oneself, but a talent that could enable the healing of others was very rare. If one was found, every faction would be fighting for ownership of it. Such power was highly valued and highly sought after.\n\nHan Sen brought Little Silver into the gully. He cut off the Viscounts’ xenogeneic genes and wrapped them up. He used ropes to tie up the bodies and then started dragging them away.\n\nLake had been entertaining a few guesses about what had happened, but when he laid eyes on those two corpses, he was rocked.\n\nHan Sen had obviously murdered the two Viscount xenogeneics. That mere fact was unacceptable.\n\nAnd he only had a minor wound after it all.\n\n“Scary. Too scary.” Lake now ranked Han Sen amongst persons who were on a very dangerous level to take on. He wasn’t quite willing to strike just yet.\n\nWhen Han Sen walked past Lake, Lake didn’t move a muscle. He didn’t even risk breathing. He couldn’t allow himself to be found, as now was not the time to try to kill Han Sen.\n\nAfter Han Sen walked past, Lake felt a great amount of relief. Hastily, he wiped the sweat away. He had never felt his much pressure before, in the task of taking on a Baron.\n\nHan Sen was smiling all the way, as he dragged the bodies of the Viscounts back home.\n\nThose bodies were rather hefty. The meat could feed many people, which would help out with the many resources that his people required.\n\nAlthough they would not be consuming xenogeneic genes, it was still Viscount flesh. It could be very nutritious, which would be very beneficial for the women and children.\n\nSelling it to the Barons and Viscounts would earn them a lot of points, as well.\n\nThe Nobles could hunt and eat, but they did not have spices. There was not even salt readily available. The meat would be tasteless, and the nobles were already sick of eating it plain. Many Nobles were spending points to buy cooking ingredients from the base. Han Sen’s goal was to take all of their points. None of them had good hearts, so he didn’t think he had to be nice to them.\n\nHan Sen brought two Viscount xenogeneics back home, shocking the base when he came in.\n\nThe fact that Han Sen had killed two Viscounts gave the Nobles a grand shock. Some of them felt they were lucky that they hadn’t tried to kill him, but it also raised the fear they held for him.\n\nHan Sen was led away by the woman in charge of cuisine. There were kids there that could handle the meat. There were a number of kids that were only a few years old, and they were tasked with washing the meat. They put in a lot of effort and worked hard.\n\n“It is a shame this base wasn’t built to house a real society. We have no one to teach the kids what they’d learn in school. It’ll be pretty bad if they grow up without learning to read,” Han Sen spoke to himself.\n\n“In a world like this, learning how to survive beats learning how to read a few words. You have given them enough.” A Viscount walked up to Han Sen, speaking to him.\n\n“Deep Blue Viscount.” Han Sen looked at the Viscount, recognizing who he was.\n\nOut of the four Viscounts, he was the only Kate. And he was the only one who brought meat to swap for points. In that regard, he was one of the only ones not going against Han Sen.\n\n“Master, if you have time, I would like to talk to you alone,” Deep Blue Viscount said calmly.\n\nHan Sen started to respond, but a sudden scream came from outside the gate. Han Sen’s face changed, and they looked towards the gate together. A large group of people were milling around the gate, craning to see something outside.\n\n“What’s going on?” Han Sen asked.\n\nThe people, seeing Han Sen approach, formed a path. Han Sen, in the middle, saw a body. It was one of the Viscounts. His name was Wind Viscount.\n\nWind Viscount was lying on the ground facing the base. It looked as if he was had been approaching the gate when his head was blown open.\n\n“What is this?” Han Sen had a bad feeling, and he frowned.\n\n“We don’t know. We saw Wind Viscount return from an expedition outside. But before he made it all the way back, he fell on the ground. He crawled a little bit before his head exploded,” a woman and a Baron explained."
}