{
    "chapter": 60,
    "title": "Golden-Horned Shura",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_60",
    "text": "Han Sen made some brief explanation to Zhang Danfeng after he parted with Lin Beifeng.\n\nHan Sen understated everything and didn’t say much about Han Hao, as he knew Zhang Danfeng wouldn’t let Han Hao off easily had he told Zhang Danfeng what had really happened.\n\nZhang Danfeng thought they were always good brothers and friends because they grew up together and certainly would not accept what Han Hao had done.\n\nWalking on the way to the maglev train station, Han Sen was wondering what he should take with him to Dark Swamp.\n\nThere were almost no human activities there, so he would definitely return with lots of prey. Even if it weren’t for the beast soul arrow, Han Sen would still want to go there—he now had sacred-blood beast soul wings and the swamp that might be dangerous to others was easy for him.\n\nHan Sen suddenly heard a glitch sound and all the lights started flashing. Surprised, he looked up and saw a meteor-like fireball quickly falling from the sky toward his direction.\n\n\"Warning… Warning… Unidentified flying object detected...\"\n\nBang!\n\nAfter the alarm of the planet's defense system sounded for a few times, the fireball hit a tall building followed by an explosion. It turned dark as the electricity was out.\n\nEven the earth seemed to have shaken a bit. Han Sen looked up to the collapsed building and saw a strange spherical aircraft crashed into the building with half of its body sticking out, surrounded by burning flames and thick smoke.\n\nPeople were screaming, crying, and running around. This area was a school district and the building hit was a school's main building. Those running from the building were mostly students about ten years old.\n\nBecause it was a public school in the integrated compulsory education system, it was not equipped with a good security system. After the explosion, there was no immediate response.\n\nThe electricity had been cut off for some reason and the automatic fire protection system was also paralyzed. In the dark, people could only see the fire at the impact site.\n\nHen Sen saw the appearance of the aircraft and suddenly clenched his fists. He had seen aircrafts like this one before. A spherical aircraft was beyond current human technologies and could only be produced by the only enemy of mankind in the interstellar era—Shuras.\n\nShura was the name given to them by mankind, and their true name could only be described in their own language.\n\nShuras looked like men except that their males had one horn on their head and their females had two.\n\nBoth Shura males and females wore masks from childhood. Their masks and horns symbolized their identity.\n\nHuman beings had fought them for centuries in the space. In the beginning, because both Shuras’ physique and technology were superior, men kept losing in the battles against them.\n\nAbout two hundred years ago, mankind discovered God’s Sanctuary and started to gain geno points in this other world, so humans’ physique had been greatly improved. Gradually, humans were able to hold the line and face off Shuras.\n\nPlanet Roca was a commercial planet and was nowhere near the warzone. Han Sen felt incredible to see a Shura aircraft here.\n\nHe grew up on Planet Roca and had only seen Shuras and Shura aircrafts on the news and Skynet.\n\nWhen Han Sen was staring at the aircraft, he saw a seven-year-old girl who was hung on the collapsed building with her clothes caught on a steel bar sticking out from the building. She tried to climb back into the building by grabbing the steel bar but she was not strong enough. Struggling, her clothes caught on the steel bar were about to tear.\n\nFace covered in tears and hands covered with dust and blood, she was almost desperate. Even if she could get inside the building, there was fire anywhere and there was no way she could survive.\n\nThe little girl gradually lost her strength and her clothes was slowly tearing. From such a height, even an adult who had max mutant geno points would fall to death, not to mention a kid.\n\nBam!\n\nNext to the little girl, the door of the Shura aircraft suddenly opened and out came a Shura with a single golden horn on his head and a white mask that covered all his face but his eyes.\n\nThe Shura was in a broken suit of alloy armor and bleeding dark green blood all over.\n\nThe blood of Shura was different from that of human and was as green as bile, which was another way to tell if someone was Shura.\n\nHan Sen was shocked by the look of this Shura. The decors and materials of the Shura masks had a lot of meanings behind them, but Han Sen didn’t really know much about that. However, just by the look of his golden horn, Han Sen knew this Shura was not ordinary.\n\nShura's horns were their most prominent symbol of identity. Their horns were in four colors: black, white, gold, and purple. The black-horned were civilians, the white-horned were elites, the golden-horned were aristocrats, and the purple-horned were royalties.\n\nFrom this random aircraft had walked out a Shura aristocrat, which surprised Han Sen.\n\nThe Shura held in his hands a black katana. The Shuras all had great physiques. Any adult Shura could match a human evolver in a hand-to-hand fight. Stronger Shuras could even reach the level of surpassers.\n\nThe Shura came out from the aircraft and saw little girl crying. With a cruel gleam in his eyes, he raised his katana and slash it toward the little girl's head.\n\nHan Sen summoned the black beetle, bloody slayer and purple-winged dragon all at once and turned himself into a giant winged centaur covered in golden armor, and even his wings were covered in golden armor.\n\nBoom!\n\nThe huge wings brought him to the middle of the building almost instantaneously. Taking the girl with one hand, Han Sen grabbed the blade of the Shura’s katana with his other hand.\n\nBlood suddenly flowed out along the blade."
}