{
    "chapter": 262,
    "title": "Now or Never",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_262",
    "text": "Almost everyone was lamenting for Han Sen that he did not get rid of Jing Jiwu when he had the advantage. In the duel, with a 11.0 bow in Han Sen's hand, he stood a very slim chance of winning.\n\nJing Jiwu could threaten Han Sen from 600 feet away, while Han Sen could not even guarantee a shot at Jing Jiwu at 150 feet.\n\nThat was why people felt terrible for Han Sen.\n\n\"Next year… Next year we will be here again…\" Seeing Han Sen was forced into the area of fallen trees and had to face Jing Jiwu, Xu Tianhao felt a strong regret.\n\nHe had lost for three years, and was never able to make it beyond the second round. This year, he was here again, and he really wanted to win.\n\nBut there opponent was the Alliance Central Military Academy. Even they had worked so hard, they were still about to lose.\n\nAs Xu Tianhao was saying next year, he suddenly realized that he no longer had another year. This was his senior year and last year in the tournament.\n\nWith mixed feelings, Xu Tianhao's eyes went wet.\n\n\"Even I have to give 10 years of my life, please give us a miracle.\" Xu Tianhao felt suffocated.\n\nSitu Xiang's eyes were also damp.\n\nShe did not realize that Blackhawk could come this far. Her plan worked, and now it was king to king. The only thing was that Han Sen was holding a 11.0 bow.\n\nAt this point, Situ Xiang wished she could enter the field and hand a strong bow to Han Sen, which was impossible.\n\nHan Sen followed her plan and took the best bow for the plan to work, which played out nicely. However, Situ Xiang regretted it so much that she did not ask Han Sen to pick a strong bow.\n\nJi Yanran and Qu Lili were wringing their hands nervously and staring at the image of the game without blinking.\n\n\"Qu Lili, Han Sen will win, right?\" Ji Yanran wanted an affirmative answer from Qu Lili.\n\n\"Absolutely, he's the genius.\" Qu Lili said decisively.\n\nWen Xiuxiu saw Han Sen was forced into the area of fallen trees and sighed. \"Han Sen did really well. He was only holding a wrong bow at the wrong time. If he is also a senior student with a 16.0 bow, this would be a super duel.\"\n\nMost people agreed with Wen Xiuxiu. Han Sen was indeed strong, but compared to Jing Jiwu, he was still somewhat lacking.\n\n\"It will still be you who defeat Jing Jiwu it seems.\" Tang Zhenliu sighed. Although he was not great at archery, he saw Han Sen's disadvantages.\n\nLin Feng said casually, \"Not necessarily. He still hasn't given up. I can tell from his eyes.\"\n\n\"But I cannot imagine what chance he would have. In the duel in this open space, can he really win with a 11.0 bow?\" asked Tang Zhenliu.\n\n\"In this world, the absolute strength doesn't represent everything.\" Lin Feng watched Han Sen and Jing Jiwu quickly moving in the area of fallen trees and said, \"We can never tell when the two players are like these two.\"\n\nTang Zhenliu knew that Han Sen was exceptional. However, under such circumstances, he did not see any chance for Han Sen to win.\n\nAfter entering the area of fallen trees, Han Sen did not try to run anymore. He had entered the range of Jing Jiwu's bow, and there was no cover anyway. Running was pointless.\n\nJing Jiwu walked slowly into the area of fallen trees with bow and arrows in his hand, and did not immediately shoot at Han Sen. Instead, he stared at his opponent and said, \"You did well. Unfortunately, we will have no chance to fight again. It has to be today.\"\n\n\"Why next time? Now or never.\" Han Sen stood still and raised his bow.\n\nJing Jiwu did not speak, but nodded, raising his bow as well.\n\nTwo persons, two bows, two arrows. Under the light, they stood like two sculptures. After 0.1 second, the two suddenly moved at the same time.\n\nThe arrows were in the air and the two bodies were moving.\n\nJing Jiwu's arrow was obviously way faster than Han Sen's. The moment he let go, the arrow was already in Han Sen's face. Han Sen turned sideways slightly and dodged that arrow by a hair.\n\nJing Jiwu was more at ease. As such a distance, Han Sen's arrow was too slow to pose any threat to him.\n\nHowever, Jing Jiwu still approached Han Sen quickly and shot at him again.\n\nWiggling left and right, Han Sen was shooting back as well.\n\nThe viewers were dumbstruck. In a duel like this, the two had failed to shoot their opponent multiple times. Shockingly, Han Sen's strange movements led Jing Jiwu to miss three times.\n\n\"My God! 16.0 bow at 60 feet, yet Jing Jiwu missed all three. Is Jing Jiwu's luck too bad or is the guy's luck is too good?\" A team member of the Alliance Central Military Academy said.\n\n\"It's not about their luck. It is because Han Sen is too misleading. When he moved, he was constantly giving Jing Jiwu the wrong idea, making Jing Jiwu believe he was going into the other direction, which led to mistakes in Jing Jiwu's judgment,\" explained Qin Cheng.\n\n\"He seemed to be just wiggling unintentionally. It turns out that's a serious skill.\" The team members all looked to Han Sen in surprise."
}