{
    "chapter": 1236,
    "title": "Not Dying and Not Hurting",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1236",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe rhino’s horn was shining brightly, and that same light was now caressing the crumpled king spirit. Xie Qing King did not relent in his pummeling of the spirit, but no matter what he did, it just wouldn’t give up the ghost.\n\nPang!\n\nThis time, when the spirit was able to get up, it punched Xie Qing King in the face, making his nose bleed. And it wasn’t only Xie Qing King having to deal with such a predicament. Ghost Eye, Blue Dinosaur, and Dry Bone were also at this same disadvantage.\n\nDisloyal Knight’s halo had the ability to weaken others, but Saint Fan’s army was practically invincible. They did not fear death, either, so a reduction in damage output or a reduction of defense durability on their part meant nothing. That being said, the wounds would stay on the broken enemies, which meant their effectiveness in battle gradually reduced the more they were beaten.\n\n“Holy Rhino is good; it is no wonder Saint Fan values it so highly and has allowed it to level up so high,” Han Sen thought, as he readied himself to attack the rhino and Saint Fan Emperor.\n\nHan Sen needed to get rid of the duo, as victory did not seem a likely outcome if they were still in play.\n\nBut before Han Sen struck, Xie Qing King barked something across the battlefield. The scary silver light that had enveloped him made him look like a terrifying foe. Han Sen was a great distance away from him at this point, but he could feel the immense power Xie Qing King was about to deploy. It made the hair on the back of his neck stand on end.\n\nSeeing the king spirit rise again, Xie Qing King had definitely had enough. He screamed, “Die!”\n\nThe fists came thick and fast, one wallop after another, wrecking the body of the king spirit. The heat of the silver fists then melted its body into thick, bubbling tar as it was beaten back into a rocky cliffside. Like a mechanical drill, Xie Qing King pummeled him through the rock as if he was merrily digging a tunnel.\n\nAfter the silver light dimmed, the body of the king spirit was shown to have disappeared. It had been vaporized.\n\n“Even after respawning another ten thousand times, you’ll never have what it takes to beat me!” Xie Qing King hollered, as he drew a pair of sunshades and slid them into his face.\n\nAs cool as he tried to play it, though, Han Sen knew Xie Qing King was sweating. That attack had cost Xie Qing King a lot of energy.\n\nStill, the fact that he had destroyed a king spirit into actual nothingness was scary. Han Sen said to him, “Brother Xie, you rock.”\n\nIf the body was gone, the rhino couldn’t heal it.\n\nBut Saint Fan Emperor waved his hand, and then, a weird light appeared. This light was sent towards Xie Qing King.\n\nBoom!\n\nThe light broke and diminished, returning the king spirit in front of Xie Qing King unharmed and free from wounds. Seeing this, Xie Qing King’s face changed. Han Sen now knew why his opponents really weren’t afraid of death. Even if they couldn’t be healed, resurrection was only a hand flick away.\n\nHan Sen summoned Purple Emperor and then became a berserk gold raven. Together, the duo went to battle Saint Fan.\n\nHan Sen used the gold raven because he could not yet use Ancient Devil Soldier. The raven had berserk powers, too, so it was bound to be effective against the emperor.\n\nSeeing Han Sen and Purple Emperor approach, Saint Fan didn’t move much. He just remained where was, comfy upon the rhino. He didn’t seem to be afraid of anything.\n\nWhen they approached, Saint Fan lifted his hands and managed to grab them both with ease. The talons of the raven and the purple sword were grabbed by Saint Fan with no trouble. Han Sen and Purple Emperor could not escape the wretched grip he had on him.\n\nSaint Fan was a twisted devil, and he started to smack the two puppets in his hands together, getting them to hit each other repeatedly.\n\nDry Bone King said Saint Fan could make the flesh of two creatures merge together, and these words stuck with Han Sen all too well. The last thing he was going to do was allow that.\n\nHan Sen flapped his wings and managed to writhe out of the emperor’s grip, leaving a few scratch marks on his hands as he slipped free.\n\nPurple Emperor, seeing an opportunity now arise, let the sword go, jumped on Saint Fan’s head, and used another beamblade to strike him.\n\nDong! Dong! Dong!\n\nThe purple beam struck against the armor a few times, but it was futile. Only the exposed skin was susceptible to damage. But as soon as wounds appeared on Saint Fan’s skin, they were immediately healed. You’d miss it if you blinked.\n\n“Are emperors always this strong?” Han Sen used his phoenix techniques to repeatedly hit Saint Fan while trying to avoid getting grabbed again. Purple Emperor continued using his blades of light to strike their ultimate foe.\n\nBut Saint Fan didn’t even seem concerned. He sat upon the rhino, unmoved. It was almost as if he didn’t want to stop the two from hitting him.\n\n“There might only be one gene lock gap, but it’s a nearly unbridgeable chasm. Nine gene locks is so weak, in comparison.” Han Sen thought the extra, tenth gene lock made all the difference in the world.\n\nPurple Emperor had ten gene locks open, but due to the lack of sufficient nutrition during its birth, its power was not all that different from Han Sen’s. But they were also individual, and Han Sen could not combine with Purple Emperor as he could with Little Angel.\n\nThey still managed to hold Saint Fan back, but it didn’t make much of a difference for those down on the battlefield. Slowly but surely, the tides were turning, and they were not doing well.\n\nEven Xie Qing King had been injured quite a bit, by this point."
}