{
    "chapter": 1928,
    "title": "Narrow Moon Knife",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1928",
    "text": "Moon was a softer geno art. To create light, you could not use pure power.\n\nWhen Yisha gave Moon to Han Sen, she hadn’t shown him how to perform it. Han Sen believed this was because she herself was not well-versed with Moon, and even if she knew how to perform it, she couldn’t do it spectacularly well.\n\nThat was because Yisha’s power was too brutal. It lacked a softer finesse that was required. A geno art like Moon needed a gentler touch, and therefore, Yisha could not learn it.\n\nHan Sen had wondered why she wanted him to learn it. He hadn’t shown her his gentle power, and Yisha didn’t excel at it herself. But even so, she had given him Moon to learn.\n\nAfter much deliberation, Han Sen was able to understand the reason.\n\nYisha was still suspicious of him. It hadn’t gone away after Han Sen displayed his talents in the battle for Red Mist Valley. Moon might very well be another test for him.\n\nHan Sen tried to think of things through her perspective, and by doing so, it was not too difficult to understand. If he performed very well with Teeth Knife, but not well enough on another brand new geno art, there was plenty of space for suspicion.\n\nOf course, Han Sen could not confirm this was truly Yisha’s line of thought. But even so, he kept on practicing with Moon to avoid being exposed.\n\nNow, seeing Moon Wheel King’s power allowed Han Sen to understand a lot more about gentle powers. He could not directly feel the power that Moon Wheel King was using, however. If he had, he’d have been able to learn a whole lot more.\n\nBoom!\n\nAs Han Sen mulled over all this, he suddenly saw a moon appear in the sky. The moonlight gathered across the weapon Moon Wheel King was holding.\n\nMoon Wheel King slashed up towards the sky. The curve looked like that of an actual moon, slicing through the air. And the moon appeared up there in the sky, unmoving.\n\nEveryone’s knives jumped out of their sheaths, no longer able to control themselves.\n\n“This surely gets things done.” Moon Wheel King put away his light and passed the Narrow Moon Knife back to Black- Moon King.\n\nBlack-Moon King looked happy. He accepted the knife and said, “Thank you for your help. Without the assistance of your Moon Wheel power in unlocking the blade’s spirit, it would not be perfect.”\n\nHan Sen was looking at the knifelight that was hanging in the sky like a moon. Instead of fading away in time, it just remained where it was, hovering like a genuine moon.\n\nThat is powerful. The knifelight has yet to fade away. If Moon Wheel King does not forcibly remove it, I am unsure as to how long it will last. Would it stay there forever?” Han Sen thought to himself.\n\nA gentle power such as that surprised him.\n\nTeeth Knife powers could break stuff, but that was an example of raw strength. It consumed its opponents through sheer force.\n\nMoon Wheel King’s knifelight wasn’t like that, though. The power gathered up, and it wouldn’t be affected by external forces. It didn’t fade away, and that was scary to comprehend.\n\nIn a fight, if a strike did not hit its target, the power would extinguish.\n\nBut Moon Wheel King’s knifelight did not go away at all. It remained where it was, like a timebomb. If Moon Wheel King could still control it, that would be even scarier. This was similar to Han Sen’s Saving Money, but without the time limitation. Regardless, Han Sen thought it was quite meaningful. He wanted to take the time to research Moon Wheel King’s knifelight some more.\n\nBut alas, he could not do that. The knifelight was still in the sky, yes, but he did not have an aircraft to get close to it.\n\nHe still watched and stared at the knifelight, and as he did, Black-Moon King handed the knife to Flower King so the Kings could each inspect it.\n\nHan Sen was so happy about this. If he could see it up close, he could research it. And if he did that, he might be able to learn a thing or two.\n\nNarrow Moon Knife had a soft Moon power in it. That was likely because it had been finished through Moon Wheel powers. The end result was that the power the blade wielded would likely be similar to that which Moon Wheel King possessed.\n\nHe couldn’t research Moon Wheel King himself, but he might be able to research Narrow Moon Knife.\n\n“I don’t know if they will let me see Narrow Moon Knife,” Han Sen thought to himself.\n\nNow, only a few Kings were looking at it. The lower tier folk were unable to get more than a glimpse. They most certainly weren’t allowed to hold it like the Kings were.\n\nThere were a lot of Kings there, too. And if Han Sen didn’t get the opportunity to hold it for a brief time, he’d be unable to use his Dongxuan Aura to quickly scan it. He’d end up walking away without learning anything.\n\nOrdinarily, Han Sen would not have been allowed to hold it. He was so very young, and he was not qualified.\n\nBut on this day, he had been invited to attend alone. In a way, he was there to represent Yisha. So, there was a chance he’d be allowed.\n\nHan Sen started to pray. “Please let me hold it. I don’t know if I’ll get another chance at this.”\n\nFlower King, and the others, were all looking at it. Each and every one sang praises about it.\n\n“There are many King class weapons here, but only this one can truly represent us,” Moon Wheel King complimented the blade.\n\nBlack-Moon King was so happy, he smiled and said, “Actually, I am thinking about giving this to Moon God’s Palace. It could be used as a sacrifice for the Moon God.”\n\nEvery King was shocked to hear this. Moon Wheel King said, “You are so generous! The Rebate are fortunate to have you.”\n\nAll the Kings praised him. They never expected Black-Moon King would be willing to sacrifice such a powerful knife. He was extremely generous, and this was not something the average King would ever think about doing.\n\n“You are welcome. This Knife was forged with the purpose of becoming a sacrifice, anyway. Until I succeeded in crafting it, I kept my work under wraps. I didn’t want to say something prematurely, and then disappoint you.”\n\nHan Sen felt bored hearing such talk. If Narrow Moon Knife was always in the Black-Moon family, he could have inspected it through the friendship he shared with Black Steel.\n\nIf it became a sacrifice, that would suck. Aside from the major priests, no one would be able to touch it.\n\nThe Kings that were looking at Narrow Moon Knife all complimented it highly. Han Sen, on the other hand, looked as if he was suffering.\n\nThe Kings, when they finished looking, handed the knife back over to Black-Moon King. Han Sen’s heart was thumping in his chest.\n\nThere were only a few Dukes, and Han Sen was unable to get a look. He didn’t know if Black-Moon King would be so kind as to let him make a proper inspection of the weapon.\n\nIf Black-Moon King allowed the other Dukes to see it, he’d have no chance."
}