{
    "chapter": 2379,
    "title": "Number One in This Exam",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2379",
    "text": "Over the next few days, Han Sen didn’t go anywhere. He discussed Bai Yi with the Siren Virgin for hours on end, trying to memorize all the important details about the man that he could.\n\nWhen the exams began, every single person of the Extreme King would be watching. And of course, King Bai was going to be there. The chance of his identity being exposed would be the greatest it had ever been.\n\n“Your personality and Bai Yi’s are way too different. It doesn’t matter how much you pretend; you two cannot be exactly the same. It is fortunate that King Bai never loved Bai Yi. Just take care not to expose yourself, and take solace in the fact that it would be hard for him to recognize Bai Yi, anyway. And no matter what happens, you need to stick your guns and tell people you are Bai Yi. No matter how suspicious others become, they cannot kill you without solid evidence proving that you are not him.” Siren Virgin explained things to Han Sen as clearly as she could.\n\nWhen Han Sen heard what she told him, he felt relieved. It was just as Siren Virgin said. King Bai had no way of verifying Han Sen’s identity. If there was a remote chance that Han Sen was his son, he would not kill him. If he did, King Bai would be known as the man who murdered his own child. Even if he didn’t mind the damage his reputation would incur, it would be bad news for the Extreme King.\n\nThe Siren Virgin had addressed Han Sen’s greatest fears, and in so doing, she had relieved a lot of his anxiety.\n\n“This woman is good! No wonder she handled the Siren Elder so easily. The old woman died without even realizing what had really happened,” Han Sen thought in admiration.\n\nHe tried to put some power into the Siren Bottle, but it was like the power was sinking into a bottomless sea. None of his attempts seemed to work. There wasn’t even a single metaphorical wave.\n\nAfter that, Han Sen didn’t dare to test the bottle any further. He didn’t want to invoke the ire of the Siren Virgin. The Siren Bottle couldn’t have been any weaker than the Undying Bird’s Nest. Attempting to use it by force would be difficult, and probably foolhardy.\n\nOn the day of the exam, Han Sen brought the blood kirin, Lilly, Bao’er, and Lan Haixin with him. It was a whole family outing.\n\nHan Sen hadn’t planned on bringing Lan Haixin, since her presence could complicate things. But the exams were not just exams. They were a very important festival for the entire Extreme King society. All of the royal families had to attend. If Han Sen didn’t bring Lan Haixin with him, others would find it very suspicious.\n\nThe Extreme King became very festive around the exams. When Han Sen and Lan Haixin arrived at the exam site, it was already really crowded. Many of the Extreme King nobles had come there to watch the royal children.\n\nThat day was the opening ceremony, so there were many traditional events taking place. One of them featured the royal children going up on stage to show-off. Once they were on the stage, every royal child had to properly announce themselves to the rest of the Extreme King.\n\nOf course, the introduction was nothing special. You just had to declare your name and title. If you added flair to the introductions, though, that was one way to stand out and make yourself memorable.\n\nBecause of this, all the royal children would be utilizing their creativity to try to attract the attention of the audience.\n\nAfter all, the entire geno universe was divided into ranks of one sort or another. And this was truer than ever when it came to the hierarchy of the Extreme King. The elites were those who were known and obeyed, and so the royal children wouldn’t miss out on this opportunity to make an impression.\n\nAfter the opening ceremony, it was time for the royal children to show-off. The first that came out on stage was the crown prince, Bai Wanjie.\n\nBai Wanjie was the crown prince, but he was only half-deified. He wasn’t one of the two deified royals who were attending.\n\nThe curtains of the stage pulled back, revealing Bai Wanjie. He was clad in golden armor, and his gold King area covered the whole of the Extreme King’s plaza. He was shining so brightly, like a gold warrior walking down a gold path.\n\n“My name is Bai Wanjie. I am the crown prince.” Bai Wanjie’s introduction was a simple one, and then he departed the platform of the Extreme King.\n\nAfter Bai Wanjie left, a sword light appeared above, tearing through the sky. The sword light was blindingly bright, and it made people’s skin feel cold. It seemed to exert pressure on them from above.\n\nAll the princes and princesses came out, and because each one of them was impressive, none of them were very surprising.\n\nHan Sen looked closer and sighed. There were many elites in the Extreme King. Many of those royal children could wipe out a lower race.\n\nThe crowd was mostly focused on the two deified children. One of them was a prince, whereas the other one was a princess. After those two, the crowd was probably most interested in Bai Ling Shuang. She was widely considered to be the prettiest woman of the Extreme King.\n\nBut in a discussion of beauty, Han Sen would have leaned toward Bai Wei. She was just as striking as Bai Ling Shuang. In truth, all of the royal children looked special, but Bai Ling Shuang was simply stronger and had more of a reputation.\n\nSoon, it was Han Sen’s—Prince Sixteen’s—time to show off. Han Sen, when he heard his name get called, had to get up and go to the door that led out onto the stage.\n\nMany nobles, commoners, and even deified elites were interested in seeing Bai Yi, known as Prince Sixteen. After all, his two most recent accomplishments were amazing, if completely unexpected.\n\nClaiming the alpha statue and obtaining the protection of thousands of Kingese. Either of these acts would have made Bai Yi’s name a very famous one.\n\nBecause of this, people watched Bai Yi expectantly. They were more focused on him than on the two deified children.\n\nAfter all, the deified royal children were there every year. But Bai Yi had been only a cliff note in the past, and his sudden rise had gotten people curious.\n\nUnder the eyes of all, Han Sen slowly walked through the door. He hadn’t activated an overwhelming King area, and he wasn’t producing any knife lights or sword lights.\n\nHan Sen, wearing a simple green robe, quietly walked to the center of the Extreme King’s stage.\n\n“Bai Yi, Extreme King’s sixteenth prince. The number one in this exam.” After saying this, Han Sen turned around and exited the stage.\n\n“Blergh!” Prince Nineteen, who had just taken a swig of tea, spat it out. His eyes opened wide as he watched Han Sen step down from the Extreme King stage.\n\nThe plaza was deathly quiet. No one seemed to know how to react.\n\n“Old Sixteen is getting crazier and crazier…” Bai Canglang had a wry smile.\n\n“Every time I think I have a handle on him, this guy does something even more insane!” Bai Ling Shuang tried to keep her face expressionless as she wondered if she had signed her own death sentence by making an alliance with Bai Yi.\n\n“Haha! I like this introduction. It’s aggressive. I have seen so many of the royal children’s introductions, but this one has to be the strongest of the lot!”\n\n“Strong? That was stupid. Even if he is a match for most of his siblings, there are two deified royal children here. How can he predict he will reach first place?”\n\n“That was pretty dumb, but I liked it.”\n\n“This Prince Sixteen is very interesting.”\n\nThe whole of King’s Kingdom was in shock. They were all intently discussing Prince Sixteen Bai Yi and his controversial introduction.\n\nEven King Bai, his wife, Ancient Abyss, and the other officials were all looking at Han Sen.\n\nHan Sen acted as if nothing had happened. He returned to his seat.\n\nThis was what Siren Virgin had helped him understand. He couldn’t act exactly like Bai Yi, but any action he took had to drip with certainty. He had to assure others that he was Bai Yi, and he couldn’t take a single step back. He had to show absolute confidence."
}