{
    "chapter": 181,
    "title": "A New Era of Warframe",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_181",
    "text": "\"Lili, hurry! The live stream of the SKTS launch is about to start. You won’t make it if you don’t run.\" After class, Ji Yanran and Qu Lili quickly ran across the campus.\n\nOut of breath when back in their dormitory, Qu Lili saw Ji Yanran turning her device on and watching the SKTS launch. She was quite relieved and said, \"Fortunately we made it.\"\n\n\"You are doomed Yanran. Are you still that girl who is the goddess of all guys and does not even spare them a glance? You just fell in Han Sen’s laps,\" Qu Lili looked at Ji Yanran’s expression and said incredulously.\n\nJi Yan suddenly blushed, \"Who said I was looking at him? I simply want to check SKTS out. It’s an epoch-making product.\"\n\n\"Ha! The product? Why do you stare at the contestants then?\" Qu Lili asked\n\nwith a faint smile.\n\nJi Yanran continued to quibble, \"That is because he promised me his prize. Otherwise I will never look at him.\"\n\n\"Stop it. I know all about your family’s warframe collection. You have even the historic warframe from the Battle of Planet Blackdeer. You expect me to believe you care about this warframe?\" Qu Lili twisted her lips.\n\n\"So what? I enjoy watching my boyfriend.\" Ji Yanran did not even care at this point.\n\n\"Doomed. You are so doomed.\" Qu Lili was surprised to see Ji Yanran like this, changing from a goddess to an ordinary girl.\n\nAt the launch, a large number of media and consumers were waiting for the release of SKTS. It was even more crowded than Liu Changming had imagined.\n\nAlthough there were a lot of bad comments on the Skynet, many were simply attracted by this controversial warframe.\n\nWhen Liu Changming walked up to the podium, the major media were desperately taking pictures. Reporters that wanted to ask questions were all stopped by the guards.\n\n\"I will not say anything but ask you to enjoy Digang’s recent masterpiece.\"\n\nThe gate was lifted after Liu Changming finished the sentence. Boxes with \"TS\" engraved on them were neatly arranged on the shelf in a huge warehouse.\n\n\"It looks the same as in the commercial!\"\n\n\"It sure does.\"\n\n\"It’s just the look. Its performance cannot be compared with the ones in the commercial, right?\"\n\n...\n\nThe media and those who wanted to buy SKTS were staring at the rows of silver boxes.\n\nSuddenly, they saw two persons walking from the warehouse and to the stage.\n\n\"Look, it's Yu Qianxun and Han Sen!\"\n\n\"They are also carrying SKTS...\"\n\nThe journalists were taking pictures as fast as they could. And at this time, Han Sen and Yu Qianxun exchanged a glance and turned their SKTS on, throwing the warframes in the air.\n\nSame as the scene in the commercial, the silver boxes turned into the silver liquid and flowed down, turning into parts of warframes and armed the two. Very soon, two SKTS were standing in front of people.\n\n\"SKTS made by Digang is officially on the market.\"\n\nYu Qianxun and Han Sen drove the warframes to the match venue and started a demonstration.\n\nThe techniques they used bedazzled all.\n\n\"Oh, it's true! Everything in the commercial is true. A biological warframe is so impressive.\"\n\n\"S*#t! Even that move is possible! Viva Digang.\"\n\n\"This is really an epoch-making product!\"\n\n\"That's my dream warframe!\"\n\n\"The new era of warframe has finally come.\"\n\n\"A warframe revolution...\"\n\n\"Don’t push. I came first...\"\n\n...\n\nThe entire site was in madness. As expensive as it was, all one hundred thousand units of SKTS were sold out almost in the blink of an eye. Many regretted coming too late.\n\nAnd after the launch of SKTS, the Digang Warframe Match officially took off.\n\nThis day, almost all the media were crazy about SKTS. And those who got their hands on one started to brag.\n\nA variety of videos about the testing, operation, and first impression of SKTS went viral.\n\nIt was as if there was only this one model of warframe in the entire Alliance.\n\nThose who were originally interested in SKTS but hesitated because of all the rumors were very regretful.\n\n\"Bang!\"\n\nSon of Heaven smashed a glass cup. It was the opening of the Starry Cup finals, but there were almost no reports on the Starry Cup. Almost all of the media chose to cover Digang and SKTS instead.\n\nThis was a major loss of Starry Group. And what made it worse was that the spokesperson of SKTS was Han Sen, whom Son of Heaven should have killed a long while back.\n\nThe massive Starry Cup finals turned out to be rather quiet. The finalists all felt quite rueful about coming.\n\nHad they known about how good SKTS would be, they would have applied for the Digang Warframe Match instead of Starry Cup. Both matches were commercial anyway, so all that mattered was the prizes. And how could a Starry Group warframe even be compared to SKTS, when the latter was the best and limited edition?\n\nAnd because most of the ace players had chosen to participate in the Starry Cup, the competition was not as fierce in the first Digang Warframe Match. Many of the applicants to the Digang match were the bench players of famous teams. Since they had no chance to compete in the Starry Group, they had chosen to compete in the Digang Warframe Match.\n\nThat was also a fact that contributed in Han Sen’s championship of the Digang Match with nine victories.\n\nThe second place was Yu Qianxun. She only lost to Han Sen.\n\nThe red and blue patterns on Yu Qianxun and Han Sen’s SKTS had also attracted a great deal of attention. Many inquired if they could add patterns to their own SKTS, and was replied that those were only designed for the spokespersons and would not be sold on the market."
}