{
    "chapter": 2353,
    "title": "Nine-Headed Bird",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2353",
    "text": "The water area shrouded Nine-Headed Bird, turning into a rain of water that restricted Nine-Headed Bird’s body.\n\nNine-Headed Bird didn’t move. He stood still with the umbrella open, and he allowed Han Sen’s water area to restrict his body.\n\n“Why haven’t you moved?” Han Sen asked with a frown.\n\n“I am afraid,” Nine-Headed Bird said coldly.\n\n“Afraid of what?” Han Sen asked.\n\n“I am afraid my strikes will be too fast, and you will be killed too soon. It isn’t like I am afraid of the Extreme King. You’re nothing more than a nuisance,” Nine-Headed Bird said in a calm voice.\n\nHan Sen laughed and said, “In this world, everything has a cost. If you ever find something that is truly free, please let me know.”\n\n“You are right. Although Pirates are never at a disadvantage, it’s rare to find something as valuable as that orb. I might not ever find anything like it again. I’m not afraid of going to some trouble to obtain the Ancient God Origin.” Nine-Headed Bird smiled darkly. His swordlight lit up, cutting through Han Sen’s king area immediately. The swordlight surrounded his body, holding back Han Sen’s water area.\n\n“You are half-deified.” Han Sen looked at him.\n\nNine-Headed Bird approached Han Sen, striding through Han Sen’s king area as if it was nothing. An ominous swordlight glowed from his umbrella as he got close to Han Sen.\n\n“I am half-deified, and you only have a first tier king area. You might think that I will hesitate to bully someone so weak, but we Pirates are not afraid of looking like the bad guys,” Nine-Headed Bird said. He closed the umbrella and thrust it towards Han Sen like a rapier.\n\nThe swordlight looked rather simple on the surface, but there was a hidden swordmind in the strike. It hid the strike’s true depth.\n\nHan Sen used his Original Water King Body and his body became water. He shot toward Nine-Headed Bird like a water dragon.\n\nHan Sen was driving toward Nine-Headed Bird’s body. Nine-Headed Bird’s umbrella, which looked like a sword, suddenly opened again. Han Sen’s watery form slammed into it.\n\nPang!\n\nHan Sen was thrown back. His water body returned to a humanoid shape, and he was about to leap toward Nine-Headed Bird again when a swordlight came down on him. The strike had been perfectly hidden, and Han Sen didn’t see it until it crushed his body.\n\nThe water that had composed Han Sen’s body shivered, trying to gather itself up again, but something was keeping it from drawing together. Because of this, it remained spread in puddles, shaking and twitching.\n\nNine-Headed Bird lifted his umbrella and smiled. “My Split-Day swordlight can’t destroy your Original Water King Body, but I can keep your body from drawing together again. It might not kill you, but it can seal you for ten thousand years. Prince Sixteen, you should just give me the Ancient God Origin. That will save us both the trouble.”\n\nAs he finished his threat, Nine-Headed Bird suddenly frowned. Han Sen’s water had begun shining gold. Every drop of water had a gold Kingese flickering inside it.\n\nKatcha!\n\nCountless waterdrops regathered, and the hidden swordlight that had suppressed Han Sen was now crushed. The shape of a human reformed in front of Nine-Headed Bird.\n\nNine-Headed Bird squinted at Han Sen in surprise. “Your body contains that much Kingese? How did you do that?”\n\nHan Sen didn’t speak. The Kingese of his body were quivering. His bones were roaring and shaking. He punched towards Nine-Headed Bird.\n\nWhen he punched, although there was no power in the thrust, he had the support of the ground and the sky. Everything in that world was shaking under the weight of the Kingese. He got a quiet response.\n\nNine-Headed Bird’s face turned grim. He put away his umbrella and gathered up his sword mind. The sword was aimed at Han Sen’s fist.\n\nHe struck, but at first, there was no swordlight.\n\nPang!\n\nAs the two strikes collided, gold light and swordlights went everywhere. Countless swordlights fell like rain toward Han Sen, sometimes making it all the way to his skin before the Kingese would flicker and ping them away.\n\nThe fist and the umbrella ground against each other. The powerful half-deified was sent flying away under the force of Han Sen’s punch. His umbrella was bent backwards like a bowl.\n\nIncredible power surged through Han Sen’s legs, and he chased after the arc of Nine-Headed Bird, still throwing punches as he went.\n\nHan Sen’s attacks were like sea waves, getting heavier and heavier. The power of each punch was stronger than the last. When Han Sen had seen Ancient Water God’s shocking water power, he had immediately realized that he could combine it with the Extreme King’s Shocking Sky Punch.\n\nNine-Headed Bird’s face changed. He kept trying to dodge away from the string of attacks, but no matter how unexpectedly he tried to move, the world answered to the beck and call of the Kingese rattling inside Han Sen’s body. Nine-Headed Bird couldn’t escape now that Han Sen had locked onto him.\n\nPang! Pang! Pang!\n\nThe fist and the umbrella kept coming against each other in the sky. In just a few punches, the King class item was broken under Han Sen’s fist.\n\n“Sh*t! Shouldn’t you have called that the Battle God King Body? This is so f*cking ridiculous!” Nine-Headed Bird kept shouting as he fought.\n\nHe was a half-deified being, but he was using every ounce of his power to hold off Han Sen. And still, Han Sen had him at a severe disadvantage. His bones were cracking, and it sounded like they were going to snap.\n\nXius and the others were watching the two fight in the sky. As she watched the gold shadow slowly beating the sh*t out of Nine-Headed Bird, she was very surprised.\n\n“No wonder the Extreme King are one of the top three races. Nine-Headed Bird of the Pirate is very strong, but he still cannot go against someone with the blood of the Extreme King.”\n\n“That king area, at its first tier, is suppressing the half-deified Nine-Headed Bird. The Extreme King are scary!”\n\n…\n\nNine-Headed Bird, upon hearing these comments, became furious. He knew that Han Sen was much weaker than him, but the Kingese powering Han Sen’s body were simply too powerful. The whole universe and all its creatures were answering to Han Sen. His every punch was combined with the power of the sky and the ground. It was enough to surpass Nine-Headed Bird’s own power.\n\nNine-Headed Bird was punched in the face. He was sent flying away again, sputtering in anger. “F*ck you! If I don’t attack with everything I have, you’ll think I’m nothing more than a housecat. Time to show you that I’m a tiger.”\n\nHe shook his arms, and a black light glowed out of his body. His arms became black wings as his body began to swell. He became a disturbing black bird.\n\nThe weird bird looked like a dark cloud with nine heads. The eyes had gold lights within them, and its claws carried clouds. When the bird flapped his wings, wind and fire were summoned. It rose overhead like some demon of the apocalypse.\n\nAs Han Sen’s punches rolled across the sky like waves, the Nine-Headed Bird released a strange, vibrating scream. That sound could break stone, and the sky seemed to tear under the weight of the voice. The bird’s talons fell to intercept Han Sen’s fist.\n\nPang!\n\nThe fist and the talons collided with each other, but this time, it was Han Sen who was blown backward. The Nine-Headed Bird flapped its wings and dove after him. The bird kept screeching weirdly, its eyes like thunder.\n\nHan Sen prepared to move forward and attack again, but the Nine-Headed Bird just hovered in the air. All nine of its heads were making strange sounds, like a demon mumbling. As the mumbled chant continued, a weird black area covered the region."
}