{
    "chapter": 2646,
    "title": "Underworld Lake",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2646",
    "text": "“There are a lot of resources to be earned from Outer Sky xenogeneics, but they are very dangerous for ordinary students to obtain. This house will keep any deified xenogeneic from approaching within one thousand miles. It is hard to say what will become of you if you leave that radius, however. If you are out by yourself and encounter danger, I’m afraid I won’t be able to save you in time. So, if you want to go hunting for some reason, we should go together,” Exquisite said.\n\n“What kind of primitive deified xenogeneics around here can I hunt?” Han Sen asked. Since he was there, anyway, he wanted to acquire more deified resources.\n\n“They are everywhere. Our people haven’t raised them on purpose, but the creatures have multiplied on their own over the years. They don’t bother the homes of the Very High, but they can travel freely wherever else they wish to go. So, when you leave the designated safe zones, you must be wary wherever you tread. There are larvae and even butterfly xenogeneics to be found. A creature like that could end your life by exhaling in your direction,” Exquisite said.\n\nHan Sen was stunned. “I thought there were resources I could take freely. Why are they that dangerous to obtain?”\n\n“If you want resources, you don’t have to go and hunt them yourself. Our race has stockpiles for your enjoyment,” Exquisite said. She now spoke in a different tone of voice as she looked at Han Sen.\n\n“What have they got for me?” Han Sen asked.\n\n“Follow me,” Exquisite said simply. She led Han Sen out of the garden. But this time, Exquisite didn’t use her little ship. She put her hand on Han Sen’s shoulder, and all of a sudden, a space teleportation trick teleported them god-knew-how-far.\n\nWhen they came out on the other side, Exquisite didn’t release her grip on him. She used her teleportation ability again. She did this a dozen times before they came to a stop.\n\nHan Sen saw beads of sweat on her forehead, and on top of that, her face was flushed red. It had cost her a lot of strength to bring him so far on a whim.\n\n“We are here,” Exquisite said, looking forward.\n\nHan Sen followed her gaze. An odd lake lay before them. The lake was full of clouds rather than water.\n\nHan Sen thought that the surface of the lake might merely have been obscured by a deep mist, but when he looked down, he realized he couldn’t peer through the fog. Despite the strength of Han Sen’s vision, he couldn’t see anything deeper than ten meters. But all ten of those meters were clouds and nothing more. There was no sign of water within that hanging mist. And something that shimmered was moving within the vapor.\n\n“This lake is called Underworld Lake because Outer Sky resides between the real world and the anti-matter world. It is sometimes said that this lake is a connecting point between the real world and the anti-matter world, a way for us to access the anti-matter world. I don’t know if that is true,” Exquisite explained, as she pointed towards the strange lake.\n\n“No one has gone diving here before?” Han Sen asked with curiosity.\n\nHe had heard the various theories of anti-matter worlds, but what he had heard was merely hearsay. He didn’t know if any of the rumors were true.\n\n“People have gone in before, but the people who go down—no matter how strong they are—never return. They are never seen again,” Exquisite said, her voice emotionless.\n\n“Then why are we here? You aren’t going to make me go down there, are you?” Han Sen looked at Exquisite, slightly alarmed.\n\nExquisite laughed and said, “No. Of course not. Although the Underworld Lake can be dangerous, it is perfectly safe as long as you don’t go inside. You can, however, do things like go fishing. If you get lucky, you might pull something sweet from there.”\n\n“We can fish in the clouds? What can we fish for? I thought you said this is connected with the anti-material world. Is the anti-material world occupied by fish and shrimp, or something?” Han Sen asked, raising an eyebrow at Exquisite.\n\nInstead of answering, Exquisite pulled out a spool of silk-like wire and pushed it into Han Sen’s hands. “Over the next few days, you should take a load off and fish here. Once you catch something, it will be easier for you to understand what is going on.”\n\nHan Sen looked at the spool of silk and noticed that the line was as thin as a hair. It looked grey. It wasn’t as shiny as actual silk. In fact, it looked fairly dull.\n\nHan Sen continued to examine the thread. This entire situation was strange. She hadn’t given him a fishing rod, and there wasn’t even a hook on the line. Not even Jiang Tai Gong would excel with such primitive tools. Although that guy hadn’t had a hook for his line, he had a proper rod, at least. Han Sen had been given nothing. All he had was a wire.\n\n“There is no fish hook, and neither is there any bait. How am I supposed to fish out anything with this?” Han Sen asked, looking skeptically at Exquisite. But she must have had her reasons for giving him such a tool.\n\n“Put some of your blood on it and give it a try,” Exquisite instructed.\n\nHan Sen put a drop of his blood onto the wire and thought to himself, “Is this the Very High or an enclave of vampires? Everything here requires blood!”\n\nExquisite could sense what Han Sen was thinking, and so she blinked and said, “Actually, it doesn’t really require blood. It just needs your genes, in one form or another. Blood is the easiest, so…”\n\nHan Sen found himself speechless, but he wasn’t in the mood to argue with her. The line absorbed Han Sen’s blood. And then, it jerked and flew up out of his hand. The line nestled itself amidst Han Sen’s hair, then disappeared.\n\nHan Sen was shocked. He realized that there was now a single strand of silver in his hair. It was the silk he had just received.\n\nBut now, the piece of silk seemed to be connected to Han Sen’s mind. The silk obeyed any mental instructions that Han Sen gave it. It could be as long or as short as he commanded it to. It was as if it was alive.\n\n“What is this thing?” Han Sen asked, turning to Exquisite once more.\n\n“It is a xenogeneic treasure called Underworld Silk,” Exquisite explained. “It is made of cloud silk essence from Underworld Lake. There are no tiers of this item, and you cannot attack with it. Its fitness isn’t high, either. Even an ordinary person could rip it with ease. But it is the only thing that can return from the Underworld Lake. You can use it to fish in Underworld Lake.”“Then why am I using my blood for fish bait?” Han Sen wasn’t happy. Exquisite was explaining things a bit at a time instead of telling him everything upfront. Han Sen wasn’t a big fan of that.\n\n“You don’t need bait. Your genes are a part of the Underworld Silk now. Your presence is in it now, and that presence is your bait.”\n\nAfter pausing, Exquisite went on to say, “I still have things to do, and I’m needed elsewhere for a while. Until I come back, I expect you to be fishing here. Don’t go too far from this place. There are far too many xenogeneics in this area. They won’t come to the shores of the Underworld Lake, so remaining here is the safest place for you.”\n\n“I would like to fish, too,” Bao’er said. She stared directly at Exquisite as she spoke.\n\n“We only have one of these Underworld Silks to spare. I will bring you another one next time,” Exquisite said to Bao’er. Before Han Sen could say anything, she used her space teleportation and vanished.\n\nHan Sen’s heart jumped. The Underworld Silk lengthened stretching past his hand and down to his feet. It snaked its way down into the Underworld Lake.\n\n“Can I really fish something out of there?” Han Sen looked at the strand of Underworld Silk that had now disappeared quietly into the Underworld Lake. Han Sen had serious doubts about this."
}