{
    "chapter": 2983,
    "title": "Killing a God Spirit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2983",
    "text": "Moment God did not believe Han Sen could break the time etching’s control. He was too close to Han Sen. He wanted to use time power to stop Han Sen, but it was no longer working.\n\nIn that burning light, Han Sen was holding the Sky Vine Radish God Lance. It had cold light that pierced into Moment God’s chest.\n\n“So what if you can hit me? The body of a Disaster-Class God Spirit cannot be harmed by you.” Before Moment God finished his sentence, his face changed. He looked down and saw Han Sen’s Sky Vine Radish God Lance had perforated his chest. In that cold light, Moment God’s Disaster-Class God Spirit body was pierced. His body started to collapse from the point of that wound on his body.\n\n“No… This is impossible…” Moment God thought it was unbelievable and screamed. His entire body turned into dust and exploded.\n\n“It looks like my Super God Spirit mode has become much stronger as I leveled up.” Han Sen was a little surprised by its effectiveness. He had not expected to kill Moment God in the way he had with one hit. He was hoping to just heavily damage Moment God. The moment he used Super God Spirit mode, he chose his strongest attack, Super Spank. The effect far exceeded Han Sen’s expectations. With one hit, he blew up the Disaster-Class God Spirit Moment God. Although Moment God had been very careless, the main reason for defeating him was because Han Sen’s Super God Spirit mode was just too strong.\n\nHan Sen measured it a little. Even when he used the Kirin’s holy spirit, it was no match for the power of Super God Spirit mode.\n\nBut Wan’er was there. His Super God Spirit only let out a strike and that was that. It quickly dissolved. Han Sen returned to normal.\n\nIt had all happened very fast. The universe’s audience saw Han Sen’s body explode with white light. In the next second, he was thrusting his weapon through Moment God.\n\nThe incredibly strong Disaster-Class Moment God had not been able to resist. He screamed and died. The universe went silent.\n\nAfter a while, all the creatures started reacting. Everyone was erupting with chatter.\n\n“It is no wonder Dollar is the strongest in the universe. One lance strike was enough to blow up a Disaster-Class God Spirit. That is invincible.”\n\n“Huh? You did not say that before. You said Han Sen’s god list No. 1 was given by Golden Growler.”\n\n“That is not what I meant. Golden Growler gave out No. 1 because he knew he would lose. Otherwise, why would he give it to him? It just means Dollar is too strong.”\n\n“Dollar is too strong. He must be the first creature in the universe to slay a Disaster-Class God Spirit.”\n\nEverybody was talking about it. The green-haired beast from Empty Mountain gnashed its teeth and madly said, “Dollar has that power, yet he did not go to save Little Mountain Leader. If he cooperates with Han Sen, perhaps they can save Little Mountain from that Moment God Temple.”.\n\nThe Gana woman coldly grunted. “Wolf hearts and dog lungs.”\n\nThey had no idea Han Sen and Dollar could not cooperate.\n\nNo one suspected Han Sen and Dollar were the same person because they were of a different race. It was like a cat and a dog. No one would have believed they were the same.\n\nIn the geno hall, God looked at Han Sen standing in front of the god temple. He frowned and thought, “This power… It is going to reach that level. His body really is different.”\n\nIn Blood Legion, Human King squinted his eyes and looked at Han Sen. His eyes looked weird.\n\nOn the streets of a small planet, a fortune-telling old man opened his eyes wide. He looked at Han Sen in front of the god temple. He was full of confusion and said, “Weird… Not a God Spirit… How could he use a power that was like a God Spirit?”\n\nSky Palace Leader frowned and receded into his thoughts. “Dollar, what race is he? Why would he possess that power?”\n\nIn front of Moment God Temple, Moment God turned into dust but did not fade away like other God Spirits. The god temple’s god altar did not start. The god flag that had Moment God’s title suddenly turned white. The god temple started to look dim. It turned into an empty temple with no God Spirit. “What… What is going on? How has God Spirit not been revived?” Everyone was shocked. They did not know what was happening.\n\nThe God Spirit that claimed to be immortal did not respawn.\n\nHan Sen was confused too. After he hunted Moment God, he only received one announcement.\n\n“Disaster-Class God Spirit hunted: Moment God.”\n\nThe announcement was just that one simple line. No God Spirit or God Spirit gene was received. It was different from what Han Sen had slain before.\n\n“What is going on? Is it because of Super Spank, or is it a problem with my Super God Spirit mode?” Han Sen’s suddenly had many ideas running through his mind.\n\nOn the other side of the god temple’s plaza, a body stood where it was. It was looking at Han Sen with much shock. After a moment, that shocked face suddenly had a weird smile and said, “Dollar really is legendary. One lance enabled you to slay a god. In the universe, you really must be No. 1.”\n\n“Bai King?” Han Sen turned around. He felt weird.\n\nHe knew Bai King was already there, but he did not know why Bai King had come there now. Obviously, Bai King had arrived there in the hopes of saving him. If he had not used his Super God Spirit mode, Bai King would have come there to take Moment God’s strike on his behalf.\n\nHan Sen did not think his relationship with Bai King was that good. So far, everything Bai King did confused Han Sen.\n\nHan Sen looked at Bai King and asked, “Why?”\n\n“This place is not appropriate for us to talk. Let us find another place to talk.” After speaking, Bai King left the god palaces.\n\nHan Sen followed Bai King and flew away from the god palaces. He really wanted to know what Bai King’s motive was for treating him the way he was all the time. Han Sen and Bai King disappeared after leaving the god temple because the god palaces showed up again. It was a place everyone could see from across the universe. Every race was able to witness what happened near the god palaces. After leaving the god palaces, unless they were close to Han Sen, no one could see them.\n\nThis act made the universe blow up. Every creature was shocked and confused.\n\n“Aren’t God Spirits immortal? What is going on? How was Dollar able to murder a God Spirit?”\n\n“What just happened? Why didn’t Moment God revive inside the god temple?”\n\n“Oh my god! Dollar can really slay God Spirits.”\n\n“It looks like God Spirits are not invincible. They claim to be immortal, but he was killed by Dollar.”\n\nThe whole universe was talking about Han Sen killing a God Spirit. The invincible image of God Spirits seemed to have crumbled a bit.\n\nHan Sen and Bai King had just left the god palaces. They were looking for a quiet place to talk when the god palaces god temple suddenly shone very bright."
}