{
    "chapter": 1288,
    "title": "Slashing Fan",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1288",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nEveryone was shocked by what happened. Even Saint Fan’s face twitched, as an expression of horrid surprise suddenly overcame him.\n\nBetween his two eyebrows was a wound that bled.\n\nThe emperor could regenerate broken tissue, so the small, phantom wound that had been inflicted should have been fine and nothing of much concern.\n\nBut it bled profusely, with no sign of recovery. And from the twitching muscles of his face, one could suspect Saint Fan was in some sort of agony. And with his utter silence and refusal to move, the entire scene was like a paused videotape, cliffhanging a big reveal.\n\nSuddenly, cracks began to form across the disheveled biomass.\n\nFrom afar, it looked like the ugliest vase in the market had been broken, then put back together again with swathes of glue.\n\nRoar!\n\nSaint Fan roared to the skies above as his webbed-looking body began to fall apart. Creatures, spirits, and humans all began to fall out of the mucus-laden mound of flesh. Somehow, they had been spared from the biomass and set free without damage to their bodies. Even the shelter and its holy flower had fallen out of the horrendous mass, seemingly without harm.\n\nSaint Fan’s forehead was cascading blood, and the fact that the wound was so small added to the creepiness of the scene. It was extremely unnerving.\n\nBlergh!\n\nSaint Fan spat out some blood from his mouth now, and a red light then flew out in Han Sen’s direction.\n\nSaint Fan was on the precipice of being done, and when he teetered to the brink and plummeted off, he did so in the grizzliest fashion possible. His body, and what remained of the biomass, exploded into a bloody, snotty mess across the region.\n\nThe red light did not seem to venture towards the shelter, but all the same, Han Sen heard a spirit stone-like gem shatter. The sound was unmistakable.\n\nThe humans were all in disbelief, rolling around trying to regain composure after what had just happened. And what’s more, they felt the contracts binding them to Saint Fan break.\n\nThey looked around, stunned. The joy they sought to feel caught up to them through the daze, and the spirits and creatures that had escaped the biomass with them tried to flee.\n\nHan Sen commanded his companions to go after the super creatures. Then, he turned around to look at someone who had tagged along, unannounced. He turned to look at Zero.\n\nZero’s hair was a little purplish, but that color was on the retreat and had almost vanished.\n\nThe humans moved forward to thank Han Sen. They saw the red light head in Han Sen’s direction, and thus believed it was he who had unleashed that magnificent blow.\n\nHe wasn’t keen to correct them, though. And after the brief session of applause, Han Sen raced over to the spirit hall. There, he saw Saint Fan’s spirit stone in pieces.\n\nThe humans all returned to the Alliance with much excitement.\n\nSome of them had been trapped inside the shelter for over a century, so they weren’t even sure if their friends or family would still be there. They had a most strange mood as they returned home.\n\nAll-in-all, Han Sen’s companions had managed to slay seven super creatures and six king spirits. Through doing this, they had obtained seven Life Geno Essences and one beast soul.\n\nHan Sen gladly accepted the spoils of war.\n\nRodman’s return shook the Alliance to its very core, as he announced that Han Sen had taken down another emperor shelter and saved two hundred humans in the process.\n\nThe humans were fine with giving their statements to the media, and recounting their tale of what happened on the day they were saved. A documentary was made about it, and it was aptly titled, “The First Human Emperor.”\n\nRight now, Han Sen was more interested in Zero, though. Han Sen knew it was her who had killed Saint Fan, yet she accepted no fanfare and was not keen to even let others know it was her who had stepped in to save the day.\n\nHan Sen remembered the red light, and he found it oddly reminiscent of the Bone Dagger she had once procured, under the strangest of conditions. That was fuel for his mind to wander and think.\n\nHan Sen did not know if it was the bony knife itself, or if it was the Asura Sutra’s power that propelled the skill she had unleashed to resolve the situation.\n\n“Zero, do you mind telling me how you killed Saint Fan?” Han Sen asked her in as gentle a tone of voice as he could fabricate.\n\n“You taught me,” Zero said.\n\n“I did? Ah, you mean the Asura Sutra thing I once asked you to read?” Han Sen half asked her, thinking he knew what she meant but wanting a confirmation off her all the same.\n\nZero nodded, and then added the simple sentence, “And the dagger.”\n\nHan Sen knew it had to be one of the two, but it seemed as if she didn’t quite know which one, either.\n\nHan Sen trusted Zero, but the Asura Sutra was incredibly powerful and so was she. It was almost frightening. But it looked like the curiosity that was Zero, and the mysteries surrounding her, were still present. Answers might not be achieved that day, but the event had renewed Han Sen’s interest in who she was, that much was for sure.\n\nThis was why Han Sen never took to practicing the Falsified-Sky Sutra, amongst other reasons. It was weaker than the Dongxuan Sutra, and not as pure as the Asura Sutra.\n\nBut what concerned Han Sen the most was the fact Zero had come along and attacked. Han Sen could have killed Saint Fan, but the humans would have died along with the spirit.\n\nHan Sen could think of only one possibility for how Zero had separated the spirit from the rest. He believed the Asura Sutra had a target select, where damage was only wrought upon those who the caster wished to deal damage.\n\nThe Asura Sutra might have well been the only skill there that allowed for the killing of Saint Fan, while saving the humans at the same time.\n\n“That’s the reason why Godslayer Luo is so famous. Ugh, I need to sort this out with Little Yan, and I need to become a demi-god quickly,” Han Sen thought to himself.\n\nGodslayer Luo was a famous demi-god, one held in a regard that was high above all others."
}