{
    "chapter": 1824,
    "title": "Knife Grave",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1824",
    "text": "Knife Grave\n\n“Queen didn’t tell you before you came?” Black Steel frowned.\n\nHan Sen shook his head. “Queen didn’t tell me anything. She just told me to come here, and that was that.”\n\nBlack Steel quietly said, “Queen is indeed different She has her own plans, though, I assume. If she didn’t tell you.”\n\nAfter a pause, Black Steel went on to say, “These volcanos are the graves of the knives. A lot of knives are buried here, and the knives come out when the tunnel is opened. They await a new master. We are here to select new weapons for ourselves. We are also being picked by the weaponry. There won’t be good quality knives at the beginning, mind you. Later on, there will be a higher chance of finding good knives. But even so, they are rare. You need to get them, but also earn their approval. For that, you will require power and luck.”\n\n“Where did these weapons come from, then?” Han Sen asked, with shock.\n\n“I do not know, but this portal opens once a year. Where the knives actually come from, I’ve never been told. If they are not chosen, they will return to their graves. They await the next host of participants in a year’s time, with the hope they might be chosen,” Black Steel said.\n\n“Does that mean the weapons we take belong to us?” Han Sen thought to himself. He wanted to collect a few, so he could give them to his family. It would be best to give them to his son, his grandson, and great-grandson, in case he could never return.\n\n“Our race has a rule: only one knife can be taken by each person.” Black Steel looked at Han Sen coldly, as if he knew what Han Sen was thinking.\n\n“Oh, really?” Han Sen looked disappointed, but then he asked, “Towards the end, what might their level be? Are any of them deified knives?”\n\nBlack Steel’s mouth twitched. He knew Han Sen was a greedy person, who was not even concerned with hiding that fact.\n\nHe had no clue why Queen might accept a student such as this.\n\n“I don’t know. The knife rain will fall once an hour, however. After the seventh rain comes, Viscount class blades will become available. It’ll be hard to dodge those knives. Across the years, no one has lasted longer than ten rounds. The best knives that have ever been found were Duke knives.” Black Steel answered Han Sen’s question.\n\n“Duke class? That’s not bad.” Han Sen nodded.\n\nBlack Steel felt as if he had been talking far too much to Han Sen. Strangely, he was also in a brighter mood. He couldn’t help but ask Han Sen, “Did you bring any high-tier armor and weapons with you to this place?”\n\n“No. Queen said I did not have to.” Han Sen looked at Black Steel, and it seemed as if he had not brought anything, either.\n\nBlack Steel said, “Do you think a Baron can block a Viscount knife rain? The knife rain is not like this, and it could last up to ten minutes. When they fall down, they will come with the full strength of a Viscount’s attack. Without high-tier armor and weapons, how well do you think you will fare in the blocking?”\n\nHan Sen looked at Black Steel without speaking. If the high-tier armor and weapons worked, Yisha would have let him bring them. But Black Steel hadn’t brought his either, so there must have been a reason for that.\n\nBlack Steel continued by saying, “It is actually pointless to bring them. Bringing those items will only help you last a bit longer. But if you bring other items to help you, the knives you wish for will not choose to follow you. They would sooner break themselves than allow themselves to be used by the likes of you. You have to use your own, raw power to obtain the weapon of your choice. It’s all down to you, and a modicum of luck.”\n\n“During the seventh rain, maybe I can find an Earl weapon. After that, there might be Marquis and Duke. But they are extremely rare, and that really will depend on your luck.”\n\nAfter Black Steel said this, he ignored Han Sen. He took off in the direction of a volcano.\n\n“Where are you going? Han Sen followed him.\n\nBlack Steel seemed okay with this. Han Sen thought following a guy who knew the way might be better than venturing out on his own. This way, he could definitely learn more.\n\n“Let’s go to the Knife Grave. There might be knives of a higher-tier there,” Black Steel said as he walked.\n\nSeeing Han Sen follow him, he stopped and asked, “Why aren’t you looking for them by yourself? Why are you following me?”\n\n“It’ll take a while for things to reach the seventh round of knife rain. If I come with you, I can learn stuff from you. I will go find them by myself once we reach the seventh rain.” Han Sen laughed.\n\nBlack Steel hummed and said, “I’m afraid you might not even last seven rounds.”\n\nHe might have said this, but there was no sign that Black Steel actually wanted to remove Han Sen from his presence. He was headed towards the volcano. He was headed to Knife Grave.\n\nThey walked side by side, and when they reached the volcano, Black Steel threw a knife at Han Sen. “You are lucky. This is a Baron knife for you. It is quite rare to find on the first round. With this, you should be able to last a few rounds extra.”\n\n“Thanks.” Han Sen swung his knife. The knife was smooth to wield.\n\nBlack Steel ignored him and kept walking to the volcano. When he was half-way, he found another Baron knife.\n\n“It looks like you have an interest in knives,” Han Sen said with curiosity. The knife did not have the word Baron written down on it So, amidst all the knives that were there, he couldn’t distinguish one from the other. Black Steel seemed to be able to tell with just a glance. That meant he was probably pretty good.\n\nBlack Steel answered, “I have practiced knife skills since I was young, and our family produces knives, anyway. So, I can determine the quality with ease.”\n\n“Good,” Han Sen thought. He then said, “If you are that good, why don’t we co-operate? You select a knife for me.”\n\nHan Sen thought there were too many weapons, as they were everywhere. Finding a good quality one would be like searching for a needle in a haystack.\n\nWith a professional, things would go much better.\n\nBlack Steel rolled his eyes and said, “I help you pick and you do what?”\n\n“I will block some of the knife rain for you,” Han Sen said.\n\nBlack Steel lifted his lips and ignored him. He sat down on a rock and placed the knife on his leg. He closed his eyes and waited for the next round to begin."
}