{
    "chapter": 2276,
    "title": "Hell Bridges",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2276",
    "text": "Mister White explained, “That bird is called the Death Crow. It leads the living through the cycle of death. It might seem like a dead-end, but it is certainly a road we will be able to survive. This is the only bridge, out of the thirteen of them, that can lead us safely to the other side. Going through life and death, yin and yang, the Sacred Leader was a very unique individual. If I hadn’t researched the Sacred Leader’s life and learned that he was reborn nine times, I would have never have assumed that this was the correct path to take.”\n\n“You are very smart, Mister White. Even the Sacred Leader’s secrets are known to you,” murmured a woman’s voice. Han Sen and Mister White both jerked in surprise.\n\nThey turned around and saw Fox Queen approaching from behind. She had caught up to them very quickly.\n\nMister White’s face looked glum. Clearly, he had never imagined that Fox Queen would catch up with them so quickly. If she didn’t possess Mister White’s skill at calculating the correct path, it shouldn’t have been possible for her to simply guess the correct way each and every time. There was no way she should have been able to follow them.\n\nSuddenly, Mister White seemed to understand something. He looked down at his own body.\n\nFox Queen laughed. “You don’t need to look. I left a spray on you, a specific scent that only a Shapeshifting Fox could follow.”\n\nFox Queen then ignored Mister White, who was now looking green in the face. She stared at Han Sen. “Good brother, we meet again! Did you miss your big sister? I sure missed you!”\n\nHan Sen was gripping the bird’s nest tightly as he started to step away. He was next to the hell bridge. He smiled at her. “I missed you, big sister, but I would have been happy never seeing your face again.”\n\nFox Queen smiled and said, “In that case, you must be disappointed. But since we’re both already here, shouldn’t you do something nice for your big sister who cares so much about you?”\n\n“You want this, you mean?” Han Sen pulled out the stone plate. He held it comfortably in one hand.\n\nFox Queen’s eyes brightened, and she smiled. “Little brother! You really do understand your big sister so very much. You are so cute! I really didn’t want to brutally murder you. If you give it to your big sister, how about I keep you alive?”\n\n“Sure, but if you want it, you will have to chase me. If you catch me, I will give it to you,” Han Sen said, then he stepped onto the hell bridge with the blood kirin.\n\nThe muscles in Fox Queen’s face tensed, but it was too late to stop Han Sen now. She flashed forward to the bridge, but she didn’t have the guts to step on it.\n\nMister White was shocked, and he shouted, “Come back! You cannot go across the hell bridge!”\n\nMister White knew he was wasting his breath, though. The hell bridge meant hell power, and just like he had explained, it was a force from a different dimension.\n\nThe moment Han Sen had stepped onto the bridge, he had entered a new dimension. No matter how loudly Mister White shouted, he knew Han Sen couldn’t see or hear him anymore.\n\n“Mister White, is there any way we can walk this bridge?” Fox Queen was staring at Han Sen and the blood kirin.\n\n“Even deified elites might die there. Do you really think he can pull through?” Mister White had a wry smile.\n\n“What a shame.” Fox Queen looked at Han Sen and sighed. She didn’t know if she was feeling remorse over the loss of Han Sen himself or the stone plate she coveted.\n\n“Mister White, you can go on ahead,” Fox Queen sad distractedly, gesturing dismissively at him.\n\nMister White felt glum. He looked at Crime, then at the black bridge of life and death.\n\nFox Queen watched Han Sen for a while longer, then stepped onto the life and death bridge.\n\nWhen Han Sen had stepped onto the hell bridge, his vision changed almost immediately. He had been able to see the end of the bridge clearly, but once he set foot on it, things changed.\n\nThe bridge stretched on and on without an end in sight. Aside from the bridge and the lake, nothing else occupied his vision.\n\nHan Sen couldn’t see the other twelve bridges or any of the teleporters. He couldn’t see Fox Queen or Mister White. It was as if the bridge was residing in a plane of existence, all on its own.\n\nFurthermore, the Hell Ghost statues on the bridge came alive, and they all looked like real devils. They hunched atop the rails, and their purple eyes glared at Han Sen as if they were going to swallow him alive.\n\nTheir bodies were wreathed in purple fire, and there were so many of them that the whole bridge was wreathed in a chain of purple flames. It was an unsettling sight.\n\nHan Sen held up the bird’s nest as he went along. He looked as far down the bridge as he could, but he couldn’t see the grand Hell Ghost statue and Yisha in the middle anymore.\n\nHan Sen gritted his teeth. He clutched the bird’s nest tight and moved forward with the blood kirin.\n\nHan Sen believed Yisha must have had a reason for selecting the hell bridge. Plus, Fox Queen was there. That meant Han Sen didn’t really have a choice in the matter. Walking across another bridge with her on his heels might have been more dangerous.\n\nHan Sen moved slowly down the bridge, holding the bird’s nest defensively. The Hell Ghosts atop the rail continued to stare at him, their eyes following him as he walked. They leered at Han Sen and the blood kirin.\n\nPerhaps they were scared of Han Sen’s bird’s nest, and that was why they had decided not to follow. They simply stared at the pair.\n\nHan Sen walked along the bridge for a while, but he soon started to feel poorly.\n\nHan Sen had the bird’s nest protecting his body, but he noticed that something ominous was still happening to him.\n\n“The bird’s nest is unable to block the hell bridge’s power?” Han Sen looked down at his body, and also the body of the blood kirin. He frowned.\n\nHe and the blood kirin were dyed purple. The further he walked, the deeper the color became across his skin.\n\nThe blood kirin had previously looked red, but not even it could block the dyeing effect of that purple color.\n\nAlthough Han Sen couldn’t tell how the purple air might affect their bodies, it obviously wasn’t something that boded well.\n\nHan Sen stopped. He used his Blood-Pulse Sutra and his Jadeskin, but he couldn’t remove the purple air from his skin. And although they had stopped, the purple air continued to grow stronger.\n\nHan Sen summoned his gold Demon Bug King Bai Sema, but that proved to be useless, too. The purple air was still able to penetrate the gold Demon Bug King Bai Sema and dye him and the blood kirin.\n\nHan Sen looked at the egg that the little red bird had turned into. There was no purple air permeating it, and that made Han Sen feel a little relief.\n\nIf the little red bird’s egg wasn’t infected, then that meant there might be a way to deflect the force. It wasn’t invulnerable.\n\nHan Sen looked back and noticed that he could no longer see the way he had come. There was no end, and Han Sen gritted his teeth."
}