{
    "chapter": 1022,
    "title": "Meeting Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1022",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen’s body surged with red fire, and the bugs that swarmed around Wang Yu were blackened and burnt. The man had been saved, but only barely. He could not stand up, let alone fight.\n\nChen Hu was next in line to suffer, though. He screamed, and Han Sen watched as he fell to the ground. A fireball was sent his way, incinerating the hungry bugs that sought to do him harm.\n\nHan Sen was managing for now, but he knew he couldn’t save everyone.\n\n“Bao’er get these bugs!” Han Sen pleaded, but the baby did not move. Her eyes seemed fixed on something.\n\nHan Sen knew he could escape and save his own hide, but he knew that would only result in the deaths of the people he had now spent much time with. Chen Hu, Lin He… they’d all die a gruesome death.\n\nLin Weiwei had been safe in the armor, but that too was now riddled with cracks. It wouldn’t be long before that broke, exposing her to the ravenous hordes of insects.\n\nBao’er continued looking in the same direction, not bothering to summon the gourd.\n\nHan Sen suddenly heard an explosion in the sky above. A shockwave followed, almost knocking the fighters off their feet.\n\nIt was a howl, and it was familiar. It was reminiscent of the howling of a wolf, but it wasn’t quite the same.\n\nWhen they were on Ghost Mountain, the purple wolf super creature heard this sound and left Han Sen and his people be.\n\nHan Sen suddenly thought he might receive protection from the creatures, after the howl.\n\nBut the howl, as loud as it was, meant whatever made it was close. Han Sen wasn’t sure what would happen next.\n\nAnd yet, nothing did. After a moment of anticipation, the bugs merely continued their onslaught without reprieve. It was disappointing, to say the least.\n\nBut in the next second, silver lightning tore the skies asunder. Its presence quickly surprised everyone, knocking them down to the ground.\n\nAs their hope had just started to wane, silver lightning descended from the sky like a river.\n\nThe bugs in the path of those lethal webs of windborne fire were destroyed.\n\nNeedless to say, it was shocking. Huddled together, everywhere outside their small portion of land was being ravaged by what felt like world-ending chaos.\n\nAll the bugs that sought to kill them were promptly electrocuted.\n\n“No way…” A thought flashed through Han Sen’s mind, but it was so crazy, he wasn’t sure whether or not he was a fool to believe it.\n\nThere was a small shadow in the direction Bao’er was looking. It was headed towards them, emerging from beyond the streams of lightning.\n\nIt was a small, silver fox. It approached them slowly, with grace and elegance.\n\nNo lightning touched it; it was as if the curtain of silver fire parted for its entrance.\n\n“No way…” Han Sen was speechless.\n\nHan Sen now understood why the wolf king left them alone, and why the creatures had all started to be nice towards him. It was because something had been watching over him the entire time.\n\n“Little Silver!” Han Sen shouted, running to greet his old friend.\n\nThe lightning broke away for Han Sen’s approach. He dropped to his knees before the fox and planted a big kiss on the much-missed creature’s forehead. Then, he ruffled the fur on his head.\n\nThe silver fox shoved his muzzle towards him and licked Han Sen’s hands. Then, he buried his head in Han Sen’s chest.\n\nBao’er squinted her eyes, looking furious at the silver fox. She seemed jealous that something else was obtaining Han Sen’s love.\n\nThe bugs had all gone. When the silver fox looked at Bao’er, it looked as if there was friction in both their eyes and an ignition of sparks.\n\nBut one second later, they looked away from each other.\n\nFortunately, Han Sen did not notice this brief stand-off. It was best that nothing spoiled the moment for him. Han Sen had wanted to discard the gourd once before, and had gone so far as to throw it away. But it was the silver fox that picked it up and brought it back, indicating Han Sen should hold onto it.\n\nStrangely, after the occupant of the gourd emerged and met the person who had given it a father, they did not seem friendly.\n\nHan Sen wished to say something to the silver fox, but suddenly, there was another explosion. A giant, golden bug emerged from the ground in a haze of soil.\n\nIts lower body was like that of a snake, whereas its upper body was plated with a carapace that was not unlike a centipede. The creature’s head was like a scorpion, and a stinger-tipped tail swung from its back.\n\nIt looked evil, like a demon freed from hell itself.\n\nAmidst the golden light that reflected from its shiny plating, the hideous creature roared. Chen Hu was grabbed and pulled across the disheveled field; as he went, soil and grass-stained his clothing.\n\nAfter a roar, the golden bug’s tail started to move. It swayed from left to right, as if it was taking aim at Han Sen.\n\nBoom!\n\nNine streaks of golden light were cast towards Han Sen, which twisted the very composure of space.\n\nThe silver fox leapt in front of Han Sen, amassing a massive vortex of silver power. It transformed back into the fierce lightning fox it could be.\n\nBefore the golden beam could reach its target, the silver fox roared as a big beam of silver lightning blazed back to counter it."
}