{
    "chapter": 2476,
    "title": "Jadeskin’s Second Tier",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2476",
    "text": "Killing! Crazy killing!\n\nHan Sen didn’t know how many unicorns he had killed so far, but after dealing out so much death, it seemed that a hazy red film had formed over his vision.\n\nKatcha!\n\nThe head of a King class black unicorn was hewn open by Han Sen. As blood poured out of the severed head, Han Sen rammed a hand into it and pulled out a crystal. He put it in his mouth.\n\nIt was the King class unicorn’s xenogeneic gene. Han Sen immediately swallowed and refined it. The gene filled up his King class genes and restored his energy.\n\nAfter having to kill so many enemies, he had lost a lot of his strength. He couldn’t use his Dongxuan Armor to recover his power quickly, so he absorbed power from space itself. But even then, it wasn’t enough to sustain him in a fight like this.\n\nInstead, Han Sen used Consume to quickly refine the King class gene. The power kept Han Sen in the game. He would have collapsed by now if he hadn’t done this.\n\nThe whole cloudscape of the Tianxia System had been painted in blood. The unicorns had no fear of death, and that was especially true of the seven unicorn Kings. All of them wielded godlights, and the rainbow area they produced was causing Han Sen a lot of trouble.\n\nBecause Han Sen had the Blood Eye Evil God beast soul, he could transport himself into the eyes of one of the unicorns if he found himself in danger. If he hadn’t done that every now and again, he would have already been skewered by the seven unicorn Kings.\n\nHan Sen had tried jumping into the eyes of the seven unicorn Kings. He wanted to attack them from inside their eyes, to see if he could kill them from within.\n\nBut the eyes of the seven unicorn Kings were special. The eyes of each unicorn King were a different color, and it was impossible to see their pupils, irises, or even the whites of their eyes. Something about their multi-colored eyes kept them from reflecting Han Sen’s image. So, he couldn’t use his Blood Eye Evil God beast soul on them.\n\nSeven half-deifieds were now attacking him. An ordinary King would have long since been killed by their rainbow-colored power. Han Sen depended on the Blood Eye Evil God beast soul, and that was how he was able to last so long without being hurt.\n\nAfter Han Sen consumed another King class gene, he suddenly had a weird announcement play in his head.\n\n“King class genes have reached 100. Battle body area is ready for evolution.”\n\nHan Sen grinned. He had absorbed many King class genes before, and after absorbing those last few, his collected sum had now reached a hundred. It was just as he had expected, too. One hundred King class genes could increase the tier of his area by one.\n\nWithout any hesitation, Han Sen chose to level up his Jadeskin Area. He couldn’t use his Dongxuan Area unless he was using Dollar’s identity, so Jadeskin had become his primary power.\n\nHan Sen used the genes to level up his Jadeskin Area, and when he did, a cool feeling flowed through his flesh and bones. It was like his body was a dried-up riverbed, and water was suddenly flowing through it once more.\n\nAfter the modification of his genes, his cells started to change, making Han Sen’s body glow. He looked perfect, like some newborn deity.\n\nThe fight had exhausted Han Sen, but now, he was in his best shape. No. He was doing better than he was in his best shape.\n\nPang!\n\nAn icy light covered Ghost Teeth Knife. It came down on the head of one King unicorn, and it cut the third-tier King and its area in half.\n\nHan Sen began murdering everything around him. It was like he was in a herd of sheep. When his knife light flashed, many unicorns died in an instant.\n\n“He increased his area level during a fight?” All of the race elites were frozen.\n\nIf a fighter increased their King area, their personal strength actually decreased briefly during the process. Leveling up an area modified one’s genes to spark an evolution of one’s cells. The body was slightly weakened while this change was underway, and although it was nothing life-threatening, it was best to choose a safe and secure location while undergoing such a process. Accidents were best avoided.\n\nThe idea of fighting while leveling up an area at the same time was simply ridiculous.\n\nThe evolution of Han Sen’s area had happened too fast. Most of the changes happened within seconds. Evolving at that rate wasn’t rare in the geno universe, but it usually only happened with primitive creatures. The genes of a primitive creature had unknown possibilities, and under the influence of an exterior force, they could evolve quickly.\n\nThe higher the level of the creature was, the more solid their genes were. It became harder to evolve, so the speed of every evolution was slower.\n\nHan Sen was already King class, and he moved up an entire tier in just a second. To the elites who were watching the video stream, it seemed unbelievable.\n\n“Maybe it’s because his genes aren’t stable. There are way too many possibilities, and that is why he evolved so fast,” many of the King class people thought. Regardless, they couldn’t avert their gazes from Han Sen.\n\nJadeskin had achieved its second-tier area. Han Sen’s body’s power and speed were increased, but it still wouldn’t be enough for him to beat that seven-colored unicorn.\n\nPang!\n\nHan Sen was fighting like mad. A crack appeared in the sky, and it was coming his way.\n\nPang!\n\nA huge number of unicorn bodies were suddenly torn apart by that crack in the fabric of space. Han Sen avoided its power, but then someone fell from that rent in space.\n\n“Lando!” Han Sen was shocked. Lando had apparently created the crack.\n\nLando’s dragon tattoo was flashing. There was a bloody hole in it, and the hole went all the way through Lando, revealing the clouds that floated behind him.\n\nSeeing Lando like this, Han Sen realized that things were going very badly. Lando couldn’t keep fighting that deified unicorn, and now there was a gaping hole in his body.\n\nIf Lando was killed, then the deified unicorn’s next target would be Han Sen. How could he not be scared?\n\n“Lando, are you okay?” Han Sen shouted at Lando, but he didn’t dare go closer to the man.\n\nThe deified rainbow unicorn was coming. It looked as if it had just teleported through the fabric of the universe to land on Lando.\n\nThe dragon tattoo on Lando’s body flashed. His hair was a bloody mess. His body suddenly jerked to the side and dodged the rainbow laser attack of the deified unicorn.\n\nBut his chest was still bleeding from the hole. It wasn’t healing.\n\nLando looked calm and composed, but Han Sen could tell that his power was waning. It was still impressive that a half-deified had done battle with a deified creature for so long, though. But if he died, Han Sen would be left to face the deified unicorn alone. That would be extremely dangerous.\n\n“Try to live. Use everything you have to live!” Lando was floating in the air. His eyes didn’t look frightened, and he didn’t look at the bloody hole in his chest. He just went on pretending it didn’t exist.\n\nHan Sen then remembered Lando mentioning that his body had been destroyed and he could no longer feel pain."
}