{
    "chapter": 2224,
    "title": "Educating a Noob",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2224",
    "text": "After returning to his room, Han Sen called out to Little Angel. He told her and the rest of his companions to be careful and to not venture out alone anymore.\n\n“Is Edward really that scary? If he does not dare come here and steal the item, what do we have to be afraid of?” Ji Qing looked rather confused.\n\n“It’s the fact that he does not come and steal the item that is most scary. But regardless, before this matter is sorted out, no one should be going off on their own.” Han Sen spoke with gravitas.\n\nThe next morning, Han Sen brought his team back to Lava Valley to continue their search. But this time, he had no choice but to bring Bai Wei with him. It meant the task at hand would be more unpredictable with a factor of unknowns.\n\nFortunately, Bai Wei was not one to talk much. All she did was follow them, behaving as if she hadn’t the slightest concern for what was going on.\n\nThey had only just arrived in the region of Lava Valley when Bai Wei stepped forward and ahead of Han Sen. “From now on, I will be the leader of this team,” Bai Wei said in a very commanding tone to Han Sen.\n\n“Why?” Han Sen looked as if he wanted to burst out laughing at her.\n\n“You should familiarize yourself with my identity,” Bai Wei said coldly.\n\n“What identity? I only know you are the biggest noob of this team, and you are the least qualified to be a leader amongst us.” Han Sen laughed at her and didn’t say anything that suggested he knew anything about her.\n\nWhile pretending to be unaware of her identity and title, Han Sen was free to treat her like a noob. If he made it clear that he knew who she was, then that would make it look like he was just bullying her. There was a difference.\n\nBai Wei was stunned by the rebuttal. She looked at Han Sen and nodded. “Okay. In that case, I—as a noob—will challenge you. If you lose, I will become the leader of this team. You and them will then have no choice but to obey me.”\n\n“No.” Han Sen rejected her proposal.\n\n“Are you scared?” Bai Wei looked at Han Sen coldly.\n\n“You are the weakest in the team, whereas I am the captain. I am the strongest that exists here. If you want to challenge me, I would have to see you beat my companions first.” Han Sen pointed to Han Meng’er and the others.\n\n“Sure. Bring them all on,” Bai Wei said coldly. She was not very fond of what Han Sen had said, though.\n\n“A noob is a noob. A noob doesn’t know who the boss is.” Han Sen sighed, and then he turned to Han Meng’er. “Meng’er, teach this noob how to respect her superior. Don’t hit her too hard, though. We don’t want to kill her.”\n\nBai Wei, upon hearing what Han Sen had said, felt mad, but she remained the same on her exterior and just coldly laughed. “You won’t dare fight me yourself, so instead you get a woman to help you?”\n\n“Your imagination is far too wild. This is my daughter. If you can beat her, then you are free to challenge me.” Han Sen laughed.\n\nHan Meng’er, after hearing Han Sen, stepped forward and out of the group. She walked in front of Bai Wei.\n\nBai Wei did not care about Han Meng’er, and neither did she care much for Han Sen. She thought Han Sen barely had the power to put up any kind of a fight against her. She believed her opponent was a meager subordinate of Han Sen, and with her looking as young as she did, she did not think there was anything to worry about.\n\nWhen Han Meng’er pulled the string of her bow, Bai Wei looked dim. Her whole body took on the image of a fighting leopard. She stared right at Han Meng’er, no longer with a look of disdain and underestimation.\n\nBai Wei was cocky, but she wasn’t dumb. In fact, she was a very smart individual, and as soon as Han Meng’er pulled the string of her bow, she felt threatened, so she gathered up might in her fists.\n\nHan Meng’er cared nothing for Bai Wei’s reactions. She merely pulled back her string the farthest it could go, and when she let her finger go, the arrow flew quickly before Bai Wei’s face.\n\nBai Wei looked cold and threw a punch toward the black arrow. It was the Extreme King’s Final Punch. It was in the top five strongest fist skills in the universe. The punch exploded from her hands, and she could have easily sundered an entire mountain if she were to hit one.\n\nSeeing that it was going to collide with Bai Wei’s fist, the arrow suddenly disappeared from Bai Wei’s vision, and when it reappeared, it was piercing her belly. Bai Wei’s face remained unchanged. When her body staggered back, her fist became incredibly hard to hit the arrow. The whole action was performed very smoothly, and there wasn’t a moment of hesitation or nervousness.\n\nBoom!\n\nA black sun rose where she stood, and Bai Wei actually ended up getting blasted away. Her armor was broken, and some of her hair was singed. Only the hair underneath her helmet was saved from burning. She would have been made bald otherwise.\n\nBai Wei’s face changed. A fire of golden light suddenly wrapped her entire body, so the explosion did not destroy her armor completely. But even so, blood dripped from the corner of her lips, and that meant she was injured.\n\nBai Wei never would have thought that an arrow fired by someone from a backup team could be as strong as that. Not even the Extreme King’s Final Punch was as strong as that arrow. She really couldn’t believe what had just occurred, but it really was the truth, and Bai Wei had lost her advantage. Han Meng’er then plucked the string of her bow over and over. Arrows flashed forward like thunderbolts.\n\nBai Wei was suppressed by the next few arrows, and there was no chance of her closing the gap with Han Meng’er. The geno arts of an Extreme King were incredibly strong, and yet Bai Wei’s Extreme King Final Punch was a little weaker than Han Meng’er’s Break Six Skies and Destroyed Bible fueled arrows.\n\nShe was not weak enough to get wrecked, though. Han Meng’er’s arrow kept Bai Wei on the disadvantage, but she was not losing. She was strong, and very few Marquises would be able to defeat her.\n\n“Enough.” Han Sen signaled for Han Meng’er to fall back.\n\n“There is no winner yet!” Bai Wei looked at Han Sen.\n\nHan Sen laughed and said, “You lost! You forced yourself to use a geno art and spend ten times the amount of power Han Meng’er used. Even so, you were unable to resist the firing of those arrows. It might be a tie right now, but sooner or later you’re going to lose. This is a competition, remember? It is not a deathmatch, so there is no need for us to continue.”\n\nBai Wei could not say anything. What Han Sen had told her was correct, so she couldn’t deny it.\n\n“If you cannot beat my daughter, then practice over the next few years. Do that, and maybe I’ll give you opportunity to challenge me.” Han Sen spoke clearly without hiding anything.\n\nHan Sen deliberately crushed Bai Wei so he could maintain his leadership of the group. If Bai Wei was to lead, Han Sen would have been unable to hunt the beast souls the way he wished to.\n\n“Just wait! I will beat both you and her,” Bai Wei said coldly. She did not continue her insistence on being leader.\n\nBai Wei was obviously not as calm as she looked, though. She looked at Han Meng’er with a complicated look. Then she looked at Han Sen. She could not believe that cold looking lady that was equipped with a bow was Han Sen’s daughter."
}