{
    "chapter": 2773,
    "title": "God Phoenix’s Request",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2773",
    "text": "After the phoenix lifted Han Sen into the air, it rocketed forward with blinding speed. This was nothing like the slow, ponderous way the bird had moved when it first approached Two Ape Mountain.\n\nBefore Han Sen could say anything, he saw that they were heading toward one of the suns in the sky. The orb glowed with power and heat as they shot recklessly toward it.\n\nThey were still some distance from the sun, but Han Sen thought that the incredible heat was about to melt his deified body. He didn’t know what would happen if he entered that glowing orb, and his heart rose into his throat at the thought.\n\nThe phoenix flapped its wings, and they shot past the sun, flying deeper into the xenogeneic space. The phoenix accelerated, leaving behind the glowing suns that hung threateningly in the sky. Han Sen looked ahead and saw, in the distant sky, a giant sycamore tree that was growing upside-down.\n\nHan Sen had seen many strange trees in his life before, but he had never seen a tree growing upside-down.\n\nThe top of the giant sycamore tree was on the ground, but its roots were growing into the sky. The roots were like a dragon’s beard, all tangled up like a large bird nest.\n\n“People say phoenixes live in sycamore trees. Perhaps this phoenix doesn’t live atop the sycamore tree, but rather, in its roots.” Han Sen looked at the upside-down growing tree with a strange expression.\n\nThe god phoenix soared up to the roots and landed deftly among them. The creature opened its beak, letting Han Sen fall into a knot of roots that looked something like a nest.\n\nHan Sen quickly discovered that the place wasn’t “like” a bird’s nest. It really was a bird’s nest.\n\nIn that bird’s nest that was composed of the roots of the tree, Han Sen saw a giant egg that was around ten meters tall. The egg was burning with the same white fire as the phoenix.\n\n“Why have you brought me here? You don’t think I look like a phoenix, do you? You’re not going to raise me as a child, are you?” Han Sen spoke to the phoenix that was now settling down in the nest.\n\n“Of course I know you aren’t a phoenix. Phoenixes don’t give birth to ugly children like you. And this, this is my child,” the phoenix said proudly.\n\n“Then why did you bring me here?” Han Sen let out a long sigh. If he was raised by a phoenix, he would become a phoenix man.\n\n“Your body has traces of a presence that belongs to a member of my race. And I must say, it is a nice one. I’m sure you must have been spending a lot of time with a youngster of my race,” the phoenix said while looking at Han Sen.\n\n“A young phoenix?” Han Sen was shocked. Then he thought of something. With a weird look on his face, he said, “She can’t be talking about the little red bird, can she? The little red bird is a hybrid, though. It isn’t actually a phoenix.”\n\nNow Han Sen understood why the phoenix was treating him differently. It was because of the little red bird.\n\n“We did spend time together for quite a while. And our relationship is solid. We are kind of like brothers,” Han Sen said seriously.\n\nHan Sen wasn’t going to tell the phoenix that the little red bird was a hybrid. If the phoenix was racist to the hybrid kind, then his special treatment would vanish.\n\nThinking about how cold and cruel the phoenix appeared when it started eating people, Han Sen shuddered. He sincerely hoped the phoenix wouldn’t have a change of heart and became callous enough to dine on him.\n\n“I thought I was the only phoenix remaining in this universe. I didn’t suspect there was another one of my kind out there in the universe.” The phoenix looked very happy, but then it said, “If you can, I hope you will be able to help me. Bring that baby phoenix here.”\n\n“I’m afraid that might be rather difficult. I have been separated from the phoenix for quite a while, and I’m not sure where it is right now… But don’t worry. If you want to see it, I will do my best to find him and bring him to you. If you guys are seeking a reunion, I will do my best to make it happen. A reunion with your family will be a beautiful thing.” Han Sen could see that the phoenix’s expression was growing a little rigid, so he quickly tried to make his voice sound more positive and certain.\n\nThe phoenix looked very happy again. “Don’t just try your best. You must bring him here.”\n\n“Don’t worry. I will make sure to complete this request,” Han Sen agreed. He wanted to trick the phoenix and leave that xenogeneic space as soon as possible.\n\nHan Sen didn’t know if the phoenix could accept a hybrid. He wouldn’t risk his safety or the little red bird’s by actually bringing it there.\n\nThe phoenix seemed very happy. It extended one of its wings, and Han Sen saw a feather that looked very fiery and white fall through the air. The feather seemed to have a life of its own, and it flew before Han Sen.\n\n“This phoenix feather is for you. It is my gift for you. If you complete my request, I will reward you with more,” the phoenix said seriously.\n\n“You are so kind. I’m more than flattered to receive this,” Han Sen said. Then, he grabbed the fire-wreathed feather in his hand. It was a true god class treasure. Even a mere feather from the phoenix would be wildly powerful.\n\nThe feather was pure white, almost transparent. The whole thing looked as if it was made of fire, but it wasn’t like a fire that Han Sen couldn’t touch. It was actually solid.\n\nThis fire feather was a small piece of an actual phoenix, but it was still only one meter long. When he held it in his hands, though, it looked like a flaming sword. Han Sen grinned widely. He could use the feather as a weapon.\n\nHan Sen was lacking a decent weapon right now. This fire feather was perfect for him. The longer he held it, the more he liked it.\n\n“A fire element fire feather. This should be quite powerful,” Han Sen thought to himself. He wasn’t going to try out the sword there in the phoenix’s nest, though.\n\nAfter he had examined the gift, Han Sen changed the subject. “Why are you looking for a baby phoenix? I think that the baby bird is substantially weaker than you.”\n\nHan Sen was speaking the truth. This phoenix had pure ancestry, and it was a born-deified xenogeneic. The little red bird was just a hybrid, and it had been very weak when it was born. Compared to a true god xenogeneic, it was 180,000 miles behind.\n\nThe phoenix sighed and said, “Breeding is difficult for our race. There aren’t many of us left, if there are any at all. Up until now, I haven’t been able to find another of my kind. I can’t believe there is a baby bird alive somewhere. For me and my race, this is great news. Once my child is born, they can become a couple. That way, they should be able to breed.”\n\nHan Sen froze when he heard that. The phoenix wanted to use the little red bird as a breeding machine. It planned for the little red bird to make babies and repopulate the phoenixes.\n\n“Hang on, I don’t even know if the little red bird is male or female,” Han Sen thought. “If they are the same sex, how will they make babies?” Han Sen didn’t say that aloud, however. He only agreed to the request, promising that he would bring the little red bird there.\n\n“If there is nothing else, I will go and search for the little red bird and bring it here.” Han Sen just wanted to get out of there now.\n\n“There is no rush. Before you leave, there is something very important you must do,” the phoenix said. Then, it spat some fire at Han Sen."
}