{
    "chapter": 2865,
    "title": "Judgment",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2865",
    "text": "When Han Sen became butterfly class and his left eye combined with the true god class Extreme King’s Overbearing Eye, he accidentally leveled up.\n\nIt was a shame he failed to achieve true god class. Although his leveling up had failed, the Extreme King’s Overbearing Eye absorbed Han Sen’s xenogeneic power. It resulted in a change. It combined with Han Sen’s xenogeneic body, turning his left eye into a true god class existence.\n\nNow, Han Sen’s whole body was mostly butterfly class. Only his left eye was true god class. It was strange. His eye possessed law power. With it combining with Han Sen’s xenogeneic power, it created some sort of mutation. It was a bit different from the Extreme King’s Overbearing Eye law power.\n\nHan Sen did not know if his true god left eye could threaten Sky Armor God, but this was a different god to the one in his house. He sensed a very dark black color inside Sky Armor God’s body. It was the color of crime. It was so dark that it was like ink. God only knew how many sins Sky Armor God had committed to have this color.\n\n“It does not matter if you are a true god or a fake god. I will judge your crimes today.” Han Sen sounded very cold. The white-and-black colors of his eyes exploded.\n\nBzzt!\n\nA black-and-white two-toned beam of light exploded from Han Sen’s eye. It shone on Sky Armor God. The beam of light looked like it was supposed to be there. Sky Armor God did not have any time to react. His entire body was covered by the black-and-white two-toned beam of light. The black beam of light became chains that entangled Sky Armor God’s body. The white beam of light became a book. It was in front of Sky Armor God.\n\nSky Armor God was shocked and angry. He tried his best to get rid of the black chains, but he noticed his entire body had been trapped by a weird power. He was unable to move.\n\n“How is that possible? In the universe, there is a power that can restrict my power. What is this power?” Sky Armor God was shocked.\n\nKatcha! Katcha!\n\nSky Armor God was tangled up by the black chains, so he could not use his power. The bone slices around Han Sen started to fall away. The purple bone slices turned into dust. Han Sen was set free.\n\n“Let me see what crimes Sky Armor God has committed.” Han Sen raised his hands. The white beam of light became an old book that landed on Han Sen.\n\nHan Sen flipped through the pages, but they were empty. There was no law inside them. There also were no scales or counterweights similar to when Han Sen was being judged.\n\nThe moment Han Sen received the book, his brain had many images playing like a movie. They kept flickering in his head. They made Han Sen understand something. “Sky Armor God, you have committed serious crimes. You should die.” Han Sen raised his head and wrote down the word “die” in his book. The book suddenly flew up. The word “die” started to shine. It became an executioner’s sword that slashed toward Sky Armor God.\n\n“How dare you, a low-life creature, judge a god like me.” Sky Armor God was furious. Beneath the black chains that bound him, Sky Armor God was unable to move his body.\n\nKatcha!\n\nThe executioner’s sword came down. It cut off Sky Armor God’s head, resulting in blood immediately squirting out. The creatures in the universe were frozen. They could not believe what they were seeing. Sky Armor God, who was so powerful earlier, had been simply decapitated like that.\n\nIn Sky Palace, the woman opened her mouth in shock. “I… Am I hallucinating? Sky Armor God was killed just like that?”\n\n“That was like law power, but it was somewhat different.” Sky Palace Leader also looked confused.\n\nThe Extreme King were very surprised. Bai Buyi was shocked. “That power looked like the second leader of the Extreme King’s Overbearing Eye, but it was still quite different. It is scarier.”\n\n“Can law power judge a god spirit? If we knew that, we should have let our children and grandchildren learn the second leader’s geno arts.”\n\n“Who is this Dollar? He is too strange. Can he just kill a god spirit like that?”\n\nThe universe was shocked to its core. Ordinary creatures did not know how powerful god spirits were. Only the old antiques knew how scary god spirits were. Every one of them looked surprised.\n\nThe execution ended. The black chains and old white book were gone.\n\nIt did not make Han Sen feel relaxed. He still stared at Sky Armor God’s body. Han Sen saw the body outside of the skeleton armor was melting. Sky Armor God’s body looked like Deep Abyss Knight again. After Han Sen slew Sky Armor God, the announcement he got was for killing a butterfly Deep Abyss Knight. It was not for killing Sky Armor God. Han Sen knew why this was happening. The crime Han Sen saw did not belong to Sky Armor God. It belonged to the true owner of the body, who was Deep Abyss Knight. The law power could only judge Deep Abyss Knight’s body. It was unable to kill Sky Armor God. It made Sky Armor God separate from Deep Abyss Knight. He had become a god spirit with nothing. He left Deep Abyss Knight’s body. Ordinary creatures could only see a purple bone armor rise to the sky. They could not see the purple bone armor with the god spirit Sky Armor God. “Dollar, this is not over yet,” Sky Armor God angrily said to Han Sen. He sent the god personality back to Sky Armor God’s temple.\n\nAfter the god spirit and god personality combined with the creatures in the universe, they could not just separate again. He forced it to separate. Because of that, he was damaged. He could no longer fight. One could have said he was in a bad situation. It was worse than when Knife King stole his rib bone.\n\nWithout a universe god body, he could not do anything to the creatures of the universe. Therefore, there was no point in him staying any longer. “It is not over yet,” Han Sen coldly said. “Only one of us will live.”\n\n“It will not happen to you,” Sky Armor God coldly grunted. He ignored Han Sen. He just wanted to return to Sky Armor God Temple.\n\nHe was no longer able to attack creatures in the universe, but creatures of the universe could not damage him. Thus, Sky Armor God was not worried Han Sen could hurt him.\n\n“Dollar, I am going to make you unable to die or live.” Sky Armor God was madly cursing him. He was forced to separate from his universe god body. The damage he incurred was worse than when Knife King stole his rib bone.\n\nUpon thinking of that, Sky Armor God, menacingly looked at Han Sen. He was instantly shocked. Han Sen’s body had a giant, green god spirit. It was holding Sky Radish God Lance. It came before him.\n\n“Sky Vine Radish… No!” Sky Armor God screamed, but he could only shout no. The big green god spirit clutched the Sky Radish God Lance to break his spirit body. The god personality fell. Han Sen took it.\n\n“God spirit hunted. Found god spirit gene.”\n\nOther creatures were unable to see Sky Armor God and Sky Vine Radish. After seeing Han Sen judge Deep Abyss Knife, a purple bone armor rose from Deep Abyss Knight’s body. It looked like Han Sen threw the green lance and purple bone armor fell from the sky."
}