{
    "chapter": 2422,
    "title": "Scarlet Eye",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2422",
    "text": "Night Wind’s face was tight and worried, and he had also brought a video back with him.\n\nWhen that video was played, Han Sen understood Night Wind’s expression.\n\nThe beginning of the video showed a stone path, which must have been the road that had been dug up.\n\nHan Sen didn’t know how they chose where to start digging, but it clearly wasn’t a random decision. They had somehow figured out exactly where to start digging.\n\nThe Hell had controlled large-scale dig sites. When Miss Mirror and her people arrived, they quickly reduced the scale of the operations. Now excavation was being conducted in three locations, and the one in the middle had to have been where they began.\n\nAs the video went on, it revealed many complicated stone paths that branched off until the stone road opened up to reveal a large room. There, Han Sen found himself looking at the statue Miss Mirror had mentioned.\n\nIt was ten meters tall. It wasn’t very big when compared to some of the statues Han Sen had seen before, but it was pitch-black, and it had the same texture as the rocks around it.\n\nThe statue featured a man sitting with his legs crossed. His arms were crossed, as well, making an X shape. The eyes of the man were just as Miss Mirror had described. There were two pupils in each, and they were red.\n\nBehind the statue were many arms and hands. They formed together to create the large shape of a torch. Every hand also featured a red eye with two pupils.\n\nLooking at the statue was disconcerting. It was like there was an endless tide of weird eyes were staring out of the screen. Han Sen was only looking at them through the video, but even so, he got goosebumps. A chill passed over Miss Mirror and Night Wind as well.\n\nThe video didn’t hang around the statue for long. It moved forward, revealing something that was even more surprising.\n\nBeyond the statue, the stone path vanished into a cave. It was a rough hole that looked like it had been dug by bare hand or claws.\n\nThe walls of the stone tunnel were smeared here and there with blood. Claws and talons were carved into the surface of the tunnel. As the video progressed, more and more blood was revealed.\n\nThe blood slowly took over every surface, turning the black cave red. The sight made Han Sen’s stomach crawl.\n\n“That cave couldn’t have been dug by hand, right?” Han Sen couldn’t help but ask.\n\nAlthough the Extreme King didn’t give much respect to the workers, they only hired people who were at least Marquises. Those people were considered strong within their own races. Their weapons might not have been legendary treasures, but they should have been decent. Even if they didn’t bring their own tools, the Extreme King would have provided them with xenogeneic treasures. They wouldn’t have had to use their hands to dig that tunnel.\n\nBut based on the marks and scratches left behind, the tunnel was obviously the work of claws and hands. It hadn’t been dug out with tools.\n\nMiss Mirror and Night Wind looked at the video with perplexed stares. They didn’t answer Han Sen’s question.\n\nHan Sen knew it was true even without their confirmation, though. He looked at the video for a bit longer, and he soon saw a dead Marquise with the head of a cow. Instead of hands, there was only a twisted mass of gore at the end of the man’s arms. Bits of bone protruded through the scraped flesh.\n\nSeeing this scene, Han Sen couldn’t stop his imagination from replaying what had happened. The cow-headed man had dug frantically with his hands, injuring its fingers on the hard stone. And yet, it didn’t stop. It kept on digging and digging with frenzied energy. Eventually, the man’s hands had been ground to nubs. He had bled out and died.\n\nThe video didn’t stop there, and the gristly sight replayed itself over and over. Han Sen saw more and more dead bodies scattered throughout the cave.\n\nThey were all in the same position. They leaned forward, pressing their destroyed hands against the walls. Some had shredded their palms, whereas others were missing entire arms.\n\nDespite having died, they still maintained their digging positions. Their faces looked very passionate as if they were excited about what they were doing, but amidst that passion, there was also the presence of fear. It was a terror that lay deep in their bones.\n\nHan Sen couldn’t explain all the emotions he saw etched across those dead faces, but his stomach clenched and a cold sweat beaded across his back.\n\nThe eyes of the dead workers were all open, exposing their dual red pupils.\n\nThe stone path was no longer really a path. It was like a long grave dug out with blood. So many Dukes and Marquises had died up and down that stone path. And the further the path went, the worse the sights were.\n\nAt the end of the video was a stone door. Just as Night Wind said, the double door looked like the entrance to a city. Both sides of the door were crimson, like they’d been made of solidified blood. There were also many semi-circular marks across the door—scrapes left behind by fingernails.\n\nThe door was ten meters high, and because they had dug right up to the surface of the door, only rock surrounded the doorframe. It was impossible to see what was beyond those doors.\n\nBut what lay before the door gave Han Sen chills.\n\nMany of the workers were stretched out before the door like people trying to escape from the demons of hell. Their dead arms were extended painfully in front of them, trying to reach some non-existent salvation. Their nails were broken and their bones were chipped. The blood on their hands had dyed the door, but none of them had been able to open the door.\n\nThe workers had lasted so long, but they had all died before this door. Blood pooled around the bodies before the evil door. The door stood solid and unmoving, like the entrance to hell itself.\n\nNight Wind’s face looked terrible. “They are all dead. No one is left alive, and they had all gone insane by the end. They just kept digging and digging. Those rocks are hard, and they are incredibly difficult to dig, even with tools. When they used their fingers to dig, they began bleeding quite quickly. But when the blood touched the stone, it was almost as if the stone softened. They could dig it up, but it still hurt them. They kept digging until they bled out.”\n\nNight Wind’s voice trembled, even though he was a deified that had witnessed many life and death scenarios. What he had seen would give even him nightmares.\n\n“This place is cursed.” Han Sen felt sick. He had the urge to just grab Bao’er and flee.\n\nAlthough they had the red bird with them, there was something that was simply wrong about this place. Even Miss Mirror, who was a strong deified, had been affected. There was every chance the red bird might not escape whatever power was doing these horrible things.\n\n“Run! We must run! We cannot stay in this horrible place any longer,” Han Sen decided. He was going to leave this place, no matter what. He would leave, even if Miss Mirror sought to stop him.\n\n“Your eyes!” Miss Mirror suddenly whispered in dread, looking at Han Sen’s eyes. Fear filled her face.\n\n“What happened to my eyes?” Han Sen’s heart jumped. He knew this was bad.\n\nWith no hesitation, Han Sen waved his hand to cast a water mirror so he could look at himself.\n\nAt that moment, Han Sen felt like fear had sunk deep into his bones. His black eyes had turned red, and furthermore, a fissure was running down the center of each pupil. The circular pupils became gourd-shaped, and they were slowly splitting in half."
}