{
    "chapter": 3037,
    "title": "Lotus God Temple",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3037",
    "text": "Han Sen wanted to explain he was not Mister Yang, but Mister Yang walked in, bowed to Han Sen, and said, “Mister, there is something wrong in the garden. You should go take a look.”\n\nHan Sen looked at Mister Yang. He looked natural as he talked to Peaceful. He said, “Lady Peaceful, please wait here. I am coming.” Peaceful did not mind and said, “Sure, Mister Yang,”\n\nHan Sen followed Mister Yang into the garden. He suddenly kneeled and said to Han Sen, “Please save me, Mister.”\n\n“What do you mean?” Han Sen guessed Mister Yang saying this had something to do with Peaceful.\n\nMister Yang quickly said, “That Peaceful is the child of Dragon Song City’s leader. I once heard Mister Meng say Dragon Song City’s leader is just like him. They were both looking for the gene egg King Qin left behind. She has looked for me because she has heard the news. She wants me to take them to find the blood dragon’s return to nest place, but there are no more gene eggs. If I take them there, they will kill us. Please help me and save my life!”\n\n“If you do not want to go, you can just reject Peaceful,” Han Sen said.\n\nMister Yang shook his head. “Mister, you have no idea. Nobles have the right to kill commoners. My blood is not pure. I did not receive blood from a God Spirit. I am just a commoner. I learned some geography to get by. My reputation is low. Nobles like Dragon Song City’s leader, although they are not the leader of this place, they would only have to pay a minuscule price for the right to kill me. Ancient God City’s leader would not dare argue with Dragon Song City’s leader over the sake of a commoner. How can I reject it? I need you to save me. I am willing to be your slave and servant if you save my life.” After that, Mister Yang kowtowed on the floor again.\n\nUpon hearing him, Han Sen frowned. The Qin Kingdom was quite developed, but the laws were still very primitive. It was far worse than the Alliance even. It was just like the universe.\n\nThe seven big kingdoms were human kingdoms. This geno universe was totally controlled by human power. Even Qin Xiu was a pure human.\n\nThat made Han Sen think about a lot of things. The antimaterial world was a world based on humans, and the geno universe did not have any humans. Until Qin Xiu entered the geno universe and had the crystallizers combine with his genes, there were not any there. It was only after that was done did humans start appearing in the geno sanctuaries.\n\nGod Spirits had a deep history with humans. They wanted to suppress humans. If it was because of Qin Xiu, that made no sense.\n\nMany races wanted to kill the gods of the geno universe, but there were no other races that invoked the ire of the God Spirits like humans did.\n\nThe most important thing was that in the legends, Qin Wan’er was dead. Qin Xiu used all kinds of ways to bring her back to life. Yet she was alive in the geno universe. Therefore, it made little sense.\n\nThe weird thing was that Han Yufei told Han Sen that Qin Wan’er was a member of the Witch race. She was not of the same race as Qin Xiu. That was making even less sense. There had to be an important crux to this issue that currently eluded Han Sen. Although Han Sen did have a few guesses, he could not figure things out just yet. He did not know if he was right or wrong. “How am I supposed to save you?” Han Sen thought that if he wanted to learn more about the world in a short time, having a local follow him would be much better. If things were not too hard, he did not mind helping him.\n\nMister Yang awkwardly said, “I moved from the other city. Not many people saw me. I don’t think Peaceful and Dragon Song City’s leader know what I look like. If you want to save me, just use my identity to reject them. If you do this, you will undoubtedly find yourself in hot water with them.”\n\n“You are smart. You can make me your scapegoat, but then what? Will you leave and hide?” Han Sen lifted his lips as he spoke.\n\n“Of course not, I know you have god powers,” Mister Meng said in fear. “You were able to kill Mister Meng with one hit. The Dragon Song City’s leader is a bit stronger than Mister Meng, but he is not very strong. He cannot do anything to harm you. If you are willing to have me, I am willing to be your servant. I will forever follow you around.”\n\nHe was a very smart person. He sensed that Han Sen was not a murderer, which was why he was saying all of this.\n\n“I understand,” Han Sen coldly said. “In that case, go and reject Peaceful. If she forces you, I will help you out.”\n\n“Thank you, Mister.” Mister Yang was very happy. He bowed to express his gratitude.\n\nAfter arriving back in the living room, Mister Yang bowed and shared his identity.\n\n“Are you Mister Yang?” Peaceful nodded and looked at Han Sen. She did not say anything. She coldly said, “Mister Yang, I am paying you a high price to go to Ancient Big God Mountain and find the god pulse. If that is fine, please come with me.”\n\nMister Yang looked at Han Sen and answered, “I am sorry, Lady Peaceful. My master has to work. I cannot leave Ancient God City.”\n\n“Who is your master?” Peaceful asked. She looked at Han Sen and checked him out. She frowned.\n\n“This is my master.” Just as Peaceful had guessed, Mister Yang moved to introduce Han Sen.\n\nPeaceful looked at Han Sen and asked, “Can I borrow Mister Yang for a bit?”\n\nShe could not find a powerful, noble blood pulse in Han Sen, which was why she thought Han Sen might have been Mister Yang.\n\nNow, Mister Yang was saying Han Sen was his master. That meant he had to be a noble.\n\nThe identity of a Mister was not as high as a noble, but it was stronger than a commoner. To be able to make Mister Yang find a master, he must have been a noble.\n\nPeaceful could not detect a noble presence within Han Sen. There were only two possibilities. One was that Han Sen was not a noble. The second was that Han Sen’s blood pulse was greater than hers. He had hidden his powers, which was why she could not sense anything “I am not sending him out,” Han Sen coldly said. “If there is nothing else you want, you can get out of here.”\n\nPeaceful knew Han Sen’s attitude was not normal. He seemed very laid back, but he was also very intimidating. She thought Han Sen must have been a high-class noble. Therefore, she did not dare say anything more.\n\nHan Sen thought there might be trouble, but Peaceful did not say anything else. She just asked his name and readied herself to leave.\n\n“You must not be cocky,” Mister Yang cautiously said. “Peaceful just does not know who you are, so she left. She will come back.”\n\nHan Sen squinted his eyes and casually said, “That is fine.”\n\nJust as Mister Yang thought, after Peaceful returned home, she started to investigate Han Sen. After she sent people from Ancient God City to investigate, there was nothing that could be learned about Han Sen. Peaceful thought that was very weird.\n\nHan Sen stayed in Mister Yang’s house for two days until it was blood pulse open day. Han Sen followed Mister Yang to Evil Lotus God Temple.\n\nThe doors to Evil Lotus God Temple were now open. Han Sen saw a god statue far away in the god temple’s god altar. It was the face of Evil Lotus God."
}