{
    "chapter": 2242,
    "title": "Escape",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2242",
    "text": "Ice Blue Knight King teleported after Han Sen with a fist brimming with power, and he thrust it forward against the Demon Bug King Bai Sema. The Bai Sema vibrated, but it showed no sign of cracking.\n\n“The shield can block Ice Blue Knight King’s attacks. It really is powerful, but it cannot last forever. We should get ready to show ourselves soon,” Edward said. He snuck out of the base and went after Han Sen.\n\nEdward had nothing to be afraid of. Ice Blue Knight King had disobeyed orders when he attacked Han Sen, and Edward technically had nothing to do with this. He would simply help the Knight King capture Han Sen and ensure his safety.\n\nAs Ice Blue Knight King pounded the Demon Bug King Bai Sema, Han Sen heard the shield groan as if it was going to shatter. It was like glass that had been strained to the breaking point. He frowned. “It looks like the Demon Bug King Bai Sema can block half-deified attacks, but not forever. It’s a shame those other Demon Bug King Bai Semas are currently damaged. If I had those in play, the tri-colored Demon Bug King Bai Sema would definitely be able to block Ice Blue Knight King’s attacks.”\n\nHan Sen kept flying, trying to think of a way that he could shake off his pursuer. He knew simple speed wouldn’t aid him in the long run. He had to find a way to escape before the Bai Sema broke.\n\n“If I can slip out of Ice Blue Knight King’s vision and hide my presence, I can use Little Invisible to help me escape the rest of the way. But right now, doing that is too difficult,” Han Sen thought to himself.\n\nHan Sen flew above a nearby mountain. Wherever they went, the creatures fled. The skies were filled with xenogeneics racing away in fear, and that surprised Han Sen.\n\nIce Blue Knight King’s superior speed had allowed him to catch up quickly. Han Sen had a few ideas on what he could do, but he couldn’t find a good opportunity to make any of them work.\n\nThe Bai Sema took more and more damage, and it looked likely to break. Ice Blue Knight King punched with increasing ferocity, but suddenly, a roar rang out from the mountain beneath them.\n\nBoom!\n\nA white light shot out from deep in the mountains. Its target was Ice Blue Knight King.\n\nIce Blue Knight King turned to block the incoming light, and there was a blinding collision of blue and white lights in the sky. Its force ended up destroying everything around them. Part of the backlash washed over the mountain, and then, a giant beast that was around a hundred meters long emerged. It sent more of that white power towards Ice Blue Knight King.\n\n“Even God is helping me!” Han Sen grinned and shot off into the mountains. The beast kept Ice Blue Knight King engaged, unintentionally stopping him from following Han Sen. The Knight King kept punching with more and more power, as if it was the only thing that could stop the annihilation of the world.\n\nThe entire mountain range shook as mountaintops and peaks fell from their lofts. The grounds were sundered while creatures fled.\n\nHan Sen rushed into a mountain and threw Bao’er into Destiny’s Tower. Then he dropped onto the ground and turned himself into a Stone Cow. He thundered towards a nearby crowd of xenogeneics.\n\nHan Sen was blending into the stampede of xenogeneics when he suddenly saw a shadow circle the mountain. It was Inspector Edward.\n\nEdward’s eyes roved over the ground. It seemed as if he was on the prowl for Han Sen, too.\n\nHan Sen didn’t look at Edward, hoping that the man wouldn’t see through his disguise. He followed the xenogeneics deeper into the mountains.\n\n“Weird. Where did he go?” Edward frowned. He had seen Han Sen land in that area, but Edward’s quarry had now vanished into thin air.\n\n“Maybe he’s turned himself invisible? Even if he did, he still wouldn’t be able to escape my eyesight. The mountain isn’t too damaged, and there are no secret escape tunnels. His only option would be to walk out. So, the things that are currently leaving…” Edward’s green eyes looked all around. After a while, he raced towards the group of fleeing xenogeneics.\n\nEdward looked very excited. His eyes brightened, and he spoke to himself, “A powerful guy! He can even shapeshift. If he was also half-deified, I don’t think I would be able to defeat him!”\n\nWithout hesitation, Edward raced after the xenogeneics that were fleeing the area. He hovered right above them.\n\nHe looked down on the thousand xenogeneics, and the irises of his eyes turned to crystal as he examined them.\n\nEdward took one look and made a mental note of each and every animal that was there. In just a second, he noticed the problem.\n\n“That Stone Cow has disappeared.”\n\nBut Edward didn’t keep following the group of xenogeneics. Instead, he looked back the way he had come.\n\n…\n\nWhen Han Sen escaped Edward’s vision, he used Little Invisible to leave the group of xenogeneics. He didn’t go too far, though. He circled around and went back to where Ice Blue Knight King and that goliath were fighting.\n\nWithout hesitation, Han Sen headed straight into the deep hole that the beast had emerged from.\n\nHan Sen didn’t believe that the monster’s intervention was truly coincidental, but now, he was looking for a way to escape. There was a strong xenogeneic blocking Ice Blue Knight King, and he was going to take advantage of that.\n\nIt looked as if the fight between Han Sen and Ice Blue Knight King had disturbed the beast, but instead of coming after them both, the monster had decided to ignore Han Sen and go straight for Ice Blue Knight King. That seemed strange to Han Sen.\n\nHe ran into the abyss it had emerged from to have a look around, and he immediately noticed that the cavern wasn’t the beast’s home.\n\nIt looked very similar, but under the clarity gifted to him by the Dongxuan Aura, Han Sen could see the molecular traces of the beast. It had come to the cave recently, and it had only been there for a short time. It couldn’t have been there any longer than two days.\n\nThe cave did house a powerful xenogeneic nest, but the molecular traces of the cave’s original inhabitants were different. They didn’t belong to the beast that had saved him.\n\n“It looks like Edward was willing to help me escape from Ice Blue Knight King.” Han Sen ran deeper into the nest without hesitation.\n\nHan Sen was certain that all the creatures that should’ve been living there were now dead. The beast must have had some kind of relationship with Edward.\n\nBut if Edward had sent the creature, then Han Sen sneaking into the lair of the dangerous beast should be the last thing he would expect.\n\n“Edward’s mind is pretty scary. He will come here sooner or later. I need to get out of here quickly,” Han Sen thought to himself as he observed the nest.\n\nAfter entering the giant nest, Han Sen saw some large bones strewn about the cavern.\n\nMost people would have assumed that those bones were the remains of the beast’s prey, but Han Sen could tell their true origin from the molecular traces. The bones belonged to the xenogeneics that originally lived there.\n\n“I don’t know if this nest has another exit.” Han Sen confirmed there were no other xenogeneics present, then decided to explore a little deeper into the nest."
}