{
    "chapter": 56,
    "title": "I’ll Be Damned",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_56",
    "text": "Fang Jingqi regretted his own carelessness as his face turned red. He also blamed his loss on Han Sen’s slyness. If Han Sen didn’t tell Xue Xi the vulgar story, he would not have been distracted and gave Han Sen the opportunity.\n\n\"Another ten thousand,\" said Han Sen to Xue Xi.\n\n\"Again.\" Fang Jingqi reached his hands out.\n\nWhen Han Sen was ready, he said to Xue Xi, \"Another lovely puppy was traveling in the desert with plenty of water and food. It found a utility pole but it still died. Can you guess why? \"\n\n\"Why?\" Snow Xi thought about it seriously but did not think of an answer.\n\n\"I was asking you.\" Han Sen ignored Fang Jingqi, and turned to look at Xue Xi.\n\n\"I don’t know the answer,\" Xue Xi said.\n\n\"Alright, I’ll tell you. It is because there was a sign on the pole that said ‘no peeing zone,’ then the puppy’s bladder exploded again.\"\n\nSnow Xi burst out laughing.\n\nFang Jingqi knew that it was Han Sen’s trick to get him distracted, but he couldn’t stand Han Sen ignoring him and said to Han Sen, \"Would you rather tell stories than...\"\n\nSnap!\n\nHan Sen's hands once again slapped him on the back of his hands, which had turned red after three slaps. However, Fang Jingqi’s face was redder than his hands.\n\n\"Come again.\" Fang Jingqi gritted his teeth and stretched out his arms again.\n\nHan Sen put his hands back and continued his story, \"Another lovely puppy was traveling in the desert with plenty of water and food and it found a utility pole with no sign on it. But it still died. Can you guess why? \"\n\nFang Jingqi was focused on Han Sen’s wrists, neither talking to nor looking at Han Sen. He would give Han Sen no chance to distract him this time.\n\nAfter Han Sen told Xue Xi the answer, Fang Jingqi was still staring at Han Sen's wrists.\n\n\"Little brat, you will learn your lesson when it’s my turn to be the slapper,\" thought Fang Jingqi.\n\nSeeing Fang Jingqi was still focused, Han Sen sighed and said, \"Jingqi, you are so calm. I’ve been the king of red hands for two decades and no one could escape my storytelling yet. You are indeed impressive.\"\n\n\"Cut the crap...\" Fang Jingqi said and suddenly changed his expression. It was too late. His hand was once again slapped hard by Han Sen.\n\nFang Jingqi bristled with anger. He hadn’t expected to be tricked by Han Sen again.\n\n\"Again!\" Fang Jingqi clenched his teeth and squeezed the word out, making Xue Xi anxious on the side.\n\nHan Sen put his hands in position and didn’t tell a story this time. He said to Fang Jingqi with a faint smile, \"Did you think I won just because you were distracted?\"\n\nFang Jingqi ignored Han Sen, as if he couldn’t hear anything Han Sen was saying.\n\n\"I won’t move even if the sky collapsed...\" thought Fang Jingqi, determined to win this round and kick Han Sen’s ass. When he became the slapper, he’d be the one telling Xue Xi stories and hitting Han Sen on the hands…\n\nHaving noticed Fang Jingqi was still focused, Han Sen sighed and said, \"Jingqi, you are indeed a genius in playing red hands. I will now focus and use up to 30 percent of my skills to deal with you.\"\n\nSeeing Han Sen putting on airs, Xue Xi laughed out loud.\n\nFang Jingqi was still staring at Han Sen’s wrists.\n\n\"Attention, I will use the secret skill of red hands king...\" Han Sen suddenly roared.\n\n\"Well, I’ll keep still and see what tricks you have,\" Fang Jingqi sneered and thought.\n\nSnap!\n\nFang Jingqi couldn’t escape when Han Sen made the move although he was paying full attention this time.\n\n\"Again...\" Fang Jingqi refused to concede defeat and wondered why he didn’t dodge the slap. It must be some tricks used by Han Sen.\n\n\"Let’s call it a day. As the king of red hands, I don’t want to bully you,\" Han Sen looked up and sighed.\n\n\"You think I cannot afford to pay? Next round.\" Fang Jingqi wanted to slap Han Sen in the face so bad, but he wasn’t a sore loser.\n\n\"Don’t blame me then.\" Han Sen stretched out his hands.\n\nSnap!\n\n\"Again!\"\n\nSnap!\n\n\"Again!\"\n\nSnap! Snap! Snap!\n\nFang Jingqi went berserk, not accepting the truth that he simply couldn’t move his hands away fast enough. Han Sen was nothing but cunning. How could he lose when he was paying attention?\n\nHowever, Fang Jingqi could not avoid the slap no matter how hard he tried.\n\nSnap! Snap! Snap!\n\nCrisp sounds kept ringing in the living room. Xue Xi was shocked. She didn’t expect Fang Jingqi to lose, let alone to lose in such a miserable manner. She had been worried about Han Sen but found that she really should be worried about her brother.\n\nWhen Fang Jingqi left Han Sen’s home, his hands were swollen like trotters and his face was pale from anger and shame.\n\n\"Jingqi, come to play red hands when you have time.\" Han Sen waved goodbye to Fang Jingqi with a stack of cash in hand.\n\nFang Jingqi almost fell from the aircraft when he heard Han Sen. \"I’ll be damned if I ever play red hands with you again.\"\n\nHan Sen had more comments but the aircraft made a loud noise and went away at full speed.\n\n\"A million easily earned. Should’ve agreed with him and made the bet a hundred thousand each round.\" Han Sen licked his lips and took the money back to his room."
}