{
    "chapter": 1227,
    "title": "Unbelievable Dream",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1227",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBoom!\n\nThunder Hell Emperor’s lightning lashed towards Han Sen, who was in the shape of a raven. He wanted to incinerate Han Sen with his electricity and burn him to ash.\n\nHan Sen knew there was no going back after coming so far. He ignored the bloodthirsty Thunder Hell Emperor and focused on grabbing his spirit stone.\n\nThe capabilities of his phoenix techniques were being pushed to the max as Han Sen fired on all cylinders. He sped up time and teleported, wanting to close the gap and obtain the stone.\n\nThe fires of the raven’s wake and the lightning that webbed and weaved a trail behind Han Sen illuminated the sky in a dazzling display. The lightning was gaining on him, despite the blistering speed he traveled at, and it was about to come into contact with him.\n\nThey both reached the speed of light, and not even a machine could tell which of the two were faster.\n\nThunder Hell Emperor’s face changed, though. The consequence of his decision to commit suicide had now become clear to him, as he noticed he was still in recovery. He needed to be strong, but he couldn’t summon the full extent of his power, and it made him falter.\n\nPang!\n\nThe black lightning hit Han Sen’s back, incinerating the wings that carried him and searing the skin of his back.\n\nBut at the same time, his talons pierced through the spirit stone that was lodged inside the forehead of the statue. If he slowed down the slightest amount, the lightning that was about to devour him would ravage his entire body and turn him into charcoal.\n\nWhen the talons struck the spirit stone, it shattered. And as this occurred, Thunder Hell Emperor and the lightning vanished.\n\nPang!\n\nHan Sen fell down to the ground like a fallen bird, hitting the tiles of the hall as a human with a smoldering, smoky back. The king spirits and super creatures looked at him, frozen in shock.\n\nThen they all abandoned their combat and scrambled, running away in fear.\n\n“Don’t let them escape!” Han Sen commanded his companions to chase after them and capture or kill them.\n\nHan Sen did not expect the emperor to commit suicide and return so quickly, but with the situation being thrown on its head like that, he had no choice but to gun it and destroy the stone as soon as he could. And as for the super creatures that had been in the emperor’s employ, he wasn’t going to let them escape.\n\nPurple Emperor managed to kill an airborne super creature with a clean swipe that beheaded it.\n\nLittle Angel soared over and killed another.\n\nThorn Queen was able to ensnare two more airborne super creatures.\n\nSnowball, who now rode upon the Blue Dinosaur, hunted down a king spirit.\n\nOld Huang, Little Zhao, and the other humans, meanwhile, had left the shelter. They did not know what to expect, but all of a sudden, they felt their contracts break.\n\nOld Huang was shocked after this happened, and he exclaimed, “How is this possible?! The contract is gone!”\n\n“Mine as well.” They all noticed the same thing, and everyone began to shout and chant in glee.\n\n“Han Sen attacked the shelter and slew Thunder Hell Emperor!” Little Zhao called out.\n\n“But it was an emperor; that is impossible!” Old Huang still could not believe it to be true.\n\nLittle Zhao found his disbelief annoying at this point, so he pointed at the shelter and said, “Look, the creatures and spirits are escaping. Who else but Han Sen could have done it?”\n\nEveryone looked at the shelter in shock.\n\nThose that fled were racing out as fast as they could, each one clearly in a panic. They most likely wished they had more legs. The higher tier creatures only cared for themselves, and they simply stepped on the lower tier beings if they happened to be in their way.\n\nThey looked so powerful, and yet there they were, running for their lives.\n\nA dragon soared through the skies above them, but a purple light chased after it, severing the head from its scaled neck.\n\nThe body fell atop a building, which buckled and collapsed under the sudden weight.\n\nThe vines had taken hold of two flying birds, and try as they might, they could not escape the snare. An angel flew towards them swiftly after, beheading the two creatures and causing blood to flow and rain over the area below.\n\n“That’s right, peel their lids! Before me and this posse, you ain’t nothin’. Go to hell, you snakes!” A man, wearing sunglasses and shorts, chased after a bunch of spirits with fists that gleamed like silver suns. He grabbed ahold of one king spirit and punched it to death with surprising brutality.\n\nThe humans who watched this were shocked. The creatures and spirits that had made them miserable and bullied them for years were now being pummeled to death, slaughtered as if they were little more than livestock.\n\n“I don’t think they are human,” Old Huang said.\n\nLittle Zhao was shocked, too. The gang that had seemingly attacked the shelter really didn’t look human, at all. The entire shelter had been emptied of hostile creatures and spirits. The shelter had been rendered a city of the dead.\n\nThey saw a skeleton monster approach them, and fear took hold of them. They had previously seen it approach a group of creatures, and it had knocked a bone heart and watched them all writhe on the ground and submit to the cold grasp of death.\n\nThe skeleton looked as if it was going to strike the bone again, but before it could, another voice sounded. A person spoke, and the voice carried with a calm and clear tone.\n\n“Dry Bone, they are with us.”\n\nOld Huang heard these words, and then watched as the skeleton immediately turned back and followed the command. A gold beast rode out of the shelter and approached the group of humans, and atop it stood Han Sen.\n\nThe forces they had watched conquer the shelter now rallied around Han Sen, falling behind him as if they were royal soldiers. The people were all in shock and disbelief, almost unable to believe what they were seeing. They thought it had to be a dream."
}