{
    "chapter": 2999,
    "title": "Moment's End",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2999",
    "text": "Bao’er kept swinging and swinging. There were crazy, mad explosions going on. Scary powers exploded, wave by wave. Because the destructive power would damage everybody, Moment God had to be fast. She was still able to go through it. Even if a moment was forever, the kill sky hammer’s power was able to break it. Time rewind only rewound a short portion of time. It was impossible to block the hammer’s explosive powers. Seeing that the light scissors in Han Sen’s hands were going to break Golden Growler’s time trap for a second time, one easily saw the Moment God frown.\n\n“Kill Sky God really was not enough to be a success or loser,” Moment God coldly said. She raised her jade hand and pulled out a strand of hair. Her hair, which had been tied up, fell down like a waterfall. It reached her ankles.\n\nHer hair looked weird. It almost looked like it was made of crystal. The strands looked like needles. She put the hair between her fingers. Moment God looked calm. She looked serious as she raised it toward her face.\n\n“10,000 skills are strong. Time is king. Forever after, there is no end, but it is like a bird flying through a gap. It could occur in a second. One second can be forever, and it could be a second. A second is nothing, so accept my anger. Moment’s End.” When Moment God spoke with her god voice, which was frigid with her cold emotions, it was like there was a giant shadow of a clock in front of her. The clock shadow did not have needles that told time.\n\nMoment God’s jade hands touched the hair. She put the hair in the shadow clock’s plate. It combined with the shadow clock.\n\nBzzt!\n\nA weird movement was released from the shadow clock. The clock, which did not exist, turned solid. It seemed ancient. It was like a very old god temple or church time clock, but the clock’s plate only had one needle. There was no hour, minute, or second needle.\n\nKatcha!\n\nThe needle pointing at 12 suddenly jumped one block. It was now pointed at the 1.\n\nWhen the clock finished jumping, the time in the god temple instantly seemed to exhibit a weird change. No one was not able to see what sort of power it was, so no one could block it.\n\nHan Sen slid out his light scissors. The blades turned into one white and one black light dragon. They ripped Golden Growler’s time restriction power. Golden Growler escaped again. It opened its mouth and spit out the golden door.\n\nSun Moon God Ape and Space Spirit were shaken. Blood was spilling from their mouths. They also had to buff Bao’er with their time power and space powers. Their faces were twisted.\n\nBai King looked very happy. He looked at Golden Growler and wished to say something.\n\nSuddenly, everything started again. Han Sen’s hands and the light scissors went toward Golden Growler again. Sun Moon God Ape and Space Spirit coughed up more blood again. Bai King smiled again. Bao’er threw down her hammer again. The whole of space was shaking.\n\nIt happened again and again. It was like a short video that opened on a brainless cycle. Everyone was repeating their actions from that one moment again and again.\n\nIn that infinite cycle, even Moment God was stuck like that too. She followed the infinite cycle to repeat her actions again and again. Upon seeing that, all the creatures were frozen. “The legends claim that a God Spirit in their temple possesses special god skills,” Sky Palace Leader said with his eyes on fire. “It looks like Moment God’s special god skill is that Moment’s End. It can make time circle infinitely. Special god skills are very powerful.” He kept watching the Moment God Temple, which kept looping its time.\n\nSky Palace’s first seat frowned and said, “Moment’s End can only make time keep repeating itself for a period, but it does not do anything good for her. She is trapped in that time loop too. She is in a deadlock now as well.”\n\n“Special god skills… Unless Moment God Temple escaped the god palace’s control, that power will be affected by the god palace’s rule. Even she will be unable to control it. That is not strange. Moment God is afraid that Gold Growlers golden door will open. She would not use Moment’s End unless she was in fear. This is interesting. What is behind the golden door that even an Annihilation class God Spirit is so scared of it.” Sky Palace Leader looked at the Golden Growler with interest.\n\nGolden Growler kept cycling with time, over and over again.\n\nThe golden door went out a little, and then it went back in a little. It went out a little, and then it went back in a little. It was not able to really open it.\n\nSky Palace’s first seat said, “No matter what this is, it is futile now. Moment God Temple has become a dead place. Whatever enters it will end up in the time cycle. Those guys are done for.” He paused for a moment and then went on to say, “But that is good. Han Sen was chosen by Sacred Leader, and he has the Holy Kirin’s holy spirit. Perhaps he will one day stir up trouble. That Dollar is even weirder, and Bai King is always suspicious. If they had not been trapped here, them causing problems was inevitable. So, this has sorted out many problems for us. It can scare the guys who are hiding. They will not dare to do anything. We just need the space barrier to heal. The god palaces will eventually fade into the nether. Everything else will return to normal again.” Sky Palace Leader shook his head and said, “I am afraid things are not that simple. Those old antiques are full of conspiracies, and they have had them for God knows how many years. It was not easy for them to have this opportunity Why would they let this go? Han Sen being trapped is just the beginning. They are merely waiting. They are waiting for other people to strike first so they do not have to help others. No matter what, someone will be impatient and do it first.”\n\n“So, what if they do?” Sky Palace’s first seat asked. “Who else can be like Sacred Leader and kill God Spirits like killing dogs? Who else can go to the geno hall?”.\n\nSky Palace Leader wished to say something, but somebody flashed in space. Some creature walked into the infinite cycle of Moment God Temple’s space.\n\nSky Palace Leader and the audience were shocked. They wondered who dared go to the Moment God Temple area. They all looked over there.\n\nma\n\nA woman was wearing a red qipao and red high heels. Her hands were holding a red paper umbrella. She walked forward. When she walked, her very long and white legs were displayed. Her curves were perfect. She was like a drawing\n\nThat woman was not the main point. The paper umbrella in her hands was not for her. She was like a servant. She held it for the man in front of her. She did so carefully. It was as if she did not want the man to get a sunburn.\n\nThe man and woman walked into Moment God Temple’s space area. The red paper umbrella covered the 10,000 lights. No one was to see what the man and woman looked like. It made their bodies appear like walking shadows. They walked into the space cycle but did not get restrained by the time cycle.\n\n“Can’t hold it and strike, huh? What are they going to Moment God Temple for? Are there people inside there?” Sky Palace Leader frowned."
}