{
    "chapter": 1230,
    "title": "Saint Fan Emperor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1230",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAfter Han Sen absorbed the six Life Geno Essence, he was left standing at a super geno point total of sixty-nine.\n\nThere was still the Ice Wolf King’s body and two others to eat, so Han Sen provided the super flesh to Golden Growler, Snowball, and Metal Eater.\n\nThe king spirits were similar to humans in that they did not eat super flesh.\n\nHan Sen went to the geno garden at the shelter, as he greatly desired the geno plants that resided there. He had been busy for quite some time, so his pining for them had only gotten worse. Now, he had the opportunity.\n\nThe plants that occupied an emperor’s garden would surely be nothing but the best, and just a few emperor-class plants would be enough to satiate Han Sen’s desire.\n\nBut when Han Sen finally walked into the garden, ready to drain it, he was dealt quite the disheartening surprise: the garden was dead. Moment Queen was standing conspicuously at its center, with a lifeforce beaming with energy. It was much stronger than it used to be.\n\n“Moment, what have you done?!” Han Sen was ready to kill her, once and for all, if she didn’t provide him an explanation for what she had done.\n\n“I just want to live,” was Moment Queen’s answer.\n\n“You have one minute to explain; otherwise, your want is not going to happen,” Han Sen said.\n\nMoment Queen looked surprised, and she stammered, “You think you’ll be safe, now that you’ve taken over Thunder Hell Shelter?”\n\n“You have forty-five seconds,” Han Sen said.\n\nMoment Queen said, “Thunder Hell Emperor was a good friend of Saint Fan Emperor. Saint Fan Emperor won’t look kindly upon the one who killed his friend and took all his things. I absorbed the plants so I can help you in the future. I have only opened five gene locks, so I cannot help you very much under my current circumstances.”\n\nHan Sen frowned, thinking he might have heard about Saint Fan Emperor before.\n\nIn the Second God’s Sanctuary, it was Saint Fan who branded a mark on his forehead when he came to take the Holy Rhino. And later, when Han Sen encountered the Lotus Empress, she name-dropped Saint Fan when she noticed Han Sen and the mark.\n\n“Now that I have opened nine gene locks, I can help you out a lot,” Moment Queen said.\n\nHan Sen brought out the Cruel Bottle and sucked her in. Moment Queen was shocked, wishing to plead more in her defense. But before she could, the bottle was corked.\n\nExisting inside the Cruel Bottle was different to existing in the Sea of Soul. You could evolve in the Sea of Soul and slumber, but the Cruel Bottle was more like a prison.\n\nIf she had just asked, Han Sen would have been willing to part with some of the plants. But for her to take them all without permission was the sort of behavior he was not willing to tolerate.\n\n“I can help you against Saint Fan Emperor; you cannot do it without me!” Moment Queen screamed, hoping Han Sen would hear her. She did not want to be trapped inside those glass walls forever.\n\n“Even if I was to lose Thunder Hell Shelter, and you were my last hope of survival, I wouldn’t let you out.” Han Sen put away the bottle and didn’t say another word to her.\n\nHan Sen asked his other companions if they knew who Saint Fan was.\n\nQing Jun and Thorn had only heard his name, but didn’t know much else. Xie Qing King and Baby Ghost had never even heard the name. Dry Bone King was the only one who was able to provide information.\n\nDry Bone King said, “I thought about that *sshole, as he’s not too far from this shelter. And last I heard, he and Thunder Fart were friends. He might attack us, you know.”\n\n“How much do you know about him, exactly?” Han Sen asked.\n\nDry Bone King looked excited to provide information, and he said, “Well, back then, my father, Skeleton King, had his spirit stone destroyed by Saint Fan Emperor.”\n\nXie Qing King was shocked when he overheard this, and he exclaimed, “Hold the phone! Are you the son of Skeleton King?”\n\n“Was he famous?” Han Sen asked.\n\nXie Qing King had been trapped for one-hundred-thousand-years. If even Xie Qing King had heard about him, Skeleton King had to be some sort of legend.\n\nXie Qing King explained, “Oh, boy. I sure did. Back then, he was the bee’s knees. He could have been an emperor, you know. I didn’t expect him to have been killed by Saint Fan Emperor, though. That sucks to hear.”\n\nDry Bone King looked angry, and he said, “Saint Fan’s power exploited a weakness of my father. He took over Skeleton Shelter, and that is how he became an Emperor so quickly.\n\n“What power did he have?” Han Sen asked.\n\n“People always assumed it was light, but that would be incorrect. His power can heal everything and anything; it has long been a dream of mine to slay him, even if revenge is a luxury I cannot afford. But I fear that even with all our might combined, there is nothing we can do to defeat him,” Dry Bone King said.\n\n“Heal everything? Did you say that right? To heal is not to attack; if he can’t attack, what is there to be afraid of?” Ghost Eye chimed in.\n\nDry Bone King looked over to Ghost Eye and said, “The powers of healing are strong, and that is especially true of Saint Fan.”\n\n“Could you elaborate?” Han Sen did not know how or why the powers of healing would inflict damage.\n\nDry Bone King’s voice sank to a strange tone, and he said, “His powers are so strong, he can seal all of your orifices. He can warp the shape of your body and turn you into little more than a meatball.”\n\nDry Bone King looked at both Ghost Eye and Xie Qing King, and said, “He could even combine the both of you. He could merge you together, by your flesh.”\n\nXie Qing King and Ghost Eye looked at each other, having both been given goosebumps.\n\n“The bottom line is, Saint Fan’s powers cannot be any less than Thunder Hell’s. And that aside, he has an abundance of super creatures and king spirits in his employ. If Thunder Hell was the mini-boss, Saint Fan is the big cheese of this region,” Dry Bone King said."
}