{
    "chapter": 2221,
    "title": "Lava Valley",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2221",
    "text": "After Edward returned to the Ice Blue Knights, he went to the information room. He perused the records of the various knight teams. After speeding through them, he frowned. He looked over to the information manager and said, “These are all the videos recorded over the past month?”\n\n“Yes, inspector,” the information manager politely answered.\n\nAfter a brief pause, Edward asked, “Did any teams bring in damaged recorders and ask for new ones?”\n\n“There were four teams over the past month, yes,” the information manager answered, after glancing over his logs.\n\n“Were any of those incidents reported in the last two weeks?” Edward asked before the manager had even finished speaking.\n\n“In the past two weeks, two teams had their recorder replaced: the 79th and the 354th teams. Those teams are led by John and Han Sen, respectively. Their members are…” The manager quickly rattled off the member records that he had on file.\n\n“The 354th team? Is that the new team the captain brought here?” Edward sounded like he was asking, but it was safe to say it was a rhetorical question. He stared at the information on the 354th team intently.\n\n“Yes, Mister Inspector. This team is special. Although they are a back-up team, they aren’t on the list of back-up knights. They are Mister White’s private guards,” the manager said.\n\n“Mister White’s guards?” Edward asked, while perusing the information. An odd expression crossed his face as he said, “He is Knife Queen’s student. That is interesting.”\n\nHan Sen was still clearing Lava Valley, but there were far too many xenogeneics there, and there was no way that his team could take them all. Han Sen had been sent there to film, more than anything. If the xenogeneics didn’t actively threaten his team, then they usually left the creatures alone.\n\nHan Sen followed the Lava Valley’s meandering path, searching for Duke xenogeneics. None of the others mattered.\n\nHan Sen told Bao’er to focus on filming the creatures that occupied the lava river, and only turn the camera on them when they slew ordinary xenogeneics. He didn’t want the camera watching when they were killing Dukes.\n\nIt was a shame Han Sen had yet to find the beast soul he was looking for. He had killed three Dukes over the past two days, and not one had yielded him a beast soul.\n\n“Be careful! Fall back,” Han Sen said quickly, his eyes becoming alert. He was gazing into the lava river, where a large shadow had appeared. A ten-meter-long black spine rose out of the river, but Han Sen knew that what he could see was only a small portion of the actual creature.\n\nEveryone looked at the lava river. The shadow was swimming deeper into the valley, and it showed no indication of actually leaving the lava stream. Even so, all the fire xenogeneics around carefully stayed away from its passing. Even the bird xenogeneics flew away and hid inside their little cave nests. The valley had suddenly become so quiet that only the frothing bubbles of lava could be heard.\n\nWhen that shadow left the vicinity, all the xenogeneics came back out.\n\n“A King class xenogeneic?” Ji Qing asked.\n\n“Probably.” Han Sen nodded.\n\nHe and his people continued their advance. They eventually reached a dark spot on the lava river, where the stream of lava had darkened to a deep red. There were some birds there that looked like cranes. They had white feathers and red heads. Han Sen smiled at the sight of them.\n\nBut there were a great many of those red cranes present. There had to be at least one thousand of them, and the weakest of them were Earls. Some of them were Marquises, and others even Dukes.\n\n“I wonder what beast souls these things give.” Han Sen instructed Bao’er to film elsewhere. He and the team started killing the red cranes.\n\nThey were a few thousand meters away from the red cranes when the red cranes finally noticed their approach. Flames burst to life on the birds’ heads, then leapt over their entire bodies. They all squawked, and they raced towards Han Sen like a barrage of missiles.\n\nHan Sen’s bullets and Han Meng’er’s arrows engaged the cranes as they came, but when they took down the first crane, it exploded in the air. Fire gushed out of the bird’s corpse, scorching the land around it.\n\n“Oh no! These cranes are kamikaze pilots! Summon the Bai Sema!” Han Sen shouted.\n\nHan Meng’er summoned the blue Demon Bug King Bai Sema, and many burning red cranes rammed into it. They started exploding against its surface like suns.\n\nA thousand red cranes came against the Bai Sema like grenades. The scene was incredible to witness. It was like an endless stream of fireballs were coming to strike the Bai Sema, as great walls of fire swept out and burned everything.\n\n“These guys really don’t want to live.” Han Sen watched as the cranes continued to divebomb the shield, hate in their beady eyes. The temperament of the cranes was obviously very bad.\n\nThankfully, Han Sen’s group had the Demon Bug King Bai Sema there for protection. None of their current enemies, even the Dukes, would get through that shield.\n\nThere were a thousand red cranes there, and it took around ten minutes for all of them to kill themselves on the surface of the Bai Sema. None of them were left alive, and they were all swiftly turned to cinders. Han Sen wondered how they had managed to survive as long as they had.\n\nThe other xenogeneics in the area had all fled in fear of the crazed red cranes. One xenogeneic flew out of the lava, though, without any fear of the red cranes. It glided slowly across the lava river, coming over to Han Sen without haste.\n\nThe xenogeneic that had emerged from the lava looked like a gold peacock. Its body was composed of burning lava, and as it flew, the gold lava dripped off of it. Each drop hit the ground like a golden firework before turning into dust.\n\nWhen it had drawn near the Demon Bug King Bai Sema, the peacock xenogeneic opened its mouth to spew out lava. The golden liquid soon coated the entire Demon Bug King Bai Sema. The Bai Sema was inside its lava, but the liquid wasn’t hot enough to get through the shield’s protection.\n\n“Is that a mutant Duke xenogeneic?” Han Sen was surprised as he looked at that lava peacock. He looked upon it in delight.\n\n“Open the Bai Sema and let me go kill it.” Han Sen drew his Ghost Teeth Knife and ran out of the shield’s safety. He slashed towards the lava peacock, and the dark purple knife air looked like it would be driven straight through the lava foe.\n\nAs the demonic knife came toward it, the lava peacock spewed lava even more recklessly, sending fountains of the molten rock up into the air. It did manage to melt Han Sen’s knife airs, which surprised him.\n\nHan Sen moved like a ghost, slashing with soft knife airs from his Ghost Teeth Knife, but his attacks didn’t seem to be working on the peacock.\n\nAs he was trying to kill the lava peacock, the bird flapped its wings. Then it vanished. It moved too quickly for Han Sen to track and attack it with his knife silks.\n\n“This thing is… unexpectedly fast.” Han Sen frowned."
}