{
    "chapter": 2895,
    "title": "Familiar Machine",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2895",
    "text": "Han Sen thought, “There are so many princes and princesses that are deified now. How many resources has this cost them? Have the resources of the Extreme King all been depleted now?”\n\nAfter reading it all, he made a mental record of all the princes and princesses he would be accompanying. Bai King made it sound like it was supposed to be a casual affair. If the princes and princesses ended up dead, there was no doubt Bai King would be very angry. It was not likely that Han Sen’s time in the Extreme King would be as joyful as it had been.\n\nHan Sen did not want to leave the Extreme King just yet, so he planned on finishing this task. Plus, he was a bit interested in learning more about the Starter King’s Land.\n\nBai King had only told him where the place was, but he never said what sort of place it was. He had not described what it looked like.\n\nWhen Han Sen returned to the garden. Bao Ying was waiting for him. Han Sen told her he was going to the Starter King’s Land. That way, she would not have to go to the garden again.\n\nHearing that Han Sen was going to the Starter King’s Land, Bao Ying appeared to be in a state of disbelief.\n\n“Is there a problem with going to Starter King’s Land?” Han Sen wondered. He looked at Bao Ying.\n\nBao Ying shook her head. “The king must really love you a lot. In the past, only princes and princesses could enter Starter King’s Land. I would never have expected the king to give you permission.”\n\n“Do you know what kind of place Starter King’s Land is?” Han Sen wanted to find out more about Starter King’s Land.\n\nBao Ying shook her head. “Only princes and princesses can enter. Whatever happens in Starter King’s Land is never spoken upon when they return. I do not know much. I only know that Starter King’s Land is a secret place left by the Alpha King. That place was for testing the mettle of the princes and princesses. It was for choosing the one who would rightfully ascend the throne. Normally, the better they performed in Starter King’s Land, the higher the chance they could get the throne. But you are not of the king’s bloodline. I suppose, no matter how well you perform, you won’t get anything out of it.”\n\nBao Ying seemed to be trying to remind Han Sen not to offend the princes and princesses.\n\n“This will be interesting.” Han Sen stroked his jaw and thought, “Why would Bai King let me go to a place like this? Is there some conspiracy at play? Is something going on behind the scenes?”\n\nNo matter what the case might have been, Han Sen still had to go there. He was definitely more curious about Starter King’s Land.\n\nThe Extreme King’s Alpha King was Sacred Leader’s servant. What he left behind might have been something truly special.\n\nIt was time for the rendezvous. When Han Sen was at the entrance of the Starter King’s Land, the princes and princesses were already gathered. They saw Han Sen arrive. When they did, they looked confused.\n\n“Good. Everybody is here,” Bai Buyi said. “The Starter King’s Land is about to open. You guys must remember that Starter King’s Land is very dangerous. Every time a group ventures in, princes and princesses tend to die. Starter King’s Land only opens once in a while and with a very short window. It will close very soon. You will have to wait a month before you can access it again. In that time, not even a true god elite can enter. So, you guys must be very careful and help each other. If you do not co-operate, it is unlikely anyone else can save you.”\n\nPrince Swordstar coldly looked at Han Sen and said, “Second Uncle, Holy Baby is not from father’s bloodline. Why is he allowed permission to enter Starter King’s Land?”\n\nEvery prince and princess turned to look at Han Sen. They were like Prince Swordstar. They thought letting an outsider xenogeneic student into Starter King’s Land was a ludicrous prospect.\n\n“This is a decree by the king,” Bai Buyi coldly said. “If you have any questions, you can go and take them up with the king.”\n\nUpon hearing what was said, Prince Swordstar did not speak again. He just angrily stared at Han Sen.\n\nHan Sen shrugged his shoulders and did not say anything. He was only in charge of keeping the sons and daughters alive. Han Sen would not care if they got injured. If they were stupid enough to fight him, he did not mind that either. As long as he battered them around and did not kill them, all would be fine.\n\nOf course, Han Sen was still in charge of recording their performance in Starter King’s Land. Although he did not plan on doing anything on the record, if they were really going to be mean, he did not mind describing how dumb and pathetic they were. It could heavily affect Bai King’s ultimate decision.\n\nMost princes and princesses were similar to Prince Swordstar, but they were even eviler. They did not show their distaste for Han Sen’s company like Prince Swordstar did though.\n\n“Your time is up! Please, everyone… Please go to the Starter King’s Land now,” Bai Buyi said. He walked in front of the palace and opened the palace’s door.\n\nThe princes and princesses looked inside the palace. They had only heard about Starter King’s Land before, but they had never entered it. They were curious.\n\nInside the palace, Han Sen many familiar pieces of equipment.\n\n“These… They cannot be crystallizer machinery.” Han Sen was shocked. He stared into the palace and saw countless machines built from crystal. They were all shining and strangely glistening. It looked like the crystallizer control room Han Sen once visited.\n\nBai Buyi brought the group of prince and princesses into the palace. He pointed at a glass container that looked like a machine and said, “You guys stand in there.”\n\nA bunch of prince and princesses walked into the crystal container. That crystal container was 60 feet long, so 20 prince and princesses were able to stand inside without feeling too cramped.\n\nHan Sen had been looking at the machines that looked like crystallizer machinery. He thought, “Are these crystallizer items the Extreme King Alpha used to have? Did these machines belong to Sacred?”\n\nWhile Han Sen was thinking, Bai Buyi stood before a crystal wall that looked like a control room. His finger moved quickly across the crystal wall. Each time he touched the crystal well, there was a flash on it.\n\nAs Bai Buyi pointed at it, Han Sen noticed the crystal container was starting to spin. The bottom was spinning in a different direction to the crystal ball. This kind of program made Han Sen think about the teleportation machines featured in the Alliance.\n\nThe Alliance’s teleportation machines were not pure crystallizer tech. There were a lot of restrictions, and they certainly couldn’t teleport that many people at once.\n\n“What is this thing?” Han Sen was very curious. He wanted to know what the place called Starter King’s Land was.\n\nBoom!\n\nHan Sen felt a surge of magic go through his eyes. It was the same feeling he had when using the teleporters in the Alliance. When his vision stopped spinning, he noticed he was not inside the crystal container anymore."
}