{
    "chapter": 1266,
    "title": "Aqua Fruit",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1266",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen now knew it was too late to stop what had been put into motion, so he quickly tried to think how he might best help the fish king.\n\nThe light of its presence was rapidly approaching, and the water was in turmoil as it came.\n\n“Do you need to step away?” Yaksha asked the empress.\n\nThe empress said, “I will watch.”\n\n“Are we killing it?” Yaksha thought they would go and kill the flying fish once it arrived.\n\n“Not yet. We will let the fish and vine do battle first. When things look dire for either of them, we will swoop in and clean up the mess.” The empress relayed to them the plan of action.\n\nYaksha did not say anything, but he clearly seemed to be agitated by the presence of the human sitting comfortably beside the throne.\n\nThe empress had wanted to hunt down the flying fish originally, so he thought the human must have done or said something to change her mind.\n\nYaksha did not know who the man was, and although sirens blared in his head urging him to do something, he didn’t do anything. He did not want to upset or invoke the ire of the empress at a time as crucial as this.\n\nThe fish arrived at the lake and looked at the empress.\n\nThe fish king eyed the audience warily, and he seemed upset with their presence there. It began to circle the lake, and not much more.\n\nThe night was starting to fade by this point, and the sun was soon to raise its head above the horizon. When it did, the Night Cloak would be rendered useless. Han Sen hid in the forest and tried to mask his sense, instead.\n\nWhen his seven gene locks of the Dongxuan Sutra were open, Han Sen could simulate the energy of small plants. Han Sen had initially thought it to be a pointless boon, but in a time like this, he realized how handy it could be. Unless someone could see him with their naked eyes, Han Sen was just another shrub in the dense undergrowth of the forest floor.\n\nHan Sen was afraid that when the fighting began, the cave he had previously taken refuge in might collapse. Thus, he wasn’t willing to hide there.\n\nHiding in the forest was a far better option, and even if trees were toppled on top of him, they wouldn’t hurt.\n\nThe rising orb from the east began to bathe the land in the orange light of a new day. The waterfall was like a silver dragon, but then, curiously, it ran dry.\n\nAnd as the sun rose, the clouds in the sky began to disperse and fade away.\n\n“Strange. Last time I was here, even during the daylight, the clouds could still be seen. And why has the waterfall now stopped?” Han Sen frowned, concerned with the curious turn of events.\n\nOn the peak of the mountain, Han Sen saw a purple dragon-like vine wriggle.\n\nThe vine was massive, and it was surrounded by the bones of creatures it had drained the life out of through its leeching.\n\nHan Sen noticed there were seven vines in total, each bearing an Aqua Fruit. The fruits looked like bells, and when the wind blew, the chiming of these bells could be heard. Each one was big, as well, not too unlike a grinding wheel.\n\nWhen Han Sen paid attention to each sounding bell, he noticed they each played a different note.\n\nHan Sen suddenly saw fairies begin to fly around the fruits. The fruits looked incredibly holy with the fairies that surrounded them like little angels.\n\nThe flying fish could not resist the temptation, so it leapt into the sky, up towards the purple vine. The purple vine then swiftly moved. Like a lashing whip, it cast itself towards the flying fish king.\n\nThe flying fish king seemed to have improved since it last tried to do battle with the vine. Its body shone brightly with the color of gold and its head was crowned with a glorious horn. In a flash, it leapt to the side and avoided the incoming attack.\n\nThe flying fish managed to evade each lashing vine that tried to get it as it made its daring ascent.\n\nThe empress and the human watched the fish king intently.\n\nHan Sen watched the fish king evade the vines with ease, and noticed it was now only ten meters away from grabbing one of its fruit.\n\nSuddenly, though, the fairies began to fly towards the fish like a swarm of angry bees.\n\nHan Sen was shocked. He initially believed the presence of the fairies to be some sort of an illusion. The fairies were real, and they were now all around the fish king.\n\nThe fairies carried a ribbon, and they seemed intent on wrapping the ribbon around the fish to capture it.\n\nMore and more ribbons appeared in the hands of the fairies to tie the fish king up. But the scales on the fish king became spiky next, proving just enough to tear through the ribbons and escape.\n\nThe fairies were not dismayed by this, though, and they looked happy to take things up a notch. Their gracious appearance was cast aside, as each of them turned into a mini skeleton. Then, they all leaped towards the fish king."
}