{
    "chapter": 1294,
    "title": "I Need Your Body",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1294",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nMoving Star Emperor greeted Lotus Empress and then left, thinking it was pointless for him to remain there with them. He was more than a little embarrassed, too; more fuel to the fire of hatred he kept stoked for Han Sen.\n\nWhen Moving Star Emperor took his leave, Lotus Empress sat down. Softly, she bid for Han Sen to do the same, “Sit down.”\n\nHan Sen approached her and did as she told him.\n\nLotus Empress looked at Han Sen and said, “To be honest, when I first saw you in the Second God’s Sanctuary, I didn’t think too highly of you. I didn’t think you’d go on to become what you are today. You killed Saint Fan; that is something many spirits have tried to do before, but always failed in their attempts.”\n\n“For my deeds to impress a gorgeous empress such as you, I can only say that it is a most magnificent honor,” Han Sen said.\n\nLotus Empress said, “You have conquered three emperor shelters. We are on the same level, practically. There is no need for you to be so gracious and polite. Today is a great day, and you should allow for some informality to take precedence. And feel free to simply call me Lotus.”\n\n“You said in your video-thingy that you wanted to make some sort of deal. What kind of deal did you have in mind?” Han Sen asked.\n\n“Wow! You are very forward, and perhaps that is why you have achieved so much in the short time you have occupied the Third God’s Sanctuary, but there is no need to rush, I assure you. That being said, there is much to discuss. So, our talk of it might take a while when the time comes. After the fruit event, maybe?” Lotus Empress suggested, and then went on to ask Han Sen, “Do you know why I hold this event?”\n\n“I’m not entirely sure. If I had this amount of fruit, I’d eat them all myself. And if I couldn’t, I’d make a bed out of them and just sleep on the things. And yes, if you think charity isn’t exactly one of my strong suits… well, you’re right!” Han Sen said, in a half-jest.\n\nLotus Empress found it funny. She giggled a little and said, “You humans are quite hilarious, I must say. A little weak overall, but you are an exception to that rule.”\n\n“I’ll take that as a compliment; thank you.” Han Sen smiled.\n\nLotus Empress returned to the conversation and said, “The reason why I hold this event is because I must choose… a helper. Yes, that is how I might best describe it. And this time, you are the one I have had my eye on.”\n\n“This thing you need help with, is it associated with the deal you wish to make?” Han Sen asked.\n\nLotus nodded and said, “When I first saw you, I knew you could help me. That is why I left a mark on you. I was going to bring you straight to my shelter, but somehow, your mark was erased. I was worried, for a time.”\n\nShe then went on to say, “I didn’t expect that you not only survived, but you achieved so much by starting from scratch. With your help, I will definitely succeed in what I am planning to do, I am sure of it!”\n\n“But I haven’t agreed to anything yet,” Han Sen said, with a slight smile.\n\nLotus said, “You will. And that is because what I am planning to give you cannot be given by anyone else, and it is precisely what you need.”\n\n“Really? What is it?” Han Sen’s curiosity was most certainly piqued.\n\n“You’ll find out soon enough. First, the event. Then, I will tell you. And if you think I am being coy because the task I want your help with is something sordid, allay those fears. It is not all that bad, I can guarantee it.” She sounded confident.\n\nTo have such confidence was rare, and she must have earned quite a bit of experience from making similar deals in the past, to be so sure.\n\nHan Sen asked, “What is so special about me, then? What made you take notice of me?”\n\nLotus said, “You’re special because you aren’t.”\n\n“Is that a compliment?” Han Sen asked with a wry smile, as it was an oxymoron.\n\nLotus Empress went on to explain. “Yes. As spirits, we are all attuned to a certain element in particular. Your body, however, isn’t. And I need someone as… flexible as you.”\n\n“But all humans are like this,” Han Sen said.\n\nLotus shook her head and said, “I have examined many humans, since long before you stepped foot in even the First God’s Sanctuary. Humans have no elements to begin with, that is true, but by the time they reach the Second God’s Sanctuary, they start to become associated with one in particular. And when you reach the Third God’s Sanctuary, that association is settled and fixed.”\n\n“You are different in this regard. I initially thought you’d be like every other human, but your body still has no element it focuses on.”\n\n“That’s not right. I have absorbed many spirit genes, and even maxed out my fire gene tally,” Han Sen said.\n\n“That’s different, but your body is still the same.” Lotus stood up, then went on to say, “Enjoy your time here. For as long as you remain on these grounds, no one will dare attempt to bring you harm.”\n\nHan Sen did not understand why his body was special. And he wasn’t sure why he was special for not being special, as she had mentioned. Han Sen looked over to the Luminous Stone, and without earning any inspiration, he decided to return to his quarters where he could rest.\n\nHan Sen summoned Dragon King and said, “Okay, listen up you. I am ready and willing to give you this egg, even if you don’t want to open up about this entire kerfuffle with your general buddies, but you must serve me for one hundred years.”\n\n“Okay.” Dragon King did not hesitate to agree. One hundred years might have been a long time for humans, but it wasn’t for spirits.\n\nHan Sen summoned Thorn Queen to take the egg and give it to Dragon King.\n\nDragon King was exuberantly happy now. He inspected the egg and immediately wished to drill into it.\n\n“Not yet! If you go in now, heaven knows when you’ll finally come out. Tell me first: what is the point of summoning demi-gods?” Han Sen asked."
}