{
    "chapter": 2606,
    "title": "Very Sky Family",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2606",
    "text": "Han Sen had just returned to his little jade island when Thousand Feather Crane and the Yun sisters dropped by.\n\nHan Sen frowned. For his safety, the leader of Sky Palace had issued a decree forbidding students of Sky Palace from approaching the little jade island. If his three friends had been allowed to visit, it meant they must have received approval from a Sky Palace supervisor.\n\nAs expected, they brought good news alongside a serving of bad news. The good news was that Lone Bamboo was doing fine. He was going to be released soon. The bad news was that Exquisite of the Very High had selected Han Sen. So, Lone Bamboo didn’t need to go to the Very High anymore. Han Sen would have to go and be with the Very High in his stead.\n\n“Sky Palace Leader wanted us to tell you,” Yun Sushang said. “If you don’t want to go to the Very High, we will still find a way for you to stay here. If you don’t want to go, you don’t have to push yourself.”\n\nWhen Han Sen heard this, he felt a bit better. He didn’t want to go to the Very High, no matter how many benefits and goodies he might receive. He had too many secrets, and so he couldn’t allow Exquisite to pry open his mind and examine all his thoughts. He was more scared than Lone Bamboo of being naked and having his secrets leaked.\n\n“Sky Palace Leader wants you to visit him. There is something he needs to tell you, face-to-face,” Thousand Feather Crane said.\n\nHan Sen nodded. He followed Thousand Feather Crane to Sky Palace Leader’s house. The leader of Sky Palace didn’t meet Han Sen in the hall. They met in the garden.\n\nThousand Feather Crane and the Yun sisters had to stop at the doorstep. Without the explicit command of Sky Palace Leader, they were unable to enter. So, Han Sen went through to the garden alone. He found Sky Palace Leader there, sitting in a pavilion and drinking a cup of tea. He was looking at the pond that resided there.\n\n“Sit. This isn’t an office, and I’m not talking to you as the leader of Sky Palace today. You are Yisha’s student, and I am her teacher. I suppose that makes you my half-student, too. Let’s chat.” The Sky Palace Leader pointed to a place near him.\n\nHan Sen sat down and made himself comfortable. He asked, “You want me here to talk about the Very High?”\n\nThe Sky Palace Leader didn’t deny this. He nodded.\n\n“Do you want me to go or not?” Han Sen asked.\n\nThe leader of Sky Palace didn’t answer. He took a sip of his tea and said, “We have an agreement with the Very High. We cannot refuse to hand over the people they select. Anyone they select must serve them for four years. Over the years, many Sky Palace students have gone with the Very High. Most of them return safely, with a lot of benefits and a deified status. But if I had the power to prevent it, I wouldn’t allow any student of Sky Palace to be taken by the Very High.”\n\nAfter pausing, the Sky Palace Leader said, “I believe you have heard about the Very High from Lone Bamboo. I’m not going to lie. Because many students have gone to the Very High over the years, Sky Palace has no secrets from the Very High. They even know about our secret skill Textless Book.”\n\n“In that case, why don’t you refuse their requests?” Han Sen asked. He knew Sky Palace must have had its reasons, and he wanted to know what they were.\n\nSky Palace Leader sighed and said, “Have you noticed that the Sky look like the Very High?”\n\n“You mean…” Han Sen’s brow furrowed. It looked as if he had come to some sort of realization, but he still didn’t understand.\n\n“The Sky and the Very High were the same race in ancient times, but there were brothers that had different opinions,” Sky Palace Leader explained. “They split up, and their descendants became the Sky and the Very High. Textless Book and the Very High Sense are quite similar because of this.”\n\nHan Sen opened his mouth wide in awe. He had thought Li Keer and Exquisite were Sky, at first. He thought the Very High had skills like the Foxes and could change their appearance.\n\nNow he knew that in reality, Li Keer and Exquisite practically counted as Sky.The Sky Palace Leader continued. “Because they have three eyes and they are very powerful, the Very High were the strongest in the universe in ancient times. Although they weren’t as strong as they are now, they could travel between systems. It was pretty awesome back then.”\n\n“But the Very High reproduced very slowly. Their children were few and far between, and the race couldn’t expand. At their most populated, they only had a few hundred people. Then one day, triplet brothers were born, and a lot of changes took place within the Very High. The three brothers were very talented. They became pillars for the Very High. The oldest one became the leader of the Very High. The second and third brothers became elders. The three of them worked together to spread the influence of the Very High. The Very High became the leaders of all races. They controlled the whole universe.”\n\n“However, population growth remained a problem for the Very High. Although they had many systems, they only had one or two hundred people. They had more power than any other group in the universe, but merely holding on to a few systems was hard. So, the three brothers began to fight.”\n\n“The second brother out of the three wanted to breed with other races to increase the population of the Very High. The eldest brother wanted to keep the blood of the Very High pure. The third one was neutral and believed both plans could work. The three of them were very smart, but none of them could convince each other. The third brother remained uninvested in the arguments, but the conflicts of the first and second brothers became worse and worse.”\n\n“The second brother wasn’t a leader, so he couldn’t do what he wanted. Instead, he rallied a few others to his cause and departed. They created what you now know as the Sky. And nowadays, we have Sky Palace. The mixed blood increased the ability of breeding, but it also made the genes of the Sky unstable. Our gene talents are shakier. After all these years of mixed blood, most of the Sky’s gene talents aren’t as good as the Very High’s. But every now and again, there one of the Sky with greater genes. Their gene talents can be even better than those of the Very High.” Speaking of this, Sky Palace Leader sighed and said, “But our origins still lie in the Very High. Their blood still courses through our veins. When the Sky are in danger, the Very High always lend aid and ensure our safety. So, back then, the Sky leader forged an agreement with the leader of the Very High. It isn’t something we should go against. My people are in our current position of safety and security thanks to the efforts of the Very High. We should pay them back. It isn’t too much to ask.”\n\n“Are you saying you want me to go with the Very High?” Han Sen asked.\n\nThe Sky Palace Leader shook his head. “It is entirely up to you. I’m just telling you the pros and cons. If you go, I will ensure your safety. For as long as I am here, and if you don’t commit a crime of murder, I can protect you from any harm. So don’t worry about that. Plus, there are some treasures in the belongings of the Very High that can help you with your wounds. If you go there, it won’t take three years to heal. You will be healed in a short amount of time. Of course, if you don’t go, it will be great for Sky Palace, too. You can stay here while I deal with the Very High.”\n\nHan Sen was very touched. He knew the Sky Palace Leader wanted him to go, but Han Sen didn’t want to go. He couldn’t allow anyone else to access his secrets. Otherwise, it could be disastrous for the sanctuaries and humans."
}