{
    "chapter": 1868,
    "title": "Black Cliff Wish",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1868",
    "text": "The moon itself did not glow. It borrowed the power of the sun to glow. The moon that provided the geno art was the same. Its light was used to light up one’s spirit, and it worked very well.\n\nBut it was hard to find light treasure. For now at least, Han Sen did not know of a location in which he could find something like that.\n\nAccording to the Moon God geno art, the different light treasures he absorbed would affect the sort of spirit he summoned. It would affect its element and even its shape.\n\n“I wonder if I can find a good treasure here on Planet Eclipse? If I’m unable to, I’ll have to head back out there in search of one,” Han Sen thought.\n\nBut for now, Han Sen was planning on scouring the reaches of Planet Eclipse for one. He had skills, Teeth Rabbit shoes, and Marquise armor to stay alive. He should have no problem doing battle with a Duke, in such a condition.\n\nHan Sen took out ten grams of the geno fluid he had been given by Yisha, and then, he swallowed it.\n\nThen, he felt an energy begin to flow and spread throughout his body. It took around five hours for it to be fully absorbed. The spells he had definitely felt improved, so it was clear to him that Yisha was not skimping, and she was giving him some good stuff.\n\nHe felt the energy spread out across all of his body, and he made sure to use The Story of Genes during the absorption process.\n\nHan Sen did not feel any negative side effects to the consumption of it, but he didn’t use any more. He was going to follow Yisha’s commands and take the small dosage of the stuff every ten days.\n\nMuch good news came from the base those days, too. The ordinary women were starting to become Barons, and by now, there were four of them.\n\n“The gold raven mark works! It is a shame the kids are just too young. They haven’t been able to generate geno armor yet. If they all became Barons, I’d have a mighty workforce,” Han Sen thought to himself. Still, he went ahead to establish a school to better educate the women and kids. He also had a school to teach them about combat and geno arts.\n\nInside a cave on Black Moon Planet, a fire flared upwards like a water spring. A Rebate with black ears was naked and drenched in sweat. His muscles shone in the glow of the fire.\n\nDong! Dong! Dong!\n\nThe big man was swinging a black steel hammer. When it struck the red hot steel, a flurry of sparks erupted.\n\nSlowly, the hot steel was taking on the shape of a knife. The big man ran water along it eventually, then examined it closely. He looked disappointed, and then he threw it away. The knife ended up on a mountain of other knives. He spoke to himself, saying, “No… this material cannot be used to make a Knife Blank. It is too poor.”\n\nAfter that, the man picked up another hunk of ore and threw it into the fire. It was more material for forging. When the man failed again, the ground split in two. Flames rose from the earth, and the place was becoming so hot, even the rocks started to melt.\n\nThe big man frowned and looked into the fire. He had been there for a long time, but he had never seen the fire behave that way. Just as he started to step closer and see what had happened, the fire took on the shape of a fire spirit.\n\n“What are you?” the big man frowned.\n\n“Black Cliff, do you wish to forge a real knife?” The fire spirit used a decidedly vague voice.\n\n“Of course. Otherwise, why would I have waited here for over a decade?” Black Cliff said simply.\n\n“If you make a wish to me, I can help you forge the strongest knife in existence.” The fire spirit’s voice still sounded so vague.\n\n“That’s alright. I will use my own hands to forge the strongest knife.” Black Cliff rejected the offer and looked confident in himself.\n\n“But you lack the proper materials. If you make a wish, I can find you the best ore that there is,” the fire spirit continued.\n\n“You can help me find materials?” Black Cliff looked at the fire spirit intently.\n\n“Yes, of course. I am a god who knows everything. It is easy to locate what you need. If you ask, I will help,” the fire spirit said arrogantly.\n\n“Why are you helping me?” Black Cliff frowned.\n\n“Because you yourself want to be considered a god. So, make the strongest knife and become a god! Your desire for this has touched me,” the flame spirit said.\n\nBlack Cliff did not believe the entity, but he really wanted the materials. He wanted them more than anything. So, he looked at the spirit and said, “Okay. If you find me the materials, I will pay you back.”\n\n“You do not have to pay me back. Your loyalty is my best reward.” The fire spirit looked incredibly happy.\n\nThe fire spirit looked happy, and then the fire erupted again into a giant wall of flame. Black Cliffs eyes were on fire, too.\n\n“Go to Planet Eclipse and find Han Sen. He has precisely what you need. It is a Knife Blank that you want.” The flames of the fiery spirit looked angry.\n\n“Planet Eclipse… Han Sen… Knife Blank…” Black Cliffs eyes burned. Although the fire on the ground was gone, the fire in his eyes remained.\n\nIt was half a month after the festival now, and Han Sen was pretty much done with the Moon God geno art. His Jadeskin had become Viscount, and it had been successfully modified. So, it should have been fine for Han Sen to practice with now.\n\nThe other part still needed to be fixed, but he hadn’t reached there yet. He couldn’t just jump over to fix it.\n\n“Old Han, what are you doing?” Xie Qing King pushed open the doors.\n\n“Practicing a geno art. You…” Han Sen raised his head and drifted off as he stared at Xie Qing King.\n\n“Haha; I have become a Viscount! Cool, huh?” Xie Qing King looked cocky.\n\nThat is very nice.” Han Sen gave him a thumbs-up. Although he had provided Xie Qing King many xenogeneic genes to make leveling up a little easier, it still felt like it was too fast.\n\n“He became a Viscount because of the gold raven power. Without that power, there’s no way he could have leveled up that quickly,” Gu Qingcheng spoke as she approached.\n\nWhen Han Sen saw her, he realized she had become a Viscount, too.\n\nThey didn’t hide this fact, so it was easy to learn.\n\n“Not bad! The gold raven mark was pretty good. But it was just a onetime thing, and it has gone now.” Xie Qing King licked his lips.\n\n“Well, what lucky timing for you guys to become Viscounts. I am planning on hunting up in the mountains. Would you like to go?” Han Sen asked with a smile."
}