{
    "chapter": 2753,
    "title": "God’s Curse",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2753",
    "text": "“We need to go see the leader at once. Bring your coral with us.”\n\nHan Sen and Exquisite were shocked. Uncle Nine’s Very High Sense was at a very high level, so the chances of him getting emotional were very low.\n\nBut now, he looked rather shaken. Not saying anything further, he took Han Sen and Exquisite and headed to see the leader. Clearly, this was a matter of some importance.\n\n“Uncle Nine, is Han Sen in a dangerous situation?” Exquisite couldn’t help but ask.\n\nUncle Nine nodded and said, “We will talk about it when we reach the leader. This is a very serious matter. If we don’t sort this out correctly, it could have terrible consequences.”\n\nAfter that, Uncle Nine didn’t wait for a response from either Han Sen or Exquisite. He rolled up his sleeves and teleported away with both of them.\n\n“Old Nine, what brings you here? Why the rush?” The Very High Leader was resting on a rocking chair inside a wooden tower. When he saw Uncle Nine bring Han Sen and Exquisite into his wooden home, he frowned.\n\nInstead of explaining, Uncle Nine merely pointed to Han Sen and the blood coral and said, “Leader, look at his body.”\n\nThe Very High Leader was confused, but when he saw the blood coral and Han Sen’s scales, his face changed. He was the leader of the entire race, but he shot to his feet in surprise. His eyes widened as he stared at Han Sen and the blood coral. He couldn’t even blink.\n\nHan Sen now knew for sure that this would be a very troublesome affair. If even the Very High Leader was showing such a strong reaction, that meant the situation was already very serious. Far more so than Han Sen had initially believed.\n\nHan Sen was going to ask what was going on, but Uncle Nine already opened his mouth to inquire, “Leader, is this what I think it is?”\n\nThe Very High Leader nodded his head heavily. After a while, he spoke in a distant tone of voice. “I can’t believe it has happened.”\n\nUpon hearing the Very High Leader’s confirmation, Uncle Nine’s face looked even dourer.\n\n“What should we do?” he asked the Very High Leader seriously, looking at Han Sen.\n\n“We must suppress this. We can’t take any chances,” the Very High Leader responded without hesitation.\n\n“Sir, what is wrong with Han Sen?” Exquisite asked, now deeply worried about what was going on.\n\nThe Very High Leader and Uncle Nine stared silently at Han Sen. After a pause, the Very High Leader said, “This is something that began in the Sacred era. Back then, the Very High were not so grand and famous, and the Sky had yet to splinter from us. The strongest race in the universe was Sacred, and Sacred was also the strongest faction.”\n\nThe Very High Leader paused, and his expression was unreadable. “According to our historical records, a disaster struck our race. It prompted us to ask Sacred for their help. In response, Sacred sent an elite to Outer Sky to help us overcome the challenge. But for some reason, the elite of Sacred died in the Buried Dragon Sea.”\n\n“Is whatever is happening to me related to the Sacred elite?” Han Sen asked.\n\nSacred Leader nodded and said, “That elite sacrificed himself to help us out of the disaster. But he was cursed by his opponent due to his actions.”\n\nHan Sen’s eyes narrowed and he asked, “If that elite is dead, why does the curse still exist?”\n\n“Our ancestors thought that the matter came to a close when the Sacred elite was killed. But evidently, they were wrong. Your body is growing scales. That means the curse didn’t end with the Sacred elite’s death…” Uncle Nine answered, pointing to the blood coral and the scales on Han Sen.\n\n“What kind of curse is this?” Exquisite asked with worry.\n\nThe Very High Leader and Uncle Nine looked at each other. Uncle Nine sighed and said, “The curse proclaimed that after the Sacred elite died, he would someday rise again. He would become a monster that only knew how to kill.”\n\n“Our ancestors believed the Sacred elite was completely destroyed, far too damaged to be revived. They thought the calamity was over, but…” the Very High Leader trailed off, looking at Han Sen’s blood coral. After a while, he said, “But the blood coral you are holding is just like the geno armament wielded by the Sacred elite. The scales you are growing look just like his scale armor. That Sacred elite might end up being reborn through your body. That is the nature of the curse.”\n\n“Is there no way to erase this infection?” Han Sen wasn’t excited about this news at all.\n\nVery High Leader and Uncle Nine shook their heads apprehensively. Exquisite quickly said, “Mister Leader, with your power, there must be something you can do. Please save Han Sen.”\n\nThe Very High Leader sighed and said, “I’m not remaining inactive because I don’t want to help. I really can’t. The scary being that cursed the Sacred elite was a real god. That Sacred elite fought that god, when the god was chased away, the toxic curse came into effect. It cannot be removed with our power.”\n\n“A god cursed the Sacred elite?” Han Sen asked, his heart suddenly pounding.\n\nThe Very High Leader said, “Maybe you don’t believe this universe has gods, but they do exist. Most ordinary creatures cannot see them.”\n\n“I believe in gods. What was this god called? And what was that Sacred elite’s name?” Han Sen asked the Very High Leader, trying to keep his excitement under wraps.\n\n“I don’t know much about what happened. Not much detail was recorded about that fight. It appears that someone tried to erase the details of it. We only know that the fight was called God’s Disaster, and that the Sacred elite was named Dragon. Those are the only details we have.”\n\nThe Very High Leader looked at Han Sen and said, “If Dragon’s power is being reborn through you, then we will have to suppress you. If the curse is real, then we can’t allow you to become a killing monster that might destroy the universe.”\n\n“Dragon’s power might not end up being reborn through Han Sen’s body. Maybe the whole reborn thing means Dragon himself. Didn’t Han Sen say that the blood coral forest contains the carcass of a monster? Maybe that is the real Dragon…” Exquisite quickly suggested.\n\nThe Very High Leader nodded and said, “That coral forest and the body down below will be suppressed as well.”\n\nHan Sen didn’t think things were going too well. The Very High were planning to lock him up like an animal.\n\n“Mister Leader, I might be infected, but perhaps there is a way for me to save myself. The Very High have many elites, so there has to be a way to remove these small things from my body,” Han Sen said quickly.\n\n“We will try our best, but if nothing works, we might have to lock you up to prevent something very bad from happening.” The Very High Leader was a very logical man. Like most Very High, he didn’t get emotional when he faced a crisis. He sorted out problems in the most efficient way that he could.\n\nHan Sen knew that right now, he was like a patient who had a very contagious disease. The best way to deal with it was to quarantine him. The Very High Leader was right. But Han Sen didn’t see being locked in a cage as an acceptable solution. He felt very upset."
}