{
    "chapter": 2561,
    "title": "What Is Equality?",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2561",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was shocked. He thought they might all be storming over to mob him, but they had actually all come to him for a blessing. That realization made him feel much safer.\n\n“To be honest, performing blessings can harm my body and reduce my lifespan. After blessing someone, it takes me half a year to recover. My lifespan is also cut down by a hundred years. If I didn’t need the xenogeneic genes, I wouldn’t have accepted Barr’s offer. So, if you offer me two thousand, four thousand, or even five thousand now, I won’t do it. I’m sorry if I have to disappoint you like this,” Han Sen said, feeling bad about the words even as they came out of his mouth.\n\nAlthough using the Blood-Pulse Sutra consumed a lot of energy, it wasn’t half as bad as Han Sen made it sound. He only needed a day or two of rest. And in regards to shortening his lifespan, that was pure nonsense.\n\nHan Sen said this because he didn’t wish to bless any old Tom, Dick, and Harry that came by. And he needed to maintain his reputation. He wouldn’t be considered as prestigious and special if he went around blessing everyone.\n\nHan Sen didn’t think he was lying, though. They wouldn’t believe that a deified could be produced for practically no cost at all.\n\nWhat Han Sen said seemed to make sense. Reducing a lifespan by one hundred years for a deified was still a low price to pay.\n\nOf course, it wouldn’t harm their lifespans. For them, it was okay.\n\nBut what made them so depressed was the fact that Han Sen wasn’t going to accept King xenogeneic genes in order to bless others.\n\nNow, every race regretted it. If they had known what would happen when Han Sen first announced a blessing for the price of two thousand xenogeneic genes, they’d have bought it without a shadow of a doubt.\n\nThe situation now sucked. Even if they paid him triple the original price, he wouldn’t bless them.\n\n“We allowed the Destroyed to snap up a bargain.” Many of the higher races felt incredibly sad. They were very jealous of the Destroyed’s Barr.\n\n“Mr. Godfather, I’m willing to use my body. I will be a maid or a slave or anything you wish of me to become. I’m begging you to be nice enough to bless me just once.” A Fox woman winked at Han Sen.\n\n“Teacher Han, this is the Sky Treasure Lotus, known as the Five Treasure. Eating one lotus seed can increase your lifespan by ten years. There are twenty-three here. I’m hoping you will be willing to bless our master just once.”\n\n“Teacher Han…”\n\nHan Sen had said he was no longer accepting xenogeneic genes, so the smarter people started to offer all sorts of different benefits and gifts in the hope it would convince Han Sen to bless them.\n\n“My body hasn’t yet healed. I cannot bless you. It is useless, even if I make promises. You must wait until my body is healed first.” Continuing to talk to them was pointless. No matter how many times Han Sen tried to explain things, he couldn’t get rid of them, so he decided to exit the core area.\n\nBack in the white whale, Han Sen became Dollar again. Then he returned to the core area.\n\nWith Barr’s two thousand core xenogeneic genes, he was very close to getting his four areas to the ninth tier. Han Sen planned to kill a few xenogeneics by himself, and while doing so, he might as well practice his teleportation abilities and Big Destroyed.\n\nSince he used Dollar’s identity to enter the core area, not many people cared to bother him. That didn’t mean that no one came after him, however.\n\nHan Sen found the bronze furnace, and after they flew for only a few minutes, two women of the Sky came racing toward him. One of them was Li Keer. He already knew her. The other woman had a white veil obscuring her face. Han Sen couldn’t determine what she looked like, but he knew she was one of the Sky.\n\n“Brother Dollar, long time no see,” Li Keer said calmly, forcing her demeanor to be casual.\n\nShe and the other woman had been waiting there all that time for Han Sen to show up again in his Dollar persona. But it had been a long time since Han Sen used that persona, and so they had been waiting for a very long time.\n\nFortunately, they were not impatient people. They had remained by Dollar’s exit point until he reappeared.\n\n“Lady Keer, who is this?” Han Sen asked, looking at Third Sister. He thought that the woman was quite strange. She didn’t seem to be looking at a person; it was more like she was examining a product, and it made Han Sen feel rather uncomfortable.\n\n“This is Third Sister. Her name is Exquisite.” After Li Keer introduced the other woman, she said, “Brother Dollar, if you don’t have anything else to do, how about we hunt xenogeneics together?”\n\nHan Sen hesitated. He didn’t want to travel with others. He really just wanted to quietly hunt xenogeneics and practice his geno arts for a while.\n\nBut he did have a history with Li Keer, and so he would have felt bad if he turned down her request.\n\n“Li Keer taught me how to teleport, and she knows I have Big Destroyed. I suppose I can practice in front of her,” Han Sen thought. He nodded to the women. “Sure. I’m not familiar with this area. Do you know where I can find King class xenogeneics?”\n\n“I know of a place with many King class xenogeneics. Allow me to take you there,” Li Keer said with a laugh.\n\nHan Sen went silent for a moment, then said, “If we cooperate, there is something we should discuss first. We should talk about how we will separate the loot.”\n\n“How about an even split?” Li Keer suggested.\n\n“Yeah, I think that is great. I will take fifty percent, and you two split the other fifty. Are you guys okay with that?” Han Sen said.\n\nLi Keer was surprised. When she suggested an even split, she meant that they should divide the loot three ways, with everyone getting an equal share. Her even split was different from his even split.\n\nExquisite said coldly, “That division of shares is unfair. Whoever works the most should earn the most. We are cooperating, but we don’t need to divide up the prizes. There are many xenogeneics. Whoever kills a beast can loot it. Sharing doesn’t matter.”\n\n“I like the way you think.” Han Sen nodded. Splitting things up that way would be best.\n\nWith Li Keer leading the way, the three of them flew into space.\n\nHan Sen was able to talk easily to Li Keer, but Exquisite had a very loner-type personality. She wasn’t very fond of talking, and she didn’t say a word to Han Sen.\n\nThe way she looked at Han Sen made him uncomfortable, too. She was like a robot without any emotions.\n\nExquisite was going to use this xenogeneic-hunting opportunity to get a first-hand look at the power Han Sen wielded. She wanted to see more of his personality, too.\n\nShe hadn’t expected that Han Sen would suggest dividing up the loot in such a way. Rather than saying anything, Exquisite planned to teach Han Sen a lesson.\n\nShe was going to test Han Sen’s mettle and steal all of his kills.\n\n“I want to see who you really are.” Exquisite touched her eyes. They had healed now, but she was still scared after what happened.\n\nThe bronze furnace was flying next to Han Sen. When they reached a certain area, it stopped in its tracks and started to cry to Han Sen.\n\n“What is it?” Han Sen asked, frowning and looking at the bronze furnace.\n\n“Danger,” the bronze furnace said by writing words in fire and smoke."
}