{
    "chapter": 95,
    "title": "Evolver-3",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_95",
    "text": "Because of the misunderstanding, Han Sen continued to challenge the evolver level of Hand of God, but he was making little progress even when using Jadeskin.\n\nRecently, Yang Manli was satisfied with Han Sen’s performance. He had finished all the tasks she assigned him and the data of the gravity trainer became normal again. She thought it was because he had stopped exploiting the loophole, but little did she know that he was actually increasing the difficulty so that his result could look normal.\n\nIt was almost midnight and Han Sen was the only one left in the gym, playing Hand of God. He had discovered that the game was almost designed for him.\n\nSince he started practicing Jadeskin, he had gained exceptional control of his bones and muscles, and he had also become much more flexible. This game could help improve his reflexes and agility, which was a great for his progress with Sleeveblade and other skills that required handwork.\n\nQin Xuan teleported out of God’s Sanctuary to look for Yang Manli, who chanced not to be in the teleport station.\n\nWhen passing by the gym, Qin Xuan saw the light in the gym was still on and knew someone was still in there. She curiously took a look and saw Han Sen was playing Hand of God.\n\nQin Xuan felt nostalgic as she played this game a lot when she was in military school, putting a lot effort in it as well.\n\nAlthough autonomous vehicles had been the mainstream in the Alliance for a long time, manual control was still needed when one was operating a warframe. In an interstellar war, warframes were fundamental as it would be hardly profitable to destroy a planet with weapons of mass destruction.\n\nWarframe, as an individual combat tool, played a vital role in wars these days.\n\nAll military schools were training their students to operate warframes, which was one of the basic skills of a soldier. Hand of God was one of the best ways to improve one’s speed and control, which were relevant to warframe operation.\n\nQin Xuan felt that she should teach Han Sen some tricks of the game. As he was handpicked by her, she would like to make him better.\n\n\"Let’s see how you are doing first.\" Qin Xuan approached Han Sen and watched carefully. She was a bit far from him just now so all she could see was that he kept failing, and that was why she wanted to teach him.\n\nBut when Qin Xuan got closer, she suddenly felt that the holographic spots were disappearing too fast, which was why he kept making mistakes.\n\n\"Which level did he choose?\" Qin Xuan checked the data on the screen.\n\n\"Evolver-3?\" Qin Xuan could not help but frown. She thought that Han Sen was too ambitious. The evolver level was designed for evolvers, as the name suggested. The unevolved could sometimes pass the evolver level, but the was very rare.\n\nEven for Qin Xuan with her current abilities, she could only pass evolver-2 occasionally, which was already incredible for an unevolved. After all, the unevolved weren’t the target players here.\n\nBut Han Sen was challenging evolver-3. And he was just aiming too high.\n\n\"Biting off more than you can chew will get you nowhere,\" she thought, while she did not interrupt Han Sen but watched him starting over again and again. She wanted to teach him a lesson when he chose to give up.\n\nHaving watched for a while, Qin Xuan became serious, then surprised, and eventually shocked.\n\nHan Sen was failing again and again. But in this process, he was making less and less mistakes and improving at a shocking rate.\n\nAs someone who had worked hard on this game, Qin Xuan knew that once you had reached your limit in the game, you could hardly improve again even with months’ effort.\n\nA limit is a limit. And no practice could bring you over your limit. Unless your strength had improved significantly, no exercise could raise your score.\n\nThe purpose of playing Hand of God was to show one’s potential. But one couldn’t improve one’s potential by playing the game over and over again.\n\nNow Han Sen’s improvement could only mean one thing—evolver-3 was not yet his limit. That was why he could still reduce his mistakes and get better.\n\n\"Evolver-3 is not his limit. Is his talent in this area so great?\" Qin Xuan did see great things in him, but did not expect he would be so good at this game.\n\nWhen she was in military school, the champion of the military academy league was just able to pass evolver-3. And that guy was top 10 in the warframe contest of the league. He was known for his swiftness and accuracy, and even had a nickname \"Lighting Hand.\"\n\nHan Sen reached the same level without any professional training, which was why she felt shocked.\n\n\"Can he pass evolver-3?\" Qin Xuan stood aside, watching Han Sen with a complicated expression on her face.\n\nHan Sen did not notice the arrival of Qin Xuan at all. Now, all his attention was focused on hitting the spots appearing everywhere. Jadeskin was fully employed.\n\n\"Faster, I can go faster!\" Han Sen's arms kept making swift and odd moves, twisted like serpents from time to time. Using all the muscles in his fingers and arms, he kept hitting all the spots appearing from nowhere.\n\nAfter the completion of evolver-2, Han Sen had experienced countless failures adapting himself to the difficulty of evolver-3. He felt easier and easier to keep going and started to feel that he could definitely pass this time."
}