{
    "chapter": 2195,
    "title": "Jade Drum",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2195",
    "text": "Night River King wanted to kill Han Sen. He even used his crescent blade, but try as he might, he couldn’t lay so much as a finger on Han Sen. When Han Sen left the planet unharmed, Night River’s failure made him a laughingstock to all the Nobles inside Narrow Moon.\n\nAlthough ordinary Nobles wouldn’t mock Night River King to his face, they were more than happy to discuss it while his back was turned. They were all surprised that Han Sen’s shield was so powerful, and that Night River King had performed so poorly.\n\nA while ago, Han Sen handed out his spare Bai Semas to Zero, Little Angel, and Han Meng’er. He kept the gold one for himself.\n\nHan Sen did this because he wanted them to guard the base. If King class elites ever attacked the base, his companions could use the tri-color Bai Sema to protect it. By combining the three shields of different colors, the defensive properties could then protect the entire base from an assault. King class elites wouldn’t be able to punch through that easily.\n\nIf Night River King decided to go all the way, Han Sen had to ensure that his base was protected. He couldn’t afford to be ambushed unprepared.\n\nAnd as for Han Yan, Han Sen had contacted Sky Palace in the hopes he could secure a place for her there. When they accepted her, he’d give her the gold Bai Sema so that her own safety was assured.\n\n“It would be great if I was able to obtain a few more Bai Sema beast souls.” Han Sen already had four, but he was of the mind that it wasn’t enough. He imagined finding and killing a few more of those Demon Bug Kings.\n\nAt this stage, Han Sen didn’t need to be afraid of anything. He went to Cold Palace to absorb moon and cold powers on every first and every fifteenth day of the month. Every single time, he also blocked all the moonlight that might otherwise fall on Night River King. He received nothing.\n\nNight River King had finally gotten the guardian position, but all he could ever do was sit around and watch Han Sen get all the goodies he had wanted for himself. The refreshing breeze was all he could enjoy. He hated Han Sen to the depths of his soul, but he now knew there was nothing he could do to him.\n\nHe looked for another elite who might be willing to stop Han Sen from visiting Planet Blade, but even the other Kings that were friends with him—like Shadow King—did not agree with him.\n\nThe Narrow Moon assembly had cooperated against Han Sen when Yisha died because they wished to share Yisha’s legacy items. Even the Nobles that followed Yisha did not want to give Han Sen all her things. He was an outsider, and they all wanted some of her stuff for themselves. That’s why no one had objected when Han Sen was given almost nothing.\n\nNow, things were different. The items were distributed and Night River King had become the guardian, so there was no longer a reason for anyone to help him take Han Sen out.\n\nYisha had only just died, and they had already stolen what Han Sen deserved. What would people think of them if they went after Han Sen again?\n\nPlus, Han Sen had that powerful Bai Sema. He’d be very difficult to take down, and there was no guarantee they could. Night River King had already tried to overcome the shield, and it had only led to a soured reputation. The other Kings did not want to do something that wouldn’t benefit them. It was none of their business.\n\nNight River King couldn’t stop Han Sen alone. So, two nights a month, Night River King was forced to watch as Han Sen absorbed that moonlight. He hated the fact that Han Sen had weaseled permission to access the planet out of him.\n\nBut now, it was too late. Han Sen never missed a day. And eventually, Night River King lost all interest in going to Planet Blade.\n\nHan Sen kept practicing with his cold and moon powers, hoping to become a Duke soon. And then, he’d be able to absorb Duke genes.\n\nNight River King wasn’t crazy enough to go to Planet Eclipse, although he wanted to very much. Part of him wanted to go and crush the planet in every way. But even causing an issue with the delivery of supplies didn’t seem likely.\n\nThere weren’t many people in the base, and on top of that, there were many resources around. So they wouldn’t run out of food anytime soon. And in regards to everything else, they were well-supplied there as well.\n\nBlack-Moon King gave Han Sen some additional help, which ensured that Planet Eclipse wasn’t an isolated community. Isolation did not mean anything to Han Sen, but he appreciated the aid he was given.\n\nTime passed, and Han Sen’s Jadeskin neared Duke level. But before he could break through and reach the rank of Duke, he received a message from Huangfu Jing.\n\nThat surprised Han Sen. Huangfu Jing was a very independent woman. Her title in the Alliance was Queen, and her personality fit that title very well. If she was contacting Han Sen out of the blue, then something must have happened.\n\n“What happened?” Han Sen asked immediately. There was no need for formalities with her.\n\nHuangfu Jing answered just as directly. “I am on Planet Jade Drum. There’s trouble.”\n\nTell me clearly.” Han Sen scanned through an overview of Planet Jade Drum as he walked and talked.\n\nPlanet Jade Drum was a planet that belonged to Thousand Treasures. There was a xenogeneic there that was named Jade Drum. It was the namesake of the planet.\n\nStone Drum, Steel Drum, Bronze Drum, Silver Drum, Gold Drum, Jade Drum—those six xenogeneics were ordinarily Duke class.\n\nAnd all of them lived exclusively on Planet Jade Drum.\n\nAccording to the information he dug up, Jade Drums could become King class, but the King class Jade Drums were usually taken away from Planet Jade Drum.\n\nThe Jade Drums were highly sought after because they were very unique. The creatures couldn’t move, and they required other races to help them travel around the universe. Normally, Drums would follow a stronger race. If someone wished to take a Drum away, they would have to receive Drum’s approval. If this was given, the Drum would allow itself to be removed from Planet Jade Drum.\n\nJade Drum xenogeneics were musical xenogeneics. They could go anywhere in the universe and absorb sound to level up. The powers they wielded were sonic, as well. If someone kept a Jade Drum next to them, and they were attacked with sonic power, the Jade Drum would shield them and fight back with sonic powers of its own.\n\nHuangfu Jing was off exploring. When she went by Planet Jade Drum, she wanted to try her luck at catching a Silver Drum.\n\nSurprisingly, Huangfu Jing received the approval of a Jade Drum. But after that, things started to go poorly.\n\nThe Jade Drums belonged to Thousand Treasures. Thousand Treasures kept the creatures there as free treasures. Anyone who bought a ticket from Thousand Treasures could go to Planet Jade Drum and find a Drum that might wish to accept them.\n\nAs far as how one went about finding a Drum and gaining their approval, Thousand Treasures did not care. They would just register the Drums that were taken away.\n\nHuangfu Jing was just an Earl, but she had gained the approval of a Jade Drum. Thousand Treasures might still allow her to take it, but if she registered it, everyone would learn that an Earl had taken a Jade Drum. She would be safe on Planet Jade Drum, but many people would seek to take it away from her if she left.\n\nSo, Huangfu Jing hadn’t registered it yet. Instead, she called Han Sen."
}