{
    "chapter": 2515,
    "title": "Pick One",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2515",
    "text": "“Fortune teller, where will you run this time?” A woman was gripping a knife in a rock-steady hand. She was holding the knife to an old man’s neck.\n\nCough, cough!\n\n“What is this? Put your knife down. We are old friends. We should talk about this,” the man said indignantly.\n\n“If I don’t keep this knife to your neck, I’m afraid you might just run away,” Yisha growled to the old man.\n\n“Why would I? Seeing you actually makes me very happy. Why would I run?” The old man forced a smile. His fingers tried to touch the knife against his neck, hoping to move it away.\n\n“Stop talking crap. I have been looking for you for the longest time. You must pay the terms of our bargain,” Yisha said emotionlessly. The knife was still against the old man’s neck. The old man dropped his hands away from the blade.\n\n“You’re talking about that? You should have told me sooner. I found out a long time, but because you weren’t looking for me, I thought you didn’t need the information anymore.” The old man looked as if he had just woken up.\n\n“Where is he?” Yisha didn’t want to explain. She had been looking for this old man for so long. Finding him hadn’t been easy.\n\nThe old man seemed to be sad, and he said, “I made the calculation far too long ago. He is long gone by now.”\n\nSeeing Yisha’s expression darken, the old man quickly said, “But don’t worry, I’ll calculate a new bearing for you at once. Three minutes. Give me three minutes, and I will give you Dollar’s location.”\n\nHearing the old man say this, Yisha’s mood lightened a little.\n\n“I will calculate it now. Just stop waving that knife around. You are such a pretty girl, but no one will marry you if you behave like this.” The old man carefully pushed the knife away.\n\nThis time, Yisha didn’t resist. She slid the knife back into its sheath, then turned her expressionless face back to the old man. “You have three minutes. If I don’t know where Dollar is in three minutes, I am going to make you marry someone.”\n\n“Me?” The old man was shocked, and he didn’t know what Yisha meant.\n\n“I will make you the son-in-law to the king of hell,” Yisha grunted.\n\nThe old man smiled wryly. He lifted his hand and began the calculation. He raised his head to Yisha and said, “I lost the bet. I have to admit it. I have your answer, but I also have two locations. One is Dollar’s location, and the other is your student’s location. You know the rules. I only lost to you once, so you can only choose one location. Which do you wish to know more?”\n\n“Han Sen is still alive?” Yisha frowned.\n\n“He is for now, but he isn’t doing well. If no one goes to save him, I’m afraid…” The old man stopped talking. He just shook his head and sighed.\n\n“Can he still be saved?” Yisha asked with a frown.\n\n“He can if you go there.” The old man nodded.\n\n“Where is he now?” Yisha asked.\n\n…\n\n“My lady, are Dragon One and Dia Robber really going to kill the Gold Armor General?” In the core area, a maid-looking woman of the Kate was curiously looking at a woman in a yellow shirt. They were on a ship.\n\n“They’re spending a lot of manpower on this project. It cannot just be for show.” The lady in yellow was attractive and composed. She seemed young, probably no more than twenty years old. But her eyes were alert and intelligent, as if they could see through everything.\n\n“The Gold Armor General is as good as a deified xenogeneic outside the core. Are they really going to kill it? I have heard that they have hired someone called Dollar, and they seem to have high expectations of him. I don’t get it, though. He hails from some small, nameless race. He achieved first place in the Marquise bracket of the Geno Being Scroll fights, but that’s it. The evolution of his genes can’t be that good. Why would geniuses like Dragon One and Dia Robber place their faith in a guy like that?” the maid asked, still not understanding.\n\nThe yellow-clothed woman laughed and said, “They’re collecting all the strength that they can. Expensive things are often useful, but we do not know if Dragon One and Dia Robber are using their resources correctly.”\n\n“My lady, Little Butterfly doesn’t understand this. In your territory, you can choose geniuses of the Extreme King, and some of them are already deified. That would save you trouble. Why are you giving up that option, though? To pick a silkworm of some other race? Dragon One and Dia Robber are strong, but they are half-deified. And even when compared to other half-deifieds, they are still worse than the likes of the Extreme King. Am I right?” the maid asked with wide eyes.\n\nThe yellow-clothed woman blinked and said, “I didn’t say I would choose the Extreme King. It’s just that the blood of the Extreme King is quite strong. After all these years, however, I believe they have peaked. Even if they could help me, they cannot improve much more. I prefer someone who can keep improving.”\n\n“Will that make a difference? They will reach the same strength as the Extreme King in the end.” Little Butterfly didn’t understand.\n\nThe yellow-clothed woman laughed. “It is just like how some people enjoy buying adult dogs to watch over their gardens. I would prefer buying a young one and raising it myself. Watching things grow is fun.”\n\nLittle Butterfly seemed to understand this, and so she said, “You mean that Dragon One and Dia Robber are like young puppies? And the Extreme King are adult dogs?”\n\n“Something like that.” The yellow-clothed woman laughed again. “It isn’t just Dragon One and Dia Robber, though. Other races could fit the bill, too. There are many different breeds of racing dogs; you just need to find the one with the most potential.”\n\n“So, which do you think has more potential? Dragon One or Dia Robber?” Little Butterfly was curious.\n\n“Neither of them are bad. Their potential shouldn’t be any worse than the Extreme King’s princes and princesses. But they aren’t the best.” The yellow-clothed woman sighed. “Out of all the people I’ve seen, the best still has to be Sky Palace’s Yu Shanxin. Lone Bamboo isn’t bad, but he is probably taken.”\n\n“Isn’t that a bad thing?” Little Butterfly asked with shock.\n\n“It isn’t that bad. This universe has no lack of geniuses. I just need some more time to find them. Let’s watch Dragon One and Dia Robber for now. Perhaps we might learn something interesting.” The woman’s eyes were like stars. She looked at the sky, thought of something interesting, and smiled. It had a beautiful curve, and she spoke to herself, “Very High’s forgotten love. Although they have big hearts, they are boring.”\n\nMany of the higher races knew Dragon One and Dia Robber were preparing to defeat the Gold Armor General. And so, their every move was watched.\n\nWhen the time for respite was up, Han Sen followed Dia Robber and Dragon One to the system with the Gold Armor General.\n\nThey had eleven half-deifieds with them and six Kings. Most of them were Dragons or Destroyed. There were only two different races.\n\nAlthough Dragon One and Dia Robber could enlist the help of more half-deifieds, they didn’t. The success of this mission wouldn’t rest on the strength of numbers. The trust and cooperation between the fighters were the most important factors."
}