{
    "chapter": 2959,
    "title": "Sacred Race Lantern",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2959",
    "text": "Roar!\n\nOld Vulture and the eyeless big beast made loud roaring noises. They both spat out a stone lantern. They lined them up beside the demon lady in the holy palace. The stone lanterns were releasing lights that covered the entirety of the holy palace.\n\nHan Sen saw the three stone lanterns and noticed they looked very similar to the one he owned. It was like they had all been birthed by the same body.\n\nHan Sen wondered, “Weird. I thought they said the stone lantern was Sacred’s race lantern. Why are there so many of them?”\n\nOld Vulture stood in front of the stone lantern and madly shouted at Han Sen, “Han Sen, don’t you think about getting cocky! If my treasure and god personality were not destroyed back then, you would not be standing right now!”\n\nHan Sen did not care for what Old Vulture told him. He slashed down. This time, the power Han Sen used was stronger than before, but the effect was not as impressive as the last time.\n\nThe three lights tremored. Clearly, the defensive lights backed one another up.\n\nHan Sen slashed a few times consecutively. Although every knife strike made the three stone lanterns’ flames quiver, they were unable to break the protective capabilities of the lanterns.\n\nTherefore, Han Sen knew their stone lanterns were a bit different from the one he personally wielded.\n\nHan Sen’s stone lantern boosted any power but did not change the element they possessed. The lantern itself did not have protective power.\n\nThe stone lanterns possessed by the demon lady and the others had a protective power. However, it seemed as if it did not increase the powers of their attacks or anything of the sort. All the lanterns did was condense and amplify the defensive properties when in the proximity of others.\n\n“Han Sen, don’t you waste your time,” Old Vulture coldly said. “Sacred’s race lanterns are here. With the protection of these lanterns, even if a God Spirit was here, they could not gain access to the holy palace.”\n\n“What you are saying is an absolute joke. You each have a lantern each, so that’s three. I have one. Shouldn’t Sacred have four lanterns?” Han Sen lifted his lips as he spoke.\n\n“Not just four,” the demon lady, Auntie Mei, said. “We should have five lanterns.”\n\n“Every race only has one race lantern. Are you telling me that Sacred has five race lanterns? Do you think I am stupid or something?” Han Sen looked at them with disdain.\n\n“That is because you lack knowledge. The ignorant race lanterns you know are not comparable to our Sacred race lanterns.” Old Vulture looked back with disdain. He really hated this situation.\n\nThe demon lady said, “Every race’s race lantern is already established. It is because they got lucky. It is why they have a lantern to shine and notify the world about their race. The Sacred lanterns possessed by Sacred were creations of Sacred Leader. They are greater than those owned by any other race. They shine for any race that supports Sacred. Every civilian of Sacred can receive the race’s glory. Little Master will become the leader of the universe. You will be Little Leader’s father. You will earn lots of glories. If you are willing, you can help Little Leader’s ascendance with us.”\n\nAfter thinking for a moment, Han Sen said, “So, Sacred does not have a race lantern, and sacred Leader created these stone lanterns.”\n\n“That is good to hear. If the stone lanterns were made by Sacred Leader, they were not approved by the geno hall.” Han Sen randomly asked, “How could it have offered protection to the Sacred civilians?”\n\n“It is not difficult to earn the approval of the geno hall,” Old Vulture proudly said. “All you need to do is get to the hall and place Sacred’s race lantern at the highest point. Do that, and it will be above all the others. Who would oppose that?”\n\nHan Sen was admiring something now, but he was not admiring Old Vulture. He was admiring what Sacred Leader Qin Xiu did. The other races just wanted to light up a lantern and try to earn a position amongst the higher races.\n\nQin Xiu, however, chose to make a lantern for himself. He made his own rules and race lanterns above every race. Not many creatures were able to do something like that.\n\nIt looked like Qin Xiu’s plans failed though. He was unable to bring the Sacred race lantern to the highest point of geno hall.\n\n“Han Sen, you and Little Master, the father and son, can work together. You can rebuild the glory of Sacred. It would be of great benefit to the universe. Stay with me and help Little Master rise the race from the ashes.” The demon lady was trying hard to convince him.\n\nHan Sen had a look of disdain. He slashed down. The lights of the three lanterns shivered.\n\n“Han Sen, do you have no ears? We are just like you. We are here to help Little Master.” The eyeless big beast looked mad.\n\nHan Sen kept slashing the lights. He coldly laughed and said, “It was not like this before. My Littleflower is not a tool for Sacred to use. If Sacred can light up the lantern, it is not a concern of Littleflower. If you want to light it up, it is your own business to do so. Do not take advantage of my Littleflower.”\n\n“Plus, you guys stole Littleflower. You tore my family in half. You should be slashed. There is no need for words to be spoken.” After speaking, Han Sen continued to slash the lanterns over and over. He kept slashing until the lights blew up. Every knife air and lantern light went everywhere. He could not cut it open, but it made the demon lady and the others scared.\n\n“How can Han Sen’s body become so strong? I am afraid he is almost as good as Sacred Leader.” The demon lady was in shock.\n\nIt was difficult to imagine a creature that emerged from the sanctuaries was able to evolve to such a high level.\n\nAlthough the creatures in the sanctuaries consumed other creatures to reinforce their genes, that sort of leveling up changed their blood. It made their genes better generation after generation. That was how they reinforced their blood.\n\nLike Littleflower was the second generation of his genes. He was the biggest benefactor. The genes of someone like Han Sen and others of his generation were really unstable. It was unknown if he could level up or not. It was also unknown whether or not he could become strong.\n\nHan Sen leveling up to become a true god was shocking. Now, he had a scary fitness level. He was much better than most top-class true god creatures in the universe. It was a wild concept to comprehend.\n\n“Han Sen, stop wasting your breath,” Old Vulture coldly said. “Although your fitness is the best out of all true gods, and your power could become stronger than the Holy Kirin, you cannot break the defense of three race lanterns.”\n\n“Really?” Han Sen coldly replied. His cause karma knife leaned forward. The sky was full of knife air. It was like a flood covering the sky and the ground.\n\n“Under the sky, you are all chess pieces. I do not believe there is a chess game I cannot break.” Han Sen slashed down. Knife lights flooded the area. It was like a galaxy being turned upside down."
}