{
    "chapter": 1838,
    "title": "Recruitment Failure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1838",
    "text": "Han Sen told them to take him to see the enlisted Barons. They were mostly comprised of Kate, but there were other races in their midst.\n\nHan Sen smiled grimly. “Do you think I am stupid? Would there really be that many Barons wanting to join me?”\n\nHan Sen thought if there were that many, a lot of them had to be faking their abilities. If not around half of them, then perhaps each and every one.\n\n“It looks like a lot of people are interested in me,” Han Sen said simply, and they just kept recruiting who they could. They were to also wait there for the arrival of Xie Qing King and Gu Qingcheng.\n\nOver the next few days, Han Sen was able to recruit a few more Barons and also four Viscounts.\n\n“Come in, if you so desire. I need a lot of pawns.” Han Sen laughed coldly in his mind. Han Sen was accepting all who would lend their services, and it didn’t matter if they were being honest.\n\nOn the fourth day, he saw Gu Qingcheng draw near. A day after that, Xie Qing King finally arrived. With those two accounted for, Han Sen felt a great relief.\n\nThey didn’t show that they knew each other, and they pretended to be just like the other random Barons. They bunked in the general quarters among the other recruits.\n\n“You guys are so annoying. Didn’t I tell you we recruit only Nobles, and not ordinary people?” A worker felt annoyed, and he pushed a woman away who was trying to climb onboard.\n\nThe woman lost her grip and fell to the ground. She was also clutching her four-year-old girl. She begged and begged, pleading at the man’s feet with tears rolling down her face. “Please, at least let my child come onboard! I will do anything.”\n\n“Get lost!” The worker wished to push the woman further away, but the woman grabbed hold of his leg and held it tight, and there was little he could do to shake her loose.\n\nThe worker was enraged by this behavior, and so he used his other leg to kick her away and send her tumbling back onto the asphalt.\n\n“Mom!” The little girl held onto the woman and cried.\n\nThe woman still wished to beg the worker for a place on the ship. She had no choice, as there was no better fate that awaited them on Planet Kate. The planet was falling apart, and there was nowhere else for them to run. There weren’t many other ships arriving, so she had no choice.\n\nThe worker had been annoyed by these desperate refugees over the past few days, and he’d grown numb to it. He wanted to kick the woman away, as he wasn’t the one who decided who was allowed on board and who wasn’t.\n\n“Children, and mothers with children, are allowed on. But there is something you need to know. We are bound for a dangerous place; a place far more dangerous than here. If you come, you will have to follow my commands. This is a decision you will all have to make.” Han Sen’s voice boomed from the top deck.\n\nIcebird Duke frowned. “What do you want to do with these people? The genes of those kids won’t allow them to become Nobles. There might be one out of every thousand. And with them being so young, they will be nothing more than a burden.”\n\n“I’m here to recruit, yes?” Han Sen laughed.\n\nIcebird Duke did not say anything in response. Her thoughts and feelings towards Han Sen merely soured all-the- more.\n\nKids and their mothers were allowed onboard. And while Han Sen had told them to consider the dangers, they didn’t think there was any better option available to them. If they stayed, they might end up as thralls to some slaver. Even if there was danger ahead, there was every chance they could start a brand-new life on a brand-new planet.\n\nNot many people could fit on the ship. And even with just the kids and their mothers, the seating capacity was overloaded. Han Sen had to go back to Narrow Moon.\n\n“This is bad. If it wasn’t for the Taurus attacking the Kate, things wouldn’t be this bad. And while they are small in numbers, they are a race that enjoys killing. The Kate were just unlucky.” A Baron sighed.\n\nHan Sen did not say anything, and he just told the mothers to look after their kids. They had to follow Han Sen’s commands, no matter what. If they didn’t, they’d face punishment.\n\nThe ship flew back to Narrow Moon. They brought the refugees to the Mirror Lake on Planet Eclipse.\n\nThat was the only place a ship could land. The magnetic storms were too powerful to approach from any other spot. Attempting to land anywhere else would end in tragedy.\n\nThe base was made out of stone. It was quite big, the size of a large castle.\n\nBut a lot of dust had collected in the time since its abandonment. Luckily, it hadn’t fallen apart, though. The doors were still sealed tightly, as well. There was no chance of a xenogeneic sneaking inside.\n\nOnce they entered the base, Han Sen asked the mothers and kids to clean the base.\n\nThey were poor, but they still had to survive. They couldn’t expect pay, and they knew they had to pull their weight.\n\nYisha only promised to give Han Sen half a year of free resources. If he needed food half-a-year from now, he’d have to buy it out of his own pocket. He needed to focus on gathering enough resources to be self-sustainable in six month’s time.\n\nAfter Icebird Duke delivered the resources, she took her men and left Planet Eclipse.\n\n“Did the recruitment process go well?” Yisha asked when Icebird Duke returned.\n\nIcebird Duke frowned and said, “He recruited thirty-nine Barons and four Viscounts. He also recruited 267 commoners, comprised of just mothers and their children. Adding to that, most of the Barons and Viscounts are simply spies. It was a big failure, if you ask me.”\n\n“Really?” Yisha smiled and did not say anything.\n\n“My Queen, can you teach him? If he goes on like this, he won’t make it six months. He’d be lucky to get past three, at this rate,” Icebird Duke said.\n\nYisha said coldly, “He is my student, but he should still make these decisions by himself. If he cannot handle this the way he chooses to, why would I waste the resources I already have on him?”\n\nHan Sen’s group used the first few days after their arrival to get set up. They hadn’t spent any time trying to hunt yet. That night, however, a shrill scream was heard. When Han Sen arrived to investigate, a Baron was on top of a young Kate mother.\n\nThe Kate woman’s clothes had been torn off. She was resisting, and she had been injured. Her voice was breaking."
}