{
    "chapter": 2282,
    "title": "The Place Where Treasure Lies",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2282",
    "text": "Han Sen and Yisha were unable to make the calculations to determine the correct path. But instead of marching ahead recklessly, they could follow the traces left behind by Mister White. In the end, that proved to be a very effective solution for navigating the palaces.\n\nHan Sen, Yisha, and the blood kirin followed Mister White’s tracks through each teleporter door. Han Sen was the guide. Thankfully, they didn’t encounter any dangers along the way.\n\nThey went through a few palaces, and their journey remained uneventful. It was an entirely safe course to follow.\n\n“What is Mister White planning?” Han Sen wondered. He didn’t know why Mister White was taking this risk.\n\nIt didn’t make sense for Mister White to believe that Han Sen had the strength to stand up to Fox Queen. It also didn’t seem likely that Mister White would leave a trail behind just to cause Fox Queen trouble.\n\nUsing the evidence of Mister White’s passage as a guide, Han Sen and Yisha made quick progress. It wasn’t long before they arrived at the fourth checkpoint.\n\nWhat they saw there made Han Sen and Yisha frown profusely. The hall was half-collapsed. Broken pillars and remnants of a destroyed ceiling lay strewn across the entire place.\n\nHan Sen looked across the hall, but he found no hide nor hair of a Sacred Leader statue there. In fact, there was nothing of any remarkability there.\n\n“It looks like Fox Queen managed to make it through this checkpoint,” Han Sen said when he found nothing of interest in the palace.\n\n“I wonder what the Sacred Leader left behind here. Whatever it was, Fox Queen must have made off with it.” Han Sen frowned.\n\nThe Sacred Leader’s items were all linked. If they were missing an item, they might run into a lot of trouble further down the line.\n\nHan Sen and Yisha had no choice but to keep going. When they went through the next teleporter, though, what they saw gave them a shock.\n\nThey hadn’t arrived at another palace. When they stepped out of the teleporter, they found themselves on the shore of an endless ocean.\n\nUnder Overbearing was as big as a planet. It wasn’t really surprising to see an ocean on such an entity, but the sight still made Han Sen feel depressed.\n\nMister White and the others must have begun crossing the oceans, but the ocean wind had destroyed all traces of Mister White’s trail.\n\n“It’s such a big ocean. I’m afraid it might be too difficult to locate Mister White and the others,” Han Sen said sadly.\n\nYisha looked around. After a while of thought, she said, “This could be where the Sacred Leader hid his treasure. Perhaps they haven’t even gone very far, but they’re exploring someplace below the waves.”\n\nHan Sen had thought of this possibility, as well. If the treasure was in the water, finding Mister White and the others might be even harder.\n\n“I guess we have no choice but to take a look,” Han Sen said.\n\nYisha nodded and dipped into the sea. Her body unleashed a purple smoke, and when the smoke came into contact with the water, the water parted.\n\nHan Sen and the blood kirin moved next to Yisha. They headed deep into the sea, surrounded by the sphere of dryness provided by Yisha.\n\nYisha’s purple smoke kept the water about ten meters at bay.\n\nAfter they started their dive, they descended deep into the ocean.\n\nThey walked a hundred miles beneath the sea, and in all that time, they didn’t catch sight nor sound of any other creature. The ocean looked dead. It was like a long-dead sea that was no longer fit for any living thing.\n\nSuddenly, a giant shadow moved in the water. Yisha stopped and stared at that giant shadow in the sea.\n\nThe shadow was approaching them quickly. Han Sen was given a proper fright when he saw what the thing was.\n\nIt was a giant xenogeneic that looked like a whale. Its body was pure white.\n\nThe white whale was more than a thousand meters long, and every move sent devastating shockwaves rolling through the sea. Many small vortexes popped up around it.\n\n“Deified creature,” Yisha said quietly.\n\n“I didn’t expect Under Overbearing’s body to be the home of other deified creatures. I’m afraid that, aside from the Sacred Leader, no other being could do something like that.” Han Sen had a wry smile.\n\nThe big white whale noticed the three of them. After all, there were no other creatures in that ocean, so their presence was rather noticeable.\n\nThat was especially true of Yisha and the blood kirin. One of them was a deified elite, and the other was full of blood air. It was difficult not to notice their presence.\n\nWhen the big white whale was a thousand meters away from them, it suddenly opened its mouth and released a high-pitched sonic wave. At the same time, its mouth produced a strong force of suction. Many giant vortexes swirled to life within the water. They snared everything within range and pulled it all into the whale’s belly.\n\nWisps of Yisha’s purple air began to flow into that vortex, and their sphere of air suddenly started to feel the force of that suction. More and more of the purple air was pulled away through the water, taken in the direction of the creature’s mouth.\n\nYisha frowned. She used her hand as a knife, and the purple air suddenly gathered up into a large swathe of knife air. She lifted her arms above her head and slashed towards the vortex.\n\nThe knife air became a roaring purple air demon. It was headed right for the giant white whale. It broke through the vortex that the big white whale had generated, but the demon-looking knife air didn’t stop there. It continued on, going right for the white whale’s head.\n\nThe big white whale showed no indication that it was going to dodge the incoming blow. In fact, its mouth widened even further. It looked like a gaping black hole. Its powers of suction increased, and it swallowed Yisha’s demon knife air effortlessly.\n\nGudong!\n\nThe giant white whale swallowed the demonic knife air whole, then let out a satisfied burp. It then spat out some air and created loads of bubbles in the sea.\n\nHan Sen was dumbfounded. Yisha had just become deified, and she was filled with hell power. She also had the Teeth knifeskills. Her talents were famous among many races, and her wrecking abilities were widely renowned. The big white whale, however, had swallowed her attack easily. The power that the giant white whale possessed was truly scary.\n\nYisha frowned. Purple substance chains rose from her body and began to align in mysterious patterns. They created a purple knife air around Yisha’s body.\n\nYisha’s entire body was now full of a knifemind. It felt to Han Sen as if she was a cruel knife herself, that she could wreck anything at any time.\n\nYisha raised the full extent of her power and prowess, but the giant white whale still didn’t seem to be afraid. It opened its mouth, and the black hole power returned. It sucked everything nearby into its mouth. Sand and water came rolling in like they were being pulled into a bottomless pit.\n\nSeeing the giant white whale open its mouth again, Yisha coldly shouted. Her arms swung at the big white whale.\n\nThe roaring demon headed for the big white whale once more, dispersing the sand and shattering the rocks as it went. It left a trail of devastation behind it.\n\nThe purple knife air and the big white whale’s black hole collided with each other. The black hole was destroyed, and the purple knife air was shattered. The shockwave of the collision exploded the entire sea. Huge waves surged across its surface, and it was like the entire ocean had been turned upside down.\n\nThe two strikes were balanced, though; neither had the upper hand.\n\nThe next second, Yisha and Han Sen’s eyes widened. The big white whale’s mouth was still hanging open, and suddenly, something flew out of it. It wrapped around Yisha, Han Sen, and the blood kirin, then pulled them into the big white whale’s belly."
}