{
    "chapter": 1899,
    "title": "Touching Flower Finger",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1899",
    "text": "The worker brought a testing gold rock on stage. Everyone looked at No Flower, wondering what geno art he was going to perform.\n\nAlthough No Flower was bald, he looked poised and elegant. He bowed before them, and to the surprise of all the Nobles who were present, he said, “I am going to perform a geno art called Touching Flower Finger.”\n\nTouching Flower Finger was famous because it was very common amongst the Buddha. It was something each one of them could perform.\n\nThis event had been created to show off new stuff. No Flower was going to perform something extremely common, and that was surprisingly disappointing to the attendance.\n\n“No Flower Buddha, Touching Flower Finger is very powerful. But we have seen it many times before. There is no need to display this, is there?” someone said from below the stage, which prompted a number of agreements.\n\nNo Flower smiled. He was not in a rush, and he said, “The point of this event is to demonstrate new things, yes. I am stupid and cannot create new skills. So, I had a little idea to modify Touching Flower Finger somewhat If this can make you smile, that’ll be enough for me.”\n\nSeeing No Flower say this, folks became curious. Someone shouted, “Then perform your Touching Flower Finger and let us see the difference!”\n\n“Amitabha!” No Flower spoke out the Buddha phrase and walked in front of the testing gold rock. No one saw him do anything. They merely saw him raise his hand and press his thumb up against it.\n\nThe people inside and outside craned their necks and leaned forward to see No Flower’s Touching Flower Finger.\n\nBut No Flower only pressed his thumb into the rock by a single inch. Even an ordinary Baron could do something like that.\n\nAmidst their confusion, the audience suddenly noticed that fingermarks were spreading all across the rock. A word was being painted onto it.\n\nIt was then that the people realized that No Flower wanted to show something more than mere destruction. He was showing off that he could write with that skill.\n\nStill, they did not quite underst抓d why. It did not matter how well you wrote; what did that have to do wit^ showcase of power? Even Barons could break the rock. You did not need tricks for that.\n\nNo Flower kept on writing, and then his entire body changed. His body surged with strength, like a King standing firm against crazy winds.\n\nWhen he waved his finger, it felt as if flowers were falling. Or as if dead leaves were falling.\n\n“The flowers open and destroy it.” No Flower was writing these words out. Touching Flower Finger was supposed to be a gentle geno art, but as he used it, it felt as if people were amidst a rain of flowers. It made you feel so lonely and depressed. It was different from what the ordinary Touching Flower Finger would make you see.\n\nSome young men with weak wills became very pale. They felt as if they had become old men, or dying flowers on the verge of giving up the ghost.\n\nEven the members of Moon Garden looked bad.\n\n“That is a strong mind. He is so young. How can he create such a thing!” Du Lishe looked ill as she spoke.\n\nBlack Steel said coldly, “The Buddhas can open their minds. No Flower must have received this from a King. If I guess correctly, this should be the device of Wilted Buddha King.”\n\nMoon Wheel King’s eldest daughter, Rebecca, said, “Not bad. Wilted Buddha King died two years ago. No Flower must have opened his mind before then. Wilted Buddha King was good at wilted skills. This Touching Flower Finger feels like something wilted. You must be right about where it came from.”\n\n“He has absorbed the experience of Wilted Buddha King in only two years? He is very strong, indeed,” Black Steel said. Rebecca nodded and did not say anything. She looked more serious than ever, though.\n\n“Sister? Is he not cheating? He’s got the will and experience from Wilted Buddha King, but we don’t. Who can reach that level with such an age and rank?” Du Lishe asked, frowning.\n\n“Clear Sea King put No Flower on stage first for an obvious reason. Now, I don’t think anyone can compete with him. It looks as if we will have to let them win this one,” Rebecca said.\n\nNo Flower finished writing. Then he stood up and walked back. The lonely feeling disappeared from everyone once he was done.\n\nInside and outside, everyone snapped out of their daze. They looked at the text on the testing gold rock, and what they saw was shocking. The wilted presence was spreading.\n\n“That is a powerful finger skill. I have only seen a few Kings who have a skill such as that. No Flower Buddha is still so young, and it is rare to see someone like that do something like this.”\n\n“Why is it strange? Don’t you know the Buddha can perform Open the Mind? The older ones can transfer their will and experience to ones of the younger generation. No Flower’s mind must have received such a transference from a Buddha King. That is how he has it, mark my words.”\n\n“The Open the Mind skill is overpowered. It’s like cheating. They are so young, and yet they are much stronger than us.”\n\n“Every race has an ace up their sleeve, allowing them to exceed in some way. The Rebate have an advantage of their own. Don’t give up faith.”\n\nTrue, but I don’t think anyone from our race can compete with No Flower. Normal Viscounts couldn’t give out a feeling like that. Not even Earls or Marquise can do something like that.”\n\n“Well, they did travel a long way to get here. We should probably just let them win.”\n\nAll the Nobles were talking about how envious they were of the Open the Mind technique.\n\nNo Flower lowered his head and waited on stage.\n\nAs this happened, a Rebate needed to go up on stage and perform a geno art of their own. This way, they could be compared. That was the general purpose of this entire event.\n\nBut No Flower Buddha’s Touching Flower Finger was far too impressive. There wasn’t anyone else in Moon Garden that could come close to this. Whoever came next would be too weak, and it’d be an embarrassment for them to follow.\n\nDu Lishe and the other second-generation Rebate all looked at each other, with none making a move forward. They all sighed. They knew the Rebate were weaker than the Buddhas, at this level.\n\n“Are those words really that good? I think Han Sen did better than him,” Qing Li said to herself, looked at the testing gold rock."
}