{
    "chapter": 1877,
    "title": "The Hall Shrouded in Death",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1877",
    "text": "“So what if it is a deified item? Without the deified one to control it, what can they really do?” a King asked, his voice hard. His body looked very bright. He took his subordinates and a Gana outside the hall.\n\nHis godlights tore through the darkness, lighting up the outside of the hall. The Nobles in his employ followed him. They traveled through the dark, wanting to return to their ships.\n\nBut before they could make it far, strange arms started to writhe their way out of the ground. They grabbed those that traversed the darkness, and even the Gana.\n\nThe King struck with his godlights. He cut down the weird arms, but he was the only one that could protect himself. The Dukes were unable to hold off the grasping arms, and they found themselves getting pulled down into the earth.\n\nWhen the arms latched onto them, they realized that the ground beneath them was turning to mud. The weaker people were immediately pulled down, disappearing beneath the surface. The Dukes struggled for a while, but the arms were ultimately too much for them. They suffered the same fate, albeit more slowly.\n\nSomeone tried flying. A gold light shot across the sky to intercept him, and the flying figure was sent spinning up into the clouds. There was no sound, and he was simply gone.\n\nThe King was invincible, but he cared little for the others in his employ. He made it out alive, but only two subordinates had survived alongside him. A dozen of the people that had previously been following him had been swallowed up.\n\nThe few Kings left inside the hall looked terrible. They knew deified items were scary, and they had heard about Purgatory Heaven before. They did not expect it to be that powerful. Not even King class fighters could deal with a deified elite.\n\nThe chances of an ordinary Noble making it out were practically zero. The Dukes could not leave, and there were not many Kings. It looked as if most attendants were going to die right there.\n\nSeeing the Gold Gana statue glowing brighter and brighter, a few of the Kings made their move. With their subordinates in tow, they led the way through the darkness. They left the Gana behind, knowing they were likely unable to take care of them, despite their strength.\n\nThe Purgatory Heaven would only get stronger, so not even the King class elites were willing to stay behind. They could make it out now, but it was difficult to say if they would be able to do so later.\n\nGold Jade King had not said a word thus far, but even he was keen to move. With his two Dukes, he ran out. He didn’t say Icebird Duke and Han Sen couldn’t follow, but if anything happened to them, he wouldn’t bat an eyelid.\n\n“We should run, too!” Icebird Duke gritted her teeth. She knew she might die by following Gold Jade King, but staying would be a death sentence, anyway.\n\n“Why doesn’t he attack the statue outright? Can’t a few Kings band together to suppress a deified item?” Han Sen pulled at Icebird Duke.\n\n“If they could, do you think they’d choose to run?” While Icebird Duke answered, Gold Jade King had already gained a great distance. If she was going to run, it was now or never.\n\nIcebird Duke’s face fell as Gold Jade King increased the distance between them. “Our only chance is gone.”\n\n“Maybe not. This hall is fine,” Han Sen said, while looking at the people remaining.\n\nThere were some people still in the hall. The Gana, the Kao, and a few Nobles that had no Kings.\n\nThe Nobles that had come with a King had already run out, but they had mostly been killed. The Kings were unable to take care of their subordinates.\n\n“F*ck! Speak, b*tch! How do we stop this thing? If you don’t tell me, I’ll kill you!” Many Nobles were threatening to murder all the Gana.\n\nOne Duke grabbed the Gana lady and slapped her. Her face went swollen.\n\n“You might as well kill me now, then,” the Gana lady said, but there was no anger coating her words.\n\n“Dying doesn’t have to be quick. If you don’t tell me the truth, you’ll suffer a fate worse than simple death.” The Duke was absolutely furious. He grabbed her arm and tore a chunk of flesh off.\n\nThe other Nobles were also demanding that the Gana give them a solution. They really wanted a way to get out of there.\n\n“Stupid people! If the Gana could stop this, the Kings wouldn’t have left.” Icebird Duke frowned.\n\nHan Sen shook his head and did not speak. A Gana could not withstand the torture and screamed, “Everyone here is already dead! The Purgatory Heaven has started, and there is no way to stop it. Everything and everyone is going to die. A Gana would rather stand tall and die than wither away as someone’s thrall. You guys were dreaming…”\n\nThe hall was in chaos. Han Sen looked outside and noticed the kings had gotten pretty far away. It was nearly impossible to see their lights now, as the darkness overwhelmed all.\n\n“Icebird Duke, let’s take the Gana lady with us. Perhaps there is a chance we might live.” Han Sen walked towards the Gana lady.\n\nThe Duke was in the middle of torturing her. So, Han Sen tried to attack the Duke from behind. The guy was as angry as could be, but Dukes were Dukes, and he was so fast. He managed to dodge Han Sen’s knife.\n\nSeeing that Han Sen was so weak, likely just a Baron or Viscount at best, the guy became even angrier. Now he wanted to kill Han Sen.\n\nIt was then that Icebird Duke launched herself in front of Han Sen, staring the Duke down.\n\nShe did not think there was a way out of this, but the Gana lady knew the most about what was happening. Having her with them wouldn’t do any harm. So, perhaps there was a chance.\n\n“Icebird Duke, what is the meaning of this?” the Duke angrily asked.\n\n“Nothing. He is my master’s student. No one can touch him as long as I am around,” Icebird Duke coldly said.\n\n“F*ck! Do you know what’s going on? Who cares who you are at a time like this? Give me the Gana back, lest I harm you,” the Duke said coldly.\n\n“You can certainly try.” Icebird Duke started to generate a frosty aura as she spoke. She swiftly became an icy phoenix, protecting herself.\n\nHan Sen applied some medicine to the Gana lady’s wounds, and he asked her, “Are you okay?”\n\n“There is no need for you to pretend to be nice to make me trust you. I can tell you that it really is too late now. We will all die, myself included. No one can stop Purgatory Heaven,” the Gana lady said emotionlessly.\n\nHan Sen looked at Icebird Duke’s enemy, and he noticed the other Nobles weren’t looking at him. He surreptitiously pulled something out of his pocket. He let the Gana see it, and he said, “Do you know what this is?”"
}