{
    "chapter": 1686,
    "title": "Really Can",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1686",
    "text": "“Surrounded,” Han Sen thought.\n\nAll around them, there were scary eyes looking their way. The masters of the eyes were four creatures clad in armor. Or maybe it was the armor itself that was alive and glaring at them angrily.\n\nHan Sen could only see the armor and the gleaming eyes. He also saw the color red, but he wasn’t sure if that was something that belonged to those beings.\n\nThe sets of armor looked like steel, but they had rusted. They also looked freshly-unearthed. Each figure held a steel greatsword that was one meter long, but very broad. They looked very threatening.\n\nHan Sen couldn’t mull over their presence for long, though. Within a second, the four monsters started to attack. Their speed was like that of a demi-god. They were top-tier, that was for sure, and Han Sen was unable to compete with them.\n\nHan Sen used his dongxuan movement to move shakily, like a wobbling fish, in order to evade the first strike. He leaped backward to gain some space and turned around. Old Cat was so fast that he was already ten meters away.\n\nDue to Old Cat being as fast as he was, the four sets of armor turned their attention to the easier target. That was Han Sen. Their greatswords came down like lightning, making their sudden slashes hard to dodge.\n\nBefore leveling up, the four monsters wouldn’t have even been a challenge. But now, Han Sen was in a bad situation. His ten thousand fitness was too weak for him to deal with those enemies.\n\nHan Sen dodged the next two strikes, but then he was delivered a blow from one of the greatswords.\n\n“Old Cat, come back and help me!” Han Sen kept jumping around and around the metal board. He used his abilities of prediction, judgment, and movement to stay alive and avoid further harm from the brutal greatswords that were pursuing him.\n\nOld Cat, seeing those armor creatures not bothering to pursue him, jumped atop a tablet and spoke directly to Han Sen. “Nine-Life Cats are a peaceful race comprised of pacifists. You’ll have to sort this fight out by yourself.”\n\n“You’re not peaceful, and I just leveled up. My fitness is low! If you don’t help me, I’m going to die.” Han Sen jumped past the metal board. The greatsword almost came into contact with his body, but it instead struck the object.\n\nThe metal board proved not as sturdy as Han Sen initially believed it to be, as the greatsword cleaved two decent chunks out of it A peek inside the newly-formed gaps revealed there was nothing inside.\n\nHan Sen was surprised by this revelation. He had assumed the board was solid because of its weight. But with the four monsters chasing after him, he didn’t have the opportunity to see what was inside. All he could do was run.\n\nA top-tier demi-god in the Fourth God’s Sanctuary had one-hundred-thousand fitness, and these creatures were certainly top-tier. Han Sen only had ten thousand fitness. With a fitness such as that, not even the Dongxuan Sutra or Heavenly Go would help him.\n\nHowever, Han Sen found that he could almost fight them, which was completely unexpected. He had been preparing to use Destiny’s Tower, but he was shocked that he could hold out as well as he was.\n\nHan Sen only had a fitness level often thousand, but even so, after leveling up, he felt as if he could understand and see more.\n\nHit fitness might have been lower, but he was somehow stronger. That was how he lasted so long under the pressure of the four armored men. If he was going to lose, it wouldn’t be anytime soon.\n\nOld Cat heard Han Sen, but he still didn’t chip in to fight. He was on a tablet, and he said, “I would like to help you, but I cannot. I am a peaceful being. I don’t have an evil bone in my body. Evil thoughts just make me sick and dizzy. If I fight them,\n\nI would be killed by my own conscience, so…”\n\n“F*ck you! You are just trying to trick me,” Han Sen replied, following a swift dodge. He couldn’t believe Old Cat refused to help, and went so far as to make up such excuses.\n\nOld Cat was not angered by the comment, though. He smiled and said, “Haha, young man! Don’t be so rushed. I may not be able to save you, but you can save yourself.”\n\n“How can I save myself? I am going to be killed!” Han Sen kept on evading as he spoke.\n\nThe swords struck the metal board a few times, leaving marks and scrapes across it. Han Sen was eventually able to see a light inside, reminiscent of some sort of jewelry.\n\n“You are in luck, and you have no idea. Stupid!” Old Cat squatted on the tablet and shook his head.\n\n“Stop being so d*mn condescending! I’d rather die than listen to any more of your bullsh*t.” Han Sen sounded angry.\n\nHan Sen did not use Destiny’s Tower because he wanted to see if Old Cat was deliberately bringing him harm.\n\nOld Cat shook his head and said, “You are stupid. I thought you would have geno armor. If you cannot fight, why don’t you use it?”\n\n“I would use it if I could. This the Fourth God’s Sanctuary; it wouldn’t work, even if I had worn it coming in!” Han Sen shouted.\n\n“Who said you cannot use it in the Fourth God’s Sanctuary?” Old Cat rolled his eyes.\n\n“I have tried it many times. If I could have worn it here, I’d have been king of this place many times over. It would’ve saved a lot of trouble,” Han Sen shouted.\n\nOld Cat sounded serious. “That was before. Now things are different; you have Nine-Life Cat’s blood. You can use your geno armor.”\n\n“Really?” Han Sen was shocked, and he was not sure if this was true.\n\n“Elegant Nine-Life Cat does not lie.” Old Cat looked at Han Sen with disdain.\n\nHan Sen decided to give it a go. He thought about summoning his white geno armor, and then, the geno armor plated his entire body and a phantom power filled him with vigor.\n\n“I really can?” Han Sen was surprised."
}