{
    "chapter": 2259,
    "title": "The Secret of Sacred’s Leader",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2259",
    "text": "“General Ghost Bone was too devious. He integrated your body into the prison’s structure. If I fully broke down the walls of the palace, I would have to destroy your body as well. Breaking the restrictions would kill you.” Han Sen looked at Fox Queen seriously.\n\n“Keep going.” Fox Queen, hearing Han Sen say this, believed him even more.\n\nIf her powers truly were woven into the palace, then they would have to be very careful as they attempted to escape. A single wrong move could have devastating consequences for her.\n\n“Pretty Big Sister, can we talk more… freely?” Han Sen asked, nodding to the cords that bound him.\n\nFox Queen huffed and released the power binding Han Sen. He was a free man again.\n\nLittle Star was still hanging upside down with wide eyes. It looked like the creature was going to cry.\n\n“Um, if Little Star did something wrong, I will correct him. Please let him go, Pretty Big Sister,” Han Sen quickly said.\n\nFox Queen rolled her eyes at Han Sen, but she still complied and brought Little Star down.\n\nWhen Little Star was free, he ran behind Han Sen and refused to reveal himself. He was obviously scared of Fox Queen.\n\nHan Sen sighed and went on to say, “Breaking out of here without injuring you will be difficult. Even a deified elite might not be able to break the restrictions without bringing you an ounce of harm.”\n\n“Skip to the chase,” Fox Queen said in annoyance.\n\nHan Sen smiled and said, “Fortunately, I am good with matters that require such skills. I’m confident that I can take you out of this place safely. But I am just a Duke, and I am weak. The entire process will be rather complicated, and it cannot be done in any short amount of time.”\n\nWhen Fox Queen remained silent, Han Sen coughed and said, “But if you are willing to cooperate with me, I believe the process can be sped up.”\n\n“What are you asking me to do?” Fox Queen gazed at Han Sen with absolute mistrust.\n\n“You are a part of this prison, so you can control a smidgen of it, can’t you? We should start from the section you are able to control. We can use that weakness to pull you away from the core. If we succeed in separating you from the main structure, then even your power will be able to break the restrictions,” Han Sen said.\n\n“Sure,” Fox Queen said.\n\n“But there is one thing I need to ask you,” Han Sen added.\n\nFox Queen knew what he wanted, and so she told him directly, “If you can free me, I will help you get rid of those guys hounding you outside.”\n\n“Thank you so much, Sister.” Han Sen looked happy, but he didn’t actually have much confidence in the plan.\n\nHan Sen had asked Fox Queen to continue stretching the loosened section of their prison to stall her. It also allowed Han Sen to understand the palace on a deeper level.\n\nHan Sen gave Fox Queen a steady supply of work to keep her occupied, but taking her out of the prison really wouldn’t be easy. He focused less on the efficacy of the plan, and more on keeping her distracted.\n\nNow that Han Sen was temporarily safe, he thought about how he might escape. He was surrounded by terrifying enemies. If he was a King class elite, perhaps he could fight his way out. But for now, he could only hold on.\n\n“The stone plate connects with the Sacred Leader’s relic. Perhaps it will come in useful when I seek to rescue Littleflower. I can’t let Edward get his hands on it.” Han Sen made his mind up, deciding to go after the Sacred Leader’s relic no matter what it took.\n\nBut right now, he couldn’t get out. And he had no idea where the monument was supposed to be. It wouldn’t be easy to claim the Sacred Leader’s relic, that was for sure.\n\n“Pretty Big Sister, why did Ghost Bone erect this palace here? Is there a reason why this place was chosen?” Han Sen was hoping to glean some information about where the holy monument might lay.\n\nFox Queen was General Ghost Bone’s wife, so there was a chance she knew a thing or two.\n\nFox Queen shrugged. “I know he made a big mistake, and Sacred Leader sent him here to explore. I don’t know anything else.”\n\n“That means you think there was some contention between them?” Han Sen could hear Fox Queen’s concern behind her words.\n\nFox Queen had been locked away for so long, and her boredom had grown to immense proportions. She seemed to like having someone to talk to, so she went on to say, “General Ghost Bone looked murderous, but he was incredibly loyal to Sacred Leader. He was practically his right-hand man. How could he make a mistake that would force him to come to this sort of place? Something else must have been happening behind the scenes, but General Ghost Bone was a quiet man. He never really told me what he was doing here.”\n\nHan Sen couldn’t tell if Fox Queen really was clueless or if she was just pretending to be. He thought for a moment, then said, “I found a place called Ghost Bone Town out in a desert. Is that where he lived?”\n\nFox Queen frowned. “After General Ghost Bone came to live here, he didn’t build homes anywhere else. Why would there be a Ghost Bone Town? Tell me what the place looked like.”\n\nHan Sen told her about the town he had discovered, but he didn’t say anything about how it was in disarray.\n\nWhen Fox Queen heard Han Sen’s description, the expression on her face morphed through a variety of emotions. After a while, she said, “I see… I see…”\n\n“What are you thinking?” Han Sen asked.\n\nFox Queen smiled. “If I am guessing things correctly, the town you found was actually a haven for the Sacred Leader. Ghost Bone Town was just an outpost. No wonder he was there.”\n\n“What is that place?” Han Sen was so happy. He was finally getting to the meat of these mysteries.\n\nFox Queen considered his question. “You told me that Sacred was destroyed a long time ago, so talking about it shouldn’t matter anymore. If the Sacred Leader was still around, I would not dare speak.”\n\nAfter a lengthy pause, she went on to say, “The Sacred Leader led the Sacred. He beat every being that came against him, and he almost became the king of the entire geno universe. But every creature has a lifespan, and that law even applied to someone as powerful as the Sacred Leader. No one is able to fight time, and death finds us all one day. That powerful man didn’t want to die like everyone else, though. And so, he sought to live forever.”\n\n“In the pursuit of immortality, Sacred Leader conducted many tests. I know there were at least a hundred of them.” Fox Queen seemed to be struggling to remember. “I was Ghost Bone’s wife, and Ghost Bone was the Sacred Leader’s most trusted right hand. I learned a bit about all this from Ghost Bone, and although I was told little, I could tell that the leader was ambitious. He sent people to the disaster on Planet Yuanli, the strange thing in Buried Dragon Valley, the holy spirits in the sanctuaries, and the demi-god’s space. They were searching for the key to immortality all because of Sacred Leader.”\n\n“The holy spirits in the sanctuaries? What are those?” Han Sen’s heart almost leaped out of his chest, but he forced himself to look merely curious.\n\n“I don’t know much of the details, as it’s only something I heard Ghost Bone say. In Sacred, there is a strange xenogeneic space they called the sanctuaries. The leader tried to research the undying spirits there,” Fox Queen said after some thought.\n\n“Spirits?” Han Sen thought, his heart trembling."
}