{
    "chapter": 3045,
    "title": "The Landlord's Stupid Son",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3045",
    "text": "Who would have suspected that Han Sen’s reaction would end up surprising Mister Yang? He was not angry. He actually laughed.\n\nHan Sen pointed at the overbearing bug and asked, “I don’t need to be your servant, but if I kill it, can I have its body?”\n\nAfter that, he looked at Mister Yang and asked, “Old Yang, can that gene race be food for Small Cat?”\n\n“I suppose it could be…” Mister Yang’s expression looked weird. Using a king-class gene race to feed a newborn gene race seemed excessive. While it was possible, it might end up just being a waste. “Of course, you can.” The white-clothed young man hastily nodded.\n\nPeaceful looked awfully glum. She wished to protest, but all she could really do was mumble under her breath and not say anything audibly.\n\nThe white-clothed young man looked at Peaceful and rushed her to get started. “Peaceful, hurry up and get your overbearing bug to attack him. I want to see if he can really kill the overbearing bug with his bare hands.”\n\nPeaceful’s eyes twitched. She seemed to be struggling with the request. In the end, she adhered to what the young man in white clothes told her. She commanded the overbearing bug to attack Han Sen.\n\nThis overbearing bug was different from Shibo’s overbearing bug. Its carapace was black, but it had a golden sheen. Its power and speed were far greater than Shibo’s overbearing bug.\n\n“Do you want to use my overbearing bug as cat food? You can go to hell!” Peaceful was secretly furious. She hoped the overbearing bug could swallow Han Sen in one gulp.\n\nThe overbearing bug’s body was very big, but its speed was quite scary. It was just like a flea. Its body became blurry a little as it teleported in front of Han Sen.\n\nIts mouth was full of long teeth that were going to try swallowing Han Sen, but Han Sen raised his arm high and threw a punch down.\n\nBoom!\n\nThe overbearing bug’s head was punched into the ground. Brain juice went everywhere. It was murdered outright.\n\nPeaceful’s eyes almost popped out of their sockets. Before, Han Sen had been able to punch a juvenile overbearing bug, but her overbearing bug was an adult. Still, Han Sen was able to obliterate its brain. It was extremely hard to believe.\n\nThe white-clothed young man was astounded as he watched from nearby. He clapped and said, “Very interesting. You can really kill an overbearing bug with your bare hands. How are you so strong?”\n\nHan Sen looked at the young man and asked, “Will you uphold your promise?”\n\n“Of course. Peaceful, give him the body of your overbearing bug.” The white-clothed young man walked over to Han Sen. As he walked, he asked, “Your name is Han Sen, right? Were you born with a Blood-Pulse? If so, what Blood-Pulse do you have? How can you be so powerful?”\n\nAfter that, the young man in white clothes reached out his hands to touch Han Sen’s muscles. He looked curious as he did so.\n\n“Mister… No…” The white-clothed young man had yet to touch Han Sen when a shadow appeared in front of him. He could not get close to Han Sen.\n\n“Did I not request that you guys not follow me? Why are you here?” The young man in white clothes did not look happy. He madly looked at that person.\n\n“My bad.” The man kneeled before the young man, but it did not look as if he was going to budge. He lowered his head and said, “This person is too dangerous. Please, do not put yourself at risk.”\n\nThe white-clothed young man coldly shouted, “I just wanted to talk to him! Why would it be dangerous? Go back now!”\n\n“Mister, please just think about it.” The man remained in front of the young man as if he was not going to leave.\n\n“I am taking the overbearing bug.” Han Sen sensed that the white-clothed young man was someone special, but that did not matter to him. He waved at the white-clothed young man and walked over to the overbearing bug. He picked up its body and planned to leave.\n\n“Annoying asshole! Get out of my way.” The young man in white clothes looked very irritated. He kicked the kneeling man out of the way and walked over to Han Sen.\n\n“Han Sen, if you are willing to return with me, I can promise you great wealth,” the young man in white clothes passionately said.\n\n“Why do you want me to come with you so badly?” Han Sen asked as he continued to walk.\n\n“My big sister has a very powerful gene race,” the white-clothed man said as he gritted his teeth. “I keep losing and end up getting bullied by her. I want you to help me beat her gene race so I can exact my revenge.”\n\nHan Sen rolled his eyes. “I am human. I am not a gene race.”\n\n“I know, but there are no rules suggesting humans cannot compete in an arena,” the young man seriously said.\n\n“I am not going,” Han Sen said. He didn’t even turn around to look at the young man as he spoke.\n\n“I thought you wanted the bodies of gene races,” the white-clothed young man quickly said. “If you can kill my big sister’s gene race, you can have the body.”\n\n“Not interested.” Han Sen did not even think twice about rejecting the offer. He did not really need gene races.\n\n“I will give you 10 gene eggs… No… I will give you 20…” The young man kept making offers. He looked as if he was not going to give up.\n\nHan Sen kept ignoring him and continued walking away.\n\nThe white-clothed young man did not want to give up. He kept following Han Sen, trying to convince him.\n\nPeaceful and the guard were following the young man. They were on alert. They stared at Han Sen. They were afraid Han Sen might do something bad to the young man.\n\nHan Sen was getting annoyed by the young man. He pointed to Peaceful and casually said, “Fine, if you want me to go to that arena, then make her become my slave.”\n\nPeaceful was furious and asked, “What did you just say?”\n\nUpon hearing this, the young man looked very happy. He looked at Han Sen and asked, “Do you mean it?”\n\n“Yeah, I am serious,” Han Sen said with a laugh. “Peaceful, do that for me,” the young man in white clothes said to Peaceful.\n\nThe expressions on Han Sen and Peaceful immediately changed. Han Sen thought, “Jesus Christ, what kind of landlord’s stupid son is this? He really agreed.”\n\nPeaceful was the granddaughter of Dragon Song City’s leader. Ordinary people would not have agreed with Han Sen’s condition. Even Big Qin Kingdom’s king would not have humiliated his children’s subordinates.\n\nYet, the white-clothed young man had immediately agreed to give Peaceful to Han Sen as a slave. How stupid was he to say something like that?\n\nPeaceful kneeled and said with simmering anger, “Mister… Please grant me death…”\n\nEven the guard looked at the white-clothed young man strangely, but he held his tongue.\n\nUpon hearing Peaceful wanted to die, the white-clothed young man froze. He wished to say something more, but the guard suddenly shouted, “Careful, Mister!”\n\nAfter that, the guard’s body shone with a strange light. Wings appeared on his back, and strange horns were on his head. He threw a punch into the sky.\n\nA bolt of lightning came down from the sky. It burned the guard into a crisp. He fell to the ground and died.\n\nHan Sen turned around. He saw a beautiful woman with white wings wearing a white dress come forth with lightning crackling around her. She descended from the sky like a wrathful angel."
}