{
    "chapter": 1039,
    "title": "Let Them Fight, Grab the Spoils",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1039",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen was shocked, to say the least. He had not expected the two to have known each other. He was hoping Xie Qing King would be freed to eliminate Holy-Sword Emperor, but that wasn’t looking likely now.\n\n“You remember me?” Xie Qing King asked, with a smirk.\n\nWhile he was petrified, he had hidden his powers. Now, he did not have to.\n\nHoly-Sword Emperor forced a smile, saying, “I had only just been born during the times you fought in the spirit base. You were a person I greatly admired; I cannot say I expected to see you here.”\n\nHoly-Sword Emperor was lying; he did not mean a word of what he said. One-hundred-thousand years ago, Holy-Sword Emperor was nothing.\n\nBut back then, Xie Qing King was not an emperor, just as he wasn’t now. With Han Sen referring to him as one, though, he was taken aback and unsure of what to say.\n\nHoly-Sword Emperor had not known of his imprisonment here. Xie Qing King hadn’t actually ascended from king to emperor status, it was just Han Sen attempting to mislead Holy-Sword Emperor.\n\nXie Qing King was made glad, upon hearing that Holy-Sword Emperor knew his name. He did not pay much heed to Han Sen, since he wasn’t on the same level as him. This was different than the way he felt about Holy-Sword Emperor, who was.\n\nXie Qing King’s silver eyes rested upon Holy-Sword Emperor, and he asked, “Have you found anything?”\n\n“This is where Phoenix Emperor once lived. There is treasure here, but evidently, it is well-hidden,” Holy-Sword Emperor quickly explained.\n\n“Really?” Xie Qing King did not believe him.\n\nHan Sen then chimed in to say, “I am not sure if he has recovered anything from this place, but I have heard he was able to obtain a certain geno item. That is how he was able to enter this place. Everyone knows because he held a big and fanciful celebration for it.”\n\nWhen Han Sen said this, Holy-Sword Emperor found himself wanting to swiftly explain.\n\nBut Xie Qing King cut-in before him, saying, “Give me that item or die.”\n\n“My Emperor, I…” This was all Holy-Sword Emperor was able to mutter before Xie Qing King swung forward with silver light.\n\nHoly-Sword Emperor was not going to hand over the item he much cherished, so he decided to flee.\n\n“If only running was so easy.” Xie Qing King ran after him, and both spirits disappeared.\n\n“Are we the same kind?” Brother Seven mumbled to ask, once the spirits were gone from sight.\n\n“Do you know the Water Pavilion?” Han Sen asked, out of nowhere.\n\nQin Junhao told Han Sen that, if he saw Brother Seven, he should ask this. It would confirm that he was an ally.\n\nWhen Brother Seven heard what was said, he happily exclaimed, “Junhao made it to Sword-Furnace Shelter?!”\n\n“Yes, he’s taking a well-earned vacation in the Alliance.” Han Sen smiled, and then went on to ask, “So, you are Brother Seven?”\n\nBrother Seven nodded and said, “I did not expect someone to be here, and neither did I expect that someone so young could ever possess such frightful power. If Holy-Sword Emperor survives this ordeal and decides to attack your shelter with all his might, at least you can return to the Alliance safely.”\n\nHan Sen smiled and said, “Smoke and mirrors; I’m not actually that strong. The info you provided us saved our lives. I have come here to bring you back. Holy-Sword Emperor doesn’t currently know what you’re up to, so he can’t kill you with the contract you have signed. It’s best that we take this opportunity and return to the Alliance while we still can.”\n\nBrother Seven shook his head, though, and said, “It’s not worth the risk. There is treasure here, and if we are able to retrieve it, humanity as a whole will improve. It is of vital importance, and it is imperative that we claim it before they do.”\n\n“But you are under contract. Holy-Sword Emperor can easily take it from you,” Han Sen said.\n\nBut Brother Seven said, “I know. But now that I have met you, things have changed. Are you willing to go with me to get the treasure?”\n\n“Treasure? Where do I sign?” Han Sen paused for a brief moment, but then backtracked to say, “But I’m serious, you should return to the Alliance. Tell me where the treasure is, and then go. You can return once I have slain Holy-Sword Emperor.”\n\nBrother Seven admitted with a wry smile, “Well, I actually don’t know where it is.”\n\nHe went on to say, “Holy-Sword Emperor’s treasure is a map. It leads to an item, located in the Phoenix Eye. But the location of the Phoenix Eye is ever-changing, so I have no idea where it might be.”\n\n“I’ve been known to risk much for obtaining treasure. But I’m telling you, your life is far more important than what any item can do for you.”\n\nBrother Seven said, “I am not concerned with myself right now. Come, we should find it. Once we claim it, you can ensure it stays out of their hands.”\n\nBrother Seven then brought out a compass. He looked at it with a concentrated expression, as if he was trying to deduce something complex.\n\nAfter a minute of silence, he said, “Follow me.”\n\nBrother Seven led them in the direction Han Sen had come from. He passed three of the broken walls Xie Qing King had smashed through.\n\nHan Sen followed him with Bao’er still firmly in his arms. It seemed no matter what he pleaded, Brother Seven was determined to stay.\n\nAt every turn, Brother Seven consulted his compass. It meant their passage was rather slow. Four hours later, they reached a dead-end; a ten-meter-tall door barred their way. It was a double door, and each side was emblazoned with the painting of a phoenix."
}