{
    "chapter": 1310,
    "title": "What’s Great About Jadeskin",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1310",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nThe moment No God lunged forward, Han Sen did so too.\n\nThe demon was a gathering force around his enemy’s sword, and it instilled a fear inside its opponents. It made them feel as if there was no escape, and the next hit would be their last.\n\nHan Sen’s swords were plain and did not contain any fancy powers. For all intents and purposes, they were ordinary and not special.\n\nBai Yishan saw No God’s sword appear behind Han Sen somehow, giving no sound or indication as to its true course.\n\nBut Han Sen, clutching his swords, was leaning forward.\n\n“Who will win, I wonder?” Bai Yishan asked aloud.\n\nThe two battlers moved too fast for his eyes to track, and it was all little more than a blur.\n\nLotus Empress shook her head and remained quiet. She did not know. She saw the Phoenix Sword strike No God, which was good, but Taia did not block the attack coming for Han Sen. Fortunately, No God Emperor’s attack did not connect.\n\nNo God Emperor’s chest was delivered a wound, which swiftly began to cascade blood.\n\nHan Sen’s chest had a light wound, but it was just a minor scratch by comparison. It was mild, and little more than a scrape that oozed faint traces of blood.\n\nHan Sen was surprised Jadeskin could make his body so sturdy, and even attacks delivered by someone such as No God Emperor did that tiny amount of damage.\n\nNo God turned around. His wound was nowhere near fatal, and he could heal with great speed, but he looked to be in shock. It had clearly been a while since he last suffered a hit in battle.\n\nSimilarly, No God Emperor could barely believe that he could only leave a scratch on Han Sen’s body, as he was able to damage Han Sen before.\n\n“You used the fruit to open your tenth gene lock?” No God asked.\n\nHan Sen did not answer, and instead, swiftly moved forward to attack again.\n\nHan Sen got hit due to Double Fly not being as efficient as it could be.\n\nBut still, it was fine. If that was the extent of No God Emperor’s attacks, Han Sen had little to fear, and he knew it.\n\nThe flashes of steel-on-steel combat were steady and near-constant, illuminating the dark island. No God Emperor was unable to evade or even block Han Sen’s attacks, and he repeatedly found himself being hit.\n\nWhen No God’s sword hit Han Sen, it was as if he was banging a wooden stick against a rock. Bai Yishan and Lotus Empress were delighted, seeing this.\n\nBut suddenly, No God Emperor flew up, leaving a stream of blood as he went.\n\n“He ran off?” Bai Yishan asked.\n\nLotus Empress was in absolute shock over what had just transpired, as none had ever convinced No God to flee before.\n\nHan Sen was not concerned with going after him, though. After all, even if Han Sen did catch up and kill him, he’d eventually respawn at his spirit stone, anyway.\n\nHe was strong, but not strong enough to break the spirit stone like the Asura Sutra had once done. The Asura Sutra could not bolster Han Sen’s defense as Jadeskin had, either. So that was okay.\n\nIn the Third God’s Sanctuary, Han Sen was now almost invincible. He was a true force to be reckoned with.\n\nAnd so, with No God Emperor out of the picture, Han Sen decided to head back towards the No Dirt Fruit.\n\nLotus Empress and Bai Yishan returned to Han Sen’s side.\n\n“So, all I need to do now is pinch it off?” Han Sen casually asked Lotus Empress, as if nothing had happened.\n\n“Yep. Go ahead,” Lotus Empress said.\n\nHan Sen reached out his hand and grabbed it.\n\nHan Sen and Lotus Empress were both as nervous as each other, wondering if this would work. They had come a long way to get to this point, and Lotus Empress had spent a long time waiting for the right person to come along and help her collect it. With nothing happening to the fruit as he touched it, Han Sen said, “My body really is pure!”\n\nLotus Empress said, “Nice! Pull it off and bring it here.”\n\nHan Sen plucked it off the branch, and just like Lotus Empress hoped, it did not rot.\n\n“So, what do we do now?” Han Sen asked.\n\nLotus Empress did not dare get too close to the fruit Han Sen was holding, in case she accidentally polluted it.\n\n“Could you help peel it for me? And then possibly feed it to me?”\n\nLotus went on her knees and opened her mouth.\n\nHan Sen peeled the fruit for her, as instructed. Then he squirted the juice into her open mouth.\n\nLotus Empress looked incredibly surprised when this happened.\n\nAnd as she did, her body began to glow as the pores of her body emitted a white steam.\n\nHan Sen fed her the last drop of juice, and once he was done, he stepped back to watch the spectacle of her becoming completely enveloped in white steam. Suddenly, his admiration for what was going on came to an end and his face changed. He had received a call from both Moment Queen and Thorn Queen.\n\n“Sister Lotus, something has happened at the shelter. I have to go at once!” Han Sen left Fish King with the others. He said goodbye to Bao’er and Bai Yishan, and then flew back."
}