{
    "chapter": 986,
    "title": "Third Tier of the Dongxuan Sutra",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_986",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen had now learned more about Taia and Qin Huaizhen. While this may have helped elucidate a few things—like how the sword had been brought to the sanctuaries—the real burning questions were still left unanswered.\n\nWhen the Qin family asked the Lan Te family where they found the sword, they said it was purchased from an interstellar traveler.\n\nThey had only seen the traveler once. They did not know where he came from, and they had since been unable to identify him.\n\nWhen the following lectures ended, the two young men from the Arthur family came to visit Han Sen again. They were still very curious, wanting to learn more about archery.\n\nWhen Han Sen met with them again, it pleased him to see their enthusiasm for archery, so he answered every question they posed.\n\nKai Wei and Long listened to Han Sen intently, and this made him even happier.\n\nBut after that, their keenness did not lapse. Each and every day, they returned to ask Han Sen about stuff they did not understand. Han Sen enjoyed the opportunity to be a personal tutor and lecturer, and he took the time to help them to the best of his abilities at every opportunity he received. He started to like the two.\n\nHan Sen didn’t think of teaching the two as a waste of time at all, provided they listened well—which they did.\n\nA month passed, and this time wasn’t only spent teaching. He also managed to open his third gene lock.\n\nHis fitness was very high at this point, so Han Sen was able to unlock his third lock rather quickly. By comparison, it’d take the average surpasser almost two years to reach this point.\n\nAfter opening the third gene lock, his dongxuan aura expanded by a considerable amount and also provided him a new function.\n\nThe second tier allowed him to mask his lifeforce to elude the notice of others. After opening his third gene lock, he could now obscure the seventh sense of others.\n\nHe could not dull or inhibit the eighth sense, though. But still, provided they did not have it, it meant he could make others practically blind and deaf.\n\nIt was a frightening power for any combatant to face, and this silent disabler was scarier than any destructive power a person could possess.\n\nHaving unlocked this ability, Han Sen wondered if his next unlock would allow him to smother the eighth sense of others, too.\n\nHan Sen sent Moment Queen out to hunt creatures, and while she was gone, he took this chance to enter the third spirit base.\n\nHe adopted a low profile, and masked his presence there to ensure that no one else knew The King had arrived there yet.\n\nHis dongxuan aura could not only stifle the seventh sense of one individual, it could be cast across an entire area.\n\nThat meant, if a spirit was outside the effective radius of his dongxuan aura, they could neither see nor enter that place.\n\nSo, after hiding his spirit statue, no one could see him or his island. His appearance there was little more than a flickering shadow.\n\nThis was stage one of Han Sen’s new Third Sanctuary Geno Raiding Plan.\n\nHan Sen began by going after royal spirits. He wasn’t going to skip any levels, as he wished to gather as many royal spirit geno points as he could.\n\nThe spirits who were beaten were not even given the chance to see Han Sen’s face. All they knew was that a veil of black obscured their vision, and then they were suddenly respawning at a spirit statue.\n\nHan Sen couldn’t help his fast ascension through the ranks, and soon, he reached the ranks of the king spirits.\n\n“Have you heard? A horrible king spirit has arrived here. You never see him until it’s too late. He’ll draw you into darkness, and then you will be killed.”\n\n“I know, I heard! I wonder which king spirit’s son it might be?”\n\n“It’s been a while since we last saw him, but do you think it might actually be The King?”\n\n“I don’t think so. Doesn’t The King wield a white light?”\n\n“But I have heard many king spirits have been killed by this new threat. It seems to be another frightening, powerful spirit we must contend with.”\n\n“Who do you think would win in a fight? This spirit or The King?”\n\n“The new spirit. The element of space is frightening.”\n\n“Split-Space King said, he’ll destroy the new spirit if it attacks him.”\n\n“He’s a space king spirit, of course he’ll wreck this shadow-dwelling creep.”\n\n“I’m sure the spirit knows this, too. That’s probably why he hasn’t gone after Split-Space King yet.”\n\nWhile the spirits discussed this, Han Sen drove his island passed them and briefly listened-in. And as he went, he thought, “If Split-Space King is indeed a space spirit, I can kill it and nab a few space geno points. If we were to have a self fight, that would be even better.”\n\nBut Han Sen wasn’t going out in search of him yet. Back in the second spirit base, Han Sen had already been told about Split-Space King and his vow to destroy The King.\n\n“Maybe I really will be able to have a self-fight with him,” Han Sen said to himself, as he continued looking for his next target.\n\nHan Sen only attacked king spirits that were one rank higher than he was. And by the time he was done, he had managed to nab an easy twenty spirit geno points. Unfortunately for him, though, they were all of basic elements.\n\nThe more king spirits Han Sen beat, the cockier Split-Space King became, though. He said Han Sen was a coward, only confident in fighting while concealed. He believed Han Sen would never show his face to him, and therefore, Split-Space King was confident saying anything he wished to.\n\nWhenever Han Sen killed a king spirit, they’d respawn with great fury. And more often than not, their rage-fueled complaints made mention of Split-Space King. His latest kill resulted in the spirit yelling, “Pah, coward! If you think you have the balls, go and fight Split-Space King!”\n\n“That wimp? He is nothing. I can kill him with ease,” Han Sen responded, from the dark that veiled him from their sight.\n\n“Talk is cheap. If you think you’ve got what it takes, no one is stopping you from fighting him. Go over there and prove your worth,” the king spirit rebuked.\n\n“Oh, I will. Deliver a message to him; we will fight in Shen Xiao. And inform him it will be a self fight. I will be waiting. Oh, and if he is not willing to commit to a self fight, tell him not to bother showing up,” Han Sen said, then left.\n\nIt wasn’t long before the news of this challenge spread throughout the entire third spirit base. Every spirit soon heard the words Han Sen had spoken, and they were each keen to watch such a fight."
}