{
    "chapter": 2396,
    "title": "Planet Dark Zone",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2396",
    "text": "Once the half-deified core demon bugs were slain, the rest of the bugs descended into chaos. Dragon One and Han Sen got busy killing them. Some of them managed to escape, but most were killed.\n\nThe group counted their spoils and found that they had two mutant core genes and eighty-six ordinary core genes.\n\nDragon One kept his promise. He gave one mutant core gene and forty-three normal core genes to Han Sen.\n\nDragon One smiled at Han Sen. “Would you be interested in continuing our cooperative efforts to hunt down core xenogeneics? You can have half of everything.”\n\n“Yeah, Dollar! This went well. Let’s do more of this together,” Dragon Eight quickly said. His eyes were shining.\n\nFrom what they could see, Han Sen was a giant meat-shield. With Han Sen at the front, they could kill scary core xenogeneics or destroy whole groups that they previously wouldn’t have dared to provoke.\n\n“Why not?” Han Sen said with a nod.\n\nHan Sen knew what Dragon One had planned, but these Dragons seemed very reliable. Cooperating with them wouldn’t be a bad thing for Han Sen.\n\nUsing Move Mountain Area wouldn’t do him much good if he was by himself. Having awesome defense was pointless if someone wasn’t there to kill the xenogeneics. Cooperating was a bonus for both parties. There was no need to reject their offer.\n\nDragon One and Han Sen signed another contract. They were very happy with the results, so they were keen to bring Han Sen with them as they traveled.\n\nNow that they were cooperating with Han Sen, they had no interest in killing ordinary xenogeneics. They could deal with normal core xenogeneics by themselves, so there was no need to hunt them now and split them with Han Sen. Instead, they went straight for the xenogeneics they hadn’t been able to take down before.\n\nDragon One explained that to Han Sen, but Han Sen was fine with it.\n\nMany Kings wished to kill core xenogeneics. Han Sen was lucky to have already found an opportunity to do so.\n\nHan Sen kept flying, playing with a core gene as he went. The core genes were smaller than a fist. They were transparent, like a shiny blue gem.\n\nDragon Eight noticed Han Sen playing with the core gene, so he flew over to Han Sen. “They’re nothing special to look at, and there’s no way to directly absorb them. You can use them to make a geno fluid, though. If you bathe in it and practice your geno arts, you might end up improving your area.”\n\n“I was wondering if I could eat it,” Han Sen said with a grin.\n\n“Ha! You want to eat a core gene? This thing isn’t meat. How would you eat it?” Dragon Eight laughed.\n\nHan Sen put the core gene into his mouth and swallowed it. Dragon Eight’s smile froze in place. His mouth gaped, and he shouted, “Oh no! You really ate it.”\n\nHan Sen licked his lips and said, “It didn’t taste good. That was awful.”\n\n“Right. You are human, yes? Are you humans a part of the Consuming Ant family?” Dragon Eight glanced at Han Sen with distaste, as if he was looking at a gross monster.\n\n“No, we definitely aren’t.” Han Sen laughed, but he didn’t explain further.\n\nAfter waiting half a day, he managed to digest the core gene, and a familiar announcement played in his head.\n\n“King class gene.”\n\nDragon One and the others looked at Han Sen strangely. Han Sen kept randomly eating core genes, and they were growing concerned.\n\nSince Dollar could apparently eat core genes, they were worried that if he got hungry enough, they might end up as his food.\n\nLuckily, none of their fears came to pass. It made them feel very relieved.\n\n“Mutant King class Core Demon Bug beast soul: Gun-type”\n\nThe type of the beast soul surprised Han Sen. It was a weapon beast soul, and it was a gun-type one. It didn’t seem to match with the creature he had fought.\n\nWhen Han Sen summoned the beast soul, however, he realized that this gun was different from the guns he had been envisioning.\n\nIt was a laser handgun made of red and purple metal. It was one foot long, and it looked very futuristic. It was heavy, and there were many symbols drawn across its body. It was both uncanny and beautiful.\n\nWhen Han Sen put his power into the gun, it turned his power into a purple and red laser. Han Sen didn’t have the chance to see what that laser did, though.\n\nDragon One was guiding them to a core area on a planet called Dark Zone.\n\nThe planet had many core xenogeneics, but the xenogeneics there were very frightening. It was easy to get yourself killed if you weren’t careful, and even many half-deified elites had fallen on the surface of that planet. Ordinary Kings usually didn’t visit such dangerous places.\n\nBut with Han Sen, their big meatshield, Dragon One opted to risk it.\n\nThe group of them were approaching Planet Dark Zone, but before they entered the atmosphere, a group of creatures came flying out from the planet to meet them.\n\nHan Sen at first thought they were xenogeneics, but when he looked closer, he saw that it was a group of the Destroyed. Han Sen remembered two of them.\n\nOne was Barr, and the other was Dia Robber. They were already King class elites.\n\nUpon seeing Barr, Han Sen felt his temples begin to throb. Barr was a madman with an invincible body. He was so strong that fighting him would be a massive nightmare.\n\nLuckily, Barr and Dia Robber didn’t recognize Han Sen in his Dongxuan Armor. They simply approached and stopped Han Sen’s crew from going further.\n\n“Excuse me. Planet Dark Zone has been claimed by us, the Destroyed. Please turn back now,” Dia Robber said, flying up to Dragon One.\n\n“Since when is Planet Dark Zone the property of the Destroyed?” Dragon One asked, his voice hard. He wasn’t afraid of Dia Robber.\n\nDia Robber smiled and said, “Everything will be back to normal soon. You guys can go in, but you will have to wait until we are done here.”\n\n“What if we want to go in right now?” Dragon One stared at Dia Robber.\n\n“Cut the crap!” In his annoyance, Barr quickly drew the bone knife slung across his back. His eyes burned with a murderous look, and he was obviously ready to fight Dragon One.\n\nDia Robber raised his hands to stop Barr, and then he calmly said, “Dragon One, we Destroyed have never offended the Dragon. The core area has many places to destroy core xenogeneics. You guys don’t have to cause us trouble over this Planet Dark Zone, do you?”\n\nDragon One frowned and started to respond, but all of a sudden, there was a booming sound. A giant mushroom cloud rose on the surface of Planet Dark Zone, and a shockwave swept through the atmosphere.\n\nDia Robber’s face changed. The Destroyed seemed to completely forget the Dragons as they turned and flew to Planet Dark Zone at high speed.\n\nDragon One and the others looked at each other with confusion."
}