{
    "chapter": 1131,
    "title": "Invisible Opponent",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1131",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen kept track of how long it took for the light to fade and the shroud of invisibility to return and cloak the scorpion.\n\nIt took ten minutes for the invisible scorpion to disappear from sight. And it got Han Sen thinking, “It would be best if I could kill it in under ten minutes, in that window.”\n\nHan Sen decided to strike the next time it came out for some moonlight refreshment.\n\nOf course, the full moon that drew it out only occurred once a month. If it came out for each full moon, like clockwork, he’d be waiting a while, but Han Sen decided to remain and see if there were any other events that would compel the scorpion out of its lair. He stayed there for a few days.\n\nWith time to kill, he focused on refining his Life Geno Essences while he observed the valley. Now, he had eleven super geno points.\n\nDuring this month-long wait, Uncle Bug came to the valley to subject his son to the once-a-month torture. Although Han Sen had seen this play out once before, it still frightened him to see it all unfold again. It was rather sad, too.\n\nThe full moon finally rose, and with its coming, the face-shaped scorpions emerged from their creepy tunnels. They used the faces on their back to help the transparent scorpion collect moonlight.\n\nHan Sen waited until it absorbed as much as it could and then began his assault. He activated super king spirit mode and ran into battle alongside Disloyal Knight.\n\nDisloyal Knight’s halo was brighter than ever, and it shone across the entire valley as Han Sen rained coins in unbridled oppression.\n\nThe transparent scorpion noticed this quickly occur, and the light-carrying baby faces all seemed to turn to look at the duo. As a coin was about to land atop the transparent scorpion, the beast threw a punch to deflect it.\n\nPang!\n\nThe moonlight acted like super-fuel for the creature, and the power of its hit connected with the coin and turned it to dust.\n\nNeedless to say, Han Sen was shocked. The scorpion was a far more terrible beast than he imagined it to be. The powers were far beyond any other super creature he had fought thus far.\n\nDisloyal Knight marched forward to clobber the scorpion, but the scorpion’s tail managed to sting its arm and knock it back.\n\n“Berserk super creature?” Han Sen was quite surprised. Disloyal Knight’s halo was already working to weaken the foe, and yet its power was still of such heights.\n\nHan Sen grabbed his Phoenix Sword and Taia. Clad in his mantis armor, with dragon wings decorating his back, he charged.\n\nThe scorpion raised its arms to defend against Han Sen’s barrage of sword strikes.\n\nDong! Dong! Dong!\n\nThe fighting sounds echoed throughout the valley, as curtains of sand were kicked up in the haze of battle.\n\nThe area was in chaos, as rocks were broken into chips.\n\nDespite Han Sen using super king spirit mode and all those beast souls, it still didn’t provide the advantage he needed to beat the scorpion. Any damage he dealt was not enough to slay the monster.\n\nDisloyal Knight co-operated with Han Sen, who was using a combination of Double Fly and his phoenix techniques to attack.\n\nThe scorpion swung its fists and its tail to batter Han Sen, but he did not fall back.\n\nBut as time went on, the scorpion’s body began to dim as the light inside it faded. It was becoming harder and harder to see, the more time elapsed.\n\n“Go.” Han Sen knew he wasn’t going to be able to kill the scorpion that day, and there was no doubt that he had gotten into a fray with a berserk-class super creature.\n\nBut as much as Han Sen thought it would be best to flee, the scorpion was enraged. It was not keen to let the man who had the gall to disrupt its monthly ceremony go free. The pincers of the scorpion grabbed him, and they rendered Han Sen immobile.\n\nAnd just as this occurred, the scorpion entirely disappeared from Han Sen’s vision.\n\nPang!\n\nDisloyal Knight’s body was suddenly open. A bloody hole appeared on his body, and Han Sen knew he had been struck by the scorpion’s tail.\n\nIt took a lot to cancel the determination of Disloyal Knight, and as much as he still wished to fight and grab the tail that had stabbed through him, it disappeared before he could grab it.\n\nPang!\n\nHan Sen was beginning to panic, but he could not see the scorpion. His chest was feeling pressure like no other, as his legs kicked the sand in an attempt to slip away. As this happened, the armor on his chest began to dent and bend to the violent will of the pincers that had him caught.\n\n“D*mn it!” Han Sen clicked his fingers to rain another barrage of coins down from the sky.\n\nThe next best thing to keeping track of this opponent was to rain coins. Coins stuck to their target, so Han Sen believed he could at least get a grasp of the creature’s location if it was laden with coins.\n\nAs the coins rained, though, there was no sign of the scorpion.\n\nDisloyal Knight let out a shrill warcry as he was stung by the scorpion’s tail once more.\n\nFortunately, Disloyal Knight was immune to poison. If he hadn’t been, he’d have been rendered unable to fight by the first stinger-strike.\n\nDisloyal Knight kept on swinging his manic fists around in a bid to hit the phantom that assaulted him, but he had no clue where it was.\n\n“Argh!” Han Sen felt pain in his back.\n\nHan Sen was the next recipient of the scorpion’s stinger. Fortunately for him, the super armor was sturdy enough to provide protection and keep the tail from piercing through.\n\n“Run!” Han Sen managed to slip through the pincer and fly higher. The super creature was far too powerful for them, and not even the coins were enough to reveal the monster.\n\nBut as Han Sen took to the skies, his relief was short-lived. He felt something snag and pull him back down as if a chain had quickly wreathed itself around his waist. It forced him down into the ground, and when he smacked hard against the sandy floor of the canyon, a hole was created in his shape.\n\nThe transparent scorpion was invisible, the coins could not stick to it, and not even Han Sen’s eighth sense could keep track of it.\n\nDisloyal Knight was not as strong as a super king spirit, and all its armor was dyed in red.\n\nHan Sen was in a sorry state now, too. He could not see where his opponent was, and all he could do was brace for the next attack that was sure to strike him."
}