{
    "chapter": 2987,
    "title": "Got a God Personality Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2987",
    "text": "I was\n\n“That strong?” Han Sen was shocked. The most shocking thing about this situation came later. After Kill Sky God was injured, he was so shocked that he wanted to escape but could not even turn around.\n\nWan’er’s face displayed zero emotion. Her beautiful body was flickering like a ghost. Her hands were waving as she moved. Since she moved so fast, even with Han Sen’s eye power, he only saw Wan’er’s body appearing and disappearing. Her hands possessed a lot of gold light as she flashed past Kill Sky God. When Kill Sky God turned his body to run, Wan’er stopped. Her small body floated in space. She slowly turned and looked at Han Sen.\n\nKill Sky God had only sprinted away about 30 feet before god blood was everywhere. His body was suddenly broken. It was worse than his body being hanged, drawn, and quartered.\n\nIn the next second, Han Sen saw a god light in the sky, but it was hidden by the big barren system’s big barren power. It did not go into space and create a god’s sadness. After Kill Sky God’s god body was burned away, one part of his upper arm bone remained. That bone was around three feet long. It was shaped like a hammer and pitch black. It appeared very heavy.\n\nHan Sen thought, “It looks like Wan’er’s power and mine are a bit different. The God Spirit she killed left a god personality behind. The God Spirits I kill leave nothing. Even the god personality was gone.”\n\nHan Sen was not currently in the mood to think. Wan’er teleported in front of Han Sen. He gathered up power and looked at Wander with alert eyes.\n\nThe blonde Wan’er might not have recognized him. Considering the power she had just put on display, she was not someone Han Sen believed he was capable of combatting.\n\nWan’er arrived before Han Sen. The gold fire connected with Han Sen’s white flame. The two powers melted into each other as if they were connecting\n\n“Big Brother!” Wan’er looked at Han Sen with shock and fell into his arms.\n\nHan Sen held Wan’er, which led to their flames extinguishing. It suddenly disappeared, and everything returned to normal.\n\n“Big Brother… Wan’er misses you. She misses you so much.” Han Sen looked at Wan’er, but her eyelids became heavier and heavier. She tried her best to look at Han Sen, but she was unable to fight the sleepiness. She closed her eyes and went to sleep.\n\nHan Sen’s expression looked a little distorted. Wan’er’s situation was very bad. Her life force was almost too weak for him to feel. It seemed as if she would die at any moment.\n\nHan Sen quickly took out a bottle of geno fluid and fed it to her, but it had no effect. He summoned the Light Well Lots too, but that did not help Wan’er either.\n\n“If you miss your Big Brother so much, you must hold on no matter what. If you die, I can never see you again.” Han Sen picked up Wan’er and took Kill Sky God’s bone back with him.\n\nnev\n\nDestiny’s Tower’s tower had a crack that went all the way up to down. It was like it had been broken by someone. Han Sen knew that it had not been broken by Kill Sky God. It was Wan’er who had broken it while rushing out. Han Sen picked up Wander and entered Destiny’s Tower. He sorted out the stuff inside. He had a conflicted expression.\n\nEverything was there except two people were missing. Ancient Devil and Ancient Abyss Grandmaster were gone. The stone platform and space bai sema were still fine. They were not damaged, but they were gone.\n\n“I did not expect Ancient Devil would be able to escape, but that is fine by me.” Han Sen shook his head. He put Wan’er inside Destiny’s Tower and put Destiny’s Tower away.\n\nHe was holding that Kill Sky God arm bone. Han Sen was thinking, “Right now, I have Evil Lotus God and Sky Armor God’s god personality. This will be the third god personality I have received, but Evil Lotus God and Sky Armor God were just Destruction class. They cannot compare to an Annihilation class Kill Sky God and his Kill Sky God god personality.\n\nHan Sen was hesitating because unlike ordinary creatures, he knew the god personality was God Spirit genes. Han Sen knew that due to the announcements. Although Han Sen was not able to absorb God Spirit genes, he always believed if he was able to absorb other genes, there was no way he could absorb God Spirit genes. Perhaps he had just not yet found a way to absorb the God Spirit genes.\n\nIt was like before in the sanctuaries when he received super genes. At first, people were not able to absorb them. God Spirit genes might have been similar to that.\n\nHe was unsure whether or not putting god personalities in god personality armaments could be absorbed.\n\n“That Kill Sky God is very powerful. He just descended and was almost invincible. In the god temple, he must be even scarier. Ordinarily, I would want to kill him and Moment God, both of whom are in the same class. As I am right now, the chances of me doing that are pretty slim. If I have Kill Sky God’s god personality armament, my chances will be much higher. I should go swap it.” Han Sen made a decision. He then thought, “But I do not know what type of god personality armament Kill Sky God’s god personality armament is. I hope it is armor so I can block Moment God’s attacks. There is no need for me to end up dead because of her.” In Han Sen’s heart, he knew that Kill Sky God’s god personality armament had a low chance of providing him with armor. That arm bone would probably not have ended up looking like armor.\n\nNo matter what it was, having an Annihilation class god personality armament should have helped him a tremendous amount.\n\nHan Sen collected the arm bone and figured out which direction he needed to go. He kept going deep into the big barren systems. Since he was already there, he figured he might as well check out the holy hall. He wanted to see if Littleflower and Old Cat were back yet. With the holy spirit, the darkness did not cause Han Sen much trouble or danger. He traveled back to the holy palace. He arrived there safely.\n\nHe was back to being Han Sen now. He reached the holy palace. When Han Sen used the long, bright lantern’s light and saw the ruins of the holy palace, he was shocked.\n\nThe holy palace had been broken when Han Sen was there. Now, the holy palace’s ruins were dyed black in dry blood.\n\nRed Ghost, the eyeless beast, and Old Vulture’s giant bodies were lying across the ruins. The wounds on their bodies were solid. Their life forces were gone.\n\nThe eyeless big beast’s body was split in half. Red Ghost had been decapitated, and Old Vulture’s feathers had all been plucked. There was a shadow standing on top of the ruin. Someone was holding Auntie Mei by the neck. He lifted her up in the air.\n\nAuntie Mei had no strength to struggle. Her hands clutched the other hands, but she could not get away.\n\n“Mis… Mister…” Auntie Mei saw Han Sen enter the radius of the bright, long lantern. She had been hopeless, but now she had a bit of hope. She gathered up all her power and used whatever she had left to shout at Han Sen, “Be wary of Old Cat…”"
}