{
    "chapter": 2457,
    "title": "Exposed",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2457",
    "text": "The woman looked into her reflection in the pool. Her gaze suddenly sharpened.\n\n“She can see me!” Han Sen knew this was very bad, but he had already considered this eventuality. If the being Han Sen inhabited was close to a reflective surface, Han Sen knew his presence would be exposed sooner or later. So, he didn’t panic.\n\nWhen the woman saw the strange appearance of her eye, she didn’t panic, either. She smiled and said, “Interesting. You dared to use an eye trick on someone like me? You are brave.”\n\nAfter that, the woman released a burning golden light in her eyes. It started in her pupils and spread across her irises, slowly fighting back the red and transforming it into gold.\n\nHan Sen’s chest tightened. He didn’t know what sort of power that woman had employed, but after the gold light consumed her eyes, the woman put away her power. As soon as she released her power, the gold color extinguished and the red reappeared.\n\n“Huh, my Goldeneye didn’t work. This is tricky,” the woman said with a pleased smile. The color of her eye changed again. This time, a deep black swept over her irises. The black rolled over the entirety of her eyeballs, overwhelming the red.\n\nOnce her eyes had fallen completely into darkness, the woman stopped feeding power into the technique she had used. Once again, as soon as she released the technique, the red returned to her eyes.\n\n“Darkness Eye didn’t work either. Fascinating.” The woman proceeded to try many different eye talents as she attempted to expunge Han Sen, but they only succeeded in making his vision go funny. Nothing seemed to affect the power of the Blood Eye Evil God beast soul, though.\n\nHan Sen was delighted with the performance of his beast soul. “So this is the power of a mutant deified beast soul. Even this woman cannot do anything against me.”\n\n“How interesting.” The woman was now smiling widely. Rather than being upset at her repeated failures, she looked thrilled.\n\nAfter that, the woman didn’t use any more eye skills. She raised her fingertips and gathered up some sort of light. Wisps of spiritual light rose from her fingertips, turning into a mirror that hovered before her face.\n\nThe mirror hung before the woman’s eye, but there was no human reflection inside it. A weird light swirled around the surface of the silver mirror, and eventually, it turned a deep red color and began to coil in tighter and tighter swirls. In moments, the red color had changed to depict the face of the Blood Eye Evil God.\n\n“Ah, it is Blood Eye Evil God. No wonder my eye skills didn’t work.” When the woman saw the image of Blood Eye Evil God, she smiled in sudden understanding. She raised her finger and pressed it to her forehead just above her eyes. More spiritual light went into her.\n\nThe woman’s eyes shattered like glass. The shadowy space that Han Sen inhabited collapsed, and he was forced to come out. He fell onto the ground and immediately tried to leap away from the house.\n\n“What’s this? That isn’t Blood Eye Evil God,” the woman murmured in surprise. Her eyes healed immediately, and her hands never stopped moving. She raised one hand, and a crystal ball flew toward Han Sen to trap him.\n\nHan Sen moved to evade the crystal ball, but the woman shifted the position of her hand and cast a few lights that struck Han Sen with pinpoint precision. Han Sen’s body became much heavier, and his speed dropped drastically. A deep ache sank into his back, and he felt as if he had ejaculated prematurely and then become impotent. He was suddenly struck with the pain of a woman’s period, and his eyesight became blurry. Pain and nausea swept through him. God only knew how many geno arts the woman had cast to give him such a wretched series of debilitations.\n\nHan Sen used his Jadeskin Area, which transformed his body into jade-like ice. The woman’s debilitating geno arts no longer worked on Han Sen, allowing him to dodge the second crystal attack. Then, he leaped out the window.\n\nThe woman’s face looked like the face of a cat in pursuit of a mouse. It was as if she had made a fascinating discovery. She ran out of the wooden house, too.\n\nHan Sen wanted to fly away and escape the island, but as soon as he moved, he saw the crystal ball racing toward him.\n\nHan Sen evaded it, but the crystal ball exploded. It transformed into a giant crystal net that covered the entire island. Han Sen had nowhere to run.\n\nHan Sen’s fingers wriggled like mad, casting sword silks as he attempted to lift the net of crystal. He kept the net from falling on him, and his mind raced to find a way out of this predicament.\n\nAfter a few of her attacks, though, Han Sen noticed that the woman wasn’t as strong as he initially believed her to be. She had the power of a King class being at the most, he wagered. But she possessed such a variety of geno arts that she could do almost anything. She had an infinite supply of surprises up her sleeve, that was for sure.\n\nWhen she saw that her crystal net couldn’t trap Han Sen, the woman changed her approach. Her fingers became like blades, and she used all sorts of geno arts to attack. Han Sen had a hard time dealing with her.\n\nHan Sen had encountered many powerful opponents in his time, and some of them had learned many skills, but this woman could use literally anything. She could fuse a dozen skills into a single attack. He had never seen anything like this before.\n\nHer attack might start out as fire powers, but when they got close to Han Sen, they might transform into gold or water powers. An attack might rage toward him, but then become as soft as a kiss when it landed.\n\nHer fingers, palms, knives, and swords didn’t allow Han Sen a moment to breathe. This wasn’t a fight. It was like the woman was conducting an artistic performance of many tricks.\n\nHan Sen fought to defend himself, but he couldn’t win. And with the crystal net in place over the island, Han Sen knew that he couldn’t escape.\n\nThe woman looked shocked, too, though. Han Sen’s attacks were very familiar to her in some ways, but they were also quite different than she expected.\n\n“Sky Palace’s Textless Book isn’t completely the same, but it is just… And the breaking power is not the same… Fascinating…” The woman was captivated by Han Sen’s skills.\n\nThe woman knew too many geno arts. Han Sen used skills that he thought would take advantage of the woman’s weaknesses. But she always used another unexpected geno art to escape every crisis, and Han Sen found himself fighting for his life instead.\n\n“I’m sorry! I didn’t mean to offend you. I came here purely by happenstance. I mean you no harm, so please forgive me,” Han Sen pleaded, as he continued to fight.\n\n“Use a few more geno arts. I have seen these before,” the woman commanded, not actually responding to Han Sen’s plight.\n\nHan Sen knew many geno arts, but he didn’t think that this situation called for them. Instead, he stuck with skills that he knew could counter her attacks.\n\nThe woman, seeing that Han Sen was only using a few skills to break all of her geno arts, looked profoundly annoyed.\n\n“Down!” The woman waved her hand, and the crystal net snapped Han Sen’s sword silks and fell toward him. Many substance chains now writhed within the crystal net.\n\n“She’s deified!” Han Sen realized that the woman had been playing with him. She hadn’t used her real powers up until now."
}