{
    "chapter": 1110,
    "title": "Super Armor",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1110",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nWhen Disloyal Knight was battling another super creature one-on-one, its best weapon was its halo. This was because it had no physical armaments.\n\nIf two armies were going into battle, its halo could weaken the entire enemy horde. Its debuffing capabilities were excellent, and using them was where Disloyal Knight truly shone. But still, one-on-one, it was by no means a poor battler. It wasn’t losing against the mantis, it just wasn’t proving strong enough to kill it.\n\nAs they fought, Han Sen ran further into the shelter. With Taia and his Phoenix Sword, he got to slaying as many primitive and mutant mantises as he could.\n\nHan Sen wanted to see if there were any other super creatures in the vicinity, and why such a large hive of the creatures had taken sanctuary in this shelter in particular.\n\nDue to the proximity of Devil’s Realm, creatures didn’t often visit the area. For so many of them to be at this particular location, Han Sen figured there had to be a specific reason.\n\nFrom the group of creatures Han Sen was doing battle with, a sacred-blood variant emerged. Without fear, Han Sen engaged it. Queen merely stood by and watched him, eager to see just how powerful he had become.\n\nHan Sen made use of his phoenix techniques to fly around the mantis and slice it with both swords, forming a bloody cross upon its body.\n\nKatcha!\n\nThe mantis had been diced into four parts.\n\nWhen she saw him manage to one-hit kill a sacred-blood creature, Queen was gobsmacked. She imagined he absolutely had to be a top-dog surpasser.\n\n“No beast soul,” Han Sen thought to himself.\n\nAside from the wide array of mantises that still occupied the shelter, there didn’t seem to be anything particularly interesting in the area.\n\nAfter killing three more sacred-blood creatures, no more could be found.\n\nIn a courtyard, Han Sen espied the presence of a tree. It looked like a plum tree, which he had mistaken for an oversized mushroom when he first saw it in the distance.\n\nEvery branch and twig was laden with fruit, ripe for the taking. The fruit were like red eggs, just hanging there.\n\nWhat’s more, many mantises stood like sentinels around it. Many of the creatures were actually staying there, in the tree’s defense.\n\n“Geno plant.” Han Sen could not mistake the energy radiating from that tree.\n\nHe didn’t know what benefits such fruit could yield, but seeing the mantis guard it like so, he knew it had to be something beneficial.\n\nHan Sen raced down to the courtyard as the mantises swiftly came to engage the intruder. With Han Sen and Queen’s combined might, it had proven more than easy for the duo to kill primitive and mutant creatures by the boatload.\n\nUnlike Han Sen’s feverish interest in the tree, though, Queen did not care for it. She was intensely focused in her observation of Han Sen’s capabilities.\n\nShe had only taught him a small amount of Heavenly Go a very long time ago, but now, he was doing much better than her. This was her signature move, and yet, Han Sen had far exceeded her own abilities with the technique.\n\nQueen had only practiced Heavenly Go, but Han Sen had integrated many different movesets and techniques into it. Queen was actually seeing a mixture of Heavenly Go, phoenix techniques, and Seven Twists.\n\nOf course, they were just additions. Han Sen still relied on Heavenly Go as the foundation for his evasive techniques.\n\nThe way Queen was staring at Han Sen was as if she had just swung wide the large gates of heaven. With each step Han Sen took, it was as if she was transported to an entirely different world.\n\nTzzk!\n\nThe super-class mantis let out a bone-chilling shriek as it flew over to the courtyard Han Sen and Queen were intruding upon. It had given up the fight with Disloyal Knight and headed straight for the tree—clearly, the tree was important to the creature.\n\n“Careful!” Queen shouted. The mantis was already above Han Sen’s head.\n\nHan Sen’s eyes flashed with the presence of a red flame, and then the fire leaped out of his eyes to encircle his entire body. His body turned into a golden raven with wings outstretched. In this manner, he twirled to avoid the mantis.\n\nPang!\n\nQueen was in utter disbelief. As she looked, she asked herself, “A super-class shapeshifting beast soul?”\n\nShe wasn’t even sure if she should be surprised anymore. Han Sen’s latest dazzler had left her feeling numb. It was too amazing.\n\n“Even if he had been injured and was off the playing field for another ten years, I doubt anyone else could come close to competing with his accomplishments,” Queen thought to herself.\n\nFor a human to possess two super beast souls in the Third God’s Sanctuary was unheard of. It was extremely rare for a person to possess even one in the Second God’s Sanctuary.\n\nDisloyal Knight raced after the mantis and resumed its battle alongside Han Sen. Quickly, the mantis was at a disadvantage and was clearly going to be the loser in the engagement.\n\nThe fire-wreathed talons of the raven slashed at the mantis’s shell. The monster’s blood gushed out like a cascade of fireworks. It had been severely weakened by Disloyal Knight’s halo, and after realizing it was going to lose, now wanted to flap its wings and fly away.\n\nBut Han Sen wasn’t going to allow it to escape. He gave chase to the beast, hacking away at the insect as it went. Eventually, Han Sen’s talons pierced through the mantis’ chest and killed it for good.\n\n“Super Creature Devil-Blood Mantis killed. Beast soul gained. The flesh of this creature is inedible, but you may harvest its Life Geno Essence. Consume its Life Geno Essence to gain zero to ten super geno points randomly.”\n\nHan Sen was overjoyed to receive a super armor beast soul in the Third God’s Sanctuary. Seeing the creature decompose, Han Sen hastily grabbed the Life Geno Essence and put it away.\n\nThe last Life Geno Essence he had retrieved could not be refined due to his injuries, so he wasn’t sure how long it would take to absorb a second."
}