{
    "chapter": 2237,
    "title": "I",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2237",
    "text": "But for Han Sen, that was ideal. After what happened with Night River King, who knew if other assassins might be lurking outside the base with Ancient Warrior Statues, just waiting for their chance to kill him.\n\nThe tri-colored Demon Bug King Bai Sema had been heavily damaged. Only Han Yan’s gold Demon Bug King Bai Sema was currently usable. If the same thing happened to them again, they’d have nothing left to repel such a horrible attack.\n\nStaying inside the shelter of the base under the constant protection of the knights was currently Han Sen’s best option.\n\nThese thoughts lasted until the Ji family returned the diary to him.\n\nThe Ji family’s code crackers were quite skilled. After they managed to decode the diary, they translated Night River King’s messages in short order.\n\nThe content started before Night River King came to the systems of chaos, and the early entries were rather boring. They were only a few words each, and they tended to be simple notes about his day. He probably only wrote them in code out of habit.\n\nWhen Night River King arrived in the systems of chaos, however, he was attacked by xenogeneics while he was defending Ice Blue System. That was where the diary got interesting.\n\nNight River King hadn’t been there for long, but in that time, he discovered something rather strange. Instead of telling the Ice Blue Knights, he began secretly investigating on his own.\n\nSixty-seven days before Han Sen began reading the diary, Night River King had been spending his second day stationed defensively at the edge of the Ice Blue System. A group of xenogeneics had approached the border of the Ice Blue System and attacked the Ice Blue Knights that were on guard.\n\nThen Night River King had made this note:\n\n“It was here. It was always here.”\n\nThat didn’t make much sense. Han Sen didn’t know exactly what it meant, but it clearly indicated that Night River King had found something.\n\nHan Sen kept looking through Night River King’s diary. He noticed that over the following days, each entry was short.\n\n“It’s still here. Purple.”\n\n“Seventh is infected. Haven’t found anything abnormal.”\n\n“Thirty-second is infected. Nothing abnormal.”\n\n…\n\n“First is abnormal. Observation ongoing.”\n\nThe short entries continued for an entire month. Night River King seemed to have discovered something, and although his entries were short and mostly without emotion, Han Sen could sense the worry that had filled Night River King as he wrote.\n\n“What did he find that scared him so badly, I wonder? What are his notes talking about?” Han Sen wondered with a frown. He didn’t have any answers yet.\n\nThe diary continued in that way for some time. The entries led up to a few days before Night River King had come and attempted to kill Han Sen. At that point, the diary included something new.\n\n“Edward asked me to kill Han Sen. It is risky, but it is worth a try. If I succeed, I can be away from it.”\n\nHan Sen frowned again. Night River King knew helping Edward would be a dangerous venture, but he was scared of this mysterious thing even more.\n\nOver the next few days, Night River King continued his observations. He still referred to “it” and the numbered creatures frequently. Those numbered creatures had undergone many weird changes.\n\nThe day before Night River King came to kill Han Sen, he wrote his last entry. He had seen something that shocked him a lot.\n\nHis last entry was much lengthier than the others. What was written there made Han Sen feel an uneasy sense of disbelief.\n\n“Good god. Seventh became King class… It’s… It affected number seven… What is that power? Is it dangerous? Can I use it?” Night River King seemed very nervous, and he used many question marks.\n\n“What did Night River King see? What are these numbers he’s referring to? It can raise creatures to King class? If it is inside the Ice Blue System, and Night River King saw it so regularly, there’s no way that it has escaped the notice of all the other Ice Blue Knights.” Han Sen frowned as he thought to himself. But Night River King’s diary never once described exactly what “it” was. And so, Han Sen couldn’t accurately guess its nature.\n\n“Purple. Night River King found it, but the Ice Blue Knights with him did not. He said it affected a number of creatures, and one of those became King class…” Han Sen sorted through the various leads, but there was nothing solid enough to go on.\n\n“It looks like I will have to go to where Night River King was originally stationed. If I head there, I might be able to find out what he is referencing,” Han Sen proceeded to think. It was simply a shame that the Ice Blue Knights owned every inch of the system. He couldn’t just go wherever he wished.\n\nHan Sen used Night River King as an excuse to ask for more information about the borders of the system. In the time that Night River King had been with the Ice Blue Knights on the border, none of them had ranked up from Duke to King class.\n\nHan Sen had thought that the numbers might have indicated the Ice Blue Knights that were working with Night River King, but that seemed to have been an incorrect assumption.\n\n“What are these numbers referencing? If I can just figure that out, they shouldn’t be too difficult to find,” Han Sen said with a groan.\n\nNight River King’s final diary entry was very intriguing to Han Sen. If the mysterious “it” could raise another creature to King class, then Han Sen was very interested in finding out what it was.\n\nBut since it had terrified Night River King to such a degree, it was probably quite dangerous as well.\n\n“How do I get to where Night River King was stationed as a guard?” Han Sen tried to think of a way to get there, but no ideas seemed to stick.\n\nHan Sen needed to get to the very edge of the Ice Blue System, and only proper Ice Blue Knights were allowed to fill those posts. Han Sen was just a back-up knight, so he wasn’t qualified for the position. He wouldn’t receive permission to go, even if he really wanted to.\n\nPlus, Han Sen didn’t think going there on his own would be a good idea. Edward would find a way to deal with him in order to retrieve that tablet. And Edward could definitely take advantage of such a place.\n\nBut being stuck in the base, unable to discover what Night River King was talking about, left Han Sen with an itchy feeling.\n\nIf the thing was as dangerous as Night River King indicated, there was every chance it was a threat to the entire Ice Blue System. Han Sen was included in that threat, as well.\n\nA back-up knight knocked on Han Sen’s door. “Han Sen, Knight King has asked you to meet him at his office.”\n\n“Okay, I will be there,” Han Sen said, waving his thanks. He got up and went straight to Ice Blue Knight King’s office. He had no idea why Ice Blue Knight King had summoned him."
}