{
    "chapter": 1905,
    "title": "Private Female Club",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1905",
    "text": "In Narrow Moon’s Full Moon meeting room.\n\nSix Kings had shown up for this meeting. Yisha, Moon Wheel King, Night River King, Flower King, Black Moon King, and Shadow King.\n\n“Knife, do you really believe what he tells you? Despite being only a Baron, he has managed to achieve a mind such as that with Unlimited Sutra? Seriously? Not even Barons who go on to become deified elites are that strong,” Night River King said.\n\nBlack Moon King coughed and said, “Night River, let’s not impose limits that might not exist. This universe is so grand in its reaches that there could be anything out there. Han Sen really is talented. Just because you are unable to achieve such feats of might, don’t presume others cannot either.”\n\n“Black Moon, don’t talk such nonsense. Look at this universe! Are there any Barons with that level of capability?” Night River frowned.\n\n“If everyone was able to do it, why else would we single out the exemplary and call them geniuses?” Black Moon King asked slowly.\n\nNight River King started to respond, but Moon Wheel King cut him off. Moon Wheel King looked at Flower King and Shadow King, and said, “What do you two think?”\n\nFlower King groaned and said, “Han Sen’s power seems unlikely, but we can’t claim that there’s a problem without knowing what it is. That hardly seems fair.”\n\nMoon Wheel King nodded. He looked at Shadow King, and Shadow King said, “I would rather put an end to this before it gets out of hand.”\n\nYes!” Night River King said immediately. “Han Sen’s history is far too strange, and he cannot be kept.”\n\nMoon Wheel King looked at Black Moon King, and Black Moon King said, “Killing a genius like that makes no sense. It will just scare off the other races, and no other race will want to co-operate with us.”\n\n“Knife, you understand where we’re coming from, yes? He is your student, so it is best that you decide what to do.” Moon Wheel King looked at Yisha.\n\nYisha said calmly, “I gave him a chance. If he passes the test, I can prove that he is fine. If he cannot pass the test, I will sever ties with him and search for any threat he might pose. If I find something, I will get rid of him.”\n\n“What is the test? If he really is a spy from some other race, he will have come prepared. He will pass the test.” Night River King looked displeased.\n\n“Oh? You think a Baron spy will be able to create a Teeth Knife knifemind in three months?” Yisha’s face was expressionless.\n\nHearing Yisha say this, the other Kings stared at her with wide eyes.\n\n“Generate a Teeth Knife knifemind in three months? Really?” Moon Wheel King asked, stumbling slightly over the question.\n\n“What is the problem?” Yisha responded.\n\n“I have no problem with that. If he can accomplish that in three months, then I will believe he is a real genius,” Night River King slowly said, as he sat down.\n\nIt sounded like complete lunacy. It was silly, to think of generating a Teeth Knife knifemind in three months. Across the history of the Rebate, no one had managed anything like that.\n\nNight River King did not believe Han Sen could do it, as Teeth Knife was exclusive to the Rebate. Even among the Rebate, it was rare. The only person who had mastered the skill was Yisha, and you couldn’t cheat your way to learn it.\n\nThe Kings were mollified. If Han Sen could generate a Teeth Knife knifemind in three months, then practicing Touching Flower Finger with such proficiency would make a lot more sense.\n\n“If we can confirm Han Sen is legit, and he really is a true genius, should we give him a bit of a reputation? His identity should allow him to become a member of Moon Garden. He did make us proud in this event, after all. If we still don’t let him in, the outsiders in Narrow Moon will become suspicious of us,” Black Moon King said.\n\n“If he can generate a Teeth Knife knifemind in three months, I would be willing to make him a teacher in the Moon Garden,” Night River King said grimly.\n\nBlack Moon King smiled at Night River King, then turned his gaze across the table.\n\n“Moon Wheel King, what do you think?”\n\n“If he is legit, and he really is that talented, he should definitely be a member of Moon Garden,” Moon Wheel King said.\n\n“If everyone has no problem with this, then we shall all reconvene in three months.” Yisha stood up and left the Full Moon meeting room.\n\nLu Xiaomei was walking down the street. The dark circles under her eyes were heavy, and she kept rubbing her head. Ever since Han Bao’er had entered her school, she had begun to feel like she was drowning.\n\nShe was a kindergarten teacher. Before Bao’er, she had dealt with kids crying, not wanting to go to school, and things like that. But now, going to work was like walking into hell itself. If her job hadn’t paid well, she would have quit a long time ago to escape having to deal with the monster that resided there.\n\n“I can’t do it anymore. I am going to die! Today is supposed to be a holiday, and so I should treat myself with a day at the spa. And buy myself a nice gift! Ever since that little witch arrived, I look ten years older.” Lu Xiaomei walked into a high-class female club. She swiped her card as she walked through the door. “I really do need to treat myself better. I can just eat nutrient fluids for the month to make up for what I spend today.”\n\nAfter she entered the place, the attendants served her with passion. She felt as if she had ascended in society, taking the place of royalty.\n\n“This is my life. Finally, I don’t have to worry about that monster.” Lu Xiaomei wrapped a bathrobe around herself and lay down to wait for her masseuse.\n\n“Miss Lu,” a voice sounded in her ear. It made her muscles freeze. She jumped up and frantically looked around. She didn’t see anyone there, so she felt relieved. She lay back down on the bed and said to herself, “I am starting to hallucinate. Clearly, I am far too stressed out. Maybe I’ll go shopping today, too. That should help.”\n\nAfter lying back down, Lu Xiaomei turned over, and there was a pretty little girl next to her, smiling.\n\n“Miss Lu, what stores are you going to?”\n\nYou… you… why are you here!” Lu Xiaomei looked like she had just seen a ghost. She jumped up and pointed at the girl. “I own this club. Did you not know that?” Bao’er shook her head.\n\nLu Xiaomei’s eyes opened wide. “You own this place?”\n\n“Yes. I have thirty-one branches of this establishment, all across the city.” Bao’er spoke with innocence.\n\n“This b*tch is showing off again…” Lu Xiaomei felt both jealous and depressed. She was really hoping Bao’er would disappear right now.\n\nBut an evil expression crossed Bao’er’s face, and she said, “By the way, I am going to the VIP area for a session. Would you like to come?”\n\n“Can I?” Lu Xiaomei was quite shocked. It was a very expensive place, and she could only come here once a month. For half a month, she would have to eat nutrient fluid just to compensate for how much that place cost. The VIP area was a place you couldn’t easily go to—even if you had a lot of money. She wanted to go, but non-VIPs weren’t allowed.\n\n“Of course, if you want. I can ask the manager to provide you with a VIP card.” Bao’er smiled."
}