{
    "chapter": 101,
    "title": "Infamy",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_101",
    "text": "Every year during the contest, there was a lot of special programs that covered different matches. Although Contest Center was just a new program, it was produced by Huaxing Station, which was a prominent TV station. With a celebrity host Fang Mingquan, the program had good ratings and was among top 100 in the Alliance.\n\nTop 100 may sound less than impressive, but was in fact an amazing achievement. In the entire Alliance, each planet had tens of thousands of programs, many of which were from the authority. It was quite something to stand out and be among top 100.\n\nAnd of course, during the contest, a program focusing on the contest itself would naturally have higher ratings.\n\nOn this day, the content of Contest Center caused an uproar in the Alliance. Fang Mingquan had introduced and analyzed Dollar’s current situation and predicted that this year Dollar would become the final champion, which had lead to outspread outrage.\n\n\"Fang Mingquan is a retard. Look at Dollar’s performance, how can he win?\"\n\n\"We know that you are famous because of Dollar’s video. But there is no need to kiss Dollar’s ass like this.\"\n\n\"Rubbish. If Dollar is the champion, I will live broadcast myself eating s*#t.\"\n\n\"What do you think of Yi Dongmu if you think Dollar could win?\"\n\n\"Ha-ha, Fang Mingquan is so dumb. Dollar will meet Yi Dongmu before he gets to top 10. He’d be lucky to survive. To win? LMAO.\"\n\n\"My Tang Zhenliu would never let him!\"\n\n\"My Lin Feng would never let him!\"\n\n\"Stupid, stupid, stupid...\"\n\n\"Although I also like Dollar, he didn’t do that well in the contest so far.\"\n\n\"Fang Mingquan, you are too subjective about this. I can’t even watch this stuff and I am a fan of Dollar’s.\"\n\n\"You call yourself a fan? Go be other people’s fan, please.\"\n\n\"Dollar is nothing compared to Yi.\"\n\n\"Yi must win.\"\n\n\"Dollar little angel, I will always support you.\"\n\n…\n\nContest Center and Fang Mingquan had been made a hit by all the criticism. Many peers were satirical about Fang’s grandstanding, too. Some even asked him to quit journalism.\n\nExcept for a few hardcore fans of Dollar, all comments on Fang was negative. Even many Dollar’s fans thought Fang’s report was over the top and didn’t dare to support him.\n\n\"Fang, I’m sorry you are wronged.\" In the conference room of Huaxing Station, Xu Kangnian grinned from ear to ear.\n\nAlthough Contest Center and Fang Mingquan were severely criticized, the ratings had risen a lot, sending the show in top 50.\n\nA large number of other contestants’ fans flooded into Contest Center, especially those who supported Yi Dongmu, this year’s dark horse who would encounter Dollar before becoming the Chosen. The Skynet community of the show had almost burst.\n\nAlthough it was only top 50, for Huaxing Station it was a great achievement. There had been less than a handful of shows that could accomplish this in the station’s history.\n\nTherefore, Xu Kangnian was quite pleased with what Fang Mingquan had done and Wang Changqing was naturally upset. He didn’t know that Fang Mingquan would try to improve the ratings this way.\n\n\"This is just my job. I have Director Xu to thank for my achievement.\" Fang Mingquan said modestly, flattering Xu at the same time.\n\nXu Kangnian was even happier and patted Fang Mingquan on the shoulder. \"Fang, keep talking about Dollar and the stronger you say he is the better. If everything goes well, we might have even higher ratings and could break our record.\"\n\n\"Please rest assured that I will do my best.\" Fang Mingquan did not think it was grandstanding as he sincerely believed Dollar would win. However, others didn’t see it that way. Fortunately, the result was good anyway. For a journalist, criticism was not always a bad thing.\n\nXu Kangnian praised Fang Mingquan some more. After the meeting was over and Xu had left, Wang Changqing said coldly, \"You are ignoring the facts for fame. You might be popular now but the reputation of the program would be ruined by you. Which station would hire you in the future? Xu’s compliment means nothing. You think you can get away with it when he finds out the show was discredited?\"\n\nOf course, Fang Mingquan understood that as well. Someone had to take the fall when the fad passed. He himself would be that someone in this case. Xu was just trying to keep him onboard now to raise the ratings. Fang had been in this industry long enough to know that.\n\nSmiling, Fang Mingquan looked at Wang Changqing and asked, \"What if Dollar really wins?\"\n\nWang Changqing paused. If Dollar really wins, then Contest Center would become famous for real and Fang Mingquan’s name would become a household name. Xu Kangnian would treat Fang like the God of Wealth.\n\n\"Keep on dreaming,\" Wang Changqing scoffed. Anyone could see that Dollar did not have what it took to win. He was just average and far from top 10, let alone winning.\n\n\"Whether you believe it or not, I firmly believe that Dollar will be the champion.\" Fang Mingquan got up and went away.\n\n\"Idiot,\" Wang Changqing whispered. He was waiting to see how miserable Fang would be.\n\nHan Sen did not go on the Skynet, so he was not aware of the debate about Contest Center. At the moment, he was practicing with Tang Zhenliu in Fang Jingqi’s villa.\n\nAlthough Tang Zhenliu would not meet Yi Dongmu before top 10, he felt like they were going to meet when they were both top 10 eventually. So, he was still practicing with Han Sen when he had time.\n\nOnly Han Sen knew that Tang would not ecounter Yi Dongmu because he would eliminate Yi himself before Yi rose to top 10.\n\nBut a sparring partner like Tang was so precious that Han Sen was happy to oblige.\n\nHaving practiced for two days, Tang finally let Han Sen go just before the next round of match began.\n\nHan Sen knew who his opponent was and did not panic. He had made up his mind to practice in the match and gain some practical experience from his opponent.\n\nAfter all, these were the champions of different shelters and it was such a rare opportunity to fight them one-on-one. Han Sen had not much experience in this kind of matches and was happy that he got a chance to gain some."
}