{
    "chapter": 987,
    "title": "Dry Angel Corpses",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_987",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“Do you think Split-Space King will show up for the self fight in Shen Xiao?”\n\n“Of course he will.”\n\n“Aye; he has nothing to be afraid of. His split-space powers can vaporize this dark-dwelling loser.”\n\n“It’s going to be one heck of a show, then. Come on, we mustn’t be late. Let’s hurry!”\n\n“This will be a rare spectacle; we must definitely get there soon.”\n\n…\n\nCountless spirits went to Shen Xiao to witness this fight. And as cold as ever, Split-Space King accepted the terms of the fight and said, “Pah! What a fool. ‘Tis a waste of life, challenging me to a self fight.”\n\n“Split-Space, this fight is pointless,” a woman said.\n\n“If I can’t beat him, or if I cower away, how in the sanctuaries do you think I can live up to my name?” Split-Space King said.\n\n“But you don’t know anything about him. You don’t know the extent of his powers. It’s risky, and if you lose all your space geno points…” The woman sounded very worried.\n\n“I am indestructible, have you not learnt that yet? I will crush anything that comes my way with the greatest of ease,” Split-Space King reaffirmed.\n\nThe woman wished to say something more, but he stopped her and said, “You are just a royal spirit. You do not understand. I can kill him one hundred times in the blink of an eye.”\n\nThe woman was only a royal spirit, but she had given birth to Split-Space King. It was very sad that he disdained her. He was a wretched son.\n\nHan Sen set up the fight, but he did not go to Shen Xiao. He killed two more king spirits and left the spirit base.\n\nWhen Split-Space King arrived, the spirits were overjoyed and their hype reached maximum. But much to their surprise, the shadow spirit that had called for this fight did not appear. The audience waited two whole days, and still he did not appear.\n\n“That king spirit must have bluffed, and really is afraid to fight!”\n\n“Of course; we should have seen this coming. Split-Space King has split-space powers, after all. That must be his weakness.”\n\n“I can’t believe he lied like this. What a shameful person; he is so embarrassing.”\n\n“Maybe he’s just busy?”\n\n“What a coward.”\n\n…\n\nHan Sen was in the underground shelter’s east side, examining a corpse Xu You brought back.\n\nIt was a horned-bug that was spiky like a burdock. It was only a primitive creature, but it was special. There was a fist-sized hole in its head, and its brain was gone.\n\n“You say there are many such corpses up north? All in the same state as this?” Han Sen asked.\n\n“Yes, there are. And there are the bodies of other creatures, too.” Xu You gave him the details of their discovery.\n\nHan Sen observed the body and fell silent, having seen something like this before. He could feel a dark residue of Yaksha in the wound.\n\nYaksha must have fled north, following their encounter.\n\n“Little Han, can we bring the bodies back?” Old Huang asked.\n\nThere were many bodies in such condition, and aside from their missing brains, they were perfectly fine. Some of them were mutant, too; they’d be a good way for the people in his shelter to level up.\n\n“Let me go there and scope the place out first. If it is safe, then you can bring them back.” Han Sen was worried Yaksha was still in the area, so he fancied checking it out alone.\n\nHan Sen saw many dead bodies as he ventured north through Thorn Forest. He masked his presence and went forward with care.\n\nAfter fifty miles of travel, he was still seeing many dead bodies. It didn’t seem as if Yaksha had returned.\n\nHan Sen brought a few of the bodies back with him when he returned. He then commanded the others to go and collect the rest, deeming the region safe for the time being. He wanted to avoid letting the meat go bad.\n\nHan Sen was a little worried. He didn’t know what Yaksha’s ultimate goal was, what he was doing, where he was going, or anything else. If Han Sen bumped into him before he could move the shelter, things would go terribly awry for not just him, but for the people that were now in his care.\n\nHan Sen went to see Bao’er, and left the shelter again with her in tow. He followed the bodies, wanting to locate Yaksha, if he could.\n\nAs he moved deeper through the forest, the number of bodies lessened. Still, there were enough to track him.\n\nYaksha was obviously uninterested in hiding himself, so this meant it’d be easy for Han Sen to track him down.\n\nBut Han Sen made sure to exercise great caution on his trek, and his carefulness increased the deeper he ventured.\n\nHe masked his and Bao’er’s presences as well as he could.\n\nThorn Forest was a wild and unpredictable place. Han Sen had seen many crazy things in his time there, so he knew he could never be too careful.\n\nSuddenly, Han Sen’s eyes opened wide. Along the thorny vines that wove between the trees, many corpses had been strung up.\n\nUpon closer examination, the corpses were all dried like husks. It was a sinister scene.\n\nAnd the most shocking thing for Han Sen was their human-like appearance. They weren’t random creatures; they were humans with wings. These dried-up angelic beings had wings of varying colors: black, white, and grey. The feathers had mostly fallen from their wings, revealing the skeleton beneath what was once undoubtedly a most beautiful plumage.\n\nThe bodies of these angels hung from the vines, and in their chests, protruding from where their hearts should have been, were red spikes.\n\nThirteen angels had been pinned there, in total. When they had died, he could not tell. They no longer looked pretty and holy; the sight of them gave Han Sen chills.\n\nHe noticed the bodies of these angels had no eyes, either. Their sockets were dark and empty.\n\nHan Sen used his dongxuan aura to scan the area, and that was when he felt Yaksha’s presence. He had been here, and he had examined the bodies of these angels, as well."
}