{
    "chapter": 2341,
    "title": "The Secret of Kingese",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2341",
    "text": "“Brother, don’t do this! I only wanted to collect two Kingese. No, actually. Just one would have been fine. Can we stick to doing just that?” Han Sen felt his delicate nerves couldn’t endure this torture anymore.\n\nThis was testing the very functioning of his heart.\n\nFortunately, he didn’t have any sort of heart disease. If he had, he was certain that this would have given him a heart attack.\n\nA huge swathe of Kingese symbols were falling from the tree. It was hard to describe. They were like a shower of gold stars falling down. It was like there was a bunch of gold tadpoles rushing towards Han Sen.\n\nHan Sen’s right eye shone. The four pupils of the Purple-Eye Butterfly were spinning as they looked at the Kingese in the sky.\n\nThis wasn’t normal. Han Sen couldn’t imagine that the king tree did this regularly. There were so many Kingese symbols, and if they all went into his body, he thought he might explode.\n\nIt didn’t matter how good an abalone tasted, you would still die if you ate too much. With so many Kingese symbols falling from the tree, it wouldn’t be just his stomach rupturing. His whole body was sure to blow up.\n\nUnder the gaze of the Purple-Eye Butterfly, Han Sen could see that each Kingese symbol was comprised of a mysterious substance chain. It was a form of energy.\n\nEach Kingese had one element of energy which made up their substance chain. There was nothing wrong with the Kingese symbols themselves.\n\nSuddenly, Han Sen froze. He noticed something abnormal that made his heart almost stop.\n\nAside from the first word Ji, the other Kingese were falling down like bees. But even so, there were faster and slower ones.\n\nJudging from the way they were coming down, it was going to start with Ji. Then, Han Sen saw something unbelievable occur.\n\n“Stor… story… of… gene…” Han Sen read the Kingese that fell. The first four words, in their order, could be read as “the story of gene.”\n\n“Is that just a coincidence?” Han Sen didn’t think a coincidence like this was possible.\n\nThere were many things in that world that looked like coincidences, but this coincidence was actually a connection. But most people didn’t have enough information to connect the seemingly random occurrences into a pattern.\n\nHan Sen wanted to keep watching, but it was too late. The Ji word that landed on his forehead was blending into him.\n\nA solid presence entered Han Sen’s body. It was like the anger inside of Han Sen was all removed. It was as if he had been condensing for one million years and now looked really solid.\n\nPat! Pat! Pat!\n\nAll those Kingese symbols went into Han Sen’s body. And because there were too many in the rush, some were unable to get into him via his forehead. They had to shoot straight into his body.\n\nThe Kingese symbols were like a meteor shower, and they shot straight into Han Sen. His presence kept changing because the Kingese kept entering.\n\nAs Han Sen was buried beneath the blazing symbols, the rest of the world was silent. Everyone stared stiffly at Han Sen, who was residing beneath the king tree. They could see all those Kingese lights rushing to enter his body.\n\nBecause it happened so fast, many people were caught mid-laugh. They couldn’t remove their smiles, and they just stood frozen. They looked very weird.\n\nMiss Mirror was perfectly still. Her poise and elegance had been wholly extinguished. Her red lips were wide open. She looked so strange, and she could not speak.\n\nShe had managed Spring Rain for many years. She had done so many things for King Bai that had to be performed covertly. That meant Spring Rain might have been an assassination squad or a pirate organization, depending on how it was viewed.\n\nMiss Mirror had seen many strange things over the years, but this gave her a big shock. It made her lose her composure.\n\nNo one had seen the Kingese fall like this in all the time since the Extreme King had first discovered the king tree.\n\nIn the time since their society began, the Extreme King had seventy kings and countless talented children. The prince that had received the most Kingese in the past managed to obtain one hundred. No one else had ever received more than that.\n\nBut comparing that prince to Bai Yi, that man meant nothing. There were so many Kingese falling from the tree. It was like a river bursting its banks. It was difficult to count. There were tens of thousands.\n\nThe King’s Garden looked dead. Everything was lit by the glow of the Kingese hitting Han Sen.\n\nHan Sen was shocked. When all those Kingese symbols hit his body, The Story of Genes ran like mad.\n\nOriginally, The Story of Genes was like a sports car with an empty tank, but when the Kingese entered his body, The Story of Genes reacted like it had been injected with high-octane gas. The engine was firing on all cylinders, making some scary, mechanical noises. It surged forward at full speed.\n\nEven the Ghost Bone Power inside Han Sen’s body had been crushed and refined. It kept pushing The Story of Genes forward.\n\nThe progress of The Story of Genes had previously been so slow, but now, it was welling up at mind-boggling speed. It kept breaking through, heading to the furthest point of a Duke.\n\n“If this is related to The Story of Genes, what the f*ck is happening?” Han Sen was as shocked as he was happy.\n\nHe was pleased that The Story of Genes was reaching Duke class, even if he was uncertain how it was progressing so quickly. It was all happening inside his body, and ordinary folk wouldn’t be able to see that. But there were too many elites in the Extreme King. He couldn’t be certain that no one else would witness the changes occurring in his body.\n\nHan Sen tried his best to stop The Story of Genes from being cast. He wanted to suppress The Story of Genes and keep it Marquise. Then, he could level up to Duke when there was no one else around.\n\nBut it was pointless to even try. As the Kingese kept running into him, The Story of Genes couldn’t be stopped. They kept diving into him like sports cars losing control on the highway.\n\n“F*ck you! If you can’t stop, then push it!” Han Sen decided. He gritted his teeth and cast The Story of Genes. It was sending him to the far reaches of Duke class.\n\nThe Kingese were so strong. If Han Sen didn’t spend the power that the Kingese were giving him to level up The Story of Genes, the power would blow up his body.\n\nThere was no turning back now. The kingese had to push The Story of Genes as far as it could go. And it did indeed become Duke class.\n\nSpell’s power suddenly had an element. Han Sen thought this would invoke changes in his body and draw attention.\n\nBut Han Sen realized that he need not have worried. Because the Kingese were still inside his body, continuing to change him like a mountain, a sea, a fire, a dragon, an overbearing thing, and like hell itself. Everything in that world appeared upon Han Sen at once.\n\nWhen those changes became so complicated, the element that turned him into a Duke underwent a change, too. It wasn’t obvious, though. It was hard to see."
}