{
    "chapter": 2430,
    "title": "Taking the Sword",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2430",
    "text": "“If we can grab that sword, maybe we can use it to widen the tree hole and retrieve the requiem tree egg,” Night Wind said, his eyes bright with anticipation.\n\n“That might actually work. Maybe someone or something wants us to go back and retrieve that sword,” Han Sen said.\n\nThe entire scenario seemed a little too convenient, though. They had chosen to leave the sword behind on the road, despite what the pictures on the screen seemed to indicate. Now, they had been presented with a tantalizing prize that would force them to return and retrieve the sword after all. They seemed to be drifting slowly closer to the reality that the screen had predicted.\n\n“I am willing to give it a try. I will go find the sword again and bring it back,” Night Wind said to Miss Mirror.\n\n“Go, but be careful,” Miss Mirror said, her voice distracted and distant.\n\n“Yes, I will get it done.” Night Wind bowed, turned around, and walked away.\n\nAfter taking a few steps, Night Wind stopped. He looked at the Duke. He thought for a moment and then said to Miss Mirror, “My Lady, this guy isn’t going to make it. Why don’t I put him out of his misery now?”\n\nHan Sen knew what the man meant. Night Wind was obviously still scared about the prophetic pictures they had seen on the screen. If he got rid of the Duke, however, there’d be one less faceless man. That would mean the prophecy could be proven wrong, and it was nothing more than an illusion.\n\nMiss Mirror nodded. Night Wind picked up the Duke and left.\n\n“Is it wise to let him go?” Han Sen asked, looking at Miss Mirror.\n\nHan Sen thought that Miss Mirror and Night Wind knew more than they were saying, but Miss Mirror hadn’t tried to stop Night Wind from leaving. That confused Han Sen.\n\nMiss Mirror didn’t move, and her voice was chilly. “You think he would stay if I forbade him from going?”\n\n“You mean, Night Wind will betray us for the requiem tree egg?” Han Sen now understood what Miss Mirror was getting at. If she stopped Night Wind from getting the sword, and Night Wind wanted the requiem tree egg badly enough, what happened in the picture might actually come to pass.\n\n“I don’t know for certain if Night Wind will betray us, but when something as valuable as this egg lies in the balance, loyalties can be tested. The requiem tree egg is a treasure that is far too tempting, and there would be few consequences for breaking the rules right now. I have to be careful.” Miss Mirror ended with a sigh.\n\n“From what you know of Night Wind, if he really brings back the sword and claims the requiem tree egg, do you think he’d go the extra mile and do… something else?” Han Sen asked.\n\n“I honestly don’t know.” Miss Mirror shook her head, and then she said, “So, we just need to be prepared. I hope that Night Wind doesn’t decide to betray us, but if he does, we need a contingency in place that can keep us breathing. I’m no longer what I once was, remember. I am only King class. If we fight, I cannot hope to beat Night Wind. Our only chance of surviving is if you and I work together.”\n\n“Even if you and I work together, fighting a deified elite won’t be easy.” Han Sen shook his head.\n\nMiss Mirror brushed her fingers across her bangs, smiled, and said, “Even if ten ordinary Kings allied together, their collective power might not be enough to defeat Night Wind. But you and I are different. If we work together, even if we cannot beat him, we should be able to keep ourselves alive.”\n\n“I am with you, of course, my Lady.” Han Sen smiled.\n\n“Although I have become King class, I still have the mind of a deified. And I understand Night Wind’s power. I know all about Night Wind. I will just need you to do as I say. If he really tries to do something rash, we’ll hold him back long enough that we can escape.” Miss Mirror said.\n\n“I will listen to you, my Lady,” Han Sen answered quickly, but he had a different plan in mind.\n\nThings had become complicated. The three of them each had their own plan. Although they all had individual goals, they knew that surviving in such a place would be difficult. But none of them could resist the temptation of the requiem tree egg.\n\nAlthough Miss Mirror hadn’t said anything about it, she obviously had her own thoughts about the requiem tree egg. She just hadn’t been obvious about it like Night Wind.\n\nBoth of them went silent. Han Sen thought it wasn’t a good idea to let the uncomfortable silence grow, so he started talking. “Do you think Night Wind can safely retrieve that big sword?”\n\n“I don’t know.” Miss Mirror paused. “It definitely seems like something is orchestrating this situation, trying to drive us to fight for the requiem tree egg. Since this entity obviously seems to require the big sword, common sense should tell you that the sword is dangerous. But Night Wind went to retrieve it anyway, and he isn’t stupid. Since he insisted on going, he might have an ulterior motive. Maybe…”\n\nMiss Mirror didn’t finish her thought, but the look on her face suggested that she was worried.\n\nHan Sen picked up where Miss Mirror had left off, and he said, “Maybe he isn’t concerned about the future that the screen seemed to foretell?”\n\nMiss Mirror didn’t respond. It was like a silent agreement.\n\nHan Sen went on to say, “If the prophecy is false, then Night Wind is fine with that. If the prophecy is true, then the person wielding the sword should be fine anyway. After all, whoever takes the sword in the prophecy will be the one who claims the egg and survives. The odds for survival are swinging wildly in Night Wind’s favor, with how things currently stand. You and I cannot take him down if things go badly.”\n\nMiss Mirror nodded. She agreed.\n\n“But there is one thing I don’t understand. How can Night Wind be sure that nothing will kill him when he grabs the sword?” Han Sen asked Miss Mirror.\n\nHan Sen wasn’t familiar with Night Wind, so he couldn’t guess the answer with any confidence.\n\n“Do not underestimate any deified being. Night Wind isn’t the most powerful deified, but the simple fact that he reached the deified level still means a lot. Do not be misled by his apparent loyalty and service to me. It can put you on a slippery slope to a painful demise,” Miss Mirror said, her voice hard.\n\nHan Sen shrugged. He did not say anything more. He looked back along the path behind them, hoping to see something.\n\nNight Wind should have already returned with the sword by now. If some sort of trap had been laid on or around the sword, he should have already triggered it.\n\nBut the ruined city was still deathly quiet. There wasn’t a single sound. They had no way of knowing if Night Wind had removed the sword or not yet.\n\nWhile Han Sen was thinking, a shadow appeared far down the path. It looked like Night Wind’s.\n\nIndeed, when the figure drew closer, Han Sen could see that it was Night Wind returning. He had a big sword slung over his shoulder, which looked just like the one they had seen before.\n\nBut contrary to their expectations, the sword was only one meter long. The tip was flat as if it had been snapped off. The sword was broken.\n\nThat surprised Miss Mirror and Han Sen both, and they swapped curious glances with each other."
}