{
    "chapter": 2382,
    "title": "Pride and Bones Are Made",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2382",
    "text": "The rocky surface of the mountain trail had been replaced with a translucent substance as the trail passed into the clouds. Han Sen’s body was shrouded in the thin layers of mist. He felt as if the dimensions of space were distorting around him.\n\nThe feeling was very gentle, though. And it was brief, disappearing in a second. Han Sen’s Kingese shone. The climb to the peak was long and tiring, and the stairs wrapped back and forth up the mountain like a massive centipede.\n\nHan Sen saw Prince Four and Princess Two trying to fight their way up the stairs. They kept running on the same few steps, not going any higher.\n\nHan Sen ran toward the peak, and he ascended with no problem. He followed the stone steps that led up to the peak. Prince Four and Princess Two were still scrambling crazily against the stairs, like a hamster on its wheel.\n\n“It looks the Kingese have kept me from being trapped by this weird dimension.” Han Sen wasn’t in the mood to watch the deified royal children flail, so he focused his efforts on heading for the peak.\n\nThe mountaintop was very wide, and it had to be as large as a soccer pitch. Most of the area was flat, too. One spot stood out on the mountaintop, however. There was a small knoll atop the peak.\n\nThat knoll was no more than a hundred meters tall. It looked as sharp as a sword, and it pointed into the sky. Five words were carved deep into its side. They said, “Pride and bones are made.”\n\nLooking at those five words gave people goosebumps. It was like there were a thousand sword airs there, and they’d rip you to pieces in less than a second.\n\n“A powerful sword mind!” Han Sen lurched in surprise when he read the five words.\n\nHan Sen’s sword skills weren’t bad. Although he didn’t focus much on practicing with a blade, his sword mind was almost as good as a deified elite’s.\n\nBut before those five words, Han Sen’s sword mind was crushed. He couldn’t bring himself back to his senses. It was like he was shaking. Some suppressive force seemed to press down on him from above.\n\n“I’m afraid that anyone who could carve those five words must have been incredibly skilled with the sword. This would have required an unbelievable level of talent. Who left those five words? There have been many great swordsmen scattered across the Extreme King’s history, and many of the Extreme King’s rulers were swordsmen. Even many commoners of the Extreme King are deified swordsmen. It’s impossible to guess who might have done something like this.” Han Sen paused before going on to think, “But I’m afraid that in order to possess a sword mind like this, a swordsman must have surpassed the deified level. It has to be from one of the most famous swordsman kings. But I don’t know them, so I don’t know which king left behind this swordmind.”\n\nHan Sen looked away from the text and glanced around the mountaintop. Aside from the knoll, there was nothing else on the peak.\n\n“Bai Ling Shuang’s mentioned that there was something to be gained by reaching this peak. Was she referring to this knoll and its carving? But if so, what could the benefit actually be? Is this entire knoll a treasure in itself? It doesn’t look like it. The reward Bai Ling Shuang mentioned must have been the swordmind itself.” Han Sen again read the five words, “pride and bones are made.”\n\nThe swordmind was very powerful. Just looking at it was frightening. The sight of it would make a normal person feel sick. Comparing a normal swordmind to this monstrosity was like comparing a stone and a moon. They were two completely different things.\n\nEven with Han Sen’s tough will, he was having trouble keeping his emotions in check before that swordmind.\n\nBut his swordmind was very tough, and he wouldn’t be shaken easily. He stood there and watched the five words intently.\n\nFor some reason, though, Han Sen felt like he was trying to scratch an itch that he couldn’t quite reach. He couldn’t grasp the real meaning of the swordmind.\n\nAs Han Sen stared at the knoll, he heard a flurry of footsteps come up the staircase behind him. He glanced back and saw Prince Four running up the steps.\n\nPrince Four, seeing that Han Sen was already at the peak, frowned and said nothing.\n\n“Greetings, Prince Four.” Han Sen bowed.\n\nPrince Four glared at him and remained silent. He headed toward the knoll. When he reached the five words, he focused on them and began to ignore Han Sen completely.\n\nHan Sen scratched his nose. If someone wanted to ignore him, he wasn’t going to push himself on them.\n\nPrince Four just stood there, perfectly still, until Princess Two arrived. When she saw Han Sen and Prince Four already there, she looked fairly upset.\n\nShe didn’t mind that Prince Four had been faster than her, but Han Sen had also reached the top much more quickly than she had. This made her sad.\n\nBut she was deified, after all. Her sadness quickly faded. Princess Two walked over to the knoll and turned her attention to the five words, just like Prince Four had. She also ignored Han Sen.\n\nThe two deified children reached out with their senses to feel the swordmind. When Han Sen detected their attempts, it confirmed that the benefit of the mountaintop had to lie in these five words. And ultimately, that disappointed him.\n\nThat swordmind was very powerful, but Han Sen did not focus on swords as his primary form of attack. If Six Paths Emperor had been there, perhaps he would have appreciated this boon far more. Han Sen stayed there, looking at the words for a while, but he did not learn anything.\n\nSince he was there already, Han Sen wasn’t going to give up an opportunity to gain more power. He decided to stay.\n\nAfter a while, Han Sen thought about Bai Ling Shuang. The timing seemed about right, so he headed back down the mountain.\n\nPrince Four and Princess Two saw Han Sen turn around and go back. They were confused when he left, but they ignored him. They turned their attention back to the words to learn whatever they could from the swordmind.\n\nHan Sen walked back down the translucent road. Many royal princes and princesses were walking up and up without actually making any progress. Bai Ling Shuang was similarly frozen in place. The royal children ran like headless chickens, but none of them were moving an inch forward.\n\nThe twisted dimension affected them too much, and they couldn’t find a way to proceed.\n\nBai Ling Shuang was furious. She had been struggling fruitlessly for so long. Her body was affected by the distorted dimension’s power. She couldn’t move, and she felt so very heavy. She had become enraged when Han Sen passed her by.\n\n“Bai Yi, that a**hole! If he took my items and didn’t hold up his end of the bargain, I am going to skin him alive.” Bai Ling Shuang’s body felt very heavy. She could barely move.\n\nWith every step she took, it felt like she was shouldering the weight of an entire mountain. She was sweating, and her clothes had long since become soaked.\n\nThe longer someone stayed on that translucent path, the more they would be affected by the twisted dimension.\n\n“Bai Yi, you little sh*t! I am going to kill him.” Bai Ling Shuang started to fall toward the ground. She hated him.\n\n“Sister Ten, am I too late?” An arm appeared and caught Bai Ling Shuang, stopping her from hitting the ground.\n\nBai Ling Shuang raised her head and saw Han Sen smiling at her. She bit her lip and said, “Why are you back here?”\n\n“This road was hard, and I got delayed. Let’s go up now,” Han Sen said as he helped her up."
}