{
    "chapter": 2770,
    "title": "God Bird",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2770",
    "text": "Barr was a primitive deified elite. With his full power, he could devastate a planet with a single punch. But he couldn’t resist those branches that reached out and began to wrap themselves around him. The branches tied him up like a cocoon, with only his head poking out above the leaves.\n\nBarr wasn’t the only one to be caught; even the transmutation class Elder Nader was unable to escape. He released his power in a massive surge, but under the force of the branches, his power was like snow melting under a spring sun. His attempts to protect himself dissolved into nothing, and then the branches bound him firmly.\n\nNo creature upon the plank bridge was exempted from this. They were all tied up in cocoons of various sizes, and soon they were all dangling helplessly from the bridge.\n\nAs Han Sen looked at them, he was struck by how much they looked like caterpillars. He had often found those insects hanging from the trees near his old house. They would hang from the branches, motionless unless a wind caught them and waved them back and forth. The sight before him was eerily similar.\n\nHan Sen kept observing the captured creatures, falling back as he did. Even Elder Nader had been unable to resist the ensnaring branches. Han Sen didn’t think he was much stronger than Elder Nader. If he got close, he might end up suffering the same fate. He didn’t want to end up snared by the branches, too.\n\nDragon One and Bao Lian seemed to share his opinion. They all made sure to retreat with haste.\n\nThe squawking of a bird sounded clearly throughout the sky. Within a second, Han Sen felt a very frightening presence descending on the strange realm. It rushed down from the sky in a blur, moving too quickly for them to react. It was like watching a plane crash. Although the bird itself remained in the sky, the weight of the bird’s aura hit the ground, instantly crushing anything on the surface.\n\nHan Sen found that his body had been slammed down into the dirt, and he couldn’t get up. The scary pressure was slowly pushing him into the ground like it was made of quicksand. His face had almost been crushed. He couldn’t get out.\n\nHan Sen’s face was on its side, trying to discern where the sound of that bird came from. Far away, up in the sky, he saw a large bird burning with a white flame. It was soaring through the air, and the very scary pressure came from its body.\n\nHan Sen couldn’t be certain what kind of bird it was. It looked elegant, proud, gorgeous, majestic; it was like a god from the sky. It was like the legends that described the god phoenix. But Han Sen had never seen a real phoenix before, so he couldn’t be sure if he was seeing one now.\n\nThe big bird was soaring casually over the mountain. Wherever it went, the landscape beneath it came back to life. Every tree, bush, and blade of grass was brimming with lifeforce once more.\n\nThe big bird flew in slow circles, and it seemed like the whole world was following it, hoping to be given a lifeforce again. The green trees were repopulated with leaves. Flowers were popping up out of the ground. Wherever the bird went, new life followed behind. The deserted wasteland was turning into a tropical paradise.\n\n“A phoenix… It really is a phoenix…” Bao Lian was lying on the ground next to Han Sen. He stared up blankly, seemingly at a loss for how to react.\n\n“I’ve been so unlucky recently. I entered an undeveloped xenogeneic space and found a true god class xenogeneic phoenix. The chances of that are lower than winning the lottery,” Han Sen grumbled in his heart.\n\nFortunately, the phoenix wasn’t flying toward them. It flew to the plank bridging the Two Ape Mountain. It glided slowly forward on its huge wings until it reached the bridge.\n\nAfter circling the bridge three times, the phoenix with its white flames descended onto the wood. The fire on its body didn’t harm the wood. It actually seemed to be forcing more lifeforce into the plank, and it made the branches grow even faster.\n\nThe phoenix then lowered its head to look at the creature nearest to it. The creature looked like a golem from what Han Sen could see through the cocoon of branches. Only the golem’s head was clearly visible.\n\n“Answer a question for me. If the answer satisfies me, then I will forgive you for offending me.” The phoenix didn’t physically speak, but everyone who could see the phoenix could hear its voice in their minds.\n\n“I will answer any question you would like me to. What do you want to know?” the golem-like creature said.\n\n“One day, you and your partner encounter danger. One of you has to die for the other to be saved, and you have the power to decide… Do you choose to die for your partner to be saved? Or would you prefer that your partner perish so that you could live?”\n\nThe voice of the phoenix rumbled, shaking their minds as it spoke.\n\nEveryone was shocked. They had expected the deity to ask about some ancient secret. They never expected a question like this.\n\nAnd it didn’t seem like the question had a single correct answer. Different people would respond in different ways.\n\nBut since the phoenix had already asked, the golem couldn’t refuse to answer. It swallowed and replied, “I would sacrifice myself to save my partner so that she could live.”\n\n“Hypocrite.” The phoenix’s voice played in everyone’s head. It sounded disdainful.\n\nThe next second, Han Sen and the others watched the phoenix lower its head. It opened its beak in the golem’s direction.\n\nBut the phoenix didn’t bite down. Rather, it made a sucking motion, as if it was drawing in a breath. A weird power came out of the golem’s body and vanished into the phoenix’s mouth.\n\nAfter that strange power was taken away, the golem’s head looked like a dried-up husk. Then, the entire creature turned into sand and scattered across the wind. No trace of the being was left to see.\n\nEveryone stared at the place where the golem had been in silence. Although the golem was just a King class creature, its power had been drained until it was nothing more than dust. It was a bit too scary to fully comprehend.\n\nThe phoenix didn’t seem to think that what it had done was a big deal. Ignoring the sand that was still leaking from the now-empty cocoon, the phoenix moved to the next cocooned creature like it was walking down the aisle in a grocery store.\n\nThis creature’s head looked like it belonged to an octopus or squid. Han Sen recognized this one. This being had been following Elder Nader, so it had to be one of Elder Nader’s students.\n\nThat creature turned pale when the phoenix looked at him. And then, he heard the phoenix’s voice sound again. Once more, it was in everyone’s head. “One day, you and your partner encounter danger. One of you has to die for the other to be saved, and you have the power to decide. Do you choose to die for your partner to be saved? Or would you prefer that your partner perish so that you could live?”\n\nThat creature was terrified, but it noticed that the question was exactly the same as before. He was so happy.\n\nThe golem had already given one answer, and that answer was wrong. So, the squid creature assumed that the other answer must be correct.\n\nThinking of that, the creature hastily shouted, “I would choose to save myself!”\n\n“Obscene.” Before the creature could explain why he had chosen to save himself at his partner’s expense, the phoenix’s angry voice rumbled in everyone’s heads.\n\nThe phoenix lowered its head and drew in a breath. The creature’s power was ripped out of it, and the body turned into dust. The wind carried it away.\n\nA chill sank into the hearts of all the onlookers, and goosebumps flared all over their skin. They thought that giving a different answer to the question would allow them to live. But now, it seemed as if the question posed by the phoenix had no correct answer. It all depended on the phoenix’s mood."
}