{
    "chapter": 1950,
    "title": "Consume Skill",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1950",
    "text": "“Han Sen! I’ve brought harm down on you. I cannot believe the Buddha had an ulterior motive for inviting me there.” Back on the ship, Yisha placed the ant down on the table and sighed.\n\nHan Sen wished to speak, but he could not. He had become an ant, and he could no longer use any geno arts. He really was like a normal ant.\n\nHan Sen was not frightened by his new state, though. He started skittering across the table, writing something out by the way he was moving. “The few items I had were stolen by Burning Lamp. He took my deified Knife Blank.”\n\nWhen Yisha saw Han Sen writing this out, she looked overjoyed. She said, “You still have a will of your own?”\n\n“I am aware, yes. What’s wrong?” Han Sen wrote.\n\n“Burning Lamp’s geno art can change the genes of a being. He can turn a member of the higher races into a primal creature. Even their brains are reduced to the level of an animal. He didn’t kill you because turning into an ant is a worse fate. It would make you feel hopeless. There is no way he’d go easy on you, though, so it is strange to see that you still possess your own will. Are you sure you are okay?”\n\nHan Sen considered his body. Aside from being an ant, and being unable to use geno arts with a human body, he had not been affected.\n\nHan Sen explained the situation to her and asked, “How do we break the spell of this geno art, so I can have my proper body back?”\n\nYisha’s expression looked sickened, and she said, “You can’t. You really are an ant now. Unless there is a deified elite with the same talent, you are stuck like this.”\n\nThere must be another deified elite with his geno art around. What about Kong Fei?” Han Sen asked. He didn’t want to be stuck as an ant.\n\nYisha gave a wry smile, and she said, “Every deified elite has a skill of their own. Kong Fei is strong, yes, but he is not talented with loop geno arts. He cannot help you get your body back.”\n\nAfter a while, Yisha spoke again. She said, “From what I know, there is a deified elite that can do this, but I don’t know where he is. Even if I wanted to ask him, I wouldn’t know where to find him.”\n\nHan Sen gave a wry smile, but he wasn’t going to give up. He said, “Don’t worry, my Queen. If this is just a geno art, then there is surely a way it can be broken. I will be fine, sooner or later.”\n\nYisha shook her head and said, “If I become deified, I will destroy that Buddha Kingdom.”\n\n“Yes, destroy it!” Han Sen was so angry.\n\nIt was the Buddha that commanded Seven Spirit to kill Han Sen, and they almost succeeded. But now they had been bold enough to do this. The Buddha were clearly impossible to reason with.\n\n“I need power. That’s my focus now, and I need that power if I am to level the Buddha Kingdom,” Han Sen thought. He was furious over what had happened.\n\nThe news about Han Sen being turned into an ant by Burning Lamp had traveled to every corner of the universe. Many of them felt sorry for what had occurred, whereas others mocked him. Most people were just curious, though. They didn’t care what he did next.\n\nHan Sen obviously had no future now that he had been turned into an ant. He had a body that belonged to one of the most primal creatures, so his intelligence would be extremely low. It was unlikely he could practice anything. He wouldn’t even be able to generate a geno armor.\n\nBut Han Sen had been able to kill Seven Spirit. It was a shame that someone of such strength had met such an ignoble end.\n\nHan Sen rested on board the ship. Little Invisible and Ghost Teeth Knife were next to him. Yisha had retrieved them for him.\n\nHan Sen had felt something was wrong just before Burning Lamp struck him. He had tossed Little Invisible and Ghost Teeth Knife to Yisha, but the moment he threw them, Burning Lamp had snatched him off the ground. He couldn’t give his other items to her, and so Burning Lamp had taken them all.\n\nHe hadn’t minded losing most of his things, but the half-deified Knife Blank was a wonderful item. He felt very bitter over that being lost.\n\nHan Sen tried to use his powers while he was an ant. The Dongxuan Sutra, the Blood-Pulse Sutra, and Jadeskin had become completely useless for him. They were geno arts purposed for the human body. They did not work while he was an ant.\n\nBut when he ran The Story of Genes, it ran as smoothly as always. Because it functioned without a hitch, there was nothing to impede his continued study of the geno art. He could even make use of Spell.\n\nHan Sen felt very relieved when he discovered this. If he was able to use some of his power, then he could be fixed. There was hope.\n\nHan Sen wanted to try using his super god spirit mode to escape the ant form, but Yisha was on the ship, and she would surely notice if he used it. Even if he successfully turned back into a human, it would be a poor situation.\n\nHan Sen remained patient, and he followed Yisha back to Narrow Moon. Yisha did not take him back to Planet Eclipse. He was put in the palace on Planet Blade.\n\nHan Sen requested to go back to Planet Eclipse, but he wasn’t permitted. So, he performed his The Story of Genes in front of Yisha and summoned Spell.\n\nYisha saw it, and she was shocked. “It looks like you haven’t turned into a primitive creature at all. Maybe it is because of this The Story of Genes. This strange geno art is special. It can even disrupt deified powers. If you make it up to King-class, I cannot begin to imagine what it might do.”\n\n“My Queen, do you see? I have turned into an ant, but I still have the powers of a Viscount. You should send me to Planet Eclipse, because I have stuff to do there.” Han Sen was now using Spell to communicate with Yisha.\n\n“Okay, and I will focus on finding you a way to get your body back.” Yisha seemed to have a thought, and she began searching through her records. She returned with a geno art. “You’ve turned into an ant, so you cannot make use of most geno arts. This skill, called Consume, is a geno art that belonged to a Consuming Ant. They are an old higher race, so perhaps it can help you in the time being.”\n\nHan Sen did not know why Yisha had given him the skill of Consume to learn. But it did suggest that she feared for Han Sen’s possible recovery. If he practiced as an ant, there might be hope. It wouldn’t be over.\n\nHan Sen let Spell accept Consume, and then he went to Planet Eclipse. He wanted to find out if super god spirit could turn him back into a human.\n\nSuper god spirit gave him a certain amount of immunity to certain types of attacks, so it should have worked."
}