{
    "chapter": 2459,
    "title": "The Possibility of Killing a God",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2459",
    "text": "The woman quirked her lips into a smile. Running her hand through her hair, she said, “Becoming Super Gene means killing these guys who call themselves God.”\n\n“Why are you trying to do that?” Han Sen was shocked. He knew how scary those beings were. But luckily, they couldn’t directly attack the beings of the universe. Their powers were much stronger than any creature within the geno universe. Not even deified beings could be compared to them.\n\nThe woman and Sacred Leader had wanted to kill these self-proclaimed gods. And Han Sen shared their insane desire. He just wasn’t strong enough right now, so he didn’t know how he would eventually bring the gods down.\n\nBecause of this, Han Sen had no plans to kill a god just yet. When he had been inside Destiny’s Tower of the Extreme King, he had only seen the statue of a god. If the black crystal armor hadn’t helped him, he would have been incapable of defeating the thing.\n\nHe couldn’t imagine how scary things might have been if he faced a real god.\n\n“I don’t know why Sacred Leader was pursuing this goal, but I know I had my reasons,” the woman obviously, obviously not wanting to share her actual reason.\n\n“Having a Super Gene can allow a person to kill those gods?” Han Sen asked.\n\n“According to my research, yes. That is correct.” The woman nodded, speaking with certainty.\n\nBut then the woman shook her head, smiling wryly. “But our research still failed. We discovered a method that could turn a body into a Super Gene, but there was no creature in this universe that could use this method. It was like we were holding a candle, and we knew we could light it, but we didn’t have a single match to do so. We were so close to dispelling the darkness, but we couldn’t. That was the difficulty we faced. The thing that we lacked to complete The Story of Genes seemed like an insurmountable barrier. It made all of our efforts seem fairly pointless.”\n\n“Is The Story of Genes that difficult to practice? There really wasn’t anyone across the entire universe who could use it?” Han Sen asked in confusion. After all, he had already learned The Story of Genes.\n\nThe woman thought for a moment, then said, “This problem is very complicated, and explaining it fully would take some time. Let me use an analogy instead. A horse needs to eat plants for energy, so it can stay alive and run. However, a car requires fuel in order to operate. You cannot give the horse fuel, and you cannot give the car grass. This description isn’t perfect, but it sort of gets across what I mean. The Story of Genes has many requirements, and there is no creature in the universe that can satisfy every one of them. You cannot lack in any department.”\n\nHan Sen pretended to understand, but he actually rather confused. He started to ask another question, but he just didn’t know how to explain what he didn’t understand.\n\n“Who are those people that call themselves Gods? Why can only those with a Super Gene kill them?” Han Sen returned the conversation to the initial question.\n\n“That question is also complicated. To put it simply, these gods are creatures, but they exist in a different way than we do. It’s like the difference between corporeal life forms and spirits. But the reality is more complicated, especially when one tries to understand how they interact with our universe.” The woman paused, and then she went on to say, “And you asked why those with a Super Gene can kill those who claim to be gods? It all began with a test conducted by the Sacred Leader.”\n\n“What test?” Han Sen asked.\n\nThe woman didn’t answer Han Sen. She stood up and said, “Okay, the garden’s clean now. Don’t you dare make this place dirty again! If you do, I’ll turn you into a pig.”\n\nHan Sen still hung in the air, not daring to touch the ground. He was worried she really would do what she claimed. Considering the woman’s power, she probably had a stronger gene-altering skill than Burning Lamp Alpha did.\n\n“You still haven’t told me what sort of test the Sacred Leader conducted,” Han Sen said to the woman as he hovered in the air.\n\nThe woman turned around and looked at Han Sen. “Why do I have to tell you?”\n\nHan Sen didn’t know how to respond. She had no connection to him, and she didn’t owe him anything. There really was no reason for her to tell him.\n\nPang!\n\nWhile Han Sen’s mind raced for an answer, the woman returned to the house and slammed the door.\n\n“Should I tell this woman I have practiced The Story of Genes? If I tell her, I might learn more secrets from her. But she also might catch me and use me as some sort of lab rat. That would be bad.” Han Sen found it to be quite the dilemma, and he was torn on what to do.\n\nThe woman had said Han Sen wasn’t allowed to touch her stuff. Han Sen didn’t want to upset her cleanliness and OCD, so he flew over the fence and landed on the ground outside. He sat there, looking up at the yellow clouds. He pulled out the Wanjie Rubix Cube and sent a video to the Treasure Identifier Elder.\n\nWhen the Treasure Identifier Elder had played Han Sen last video, it had drawn the focus of all the other races.\n\nThat light-yellow clouds became the focus of many elites. When this new video came out, many factions were able to confirm Han Sen’s location based on the changes in the cloud patterns.\n\nBut because the demon spirit was probably close by, no one dared to go.\n\nThe Extreme King wasn’t very concerned about it, though. Bao Qin had retreated after he was injured, but the Extreme King had hurriedly sent out more deified elites to prowl through the Tianxia System.\n\nHan Sen sat on the island for hours, trying to decide whether or not he should tell the woman that he had practiced The Story of Genes.\n\nSuddenly, the sea of clouds rumbled. Many giant cloud dragons came roaring out of the veil, pulling the Sea Demon Car to the island.\n\n“The demon spirit is here!” Han Sen was shocked, and he hastily decided to run.\n\nThe woman hadn’t killed him, but that didn’t mean that the demon spirit would spare him.\n\n“You come in,” said the woman. He looked up to see her head poking out a window.\n\nHan Sen answered by running into the garden.\n\n“Feet.” The woman frowned.\n\nHan Sen quickly jumped into the air. He flew through the garden, then floated into the house, being careful not to touch anything. He hung in the center of the building, as far away from all of the house’s contents as he could get.\n\n“Don’t say anything, and don’t make a noise,” the woman advised him with a frown.\n\nHan Sen nodded but made no further answer.\n\n“Good boy.” The woman smiled, pleased with Han Sen’s performance.\n\nJust like the previous two times that Han Sen had seen, the demon spirit stood outside the fence and stared up at the window. The woman ignored him for half the day, becoming grumpier with every second that passed. In the end, she couldn’t help but open the window and shout at him.\n\nWhen the woman grew tired of yelling and subsided into silence, the demon spirit left. It was as if he had come there just so the woman could shout at him. Whatever was going on between the two of them, they obviously had a lot of history.\n\nHan Sen was curious about the relationship between the woman and the demon spirit, but he knew it would be best not to ask the woman just yet. He could see the anger and scorn still etched deeply into her face.\n\n“Do you want to know who that is?” the woman asked. She turned around, her intense eyes landing on Han Sen like physical weights.\n\n“No.” Han Sen shook his head without thinking. He felt fear when she asked him, and he knew nothing good would come from that particular answer.\n\nThe woman was shocked, but she laughed. She narrowed her eyes slightly as she examined Han Sen. “Do you want to know what sort of test Sacred Leader conducted?”"
}