{
    "chapter": 2726,
    "title": "Real and Fake Bodies",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2726",
    "text": "Shale’s punch struck the Six-Eared Macaque solidly and sent the creature’s body soaring through the sky.\n\n“He hit the real body?” Han Sen instantly refocused on the fight. The Six-Eared Macaque had managed to escape using its fake body this time. Shale’s blow had landed on the real monkey.\n\nShale chased after the flying monkey like he was part of its shadow. His punches were like a river, bursting its banks to flood over the Six-Eared Macaque. The creature’s body started to crack, and deified blood poured everywhere.\n\nNo matter how many movement skills it used or fake bodies it summoned, the creature continued to lose ground. It no longer had the power to battle Shale’s mighty fists.\n\nUnder the continuous stream of hits, the powerful Six-Eared Macaque was badly injured. It squealed as many fissures and wounds appeared across its body. But the Six-Eared Macaque’s body was so strong, and as of yet, Shale hadn’t managed to inflict any serious injuries. Only its skin was being injured.\n\n“Ha!” Shale suddenly stopped attacking. He wanted to give the Six-Eared Macaque a chance to retreat and compose itself. Shale watched it from afar, giving it a moment to breathe. He slowly waved his fists and shouted.\n\nAfter Shale’s shout, the space around him shone with a striking power that looked like the sun. Countless gleams of that striking power flooded out of Shale. It was like a meteor shower ceaselessly raining down on the Six-Eared Macaque, and each gleam exploded on contact like a nuke.\n\nBoom!\n\nThe scary explosions almost destroyed everything. Under the never-ending attacks of that scary power, the Six-Eared Macaque’s body was unable to hold up. The creature’s godly body was slowly being torn apart.\n\nHan Sen watched the display in amazement. Shale’s punch was rather similar to his own Under the Sky knife skills. The punch Shale had just cast was summoning power that had been previously dispersed.\n\nThe attack wasn’t exactly like Under the Sky, however. It was only similar.\n\n“This is the Sea’s Return to the Stream. It is very similar to your Under the Sky knife skills. Do you think Shale performs it well?” Li Chun Qiu asked calmly.\n\n“He is very strong,” Han Sen confessed honestly. In such a short amount of time, Shale had become very proficient with such a challenging geno art. It meant he was very strong.\n\nShale had lacked knowledge and geno arts in the past, but the Very High had been kind enough to fix those flaws. The more geno arts that Shale learned, the scarier he would become. It would be just like leveling up again.\n\n“I hope you become deified soon. Don’t make Shale wait too long,” Li Chun Qiu said. Shale walked over to them, carrying the Six-Eared Macaque over his shoulder. He nodded to Han Sen and turned to leave with Li Chun Qiu.\n\nHan Sen didn’t concern himself with the two of them. He happily held the Good Fortune Spell and sighed. “It would be great if the universe had more people like Li Chun Qiu in it. I have made too many enemies here, but for some reason, I don’t need to find resources myself now. I will have an endless amount.”\n\nHan Sen was preparing to leave when he suddenly felt something wrong. His heart told him he was in danger.\n\nThe next second, Han Sen teleported away just a shadow struck the spot he had been standing a moment before.\n\nHan Sen leaned forward to get a better look at the shadow, and what he saw gave him a shock. It was a monkey that was half the size of a human in height. Its head had six ears, with each one looking like a snail. Golden fur covered the being. It looked like the Six-Eared Macaque, but it was much smaller than the first Six-Eared Macaque.\n\nEarlier, Han Sen had watched Shale defeat the Six-Eared Macaque. The man had even dragged the creature’s body away with him. And now, there was a smaller one right here. That was unexpected.\n\n“Was that prior Six-Eared Macaque a mother monkey? Did it have a baby that Shale didn’t see?” Han Sen murmured to himself, looking at the smaller Six-Eared Macaque.\n\nHan Sen couldn’t think of any other explanations for why a miniature Six-Eared Macaque had appeared before him. But the xenogeneics inside the Star Fruit had no chance of getting pregnant. Therefore, his theory didn’t make sense.\n\n“You are a mother monkey. You all are mother monkeys. This is my real body. What they took away was just one of my fake bodies,” the Six-Eared Macaque shouted shrilly at Han Sen.\n\n“Awesome. The fake body was able to trick Li Chun Qiu? It even tricked me. This Six-Eared Macaque’s fake body skill makes it invincible,” Han Sen thought in awe.\n\nThe Six-Eared Macaque looked murderous. It glared at Han Sen and said, “Earlier, with that Very High monster nearby, I had to fake my own death. But now, there is no need for me to hide. After I kill you, I can go out into Outer Sky. Even if that Very High monster realizes that the body was a fake and comes back here to get me, he won’t be able to find me.”\n\n“That idea isn’t a bad one, but I’m afraid that you’re wrong about one thing.” Han Sen laughed.\n\n“What’s that?” The Six-Eared Macaque asked, its eyes glittering at Han Sen.\n\n“I’m scarier than that Very High monster. If you quietly left earlier while you had the chance, you could have gotten away free. It is a shame you wanted to murder me instead. I’m afraid you’ll be the one who ends up dead today.” Han Sen sounded serious.\n\n“You are just a half-deified. How dare you try to bluff me!” The Six-Eared Macaque shouted furiously. It ran toward Han Sen.\n\nHan Sen’s Apollo Set shone as he threw a punch toward the Six-Eared Macaque.\n\nPang!\n\nHan Sen’s punch caught the Six-Eared Macaque’s body mid-leap and tore it in half. It was just a fake body, however. The Six-Eared Macaque’s real form was gone.\n\nPang!\n\nThe Six-Eared Macaque suddenly appeared behind Han Sen. It punched Han Sen in the back, sending him hurtling forward. It was a long time before he came to a stop. There was a dent in the back of the Apollo Set in the shape of a fist. The Apollo Set seemed to be on the verge of breaking.\n\n“How dare you act so cocky in front of me!” the Six-Eared Macaque screamed. It jumped at Han Sen again.\n\n“This monkey is so strong. It can use fake bodies, and its ability to hide its presence is unsurpassed. It is so hard to avoid it.” Han Sen eyed at the Six-Eared Macaque, but he didn’t fall back. He threw a punch to meet the beast.\n\nThe Six-Eared Macaque’s body was destroyed, but once again, it was only a fake body. Han Sen didn’t know where the real body had gone.\n\nHan Sen’s heart leaped, and he cast the Dongxuan Sutra. Everything in the universe became a cogwheel in his eyes. Although he couldn’t see the body of the Six-Eared Macaque, he could see the cogwheels of the universe that were moving while the Six-Eared Macaque remained invisible.\n\nThe Six-Eared Macaque was so angry. Its eyes were shining with rage, and it flashed toward Han Sen with great speed. It stared into Han Sen’s eyes, raised its claws, and tried to slash Han Sen’s eyes out.\n\nSeeing that it was almost in front of him, Han Sen swung his fist. He sent his punch toward the invisible-albeit-real body of his foe.\n\nThe Six-Eared Macaque was shocked. It had no idea how Han Sen had discovered where its real body was. It was too close, and it had no time to dodge. It sent a punch of its own to counter Han Sen’s fist.\n\nThe Six-Eared Macaque found itself wrapped up in a soft snowfall. The shadow of a snowlady covered its body."
}