{
    "chapter": 2166,
    "title": "Returning to Narrow-Moon",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2166",
    "text": "Han Sen sat on a ship departing Sky Palace, bound for Narrow Moon. He hadn’t been allowed to take half of the ocean mountain with him, but the Sky Palace leader permitted him to keep a bunch of ocean stones.\n\nHan Sen would usually take a public passenger ship, but on this day, he was riding a cargo ship. Loading it with ocean stones took a while, and the people of Sky Palace who passed by couldn’t help but stare at the bounty.\n\nStudents usually took items and gear with them when they left Sky Palace, but they had never before seen a student embark on a cargo ship fully stocked with ocean stones.\n\nThe stones weren’t close to half of the mountain Han Sen had sundered, but it was more than enough masonry to build an entirely new base. Because of that, Han Sen was quite satisfied.\n\nThe story of Han Sen destroying the ocean mountain quickly spread to each and every corner of Sky Palace. The Sky Palace leader and the elders quickly came to investigate what had happened, and they supposedly learned that the ocean mountain already had a crack. The incredible results weren’t because of Han Sen’s raw strength. Instead, Han Sen had taken advantage of an existing fault.\n\nEven so, the tale of Han Sen sundering the entirety of ocean mountain was a popular one. It was a frequently discussed topic, and it would soon become a legend.\n\nMany years later, when students departed Sky Palace, they would leave their names or a mark of their presence by scrawling them onto half of a floating mountain. It was easy to imagine them asking what had happened to make it like so.\n\nThe Sky Palace people would sound very proud when answering, telling the newbies how someone had once managed to cut the ocean mountain in half.\n\nHan Sen and that half of an ocean mountain became something for the history books of Sky Palace.\n\nHan Sen knew ocean mountain hadn’t been previously cracked, though. It split open because of the stone bug residing within.\n\nBut when Han Sen was breaking the ocean mountain, the situation had been too messy for him to get a look at it, and as a result, he hadn’t actually seen the stone bug with his own eyes. And although he tried to use his Dongxuan Aura to find where it had gotten to, it had vanished. It was nowhere to be found.\n\n“I wonder what the level of that strange creature was. Perhaps it was deified?” As Han Sen thought about this, Bao’er suddenly summoned her little gourd.\n\nHan Sen thought that was odd. Bao’er rarely summoned her gourd willy-nilly, and he hadn’t a clue why she had summoned it now, all of a sudden.\n\nAmidst Han Sen’s confusion, Bao’er shook her gourd. She slapped its bottom, and when she did, something fell out of it and landed on the table.\n\nHan Sen saw it, and when he did, he was both surprised and happy. A stone bug that looked an awful lot like a silkworm flopped out of the gourd. It was the one that had resided inside ocean mountain.\n\n“No wonder I was unable to see the stone bug. Bao’er had taken it.” Han Sen watched Bao’er curiously poke the body of the stone bug.\n\nThe stone bug raised its body, but it did not have any limbs, and Bao’er’s fingers kept it constantly moving. It couldn’t resist the push of her fingers.\n\nThat was unexpected.\n\nThat stone bug had produced the stone mountain, but despite that, it did not seem to be all that powerful. By the looks of things, it did not even have the strength of a Baron.\n\n“Planet Eclipse has an active volcano. Maybe I can throw this thing into it, and see if it can generate more ocean stones,” Han Sen thought to himself.\n\nBao’er was still playing with the stone bug. While she did, Han Sen went to find more information on ocean stones and the stone bugs that produced them.\n\nThe biggest place that stored ocean stones was Purgatory Rock Sea. It was a strange xenogeneic space that was composed almost entirely of lava. Sometimes islands would appear in the midst of the lava, and those islands were composed of ocean stones.\n\nBut Purgatory Rock Sea had many fire xenogeneics to contend with, too. Many of the xenogeneics were King class, and some were even deified. Going there in pursuit of ocean stones was a dangerous job. The death rate for those that went there was very high.\n\nOrdinary people would only be able to find bits of pre-shattered ocean stones. Only deified elites could bring back a whole mountain’s worth, like the one Sky Palace had possessed.\n\nHan Sen was able to learn much about the ocean stones, but surprisingly, he was unable to learn anything about the stone bugs. It seemed as if no one knew how ocean stones were created. No one had seen one of those stone bugs before.\n\nHan Sen had a look at the ocean stone bug. After Bao’er annoyed it for a while, it stopped moving and played dead. It realized that the more it resisted, the happier Bao’er would become.\n\nAfter it decided to stop moving, Bao’er’s interest in the creature quickly disappeared.\n\nHan Sen observed the stone bug closely. Its body was like grey rock. It felt warm to the touch, and that was it.\n\nIts lifeforce was not very strong, so Han Sen was unsure how it had managed to break the ocean mountain as it had.\n\nHan Sen let Bao’er put the stone bug back in the gourd. He was going to experiment more with it once he visited the volcano. If he took the critter to an environment like that, something might happen.\n\nThe ship was guarded by a number of Sky Palace’s elites. Han Sen was delivered back to Narrow Moon safely, with the ship packed to the gills with ocean stones.\n\nOn a primal planet covered with many cruel creatures, a man stood holding a knife. All the creatures that went by him were killed. No bones were left after their death, as the knife consumed them whole.\n\nThat knife was strange. It was made from bone and shaped like some creature’s spine. The knife was serrated like teeth, and it was around two meters long. But when the man swung it, it killed any cruel creature that it came against, and all of the beast’s flesh would be absorbed into that bone knife. The blade appeared more and more bloody as the creatures died.\n\nThe man that gripped that bone knife looked a little strange, as well. His head had three faces like a Destroyed. But he only had one pair of arms, and those three faces looked very different from a Destroyed.\n\nThe average Destroyed had one bird head in the center, with the faces of a man and woman on either side. But this man’s three faces all looked like men. The center face was emotionless. The left one looked like a ghost, and the right one looked handsome.\n\nThe man kept killing, his expressions never looking bored or annoyed. Countless lives were harvested by his bone knife, but his emotions did not change once.\n\nWhile the man was killing, his beautiful face looked up to the sky. A ship breached the atmosphere and came down to land near him.\n\nA robot departed the ship and walked in front of the man.\n\n“Barr, someone is willing to offer you a high sum to kill Knife Queen’s student. Will you accept this contract?” The robot made some electronic noises.\n\n“You know the rules.” The man named Barr continued to kill as he spoke. He cut a creature in half with his bone knife right then and there. The teeth-life blade went on to munch on the body, and eventually the knife swallowed it up.\n\nThe bone knife looked even stronger after that. Its red color had grown even darker.\n\n“This video should be sufficient. I assure you that this target is worth your time.” The robot proceeded to display a video of Han Sen.\n\nBarr watched it, and he was attracted by what he saw. A short time later, his eyes flashed and he said, “I will accept this task.”"
}