{
    "chapter": 2299,
    "title": "The Little Red Bird Hatches",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2299",
    "text": "“Is the little red bird about to hatch?” Han Sen thought in surprise.\n\nBut as he watched, the color gradually drained from Han Sen’s face. The substance chains connected to the bird’s nest started to pull back into the egg, and the nest began to fall apart piece by piece.\n\nPieces of dry grass fell away from the nest, turning to dust in midair. Before they reached the ground, they had dissolved into nothing.\n\n“Oh no… Is this little guy going to drain all the power out of the nest?” Han Sen reached out to save the nest, but when his hand touched the red flame, his body aged and withered. Within a second, he was so old that he looked to be on the verge of death.\n\nHan Sen jerked his hand back. When his hand was no longer close to the red flame, his body returned to normal. He didn’t look old anymore.\n\nThe sight of the disintegrating bird’s nest made Han Sen’s heart bleed.\n\nAnd there was another reason that this was a very serious problem; Queen Bai Wei had told him to hold on to the bird’s nest. What if Queen Bai Wei returned for the missing nest? What would he do then?\n\nThat line of thinking was pointless, however; the egg had already absorbed most of the nest’s power. The dry grass had turned into dust, and there was nothing he could do to reverse the process.\n\nThe egg’s red flame burned hotter and hotter, and the egg itself became thinner and more transparent. As the egg became translucent, he could see what was inside it.\n\nThe little red bird was still curled inside the egg, sleeping peacefully. Its body was full of fire, and it looked as if it was awaking from its slumber.\n\nWhen eggshell became paper-thin, it finally cracked. The shell crumbled into nothing, burning away in the fire. The little red bird fell out. It opened its wings, and flames roared out of its body. It became a red phoenix.\n\nIt immediately flew around in the air. It circled Han Sen three times, nodded at him repeatedly, then flew down to settle on his shoulder.\n\nThat movement shocked Han Sen. The fire on its body was not an ordinary fire. Han Sen had only just touched it, and he had almost died of old age. He worried that if the bird landed on him now, he’d grow so old that he’d crumble into dust himself.\n\nHan Sen tensed as the little red bird landed. Its fire was gone, at least. It now really did look just like a little red bird. It landed on Han Sen’s shoulder in exactly the same way that it used to.\n\nHan Sen sighed. Fortunately, the little red bird had some modicum of intelligence. If it hadn’t restrained its power, things might have turned out poorly for him.\n\n“Little Red!” Bao’er came waddling in from the outside. She sounded so happy when she saw the little red bird.\n\nThe little red bird was sitting quietly on Han Sen’s shoulder, but when it heard Bao’er, it perked up immediately. It flew towards Bao’er’s hand and allowed Bao’er to stroke its feathers. The bird looked as if it enjoyed the attention, and it kept its head there for Bao’er to stroke.\n\n“What is this? I am your master, you know!” Han Sen lifted his lip. He looked at the little red bird with an unfriendly smile.\n\nThe little red bird seemed to acknowledge Han Sen’s expression, so it flapped its wings and flew quickly behind Bao’er. It peeked at Han Sen by poking its head over Bao’er’s shoulder.\n\n“This guy ate the flesh of the Sun Raven. It should be deified, no matter what. Why is the guy still so small?” Han Sen was confused.\n\nBut the power within the little red bird was proof of its rank. Not even Han Sen could withstand its fire for a single second. It was definitely a deified creature.\n\nThose days, Han Sen felt good. After Yisha made him the Rebate’s Holy Child, he received a lot of resources. Planet Eclipse remained under his control, and he was given another eight planets and a slew of different treasures as well.\n\nEven more resources would come Han Sen’s way in the future, but he had too much of that Ghost Bone power still within him. He didn’t need any more resources right now. So, for the moment, he planned to put everything he received in storage.\n\nHan Sen had brought many spirits to Planet Eclipse, and they left the planet to explore the geno universe when they became Marquises. Six Paths King, Ming Yue, and Moment Queen had already begun their journeys.\n\nHan Sen didn’t worry about the safety of Six Paths King, and Ming Yue left with Gu Qingcheng. Han Seen wanted Moment Queen to stay by his side, but she refused. She wanted to level up alone.\n\nHan Sen didn’t force her to stay. Moment Queen had been with him for quite some time. In their early days together, Han Sen came to her as a threat. But eventually, after much time, he won her over. They had enough trust in each other that he was comfortable bringing her to the geno universe.\n\nThings had been going well for Han Sen lately, but it couldn’t last. Life soon proved that there was always something for Han Sen to worry about. He received word that an envoy of the Extreme King would be coming to visit Narrow Moon.\n\nThis time, the leader of the envoy would be the fourteenth prince Bai Canglang. When he heard the name, Han Sen’s worry deepened.\n\nCrime had served Prince Fourteen. The Extreme King delegation claimed that they were visiting to congratulate Yisha on her ascension to becoming deified. But such a simple courtesy wouldn’t usually require Prince Fourteen’s personal attendance.\n\nAmongst a smaller race like the Rebate, a deified warrior was practically a god. For the Extreme King, though, achieving deified status just made someone exceptional. They wouldn’t send a delegation all this way just to congratulate Yisha on an achievement that many of their own members had made.\n\nWhen Han Sen learned that Bai Wei was a part of the envoy, he knew that Mister White had been correct. He would be forced to go with the Extreme King.\n\n“If Mister White’s guess is correct, going with the Extreme King will be very dangerous for me. Zero and Meng’er shouldn’t go, because I might not be able to protect them from the Extreme King. They should stay in Narrow Moon under Yisha’s protection. They will be treated well, and now that I have resources, they should become Dukes without too much difficulty. It might even be possible for them to make it to King rank.”\n\n“I have to take the blood kirin, though. Its power can surely help. But should I bring the little red bird?” Han Sen was hesitating.\n\nHan Sen was deep in thought, but he looked up suddenly, turning his face toward the entrance of the garden.\n\nThere, he saw a blue-clothed man leading a lady in white into his garden. The woman in white was Queen Bai Wei. Han Sen didn’t know who the blue-clothed man was, but judging from the way he walked, Han Sen could guess that the man was Prince Fourteen Bai Canglang.\n\nHan Sen wasn’t surprised that they had come looking for him, but he was surprised that no one had warned him before the two showed up in his garden.\n\nNormally, someone should have reported their arrival. Even if they forced their way in, someone should still have gotten a message to Han Sen.\n\nBut Han Sen had received no warnings. Business in the base continued as usual. Bai Canglang brought Bai Wei right into the deepest part of the garden.\n\nHan Sen frowned and examined Bai Canglang. He looked like a man in his thirties. He was not pretty, but he had a noticeable air of casual strength about him. He walked as if he had no cares in the world. He looked so free.\n\nAlthough he was walking through Han Sen’s garden, Bai Canglang behaved as if he was at home. He walked up to Han Sen and sat down next to him. He picked up the teapot and teacup upon the stone table and poured himself a cup of tea. He said, “This tea is fine, and the people here are great.”"
}