{
    "chapter": 2621,
    "title": "At6 Gene Mutant People",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2621",
    "text": "“Lady Exquisite, can you tell which of the city’s items are geno treasures?” Han Sen asked Exquisite.\n\nExquisite shook her head. “No, but I can see something you cannot.”\n\nHan Sen observed the anvil for a while, then he began to walk on down the street.\n\n“Are you going to give up without even trying?” Exquisite asked coldly when she caught up to Han Sen.\n\n“I bet that countless people from Sky Palace have already tried to take that anvil. I was standing there for a while, and the looks that the blacksmith was giving me weren’t very friendly. I would rather go somewhere else where the reception is not so uninviting,” Han Sen said as he looked around.\n\nAs Han Sen was checking out the city, the civilians in the city checked him out in return. The city wasn’t big, and there weren’t many people. They all lived there, so they knew each other well. Non-natives stood out quite a bit there.\n\nPlus, the people in that city were looking at Han Sen with hostile eyes. There was nothing warm or inviting about them. Han Sen could understand their attitude. In the past, Sky Palace students must have performed quite a few scams to steal their goods. These people certainly wouldn’t enjoy outsiders coming in just to make off with their things.\n\nYun Changkong hadn’t been willing to divulge the specifics of the Black King City to him. It was probably because Sky Palace students had done many things in that city that no one would be proud of.\n\nThe people of that old city didn’t like outsiders, but they weren’t picking any fights. They only walked around Han Sen with cold stares. It was likely they had been taken advantage of before.\n\nThe students of Sky Palace had their power restricted in the city, but they still had their physical strength. Ordinary creatures couldn’t stand against power like that.\n\nIf it wasn’t for Black King City’s rules, any Sky Palace student could bring down the entire city with their fists.\n\n“No wonder Bo Qin said it was harder to get something in Black King City these days.” Han Sen shook his head with a wry smile. He wasn’t very good at talking, and his ability to communicate with others was below average. He didn’t think he would gain much from this city.\n\nNow that he didn’t have access to his powers, he was unable to tell which item was a treasure and which was just a normal item. He could only rely on his gut instincts and eyesight.\n\nHan Sen tried to summon a beast soul, but beast souls were restricted, as well. He couldn’t bring anything out of his Sea of Soul. That stopped his cheating mind in its tracks.\n\n“Lady Exquisite, do you know what race the people here belong to? Why do they look like crystallizers?” Han Sen said as he walked.\n\nAfter a moment of thought, Exquisite said, “This is just their appearance. They aren’t true crystallizers. They aren’t like any race in this entire universe, actually. They are just creatures of the Black King City. They can’t leave this place. They must spend their entire lives inside this city.”\n\n“Are the creatures in the other four cities similar to these?” After Han Sen asked that, a strange feeling whelmed him. He was from Sky Palace, but he was asking an outsider about what might be members of his own species.\n\nExquisite didn’t seem to give Han Sen’s question much thought. She shook her head and said, “Each of the five cities is different. The inhabitants all have special traits and quirks. The other cities aren’t as safe as Black King City. Even deifieds can die in them with a little bad luck.”\n\nHan Sen and Exquisite continued to walk and talk, sightseeing their way through the city. The grass, the wood, the bricks, and the slate of the region looked very old and heavy.\n\nHan Sen felt as if he was walking through the streets of a vintage film. Everything there looked like treasures, but they weren’t.\n\n“It sucks not having my ability to sense things,” Han Sen sighed. But he suddenly remembered he had crystallizer glasses. He didn’t know if the crystallizer technology would work in the city, so he gave it a try.\n\nHan Sen put the glasses on his face and looked at the people in the city. Data scrolled across the lenses.\n\n“Target locked… analyzing data…” the voice of Glasses sounded in Han Sen’s ears. The data continued to flash across the lenses.\n\n“Why are you wearing glasses?” Exquisite felt as if what Han Sen was doing was rather weird. She looked at the glasses.\n\nGlasses wasn’t a treasure, so Exquisite wasn’t surprised by his ability to put them on.\n\n“These people don’t like us. Wearing glasses to hide our faces might help us steal items. They won’t be able to immediately recognize me if I wear these,” Han Sen explained.\n\nWhen she heard Han Sen say that, Exquisite looked at the people and said, “You think too much. Anyone who takes an item from this place will be branded a threat, and they will never be able to come back.”\n\nHan Sen laughed and didn’t respond. He continued walking. Not long later, Glasses had results ready for him.\n\nTarget: AT6-type mutant genes. Male. Calculated Gene Age: 34.\n\nGene level: none\n\nGene potential: none\n\n“What is an AT6-type mutant gene?” Han Sen asked the glasses in shock.\n\n“AT indicates that it is a creature. The number six means it is from the sixth branch of creatures,” Glasses answered.\n\n“What does AT mean?” Han Sen tried to ask it.\n\n“AT is AT.” The AI of the glasses had the maturity of a six-year-old. She was unable to answer Han Sen’s questions.\n\n“Are they related to the crystallizers in any way?” Han Sen changed his approach with his questions.\n\n“No,” Glasses answered hastily.\n\nHan Sen asked her about a few other races that looked similar, but Glasses refuted each suggestion.\n\n“Can I see what other AT creatures might exist?” Han Sen asked, not willing to give up yet.\n\n“Information incomplete. Cannot answer,” Glasses answered.\n\nSince he couldn’t get any more information out of Glasses, Han Sen put his mind on the city.\n\nGlasses could be used, but she could only scan creatures. She didn’t scan treasures, and so Han Sen would have to depend on his luck for any decisions he made on that prospect.“If you follow me to the Very High, I can tell you where a deified treasure lies and how to claim it for yourself,” Exquisite said as two of them walked around the streets. Han Sen was coming up empty-handed thus far.\n\n“Where is a deified treasure?” Han Sen asked her quickly.\n\nExquisite had been tricked by Han Sen once before. She looked at him silently, not willing to answer his question.\n\nHan Sen couldn’t trick her into giving him more information, so he shrugged and said, “But you should at least tell me what sort of treasure it is.”\n\n“The city is very small. If I told you what it is, you would find it.” Exquisite rolled her eyes.\n\nHan Sen was surprised. It was rare to see her express that much emotion.\n\n“Never mind, then.” After a moment of thought, Han Sen decided to return to the blacksmith’s smithy.\n\nSky Palace had controlled Black King City for many years. All the best stuff had probably been taken by this point. Even if there was something good left to get, it would be either extremely difficult to claim or impossible to find. So far, the anvil was the only thing Han Sen had seen that interested him. And so, that was what he was going to try to claim."
}