{
    "chapter": 1149,
    "title": "Kill You Forever",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1149",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen looked inside the door and saw the shadow kneeling. There were no more musical notes or energy signatures left to scan. Xiang Yin would probably not make it.\n\n“You lose. Badly! Now, watch as she dies! I am different; I have many more ways to play with you.” Yaksha began to cackle like a mad scientist.\n\n“How can you be so certain I’ll watch her die?” Han Sen said.\n\nYaksha spat out blood and mumbled, “You are only a little stronger than me. You have only opened nine gene locks; you cannot enter there.”\n\n“And who said I’ll need to enter to save her?” Han Sen then brought out his bone xun.\n\n“What’s that for? Are you going to play a requiem on her behalf? Or perhaps you’re going to somehow play the song of Gandharva?” Yaksha jested in spite.\n\n“I can play that, if that is what you would like to hear.” Han Sen then brought the xun to his lips. He blew into the head, causing a stream of white light to cast its way into the door.\n\nThe power was the same that the xun created, and he used this to recharge her body.\n\n“How?” Xiang Yin felt this power enter her body, providing her support before she collapsed completely.\n\nShe only needed a little bit more power to reach the tenth step, and with that power, she had hope.\n\nXiang Yin’s notes filled the air, and her scent re-fragranced the atmosphere. With Han Sen’s help, she was slowly able to move forward and take one last step.\n\n“Impossible! She only played it once. How can you know the song of Gandharva already?!” Yaksha barked.\n\nCarried by the gentle soundwaves of that divine music, Xiang Yin leaned forward, ready to take that last step.\n\n“No! It should be me who makes that final step!”\n\nYaksha looked insane as he watched Xiang Yin take that one last step.\n\nYaksha’s eyes were going bigger and bigger, unable to believe what he was seeing.\n\nBoom!\n\nThe tenth step was scaled, and when Xiang Yin set both feet on it, a flame ravaged her entire body.\n\nThe light was too bright to witness what was happening now. But it eventually dimmed, and when it did, Han Sen saw her reborn. She looked so holy, like a divine fairy or angelic being.\n\nXiang Yin spoke something to him, but Han Sen could not hear the words. He could only read her lips.\n\nThe door closed, and as it did, Han Sen reviewed the words he believed her to have spoken: “I’ll wait for you in the Fourth God’s Sanctuary.”\n\nHan Sen was not entirely sure that was what she said. She pointed at him as if she wished to say something further, but the door closed before she could.\n\nBoom!\n\nThe door was closed, separating the two for good. Han Sen was depressed, having not even been able to receive a “thank you” for his efforts.\n\nBut Han Sen did not have time to dwell on it. He picked up Yaksha and just said, “You said you have many ways, right? I can tell you right now that you don’t. I’ll kill you every single time I see you. So, my advice to you is to keep that spirit stone safe. If you don’t…”\n\nHan Sen punched through Yaksha’s skull and tossed his body away. Yaksha’s body faded from sight, warping him back to his spirit stone.\n\nWhen he respawned, he mulled over the words Han Sen had spoken to him. Han Sen’s speech was one of remarkable confidence, and it made Yaksha angry to realize that he was now the weaker one.\n\n“I’ll make you regret this.” Yaksha left his shelter, making this one final vow.\n\nHan Sen decided to make his way out of the underground realm. He exited his super king spirit mode, and his body was exhausted. So, he called for Golden Growler to carry him back.\n\nNot long after, Han Sen came across the Blue Dinosaur and Queen. Queen looked incredibly relieved to see Han Sen.\n\n“Let’s go back to the shelter as soon as we can,” Queen said, as she ran over to hold Han Sen in her arms.\n\n“I’m not going back. Those *sshole super creatures tried to kill me, so I’m going to exact my revenge.” If it wasn’t for the super creatures getting involved, Han Sen wouldn’t be in such a condition.\n\nHe recalled their names and knew he had to kill them.\n\n“They lead armies of noobs. That’s it. And when they recover, I’m going to make light work of them,” Han Sen said.\n\nHan Sen set up a camp outside the cave’s exit, and when he recovered, he thought of going after the rat king first. He wanted to take its Life Geno Essence.\n\nA few days later, he was back in tip-top shape. With Blue Dinosaur, he returned to the underground."
}