{
    "chapter": 2619,
    "title": "Black King City",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2619",
    "text": "On the little jade island, Han Sen, Han Yan, and Bao’er were sitting at a table with four gourds of various sizes laid out across it. They were the four gourds Han Yan had collected from the holy vine.\n\nThe three of them had briefly examined the gourds, but they still didn’t know how to get the holy air out of them.\n\n“Bao’er, can’t you make these things release their holy air?” Han Sen asked, glancing at Bao’er.\n\nBao’er shook her head. “I could if I was at the vine, but not right now.”\n\n“Does that mean retrieving them was pointless, then?” Han Sen felt depressed.\n\n“Stop trying. Once the holy gourds are separated from the holy vine, the holy air inside of them solidifies. They won’t release anything.” Yun Changkong smiled as he walked over to them. Yun Suyi and Yun Sushang were following behind him.\n\n“Greetings, brother,” Han Yan said. She stood up and bowed to Yun Changkong.\n\n“Greetings, auntie…” Yun Suyi and Yun Sushang bowed, as well.\n\n“Why is this so messed up?” Han Sen thought. He bowed to Yun Changkong, too, but only referred to him as Elder Yun.\n\nThe Yun sisters said hi to him. They had been close for some time, so there was no need for a great deal of politeness.\n\nAfter Han Sen instructed them all to take a seat, he had Zero come and pour the tea. Yun Changkong had a sip and then said, “The holy gourds cannot release holy air now that they have been picked. But they are a material that can be used to forge deified treasures. We should conduct a test and learn what elements they are associated with. Then, I will have Sky Chance’s department make the treasure for you. However, making the treasures will still require other materials, and they might be expensive. The process isn’t guaranteed to be successful, either. I would wager it to be fifty-fifty.”\n\n“What kind of materials will I be needing?” Han Yan asked.\n\n“We won’t know that until we test the holy gourds. After we have decided what sort of treasure you want, then we can make a list of the materials that will be required.” Yun Changkong smiled and went on to say, “Don’t worry about it, little sister. I will pay for the materials in return for your willingness to join us. Please do not object to my insistence. It is settled.”\n\nUpon seeing Yun Changkong’s certainty, Han Yan didn’t turn down his offer.\n\nAfter chatting for a while, Yun Changkong turned to Han Sen. “Han Sen, have you not been to the five cities?”\n\n“No, not yet.” Han Sen shook his head and said, “I wanted to go to the five cities, but a guard told me I need some sort of special\n\npass.”\n\nYun Changkong pulled out a piece of paper with a black symbol written on it. “The five cities are different from the twelve towers. It is very dangerous there, and the cities are all different from one another. Until you heal, you shouldn’t go to the latter four. This is the Black King City spell of the five cities. If you have this, you will be allowed to enter the Black King City. Perhaps it can help you. But remember: you cannot lose the pass if you enter there. And you cannot kill anything inside. Otherwise, you will land in a lot of hot water.”\n\n“What is inside the Black King City?” Han Sen asked with curiosity.\n\n“I can’t tell you. But you will find out as soon as you go there,” Yun Changkong said, waving his hand with a mysterious air.\n\n“This spell can only allow one person inside?” Han Sen asked with more curiosity.\n\nYun Changkong nodded and said, “In the future, little sister’s spell will be handled by Sky Palace Leader. Her level is low now, so it is pointless for her to venture into the five cities. We will need to wait until she is King class. Then she will receive her five cities spell.”\n\nAlthough Han Yan was now Yun Changkong’s sister, she was still his student. Yun Changkong was explaining things to Han Yan just like an average instructor would.\n\nWith Yun Changkong only being the senior student, the atmosphere was so unnatural. The Yun sisters were very quiet because of it.\n\nYun Changkong understood why, though. He dropped the info and left, leaving Yun Suyi and Yun Sushang behind.\n\nWhen only the youngsters remained, the atmosphere became far more relaxed and comfortable. Amidst the liveliness, Han Sen was keen on asking the Yun sisters about the Black King City.\n\n“Father said that our powers are too weak, and we cannot go in yet. That is why we don’t know much about the cities. I have heard that Black King City is the safest of all the cities. As long as you keep the spell on your person, and you don’t have any intent to kill within you, it shouldn’t be too dangerous for you to go to the Black King City.” Yun Suyi stopped to think for a moment, then said, “The legends claim that Black King City has many rare treasures in it. Many of the people that entered there came back with grand trophies, but they were never willing to say how they came into possession of them.”\n\nThe Yun sisters didn’t know much about the Black King City, which only made Han Sen even more curious.\n\nThe next day, he rode his legless crane to the White Jade Jing. He wanted to see the Black King City so he could see what was so special about it.\n\nOf course, when he reached the gate of the city, Han Sen was stopped by a Sky Palace student.\n\n“Mister Han, I’m so sorry. Without a pass from the leader, no one is allowed to enter the Black King City.” That guard had once attended lessons taught by Han Sen, so he was very polite.\n\n“Will this do?” Han Sen took out his pass and handed it over to the guard.\n\nThe student inspected it and then let him pass. Before Han Sen went, though, the guard reminded him that he must carry his spell at all times. He couldn’t, at any cost, lose the spell.\n\nHan Sen thanked the guard and entered Black King City.\n\nFrom the outside, the city looked like an ancient place built from black jade. It looked old. It was mysterious and cold.\n\nAfter entering the Black King City, Han Sen was shocked by what he saw.\n\nHe had thought Black King City was a mysterious place, and that there might be dark and dangerous creatures out on the prowl. He at least thought it might look like the White Jade Tower, albeit with the presence of creatures.\n\nBut as Han Sen stepped on to the city’s main street, he saw that the place was quite populated. It was a town with all sorts of people. There were merchants and farmers. There were even restaurants in which people relaxed and chatted as they ate.\n\nIf Han Sen hadn’t come in through the clearly defined entrance, he’d have assumed he had gone to the wrong place. This place shouldn’t have been called Black King City. It was more like a small town on some underdeveloped planet.“Peanuts! Walnuts! Pears! Dates!” a seller was barking down the street.\n\nHan Sen could see a farmer leading a cow. There were chickens clucking in cages and dogs barking at one another on the street. Han Sen felt strangely unsettled as he walked down the street. When he was young, not even his home had been this underdeveloped. This was the sort of thing he might have seen in an old movie.\n\nHan Sen looked at the ancient city people around him and noted that they looked very human. They were almost exactly the same as his own people.\n\n“How is this possible? How can there be humans here?” Han Sen mumbled to himself in shock.\n\nThey looked exactly like humans. They were different from the Very High, the Sky, and the Extreme King. They did not have the additional features that the other races had. They were practically identical to humans.\n\n“Am I having some sort of hallucination? They cannot be humans,” Han Sen thought to himself.\n\nSoon after, though, he realized that what he was seeing couldn’t just be some sort of illusion. The beings around him were obviously living humans.\n\nHan Sen wanted to use his Dongxuan Aura to examine them more closely, but he found that his power was all gone. Not a single speck of it remained."
}