{
    "chapter": 2433,
    "title": "Dead Lock",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2433",
    "text": "Miss Mirror was severely injured, and she wouldn’t be getting back to her feet anytime soon. Blood continued to trickle past her lips, but luckily, her lifeforce still seemed stable. She was wounded, but not dying.\n\nHan Sen turned around and looked at the blonde girl, and he noticed that she had turned around to look at him, too. They stared at each other, only a single step separating them.\n\n“What the hell is happening right now?” Han Sen wondered. His heart was pounding like it was about to jump out of his chest, and he considered teleporting to the sanctuaries immediately.\n\nThis blonde girl had just executed a deified elite as easily as Han Sen might step on an insect. Attempting to fight her would be a death wish. Han Sen didn’t want to die, so he didn’t attempt to fight back or make any moves that the girl might interpret as aggression.\n\nBut when Han Sen saw the girl’s eyes, he resisted the urge to hop back to the sanctuaries. She didn’t look murderous.\n\nOf course, that wasn’t the most important reason that Han Sen was staying here rather than fleeing to the sanctuaries. He could already tell that the girl could strike with her sword much more quickly than Han Sen could use the Blood-Pulse Sutra to open a portal. She could cut his head off before he even finished summoning power.\n\nSo instead of running or fighting, both of them just stood there. Han Sen didn’t move. He was afraid that any motion on his part might cause the blonde girl to attack.\n\nBut the blonde girl just stood where she was, not attacking. She looked in Han Sen’s direction, but her eyes didn’t seem focused. It was hard to tell if she really was looking at him.\n\nHan Sen remained motionless as cold sweat beaded on his brow. The scary girl was as still as stone, and they had been staring at each other for ten minutes.\n\nIf they had been in a bar or pub, staring at a beautiful blonde girl for a prolonged amount of time would have been an enjoyable, relaxing thing for Han Sen. Instead, they were in an abandoned city in a cursed land, and Han Sen was anything but relaxed.\n\nLooking at a pretty girl was like looking at a beautiful painting; Han Sen didn’t need to touch it to enjoy the experience. But right now, Han Sen had difficulty breathing under the pressure. Every second felt as long as a century.\n\nThat girl was pretty indeed. She was like a blonde princess from a fairy tale, but no matter how attractive she was, thinking about how easily she had just killed a deified Extreme King kept Han Sen from calming himself down. Who knew when she might suddenly decide to cut Han Sen in half with a single swing of her sword?\n\n“You should move. Show me a sign. Are we fighting or seeking peace?” Han Sen thought desperately. Sweat was running down his face now. He thought of a million ideas, but the girl was still just looking at him. Her eyes were dull, like she was badly dazed.\n\nHan Sen gritted his teeth. He gradually moved his foot, wanting to step away from her, wondering if he could walk off slowly without disturbing her.\n\nBut he had only taken half a step when the blonde girl took one whole step toward Han Sen. She almost bumped into him. Han Sen immediately stopped, which made the girl stop, as well.\n\nBoth of them were much closer now. Han Sen could almost feel the girl’s breath, and he could smell her perfume again.\n\nHan Sen didn’t move, and the girl didn’t either. The two of them continued to stare at each other again.\n\n“Oh, my God, what is happening here? Is this girl really a princess? Does she think I am so handsome that she doesn’t want to kill me? Does she want to marry me instead? Just tell me if you want to marry me! Don’t just stand there doing nothing. It’s creepy!” Han Sen thought. If this girl liked him, she should summon her courage and tell him. If she was in love with him, that was totally fine; it was better than killing him, anyway.\n\nIf something didn’t happen soon, the tension was going to make Han Sen explode. The girl clearly hadn’t noticed how rigid and uncomfortable he was. Her eyes were still unfocused. When she stepped forward as he stepped away, it was probably a subconscious reaction.\n\nHan Sen didn’t know what the girl would do once she woke up. If she had injured Miss Mirror and killed Night Wind without even being fully conscious, she must be pretty scary.\n\nThen Han Sen remembered something that made it seem even less likely that this would end well for him.\n\nThe first four pictures on the screen had already come true. When Han Sen remembered the scene from the fifth picture, his heart began beating even faster.\n\nIn the fifth picture, one faceless man had been lying on the ground, and two other faceless men appeared to be fighting. One of them was gripping the other’s neck.\n\nHan Sen could guess that the faceless man on the ground represented Miss Mirror, which meant that the fighting faceless men were the girl and himself. If he fought someone with her power, there was no way he could win.\n\nThinking of Miss Mirror, Han Sen glanced over at her. She was in a much better condition, and her wounds were healing quickly. But she lay on the ground, not attempting to get up or run away.\n\n“Why isn’t she running?” Han Sen thought to himself. Then, he understood.\n\nShe must have remembered the fifth picture, as well. If the fifth picture came true, she might be the safest by remaining on the ground. If she got up to run, perhaps she would end up as the one fighting.\n\n“So evil,” Han Sen thought.\n\nThe girl still hadn’t moved, but it did seem as if her eyes were starting to brighten. She was slowly starting to wake up.\n\nHan Sen kept thinking, “If those pictures are true, then only two faceless men will exist by the sixth picture. One will be on the floor, and the other will be kneeling in prayer before the statue with a thousand hands and a thousand eyes. I don’t know if the one on the floor is dead or alive. If they are alive, then that means either Miss Mirror or I will survive. Only one of us will live, but that doesn’t matter… Miss Mirror will be the one who dies. I will be the one who gets out.”\n\nHan Sen was confident about this. He was very confident because he had the super god spirit body. He couldn’t beat the girl, but he could use the short period of invincibility to return to the sanctuary.\n\nHan Sen continued to think, and Miss Mirror remained on the ground, waiting for some chance. The girl, meanwhile, was looking at Han Sen. None of them were moving. It was like time had stood still, and everything was silent.\n\nLife and awareness were flowing back into the girl’s eyes. Only her eyes seemed to change, but somehow, they made her whole body seem different.\n\nShe had moved like an emotionless killing machine when she first came out of the egg, but now she seemed like a real human.\n\nThe girl blinked, and Han Sen’s heart jumped in response. With this girl now awake, God only knew what she might do.\n\nAfter the girl blinked, she seemed to come back to herself fully. She saw Han Sen, and so she moved. She jumped to him and grabbed him by the neck."
}