{
    "chapter": 1299,
    "title": "Desperate Wine",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1299",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\n“No God Emperor!” Empty Witch exclaimed.\n\nHan Sen and Lotus Empress’s faces changed, both equally surprised to see he had been hunting them.\n\n“You’re really this persistent?” Lotus Empress said.\n\n“Leave me the fruit you took and go.” No God Emperor was referring to Han Sen.\n\n“I ain’t leaving sh*t.” Han Sen pulled out Taia, and with a burst of courage, he leaped towards No God Emperor.\n\nNo God Emperor spun No God Sword and went forward to meet him.\n\nArgh!\n\nHan Sen’s shoulder was cut, and if he had evaded him a split-second later, his arm would have been hewn completely off.\n\nHan Sen’s Taia managed to find its target: No God Emperor’s chest. But it seemed to have been imbued with some sort of power that repelled direct attacks. Han Sen’s sword pinged off like rubber after coming into contact.\n\nHan Sen’s shoulder was starting to heal already, though, so there was no need for a period of rest. Han Sen’s Jadeskin had opened nine gene locks, so his passive recovery was better than ever.\n\nBut now, Han Sen well and truly knew he could not defeat No God Emperor even if he made use of super king spirit. And with his transformation time still being limited, he couldn’t use it indefinitely. He’d eventually run out, and it was at that point Han Sen would meet certain death.\n\nThat being said, No God Emperor did not expect to get hit. And he was surprised he hadn’t been able to break Taia’s blade.\n\nA second later, though, No God Emperor was back to attacking. He swung his sword without delay, employing its magic of being nigh untraceable. Even with his eighth sense, Han Sen could not feel that blade coming.\n\n“Go!” Lotus Empress pulled Han Sen back and escaped with him just as they had earlier.\n\nBut this time, after the smallest of a break, No God Emperor found them and was on them. Wherever they went, he followed.\n\nHan Sen still knew he’d have to open his tenth gene lock if he wished to have a chance in fighting their pursuant, but that didn’t seem likely to happen anytime soon.\n\nHan Sen was still able to use the Dongxuan Sutra to keep an eye on where No God Emperor would next appear, so that was sufficient to keep them on the lam for a while, despite knowing it would not last forever.\n\nBut not even the Dongxuan Sutra could guarantee his survival in face-to-face combat. Even with its usage, every evasion or dodge took extreme effort.\n\nAnd if all he could do against No God was dodge, then there’d be no point standing up to him. So they had to keep moving, with Lotus Empress teleporting them shortly after No God Emperor appeared. And it never took him long to show up.\n\n“Let’s go back to Evil Lotus Shelter,” Han Sen suddenly said.\n\nLotus replied, saying, “Why go there? There are emperors and super creatures there, but they don’t want to help us.”\n\n“We don’t need their help, but perhaps there is a way I can stop his rampage,” Han Sen said.\n\n“And what would that be?” Lotus Empress asked with curiosity.\n\n“It’s hard for me to explain, so take us back and I’ll show you.” Han Sen was planning to use the jue and summon the altar, using the emperors and super creatures there as a sacrifice.\n\nLotus Empress nodded, and then they teleported back to the plaza.\n\nHan Sen saw that a lot of the emperors and super creatures had yet to leave, and the fruit was still there untouched. Han Sen started sucking them into the Cruel Bottle, in the event that he needed those as an extra sacrifice.\n\n“Put them back!” Moving Star Emperor bellowed, as he fired a number of star-like orbs at Han Sen. Han Sen was shocked at his sudden inability to break the stars that sought to slice him up.\n\nSo Han Sen dodged them instead. And then, he said, “This is none of your business!”\n\nMoving Star Emperor did not say anything, and there was no guarantee he was even listening. He just smiled queerly. Han Sen was surprised to see every spirit and creature close in on them, then.\n\n“We were tasked to guard these fruits. If even one is missing, No God Emperor vowed to kill us all. Leave the fruit and run!” an emperor explained.\n\n“You’re a bunch of pussies! You call yourselves emperors? Have some backbone and stand up for yourselves,” Han Sen lectured them, while collecting every fruit there.\n\n“This entire thing is the fault of this cheap human. We should just kill him and be done with it,” Moving Star Emperor proclaimed.\n\nMany of the emperors there were in agreement, and they walked towards him.\n\nLotus Empress wished to say something, but she saw a vortex appear in the sky again. Just like before, No God Emperor came out, breathing a nasty fire.\n\n“Now, to the Luminous Stone at once!” Han Sen commanded.\n\nShe didn’t know what Han Sen was thinking or what he was planning, but any plan was better than no plan. And with the confidence in his voice, she trusted him. Without hesitation, she took him to where he needed to go.\n\n“What are you planning to do?” Lotus Empress inquired.\n\n“Have a drink of wine,” Han Sen said.\n\nHan Sen brought out his jue and poured some wine into it.\n\n“Is now the best time for you and I to share a drink?” Lotus Empress wasn’t sure if this was a jest or not. Their enemies were coming closer, yet it was rather perplexing to see Han Sen so calm when doing this.\n\n“Enjoy the swallow, because that’ll be your last,” Moving Star Emperor said.\n\nHan Sen looked at the crowd that had gathered, and raising a glass, he proclaimed, “Anytime’s the only time, baby. And to all of you, leave now and you’ll live. If you remain, you’ll suffer the consequences.”\n\nAfter that, Han Sen necked the wine.\n\n“This guy is so full of crap…” Moving Star Emperor started to mock him again, but something took him by surprise.\n\nThe entire shelter was suddenly trapped in a darkness that not even an emperor could see through."
}