{
    "chapter": 2247,
    "title": "The Xenogeneic Born in the Bone Blood",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2247",
    "text": "Han Sen looked at Fox Queen without speaking. Truth be told, he didn’t actually believe everything that she had told him.\n\nPeople say that beautiful women are often liars. Judging from how pretty she was, she had to be an absolutely fantastic liar.\n\nFox Queen seemed to be aware of Han Sen’s thoughts, and she shot him a quick grin. “If you don’t believe me, then why don’t you wait here for a little while? When you see the xenogeneic, you’ll know the truth.”\n\nHan Sen didn’t speak, and she didn’t either. They sat atop the peak together in silence. She had tucked her knees into her chest and wrapped her arms around them, leaving her bare feet visible beyond the edges of her clothes. A drizzle of rain fell upon her hair. Her clear eyes were dazzlingly attractive. If people didn’t know her, they would believe she was a delicate and sentimental lady.\n\n“These shapeshifting foxes are really something. They can look both really sexy and really innocent.” Han Sen was amazed by the utility of her powers. With the way she could change, it was impossible to even guess her age.\n\nThere was no day or night cycle in White Bone Hell. The blood-filled sky continued to wash the land with a light rain, but after a while, it became a heavy downpour.\n\nFox Queen sat atop the peak, allowing the rain to fall across her. But no drop of rain could actually touch her. Her body glowed with an aura of holiness. She was like a goddess amidst the bloody bones. It was a strangely beautiful sight.\n\nHan Sen’s body cast a skill that allowed the rain no closer than an inch from his skin. He sat next to Fox Queen, gazing out at the landscape that was dyed red. As strange as it all was, Han Sen found himself rather impressed by the sight.\n\nThe blood seeped and ran between the bones. It was like a bone mountain inside purgatory. The scene was frightening, but also oddly clean.\n\n“I still don’t know your name,” Fox Queen said quietly, raising her head to glance at Han Sen.\n\n“San Mu,” Han Sen said without hesitation. He really didn’t want to become well-acquainted with a strange character like Fox Queen. She obviously had a long and complicated history, and it seemed as if further association would only lead to trouble.\n\nIf she really did make it out of that place, Han Sen hoped she wouldn’t want to follow him.\n\n“San Mu, what a terrible name!” Fox Queen barked a laugh. “That name means ‘three wood,’ but one wood is boring enough, surely. You have three! My, my. It is no wonder you are such a boring individual.”\n\nHan Sen laughed, but he didn’t speak. In his experience, no shapeshifting fox was innocent. Many rich men married women like her, only to end up losing something precious.\n\nJust like the Destroyed. If not for a shapeshifting fox, they wouldn’t have lost the Destroyed Bible, their most valued treasure.\n\nAnd the two women who pulled off that crime were just minor foxes. This was like a grandmaster fox. If Han Sen made her angry, he would end up losing more than just his undies.\n\nBased on the way he behaved, Fox Queen believed Han Sen was a fairly boring guy. She closed her eyes and raised her face, letting the red rain fall across her.\n\nThe scene was lovely and artfully arranged, which Han Sen admired. Fox Queen could keep changing her style effortlessly. Any man could find something attractive in a person like her. Her scariness reminded him of Gu Qingcheng.\n\nAs Han Sen was losing himself in thought, Fox Queen suddenly pointed towards the mountain range that resembled a lotus and said, “It’s coming!”\n\nHan Sen looked in the direction she was pointing, but there was too much rain. A river of blood appeared across the lotus mountain, gushing out like a waterfall.\n\nHan Sen didn’t see anything. And as he hesitated to believe her, he heard a cry. Something was coming down the blood waterfall, moving smoothly like it was walking over the blood rather than swimming through it. The creature was out of the mountains now, and it was following the river down.\n\nIt was too far away, and the blood rain blocked much of Han Sen’s vision. He could see a body, but it was blurry. He decided to summon his Purple-Eye Butterfly to get a better view of the thing.\n\nIt was a red kirin. Its scales were like crystals dipped in blood, and a pair of coral-like kirin horns rose from its head.\n\nThe creature wasn’t quite as large as an adult bull, but it gave off a sense of unleashed violence as it walked. It looked like it was striding across blood clouds.\n\nThe beast looked excited.\n\nAlthough it didn’t release any power, Han Sen could sense clearly how strong it was. It was different from other creatures, and aside from its lifeforce, it gave off an aura of death.\n\n“What is it?” Han Sen asked with curiosity.\n\nFox Queen shook her head. “Ghost Bone led the Sacred Blood army, and they killed billions of creatures. This was just the son of some average Viscount. Who knows what it was?”\n\n“If it was just a member of a smaller race, and its parent was a Viscount, then how could it have become a King? And if it was left here to grow, how could it one day become a deified thing?” Han Sen didn’t believe her tale.\n\nFox Queen didn’t bother explaining it. “You’ll figure that out later.”\n\nFox Queen didn’t say anything more, so Han Sen turned back to watch the creature.\n\nThe blood kirin was still surfing along the river. The creature seemed scared. It didn’t seem to want to get close to the hellish gate or interfere with Han Sen.\n\nAfter a while, the rain stopped. The blood clouds faded to reveal a sky that looked as if it had been rinsed clean.\n\nHan Sen had never seen a sky like this before. There was no moon and no stars, only darkness as far as the eye could see.\n\nSuddenly, the blood kirin raced up to stand atop the white bone peak. It shrieked with a voice that boomed and echoed like thunder. It did that for some time.\n\nHan Sen noticed something weird; the blood kirin was glowing red. Its red body seemed to split the space that it walked through. It looked very murderous. A creature with a weak will would piss their pants, if they were to see it.\n\nWhen the blood kirin released its blood power, its form turned into a bloody swirl.\n\nWhite Bone Hell’s bones and rivers started to rumble. The bone air rose, and the blood river released a blood light. It was headed for the blood swirl.\n\nEverything moved because of that blood kirin. He was intimately connected with this world, like some god demanding sacrifices.\n\nWhen the bone mountain and blood river power entered its body, the blood kirin’s body looked clearer. It was like a blood crystal statue, and it looked murderous."
}