{
    "chapter": 2609,
    "title": "Exquisite’s Third Eye Pang!",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2609",
    "text": "Two water knives collided and exploded, becoming like a rainy squall scattering over the surface of the pond.\n\nExquisite frowned. Her knife skill was from a race that was now extinct. Its name was Twist and Turn. It was a knife skill that could twist space. The skill made it nearly impossible to follow the course of the knife.\n\nExquisite knew that when Teeth Knife reached its height, it could break through the fabric of space. But that didn’t mean Teeth Knife could go against Twist and Turn. Unless, of course, Han Sen could somehow follow the course of her blade.\n\nExquisite reformed her water knife and used Twist and Turn again. The shadow of the water knife twisted in the dimensions of space to take on a strange shape. Only masters of space could see the shadow of that knife. Anyone else would block the knife that they saw coming toward them, but that would be a decoy. They would block a shadow, while the real water knife would still be flying toward them.\n\nHan Sen didn’t move. He waved his own water knife casually, blocking all of Exquisite’s attacks. Exquisite attacked ten times, and not a single one came down on Han Sen. “He is definitely worthy of becoming my silkworm,” Exquisite thought. She nodded. She enjoyed Han Sen’s performance. Unless he had real power, Han Sen would be a poor silkworm.\n\nSilkworms had to be exceptionally talented and have a genuine drive for learning. The further they could go, the more use they would be to the Very High on the whole.\n\nNow that she knew Han Sen had a potent mastery of knife skills, Exquisite wasn’t going to hold back. She began to use all her skills, cycling through knife attacks one after another.\n\nHer Very High knife skills combined with the knife skills of all the different races she knew. All her skills were a patchwork of knowledge gathered from across the universe. Although her attacks wouldn’t be any stronger than the most famous knife skills in the universe, the rotation of skills she employed was quite unique.\n\nIn the next twenty or thirty attacks, Han Sen felt as if he was fighting twenty or thirty different people at once. And it was like each swordsman was trained differently, and they were each an incredible fighter in their own special way. All of the styles employed came pouring out of his opponent with natural precision and exceptional talent. Even Han Sen found himself shocked by Exquisite’s knife skills.\n\nAn ordinary person that practiced a lot of knife skills would be limited by their personality and body. They had to follow one course.\n\nIf someone had excellent agility, their knife skills would be very fast and flexible. If another person was very strong, their knife skills would be simple and violent. People that had no patience tended to attack quickly.\n\nBut Exquisite’s knife skills didn’t resemble anything he had seen before. She was her own woman, and it was like her personality could change to perfectly accommodate whichever skill she used next. Not even Han Sen could do something like that. His knife skills followed his one true style. That was Teeth Knife. Han Sen’s Teeth Knife was different from Yisha’s Teeth Knife. People that knew Teeth Knife didn’t need to look at who used it. Merely by seeing the skill, they could tell who used it and how.\n\nHan Sen was shocked. He didn’t know Exquisite was actually more shocked than he was. Her knife skills kept changing, and yet, no matter what technique she used, Han Sen was able to use Teeth Knife to block each strike. That wasn’t because Teeth Knife itself was so strong; it was because Han Sen himself was too talented.\n\n“It looks like the God Spirit Touch was accurate. Maybe he really does have an eleven armor talent.” Upon seeing Han Sen’s knife skills, Exquisite felt deeply moved. She wanted to fetch another God Spirit Touch to test Han Sen again.\n\nBut she hadn’t brought a God Spirit Touch herself. If she wanted to conduct another test like that, she would have to visit the Very High.\n\n“Beating him will be difficult. I will have to use this.” Exquisite’s heart jumped. She closed her eyes.\n\nHan Sen was surprised when she closed her eyes. He didn’t know what Exquisite was thinking. A ninth-tier King should be able to see fine, even with her eyes closed. But Han Sen knew there had to be a reason for what she had done.\n\nWhile Han Sen mulled over this conundrum, he saw the red mark on Exquisite’s forehead open. A black and white eye appeared.\n\nThe Very High and Sky were the same. It didn’t surprise Han Sen that Exquisite had a third eye.\n\nExquisite’s third eye was different from the third eyes of the Sky, however. The third eye of each Sky was different depending on their elements and powers.\n\nExquisite’s third eye was a tai chi symbol.\n\nHer white and black eye was like a yin and yang fish. On the white part, there was a black dot. On the black part, there was a white dot. The yin and yang eye was spinning upon her forehead. When he gazed at it, Han Sen felt a sense of mystery within him, like this eye possessed all the answers in the universe.\n\nWhen the tai chi eye opened, Exquisite’s whole body started to change.\n\nAlthough Han Sen might have thought that Exquisite was just some snobby and cruel woman who cast disdain on the ordinary, he knew that her heart still had some humanity in it.\n\nBut right now, Exquisite didn’t look like a person. She looked like an emotionless machine.\n\nNo, she was scarier than a machine. At this moment, Exquisite was like someone who had combined with the universe, a machine that was as cold and uncaring as space itself. Exquisite’s movements felt like they were powered by the forces of nature.\n\nIf a King body was like someone pushing their powers as far as they could go, and Ancient God was power concentrated into a single creature, then Exquisite with her yin and yang tai chi eye was like the world’s law and order.\n\nHan Sen used his Dongxuan Sutra to observe her. He saw that Exquisite now looked like a universal cogwheel. She had become a part of the universe, a piece of machinery that was no longer a person.Han Sen frowned. His Dongxuan Sutra could only allow him to see the universal cogwheel’s connections. He couldn’t become a cogwheel himself like Exquisite was doing. His skill was totally different. If the universe was a car, the Dongxuan Sutra was like the person that was at the wheel. Now, Exquisite was acting as if she was a part of the car.\n\nHan Sen didn’t understand this. What Exquisite had done must be affecting her body.\n\n“Strike! I will grant you one hundred free attacks,” Exquisite calmly said as she looked on Han Sen.\n\nIf anyone else had said that, Han Sen would have thought it was a ruthless and arrogant taunt that dripped with pride. But hearing it from Exquisite’s mouth, it was like the soulless voice of a machine. Everything she said sounded like she was merely stating a fact.\n\nHan Sen didn’t mind, though. He used his water knife to strike. And Exquisite, meanwhile, showed no intention of blocking. She sat near the pond, looking calmly at Han Sen.\n\nWhen Han Sen’s attack reached Exquisite, the water in front of her became a knife to block Han Sen’s water blade.\n\nHan Sen furrowed his eyebrows in a deep frown. He kept on striking, pushing his Teeth Knife to the max. It didn’t matter how many times Han Sen attacked, though. Exquisite’s water knife was able to block each attempt.\n\nExquisite gave Han Sen the feeling that this was supposed to happen, and the water knife was supposed to be there. It was an unavoidable rule. It didn’t matter how many times Han Sen switched up his knife skill, he couldn’t land a hit."
}