{
    "chapter": 2399,
    "title": "The Raging Insect",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2399",
    "text": "“Dollar will die!” Dragon One could see that Han Sen was about to be swallowed by the weird insect.\n\nInstead of being sad for Han Sen, he was sad about what Han Sen’s death would mean for all of them. Even Han Sen, who could somehow nullify the air-restriction, couldn’t escape this monster. If Han Sen couldn’t escape, then it likely meant death for them all.\n\nDragon Eight, who was following Dragon One, also saw what was about to happen. He looked just as glum.\n\nBoom!\n\nIn the sky, the insect’s enormous mouth was closing around Han Sen. Its sharp teeth were about to clamp down on Han Sen’s body.\n\nDragon One and the others couldn’t bring themselves to look at the horrible sight. They turned their heads and continued running as hard as they could. They hoped they could find a place on Planet Dark Zone that wasn’t smothered by the air-restriction area. That was the only way they might be able to escape this hellhole.\n\nHan Sen’s body didn’t break because of the weird insect’s attack, though. He was still in super god spirit mode, so the creature’s incredible power was unable to touch him. While the weird insect’s teeth pierced through his body, they didn’t actually bring him any harm.\n\nHan Sen’s body was incorporeal now, rather like a ghost’s. He moved effortlessly through the weird insect’s teeth and flesh, and he was on the verge of escaping the creature’s body when he realized that he didn’t want to leave just yet. He turned around, heading deeper into the maw of the weird insect.\n\nThe hard bug shell and flesh couldn’t restrict Han Sen’s movement. He moved quickly through the insect’s entire body.\n\nBut Han Sen found that the inside of the creature was like jade. Even its organs and vessels had taken the texture of xenogeneic genes. There was no weakness to be found anywhere, so it would be hard for Han Sen to hurt the creature from the inside.\n\nBut Han Sen had found the beast’s xenogeneic core located in its brain. It was a green core that shone like the stars.\n\nTime passed. Han Sen’s super god spirit mode could last much longer now that he had reached King class. He couldn’t use it forever, but he could certainly last around half an hour.\n\nStaying close to the green deified core of the beast, Han Sen gathered up power in his hand to perform super spank. Once he built up sufficient power, he moved toward the green core.\n\nBzzt!\n\nThe substance chains went crazy under the impact of Han Sen’s hand. They were like rubber bands that couldn’t be broken.\n\nRoar!\n\nThe weird insect felt a sharp pain in its head, and so it roared. Its body hit the ground, then drilled deep inside. It decided to go for Dragon One.\n\nThe insect snapped up a Destroyed King, plunging through the man’s King area like it wasn’t even there. Blood splattered everywhere. It was like it had eaten a sheep, not a scary King.\n\nDragon One headed for the other side of the planet. He tried using every power at his disposal to fight back, but against that deified insect, all of his powers seemed to be useless.\n\nThe scariest thing about the creature was its King area. If they met an ordinary deified xenogeneic, Dragon One and the others could still make an easy escape.\n\nBut this weird insect’s area power not only restricted air travel, it stopped any powers being used in the atmosphere. Even using skills or items to teleport was impossible. They were trapped.\n\n“Run! Run for your life!” Dragon One and the others used all their various powers to try to escape, but the creature picked them off one by one. In the end, only Dragon One, Dragon Eight, Barr, and Dia Robber were left alive. They were injured, but they were still running.\n\nSomehow, they all started to work together. They knew that if they didn’t, they had no chance of surviving.\n\nThe bodies of Dragon Eight and Barr were special. They were almost immortal. That incredible power allowed them to escape some attacks and continue breathing.\n\nDragon One and Dia Robber were top-tier Kings. They were invincible when it came to fighting others of the King class, but attempting to deal with this scary deified was enough to leave them injured and bleeding.\n\nBoom!\n\nThe weird insect clamped its jaw around Barr’s leg, and Dia Robber took that moment to gather up three different types of power. He created a triangle composed of three different energies. Light blossomed inside that triangle, breaking space and shaking the air around it. The light shot forward, smacking right into the weird insect’s mouth. But the weird insect just swallowed the light, which disappeared harmlessly down its throat.\n\nDia Robber looked pale and hopeless. That was the strongest move he could conjure, but it hadn’t affected the weird insect in the least.\n\nThat insect wasn’t an ordinary deified monster. Its area power and the strength of its body both indicated that whatever it was, this creature was far better than an average deified xenogeneic.\n\nAlthough they hadn’t exhausted all of their strength yet, Dragon One and the others knew that if they could not escape the weird insect’s area, then they were sure to die.\n\n“This is bad. Why did we randomly encounter a xenogeneic with such a scary area?” Dragon Eight groused loudly as he ran.\n\nDragon One remained silent, though. He knew that complaining would help no one. He needed to last as long as he could, grasping every additional second that he could, in the hope that a miracle might save them. Maybe a new idea would occur to one of them, something that could help.\n\nDia Robber was of a similar mindset. In that place, no one could save them. Even if the deified elites of his race knew they were in danger, deifieds were not permitted access to the universal core area. Only King class beings were allowed to enter this place. You could not be one level higher nor one level lower.\n\n“If I am to die, I do not want to die fleeing,” Barr snarled with a furious look on his face. He turned around and sprinted towards the weird insect. His body blazed with a sword light.\n\nDia Robber started to stop him. But then he realized that with the situation they were currently in, no matter how hard they ran, they could not run far enough. Stopping Barr was pointless.\n\nBarr slashed the weird insect’s head, but the bone knife never made contact with the weird insect’s shell. The substance chains on its body caught the knife and crushed it.\n\nBarr’s hand touched the substance chains. His arm vanished in a cloud of fleshy scraps.\n\nThe weird insect opened its mouth to chase down the injured Barr. Barr couldn’t run any further, though, and he didn’t want to. He summoned his area power and used his left hand to punch the weird insect’s face.\n\nBarr’s powerful area was as weak as an eggshell before the brute force of the weird insect’s teeth. Barr’s King area shattered, and his body was bitten in half. The bitten section of his body disappeared down the creature’s gullet.\n\nAlthough Barr could respawn and gain strength each time, the process required his cells to be close by. Now that half of his body was swallowed and digested, he could no longer respawn.\n\nThe weird insect swung around, going for what was left of Barr’s body. Barr was still conscious, but the situation was hopeless.\n\nRoar!\n\nAs the weird bug came down to eat the other half of his body, Barr realized he was going to die. But then the bug suddenly squealed. Its body became straight and rigid, like it had been electrified.\n\nBarr and the others froze in place. They weren’t sure what was happening.\n\nBlergh!\n\nThe weird insect opened its mouth, then spewed out dark green blood like a fountain. The blood sprayed all over Barr."
}