{
    "chapter": 1895,
    "title": "Red Mist Spring",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1895",
    "text": "Han Sen quickly fell back as Black Cliff roared. His body was on fire, and he leaped towards Han Sen like a beast. He was shouting, “Knife Blank! My Knife Blank!”\n\nIn that precise moment, the meeting room was blown up by the power unleashed by Black Cliff. His Duke powers were scary to witness.\n\nMany people heard the commotion and came rushing toward them. Han Sen shouted, “Please stay away! Run, as far as you are able to!”\n\nHan Sen held onto the Knife Blank and also ran. The rabbit shoes were on his feet, and he headed out of the base.\n\nBlack Cliff was like a hungry beast as he ravenously pursued Han Sen. He summoned a big black hammer and swung it forward. The fire was like a living thing as it tore a big hole in the ground. The nearby houses were being smashed to pieces.\n\nLuckily, the rabbit shoes made Han Sen just as fast as Black Cliff. Han Sen made it out of the base, but he hadn’t gained enough of a lead to lose Black Cliff.\n\nBlack Cliff ran like a lunatic. He kept trying to smack Han Sen with the hammer. He wanted to smash Han Sen into nothing but bits and take the Knife Blank for himself.\n\n“King Jun, that *sshole! He is so obscene.” Han Sen knew that Black Cliff was not himself. The fire in his eyes was growing brighter, and he attacked without holding back.\n\nIt was fortunate Han Sen had the rabbit shoes; otherwise, he’d be mush right now.\n\n“Zero, contact Queen!” Han Sen shouted as he kept running. He was running towards the mountains, leading Black Cliff away from the base so he wouldn’t inadvertently destroy it.\n\nHan Sen couldn’t lose him, but he used his Dongxuan Movements to dodge each attack. He kept evading as he led the raging Rebate towards the Red Mist Valley.\n\nHan Sen could not fight Black Cliff. He needed Yisha to help, but god only knew how long it would take her to get here. So, he needed to find a way to buy himself some time. It’d be bad to suffer even a single strike.\n\nA random Duke class hit could be enough to break him to pieces.\n\nHan Sen guided Black Cliff towards the red mist, and in the meantime, Zero got in touch with Yisha. Yisha had the time to see her message.\n\n“What? This has really happened? Black Cliff did this?” After Yisha heard Zero explain the matters at hand, she frowned.\n\nShe could not believe he was willing to do such a thing.\n\nBut it was Han Sen’s subordinate that had contacted her, and she knew Zero wouldn’t lie. Yisha went quiet and quickly left for Planet Eclipse. She was soon at the base.\n\n“Where are Black Cliff and Han Sen?” Yisha asked with a frown.\n\n“Master was getting chased. He was leading the enemy off that way!” Zero pointed to Red Mist Valley.\n\nYisha did not delay. Like an act of teleportation, she instantly disappeared.\n\nYisha was in a major rush right now. If what Zero had told her was true, then there was a Duke chasing after Han Sen. It was difficult to gauge how long Han Sen might last in such a pursuit. He could have been whacked into jelly by now, already.\n\nYisha scanned the valley ahead, and what she saw shocked her.\n\nHan Sen was sitting on a rock outside the valley, singing.\n\n“Where is Black Cliff?” Yisha asked as she ran up to Han Sen.\n\n“In that valley,” Han Sen said, as he pointed down into it.\n\nHan Sen had drawn Black Cliff into the valley, and his pursuer had gotten lost in there. Han Sen was able to get back out and wait for Yisha’s arrival. Black Cliff was still down there.\n\nYisha looked into the valley with much confusion. Her face changed and she said, “A Red Mist Spring?”\n\n“Do you know what it is?” Han Sen asked Yisha.\n\nYisha looked at the red mist plaguing the valley and said, “It is a Red Mist Spring. I don’t know if it is good for you or bad for you, though.”\n\n“What is a Red Mist Spring?” Han Sen felt a chill hearing this, but he asked her for more info.\n\nThey had been in the valley searching for quite some time, last time they were there. There didn’t seem to be anything useful inside. They couldn’t find what was causing the mist, either. Even if there was a treasure, it seemed unlikely they could find it.\n\nNow hearing Yisha say this, it sounded as if it might not have been treasure that was inside there. It might have actually been something harmful.\n\nJust as Yisha was about to answer, Black Cliff came out of the clouds with a big hammer. After seeing Han Sen, he roared and swung towards him.\n\nYisha frowned. She could tell something was wrong with him, and she knew he wouldn’t behave like that in front of her.\n\nShe waved her hand and a purple mist came out. It cracked Black Cliff’s big hammer in an instant.\n\nBlack Cliff coughed up some blood. The hammer was his geno armament, and as soon as Yisha broke it, harm was delivered to his body. But even so, he still wanted to go after Han Sen and Han Sen alone. He was acting like a man possessed.\n\nYisha then hit Black Cliff himself with the purple mist. She didn’t want to kill him, though. All she wanted to do was knock him out.\n\n“We cannot let others learn about this spring. I will discuss this with you when I return.” Yisha told Han Sen that, then picked up the unconscious Black Cliff. After that, she warped away.\n\nHan Sen went back to the base. After what happened with Black Cliff, he knew he’d have to be more careful. King Jun was able to use Black Cliff to come after him, so it was clear he could assume the form of other people to get to Han Sen.\n\n“Having an association with a god is a bad thing, indeed. They are so powerful, but they won’t kill directly. Why is that? Maybe if I find out why, I can kill King Jun.” Han Sen retreated into thought.\n\nWhen it was nighttime, Han Sen sought rest. When he turned around, he saw Yisha standing right there. She had been behind him, and her sudden presence there scared him.\n\n“Queen, when did you get here?” Han Sen blinked.\n\nYisha smiled and said, “I just wanted to take a look at you. I almost don’t recognize you.”\n\n“Why? Why would you not recognize your student?” Han Sen smiled.\n\n“Under the threat of Black Cliffs pursuit, you managed to run so far and so fast without sustaining any damage. I don’t even think a Marquise could do such a thing.” Yisha squinted her eyes as she spoke.\n\n“You know, I have shoes that can give me speed. I’m weak in other talents, so I guess I’m just good when it comes to being speedy. These take me up to around Duke class, I think.” Han Sen said that, and then used his rabbit shoes to walk three meters.\n\nThat is a good item. It gives Barons the speed of a Duke. That is very rare. It is better than your holy item, even.” Yisha looked at the rabbit shoes as she spoke.\n\nHan Sen felt strange, all of a sudden. He was afraid Yisha might want to try them on. They were a beast soul, and Yisha couldn’t use them because she was not from the sanctuaries.\n\nFortunately, she was not interested in the rabbit shoes. She thought of something else and said, “Do you know what the Red Mist Spring is?”"
}