{
    "chapter": 1157,
    "title": "Digging Treasure",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1157",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nBecause the hole was not too far away from the nest of the Metal Eaters, Han Sen approached it with great care. The last thing he wanted to do was make them aware of his presence there.\n\nHan Sen wasn’t afraid of the Metal Eaters; he had just been caught with his pants down when he encountered them before. He had only expected there to be the baby Metal Eater and no others. They were fearsome foes, and he simply wanted to exercise caution.\n\nWith great care, he approached the hole. If he caught sight of them again, he’d shoot off back into the trees as quick as he could.\n\nFortunately, though, he didn’t see any of the creatures as he ventured towards the hole. He poked about its surrounding vicinity to ensure there weren’t any lurking about, either. All seemed good.\n\nHan Sen squatted down at the hole. The hole was around the size of a bowl, and he could not tell how deep it went. Due to the hole not being completely vertical, scanning what may have been down there was difficult.\n\n“Maybe I should just dig a hole of my own.” Han Sen summoned his Devil Pill and created a shovel. With that, he started to dig.\n\nThe soil was cumbersome to dig up, as there were many rocks to remove. Fortunately, Han Sen was a very strong man. He managed to dig a hole for himself that was five meters deep in no time at all.\n\nQuite the feat, considering the ground was mostly rocks beneath the thin layer of grass and soil.\n\nDong!\n\nHan Sen’s shovel struck something quite hard, and try as he might, he could not dig any further.\n\nHe was delighted at the discovery, and he knew that he had come across something remarkable.\n\nIf it was just a rock, his shovel would have cut through it. With the shovel unable to break more ground, Han Sen had reached treasure for sure.\n\nHan Sen quickly brushed away the soil, and soon after, a part of the item emerged. He froze when he saw it. It was actually rock, albeit one that seemed to be extremely well-polished—unnaturally so.\n\nThere was only a small part of it showing, so Han Sen got to digging out the rest. With the shovel, he began to remove the other stones and soil around it. This rock he had stumbled across was far bigger than he expected. It ended up taking him far longer to dig it up than he initially expected.\n\nThe rock looked as if its top and its bottom had been cut clean through, leaving it at a height of two meters.\n\nIts width, however, was easily ten meters. It looked as if it belonged to a part of something much bigger; when or what that was, however, was up for debate.\n\nWith nothing particularly remarkable about it, Han Sen thought to flip it over and see if he had missed something. The rock was not only surprisingly sturdy, it was surprisingly heavy, too. Try as he might, Han Sen could not lift it an inch.\n\nHan Sen opened nine of his Blood-Pulse Sutra gene locks, wiggled his fingers beneath the rock, and then tried to lift it.\n\n“Get up, you stupid rock!” Han Sen exclaimed.\n\nHan Sen’s face was as red as a beetroot, but he could not lift it more than a few inches. His body trembled with the effort he exerted in trying to lift it, but he ended up having to just let it go.\n\nWhen he dropped the rock back down, the ground all around quaked.\n\n“This has to be something good, right?” Han Sen wondered. He summoned Disloyal Knight and Golden Growler.\n\nHan Sen asked them both to help him lift the thing, all together.\n\n“One, two, three!” Han Sen shouted, before putting all his strength back into the trying task of lifting the rock alongside his companions.\n\nHe almost managed to flip it this time, but Han Sen got spooked by something most unnerving. It frightened him backwards, making him drop the rock back where it lay.\n\nThe small Metal Eater was directly below the rock he had been trying to lift, and it had been looking directly at Han Sen.\n\nHan Sen leaped out of the hole he had dug, wanting to get out of the area as quick as he possibly could. But he then realized he had not seen the other six Metal Eaters.\n\n“Why are you down there, squirt? It is dangerous for you to be out in the woods all alone. You should go home,” Han Sen said with a condescending tone of voice.\n\nThe Metal Eater simply wriggled out from underneath the rock and stared at Han Sen, not at all intimidated by him.\n\nWithout the adult Metal Eaters anywhere nearby, though, he did not yet want to leave.\n\nThe Metal Eater did not act aggressively towards Han Sen, at least. But just to be sure, he scanned the proximity and made sure there were no adults lurking nearby. Then, he summoned Meowth to stand outside the hole and serve as a lookout.\n\nHan Sen looked back down at the Metal Eater and told it, “Good kid. That’s right; don’t call out for Momma.”\n\nThe Metal Eater gave no response, so Han Sen jumped back down and returned to the rock so he could try lifting it up alongside Golden Growler and Disloyal Knight again.\n\n“One, two, three!” Han Sen shouted.\n\nThe trio were barely able to lift it, and it seemed as if the baby Metal Eater thought they were trying to play some sort of game. It joined in and tried helping them lift it.\n\nBoom!\n\nThe rock was lifted, and after it had been flipped, Han Sen noticed an engraving on the stone’s underside. When Han Sen wiped away the soil to get a proper look, he froze. On the big rock, two words had been engraved: “Person One.”\n\n“What does that mean? I am one person!” Han Sen was quite confused, to say the least.\n\nAs Han Sen examined it further, his face changed. The rock and the text looked familiar. Han Sen tried to remember where he had seen something like this before, and that’s when it hit him.\n\n“This must be it! The words are so similar,” Han Sen said, as he looked at the rock.\n\nHan Sen continued staring at the rock.\n\nHan Sen had been trapped in the Valley of Time for three years. In the valley, there was a broken stone, and it was one he had seen off-and-on for the duration of that painful time.\n\nHe was positive this rock was connected to the one back in that valley, and they looked as if they may have once been connected.\n\n“If this is a part of that rock, why would it be all the way out here? And what is the connection between this and the Empress Coin?” Han Sen frowned, with a headful of questions."
}