{
    "chapter": 2296,
    "title": "Can’t Stop You",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2296",
    "text": "Yisha and Han Sen returned to the base of the Ice Blue Knights, where they ran into Ice Blue Knight King. It was fairly obvious that he had been unable to navigate the palace maze, and had thus decided to return.\n\nWhen he saw Yisha and Han Sen come back together, Ice Blue Knight King’s eyes widened.\n\n“Knife! I am so glad to learn that you are still alive…” Ice Blue Knight King said, coming up to her.\n\n“I’m afraid that my survival might not be a good thing for you,” Yisha growled.\n\nIce Blue Knight King frowned. “Yisha, what makes you say that?”\n\n“I am alive. That means no one is allowed to bully my student. Do you understand now why that might not be a good thing? It would have been better for you if I had remained dead,” Yisha said, her voice as hard as stone.\n\nIce Blue Knight King fidgeted awkwardly, but he said, “I was just doing my job! I had no choice in the matter. There were some things I just had to do.”\n\n“I don’t care about your job. Let me ask you something: did you drag my student into the Ice Blue Knights by force? Against his will?”\n\nYisha stared at Ice Blue Knight King as she spoke.\n\nIce Blue Knight King looked glum, and he admitted, “Yes.”\n\n“Were you the one who captured him?” Yisha asked.\n\n“Yes,” Ice Blue Knight King said.\n\n“If you were unable to look after him, why would you drag my student all the way out here? Is that how you manage the Ice Blue Knights?” Yisha hissed.\n\nIce Blue Knight King could not speak. His face turned red.\n\nAnother Ice Blue Knight who was accompanying Ice Blue Knight King stepped forward to angrily tell her off. “Knife, don’t be so rude. You are a member of the Ice Blue Knights yourself! How can you speak like that to your captain?”\n\n“From now on, I have no affiliation with the Ice Blue Knights. It’s over.” Yisha looked at them all with disdain.\n\nIce Blue Knight King frowned and said, “Knife, I understand the reasons for this mood of yours, but there are some things you can’t just say. I will pretend I did not hear what you just said. If you want to talk, we can do so later and in private.”\n\n“There is nothing more for us to talk about. Let’s go, Han Sen.” Yisha turned around to leave.\n\n“Knife! Don’t be ridiculous. The Ice Blue Knights have rules. You are a member of the Ice Blue Knights, and you were born to be an Ice Blue Knight. Furthermore, you will one day die on behalf of the Ice Blue Knights. The Ice Blue Knights would never permit one of their members to turn traitor, and furthermore, the Extreme King would not allow…” Ice Blue Knight King trailed off, a shocked look crossing his face.\n\nYisha’s body had filled with purple air. Like a demon, she covered the entirety of the Ice Blue Knight base with her power. Suddenly, everyone in the base looked very pale. The weight of her suppression lay on them so heavily that they could barely stand.\n\n“Deified… You became deified.” Ice Blue Knight King and all the other Ice Blue Knights were stunned.\n\n“I’m sorry. Do you mind repeating what you were telling me again?” Yisha turned an unyielding gaze on Ice Blue Knight King and the others. The King class Ice Blue Knights had all turned pale. No one dared look Yisha in the eyes now.\n\nIce Blue Knight King had also paled, and a series of emotions crossed his face, too quickly to recognize. He ultimately sighed, and said, “I have my own reasons to want you to stay, but since you are already deified, I suppose the Ice Blue Knights don’t stand a chance in keeping you here. In that case, I give you permission to leave.”\n\nYisha did not look at Ice Blue Knight King. She took Han Sen with her and departed the Ice Blue Knight base.\n\n“My Queen, that was awesome. Those Ice Blue Knights all looked so cocky, but they were ready to pee themselves before your glory,” Han Sen told her as he piloted the white whale away from the base.\n\nAfter Yisha and Han Sen departed the Ice Blue Knights, they used the big white whale to travel through space. They were headed back to Narrow Moon.\n\nYisha was holding Bao’er. She fed Bao’er pieces of fruit as she spoke. “The ten sets of knights of the Extreme King. They all sound so powerful. They inspire fear across the geno universe, spreading the belief that every knight has the power to destroy a race. But inside the Extreme King, the knights are still just pawns. They do the dirty work and little more. They aren’t given important missions. If any of the members of the knights manage to become deified, they are permitted to leave. They are no longer bound to the knights. This is a rule of the Extreme Kings. Ice Blue Knight King could not have fought against that.”\n\n“A powerful regiment of knights like the Ice Blue Knights are still only considered pawns?” Han Sen was shocked to hear this.\n\n“They don’t have any deified members. If you think that is the primary army of the Extreme King, you are profoundly underestimating their might.” Yisha smiled, then went on to say, “The primary army of the Extreme King is composed of the Royal Knights. They only recruit pure members of the Extreme King, however. And all entrants have to be at least King class. They have very high requirements when it comes to having the right blood and background.”\n\n“Aside from the Royal Knights, the Extreme King have many other organizations as well. Most of those are simply less famous. The Extreme King are so strong that very few races are able to compete with them. Even higher races like Sky Palace wouldn’t stand a chance against the Extreme King in a fight. They rely on the power of the Very High to make the Extreme King avoid them. That’s the only reason that the Extreme King have never touched Sky Palace.”\n\n“I see.” Han Sen did not understand how the Extreme King worked. He thought for a minute, then asked, “Then what is Narrow Moon to the Extreme King?”\n\n“We do not belong to anyone.” Yisha sighed, and then said, “I told you before. Our elder was a servant of Hell King at one point, but Hell King’s time has long since past. Now, the ruler of the Extreme King is known as White King. Narrow Moon has never had a deified member before. But becoming deified would change little for Rebate politics; a Rebate would never be considered pure of race, and so they could never choose a side. They would be puppets.”\n\n“As long as my queen is here, the Rebate will become one of the most famous high races in the entire universe.” Han Sen was quick to lick her boots. Yisha was his biggest supporter. The safety and security of Han Sen and his friends and family all depended on Yisha.\n\nYisha rolled her eyes. “Tell me what happened in Narrow Moon.”\n\nHan Sen told her about everything that had transpired in Narrow Moon. He did not exaggerate anything, but even so, Yisha’s face darkened after hearing it all.\n\n“They divided up all of my possessions? They were cruel to my one and only student? They are all such rotten bullies.”\n\nHan Sen’s heart felt touched. If she was saying things like that, then that meant he really was quite important to her.\n\n“It is okay that they bullied my student, but they stole my palace and dirtied up all my things. I cannot allow this,” Yisha said angrily.\n\nHan Sen was touched before, but now he was speechless. He rubbed his nose and said, “Yeah! You cannot allow that. You are going to have to teach them all a lesson.”"
}