{
    "chapter": 969,
    "title": "One in a Ten Million Chance",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_969",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nAs the days went by, the purple orchid matured. Its flowers spread open like purple butterflies, and they released a most glorious scent.\n\nThorn Baron confirmed that they were mature, and so Han Sen promptly put one in his mouth. An incredibly sweet nectar bathed his tongue in delightful ecstasy.\n\n“Sacred-Blood Purple-Butterfly Orchid Consumed: Sacred-Blood Geno Points +1.”\n\nHan Sen was more than ecstatic, so he collected the rest and stuffed his mouth with them. By the time he was done, he had obtained seven geno points.\n\nThorn Baron looked at the plants with shock, almost unable to fathom how the plants had all survived their uprooting from the garden.\n\nShe found it even more difficult to believe how healthy the Flying Mushroom had become, and how it was actually growing bigger.\n\n“How did you make this thing grow?” Thorn Baron asked.\n\n“Oh, it’s just a little something that is derived from human knowledge. But tell me, what are the chances a royal spirit will become a king spirit following the consumption of this mushroom?” Han Sen enquired.\n\n“It is somewhere in the realm of one to ten million,” Thorn Baron answered.\n\n“You might as well have just told me there’s zero chance.” Han Sen frowned.\n\n“Even king spirit parents are not guaranteed to have a baby king spirit offspring. Believe it or not, these chances are actually decent,” Thorn Baron said.\n\n“You are a royal spirit, but you should have the genes of a king spirit. Will you have a higher chance of becoming a king spirit?” Han Sen asked.\n\n“Are you suggesting you might give it to me?” Thorn Baron asked, with a sudden perking of her mood.\n\n“Yes. There isn’t much point in me keeping it,” Han Sen coldly said.\n\nHan Sen wanted to give it to the spirit with the greatest chance, and he thought Thorn Baron would be the best choice.\n\n“I’m not sure the chance would increase, though.” Thorn Baron sighed.\n\n“Well, we’ll wait and see. There’s still a while to go before it has fully matured.” Han Sen quite liked her, and she had always been honest. That was a big plus in his books.\n\nMoment Queen returned from her hunt with Dragon-Blood Snake. They brought the carcasses of six mutant class creatures back with them, which, after consumption, provided Han Sen an additional thirty-five mutant geno points.\n\nHan Sen allowed Moment Queen to remain in the shelter after that, and he himself went out to hunt next. Bao’er’s gourd was good, but the creatures it absorbed seemed to disappear forever. Because of that, he did not take her with him.\n\nThe white bear was still accompanying Bao’er on a day-to-day basis, and he had swiftly become her favorite toy.\n\nHan Sen took a vial of the bear’s blood with him, in case he need it later for the hunt.\n\nHan Sen had long since stopped the movement of the shelter, which allowed the people to become familiar with the surrounding terrain.\n\nAnd on this hunt, Han Sen decided to head west.\n\nThere weren’t many insects left in the vicinity, due to Bao’er’s gourd absorbing much of the population. To find more, he had to walk an additional fifty miles.\n\nTo make the traversal easier, Han Sen rode his Dragon-Blood Snake. And soon after the fifty-mile mark, he did indeed start to stumble across creatures.\n\nThe first thing he found was a Tank Ant nest. He stopped right next to it.\n\nHan Sen took out a metal straw and placed it on the corpse of a dead iron bug. Then he went into hiding.\n\nNot long after, a few Tank Ants came marching out of their nest.\n\nTheir names were quite misleading, as “Tank Ant” belied their relatively frail nature. They were red, and they were about the size of an average fist. Their shells were tough, but that was just part of dealing with ants. But regardless, they waltzed out and went straight up to the iron-bug bait.\n\nHan Sen did not use much blood, so it was only enough to attract a few ants. This was exactly what he desired, and after the ants had arrived at the dead bug, Han Sen loosed an arrow at one of the suckers.\n\nPat!\n\nThe flaming arrow tore right through the body of the targeted Tank Ant.\n\n“Mutant Creature Hunted Tank Ant killed. No beast soul gained. Consume its flesh to gain zero to ten mutant geno points randomly.”\n\nThe Tank Ants had come out of their hole one-by-one, in single file.\n\nHan Sen did not decide to hunt these Tank Ants because they could provide him with decent beast souls.\n\nHe hunted them because of their nature. They always lived together, and what’s more, most of the ants inside that particular ant hill were mutant class.\n\nThey were so small, Han Sen would be able to eat them quickly and increase his mutant geno point tally at a rapid pace.\n\nThe Tank Ants were very dumb, too. Even if the ants ahead of them had been killed, they fearlessly continued their single-file march.\n\nHan Sen was overjoyed, being able to kill them in such a hassle-free manner.\n\nIt was an easy task, overall, and their mindlessness made it a simple affair.\n\nThe strongest Tank Ant Han Sen detected had only opened three of its gene locks. But with its waist as a weakness like all the rest, it was still incredibly easy to kill.\n\nAfter killing twenty of them, Han Sen received a beast soul.\n\nEventually, though, the smell of blood faded. And when it had all disappeared, no more ants came to the surface.\n\nPicking up the bodies of the ones he had slain, Han Sen removed their shells and built a campfire in which he could cook them.\n\n“Ah, this is good.” Han Sen ate one and found that it tasted wonderful. The meat was crisp and surprisingly sweet.\n\n“Mutant Tank Ant Consumed, Mutant Geno Points +1.”\n\n“Just a little salt is all that’s needed for this delicious meat.” As Han Sen ate, though, he felt something was amiss. He was unnerved, and so he turned to scan the environment around him. Then, he caught sight of two red eyes staring at him from a nearby bush.\n\nQuickly, he became alert. With his skills and experience, Han Sen should have known something was watching him far sooner. Whatever was watching him, it wasn’t any old creature."
}