{
    "chapter": 2695,
    "title": "Trapped Inside the Jail Demon Hall",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2695",
    "text": "The talons of the Red Blood Demon tore through Han Sen’s body, and it exploded like a water balloon.\n\nThe next second, the water that had separated began to gather up again. It reformed Han Sen’s face, but before the water finished reconstituting Han Sen’s body, the creature spread its claws again. Once more, it swung at Han Sen. The red substance chains that went with the attack erupted like a volcano.\n\nHan Sen was shocked. He had used his Original Water King Body to escape that first strike, but right now, his body still hadn’t coalesced. If he was hit again, all of his cells that had been turned into water would become nothing. Even the Original Water King Body wouldn’t resurrect him a second time.\n\nHan Sen could no longer afford to hesitate. In a moment, his body glowed pure white as he entered his super god spirit mode. The volcanic-looking red substance chains went right through him, passing harmlessly through his shadow.\n\nBut just as Han Sen started using his super god spirit body, some strange power knocked him back out of it. He was back to his usual self in no time at all.\n\nHan Sen’s stomach sank. With Wan’er still inside his Destiny’s Tower, his super god spirit mode had been severely downgraded. Again, it had been canceled before he could use it to finish a fight.\n\nThe Red Blood Demon didn’t give Han Sen any time to think. Its body became a crimson shadow that went straight for him again. It was like a real demon, and it moved toward him too fast for his eyes to follow.\n\nHan Sen teleported away, regardless. Because he wasn’t trying to escape Jail Demon Hall, he didn’t trigger the building’s restrictions.\n\nBut by the time Han Sen had teleported away, an evil smile had already crossed the Red Blood Demon’s strange face. Again, it appeared directly in front of Han Sen. Five red clawed fingers reached forward to shred his heart.\n\nHan Sen’s eye flashed red. That red color spread across his body, and then he simply disappeared. He went straight into the Red Blood Demon’s eye.\n\nHan Sen had been pushed far enough that he had no choice but to use his Blood Eye Evil God’s beast soul. With the eye skill, he entered the Red Blood Demon’s eye.\n\nDoing this might allow Exquisite and Li Keer to suss out the secrets of beast souls, but he had no choice. He couldn’t let the Red Blood Demon kill him just to keep his secrets.\n\nIn the Red Blood Demon’s eyes, Han Sen’s surroundings were pure red. It was completely different from the eyes Han Sen had entered before.\n\nHan Sen felt a bit relieved, for a moment. Just as he thought he had escaped all of the danger, he saw the redness around him begin to boil. The power rose up around him like scary flames of blood. That power carried a scary presence, and it turned the whole of the eye-world into a flaming red sea.\n\nHan Sen could feel the power inside the bloody flames. He didn’t dare stay there any longer. He teleported out of the Red Blood Demon’s eyes.\n\n“This guy is too much for me to deal with!” As soon as Han Sen teleported out, the Red Blood Demon was coming for him with its red substance chains lashing around. It reached Han Sen in an instant.\n\nHan Sen’s purple eye began to spin as he used the Purple-Eye Butterfly beast soul to trace the movements of the Red Blood Demon.\n\nHe used the power of all the beast souls he had, without hesitation. He used Move Mountain Area’s area beast soul and even his own Dongxuan Area. He used Jadeskin, the Blood-Pulse Sutra, and more. He used everything he could to repel the monster. He pushed all of his powers to the max.\n\nAside from the peacock king soul robe that couldn’t be worn in tandem with the Apollo Set, Han Sen used every beast soul he had at his disposal.\n\nEven so, Han Sen’s power and speed were unable to close the gap between him and the Red Blood Demon. He used his formation and judgment powers to their full potential, and he barely dodged the next attack.\n\nKatcha!\n\nWhen the Red Blood Demon attacked for the third time, it was already too late for Han Sen to avoid. The red substance chain brushed right by his ribs. Three of his rib bones snapped instantly, and his flesh was torn through.\n\n“I have to fight for my life again!” Han Sen’s mind was still calm at that moment, though.\n\nThinking too much about things wasn’t going to help him now. He needed to calm down. He used the full potential of every power he could to battle the beast. He had to stall for as much time as possible, all so he could be saved.\n\n“Jail Demon Hall has some kind of isolation protocol? The Very High must know about this, surely. I need to keep going until the Very High come. Then I can be saved.” Han Sen tried to comfort himself.\n\nBut Han Sen had forgotten one thing. Outer Sky was way too big, and there weren’t many of the Very High. Jail Demon Hall was far away from where most of the Very High lived. It was in the middle of nowhere, and there was usually no reason for anyone to visit. If the Very High noticed there something amiss, it would still take them half an hour to get there. It might even take them longer than that. Han Sen didn’t know if he could even last that long.\n\nAt this time, Liyu Zhen and Li Xue Cheng had been focusing their attention on Jail Demon Hall. When they saw Jail Demon Hall’s door suppress the Red Demon Beast’s light, they knew that their plan had succeeded. The Red Blood Demon had already gone mad with rage and triggered the defensive properties of its prison. They had trapped Han Sen inside with the infuriated Red Blood Demon.\n\n“The guy in charge of Jail Demon Hall won’t be able to get here for at least half an hour. And half an hour from now, I don’t think there will be anything of Han Sen left to save,” Liyu Zhen said with a cold laugh.\n\nLi Xue Cheng looked at Liyu Zhen and asked, “Is the warehouse okay?”\n\n“Don’t worry. Everything is fine. The healing geno fluids Han Sen always used are all gone. The warehouse only has the recommended, superior healing geno fluids left. No one will know that a geno fluid can trigger the Red Demon Blood’s power. Even if they found out it was the Blood Marrow Geno Fluid that triggered the Red Blood Demon’s rage, they couldn’t blame me. It would just be an unfortunate event, caused by no one but himself.”\n\n“That is great,” Li Xue Cheng said with relief. He smiled and went on to say, “Exquisite just gave him some geno fluids, too. She won’t be here for another two days, at least. He is very dead this time. He is such a genius. It is a shame he has to die. But no one asked him to be our enemy.”\n\nExquisite and Li Keer were practicing Under the Sky, trying to employ Han Sen’s experience to their advantage.\n\nAll of a sudden, both of their phones rang at the same time. They saw the number, and it shocked them.\n\n“Why is the Inspection Department calling us?” Li Keer asked with confusion. She quickly answered her phone.\n\nIt didn’t take long for Li Keer and Exquisite’s faces to change. Li Keer screamed, “What? Jail Demon Hall’s restrictions have been triggered?”\n\nBecause Jail Demon Hall’s restriction powers had been activated, they had no way of learning what was going on inside, either. All of their scrying powers had been cut off due to the hall’s defenses. So, right now, even the Inspection Department couldn’t tell what was happening inside the hall. They had already sent out an agent.\n\nWhen they found out who was in charge of Han Sen’s challenge to the Red Blood Demon, they contacted Exquisite and Li Keer. They asked if the two women knew if Han Sen was inside, because the restrictions had been triggered ten minutes before.\n\n“It is over…” Exquisite and Li Keer felt cold. Only Han Sen had permission to hunt inside that hall, so he was the only person inside. If the Red Blood Demon had triggered the defenses, Han Sen was probably the reason that it had done so.\n\nAfter the two of them spoke to the Inspection Department, they used God’s Wander to travel to Jail Demon Hall. They prayed Han Sen wasn’t inside.\n\nBut the closer they got to Jail Demon Hall, the colder they felt. That was because they couldn’t sense their connection with Han Sen. Something was smothering their ability to feel what he was feeling. There weren’t many powers that could sever their connection with Han Sen. The power that bound the true god xenogeneic within Jail Demon Hall was one of the only things that could. There was an 80% to 90% chance that Han Sen was trapped inside Jail Demon Hall. He could even be dead already."
}