{
    "chapter": 394,
    "title": "Solo Show",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_394",
    "text": "Broken buildings and damaged bodies were everywhere. People were crying and shouting.\n\nThose who could fight in Steel Armor Shelter, no matter which gang they were from, had all joined the fight. No one wanted to see Steel Armor Shelter ruined. If they lost their own room, which was their safe space, everything would become difficult for them in God's Sanctuary.\n\nEspecially for the large gangs and merchants, losing their rooms meant the loss of a safe warehouse or transition space, which would cost tremendous damages.\n\nMany precious items were stored in the rooms. If ruined by the golden growler, many people would become poor overnight. Numerous arrows flew to the golden growler like a shower, which did absolutely no harm to the creature. In the eyes of the golden growler, the attack was like drizzle.\n\nEven Little Finger who was already a first-class fighter in First God's Sanctuary could not even hurt the golden growler with a sacred-blood weapon. When hundreds of different weapons cut on the golden growler, the creature could simply shake its body to get rid of both the weapons and their owners. The golden growler was like a monster from hell, crushing and smashing everything in its way. Whoever happened to be standing under its paw would become a pool of mud immediately.\n\nBlood flowed and became a river.\n\nIt looks like apocalypse in Steel Armor Shelter. With the screaming and howling, one would have goosebumps even it was noon.\n\n\"Retreat… Retreat…\" Little Finger ordered everyone to retreat. It was not because he did not want to buy more time for the merchants and ladies who did not have much ability to fight, but because he could no longer keep fighting. In a short amount of time, the Fist Gang had already lost a few core members.\n\nThe situation of Steel Armor Gang and the Disciples was not any better than the Fist Gang. Plus, Steel Armor Gang had suffered the most loss.\n\nMany members of the Steel Armor Gang were military school students. The education they received gave them more courage to sacrifice themselves. However, no matter how brave they were, it was simply useless in front of golden growler.\n\nThe blood made people's hearts tremble, and deaths brought despair.\n\nAt this point, even if the steel armor gang wanted to retreat, it would be too late, given how fast the golden growler was. Its giant body did not affect its speed. If no one could distract the creature, none could run away from it.\n\nThe Steel Armor Gang had become the last line of defense. As the members were becoming desperate and about to make suicidal attacks, they suddenly saw the murderous golden lion stop.\n\nEveryone was dazed. The golden lion raised its head, staring into the sky, and had an angry look on its face.\n\n\"What could possibly cause the anger of such a frightening creature?\" Everyone followed the golden lion's sight and became dumbstruck.\n\nA monster in jade armor fell from the sky. Although it was much smaller than the golden lion, it looked even more vicious.\n\nOn the back of the armored beast stood a man with golden hair and red armor, who looked like Apollo.\n\n\"Han Sen…\" Many people who knew Han Sen couldn't help but yelp.\n\nAs people were taken aback, the golden lion suddenly roared and jumped into the air, throwing itself at the golden rock worm king.\n\nSeeing the look in the golden growler's eyes, Han Sen knew that the creature had recognized himself. The lion's eyes were filled with hatred. Han Sen was sure the creature wanted to rip himself apart.\n\n\"Let's finish everything here and now.\" Han Sen gripped the cursed wolf dagger in his hand, staring at the golden growler.\n\nBoom!\n\nThe golden growler clashed with the transformed golden rock worm king. Although the worm king was just about one tenth the size of golden growler, it did not back off after the clash. The eight sharp claws dug deep into the fur of the golden growler.\n\nRoar!\n\nThe golden growler felt the pain and howled. Its paw hit the golden rock worm king, knocking the worm away, which then caused several buildings to collapse.\n\nThe moment the golden growler laid its paw on the rock worm king, Han Sen's heart started to thump like a running engine, almost jumping out of his chest.\n\nQi and blood quickly rushed into Han Sen's body, making him burn with explosive energy.\n\nThe cursed wolf dagger almost became one with Han Sen and went toward an eye of the golden growler.\n\nPreviously, Han Sen could not even break the eyes of the baby golden growler. However, Han Sen had become much stronger. With the super beast soul cursed wolf dagger in his hand, Han Sen was not who he used to be.\n\nThe dagger was stabbed into the eye of the golden growler hard, as if it was stabbed into rubber. Han Sen used all he got and pushed the dagger inward.\n\n\"Roar!\" As blood flowed, the golden growler howled, trying to hit Han Sen with its forepaw.\n\nThe moment Han Sen pierced the golden eye, he had already kicked the golden growler's face in order to retreat. When he was in the air, the worm king threw itself under Han Sen's feet, helping its master avoid the golden growler's paw.\n\nWith a bleeding eye, the golden growler had incredible hatred in its only eye left. With a roar, it quickly hit Han Sen and the golden rock worm king again at an incredible speed.\n\nHan Sen looked cold. Stepping on the golden rock worm king's back, he dodged the paw and stabbed at its other eye.\n\nWhen the golden growler tried to take its paw back to hit Han Sen, the rock worm king had already dug its claws into the lion's paw, its tail piercing its fur, making the golden growler scream.\n\nHan Sen threw himself at the lion, piercing the other eye of the golden growler. Blood suddenly colored the golden eye red.\n\nRoar!\n\nGrowling continuously, the golden growler quickly rushed toward a direction, knocking down countless buildings. It eventually broke out of the shelter and ran away.\n\nWatching golden growler leaving embarrassed, loud cheers exploded in the shelter. Many were shouting Han Sen's name.\n\nHowever, Han Sen had no time to respond. Standing on the back of the golden rock worm king, Han Sen quickly chased after the golden growler. This time, he will not let the creature off the hook again."
}