{
    "chapter": 2942,
    "title": "Qin Xiu",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2942",
    "text": "It did not just look like one. It really did come alive. The statue’s eyes were lively, and the body turned soft. She stood up and looked at everyone in the pavilion. Nine Thousand King watched as the jade statue was revived. His body shook. He did not look powerful anymore. The light of the battle armor quickly disappeared. The eye closed tightly. There was a thud as he kneeled in front of the revived statue. His head touched the floor. He did not dare raise his head as he said, “Servant Number 9 is greeting Miss Wan’er. Do you remember Number 9, Miss Wan’er?”\n\nHan Sen thought, “This old man Nine Thousand King knew Sacred Leader’s sister was called Wan’er and he did not tell me.”\n\nThe statue saw Nine Thousand King, who was terrified on the floor, shivering with fear and not daring to raise his head. She raised the cup in her hand and drank all the wine it contained.\n\n“Number 9, was that you who wanted to break the statue?” After the statue drank the wine, it started to speak. It was not the voice of a female like Wan’er. It was the voice of a man.\n\nWhen Nine Thousand King heard the voice, he raised his head. He was scared. His eyes opened wide. He looked at the statue like he was looking at a ghost. He only took one small glimpse. Nine Thousand King immediately slapped his own face and said, “It is my fault. I am a bad servant. I should die.”\n\nHan Sen, who was standing nearby and seeing all of this, was frozen. Nine Thousand King was not joking. He was really slapping himself terribly hard. His cheekbones were breaking. In just a few slaps, he was already covered in blood. Nine Thousand King kept on hitting himself. He kept on hitting himself hard. It was hard enough to be considered a form of suicide.\n\nThe jade statue did not watch Nine Thousand King, who was in the middle of slapping himself to death. He looked at Han Sen. It made Han Sen feel a chill, so he secretly gathered up power. When he heard Nine Thousand King speak after the statue came alive, he felt as if it was embodying Sacred Leader.\n\nThe statue looked at Han Sen and smiled as it asked, “What is your name?”\n\nAlthough his body looked like Wan’er, his power was too outstanding. One sensed that he was a very gentle man. One would not have thought he was a woman.\n\n“Crystallizer Han Sen. What is your name?” Han Sen thought that person was not hostile, but he did not underestimate him either. He remained in a state of caution.\n\n“Name. That is a distant memory. I have almost forgotten.” The man laughed. After a seriously long think, he said, “My name is Qin Xiu. I am the King Kingdom’s king. Xiu means fixing the country and keeping the peace.”\n\nBefore Han Sen could say anything, Qin Xiu was talking to Han Sen again. “Can you share a few cups with me?”\n\nQin Xiu sat down in the pavilion. He picked up the bottle and poured two cups of wine. He raised one of them.\n\n“If you do not mind, I am willing to join you.” Han Sen spoke as he walked into the pavilion. He sat down next to him. He raised the cup that Qin Xiu had poured.\n\nWhile they were talking, Nine Thousand King was still slapping his face. He did not dare stop, but he looked confused.\n\nHe was not able to confirm that the man who had been revived through the statue was his master. He also did not know if the man he served had truly come back to life or if this was some sort of shadow copy.\n\nNo matter who he was, Nine Thousand King did not dare slow down. People like Sacred Leader, even if he only had a sliver of life, he could not disrespect him.\n\nThe master had invited Han Sen for a drink. Nine Thousand King could not believe that this situation was happening. Although Han Sen was a strange character, compared to his master, Nine Thousand King thought Han Sen was not even worth one of his hairs.\n\nIn the universe back then, only God knew how many scary elites found themselves in the position of a servant before the glory of Sacred Leader. Very few God Spirits were able to share a drink with Sacred Leader. Now, Sacred Leader was drinking with Han Sen. He also had addressed Han Sen by his name. Nine Thousand King was in total disbelief.\n\n“In that universe, whoever was worth the leader addressing them by their name was almighty. Does Han Sen really have what it takes?” Nine Thousand King was shocked.\n\nQin Xiu raised his wine cup and said, “Cheers, my friend.”\n\n“Why go cheers with me?” Han Sen was confused. He looked at Qin Xiu. It did not matter if this was Sacred Leader reborn or not, but there was a problem with his attitude.\n\n“Has he seen the relationship between me and Wan’er?” Han Sen thought.\n\nQin Xiu laughed and did not answer. He drank all the wine in his cup and said, “Back then, I made this holy garden and cut it out from space. I had it stop and remained fixed in a certain place in time. I made the holy garden cycle every hour. Here, you will never get old, and you will never die. This is a place in which you can live forever.”\n\n“Qin Xiu really is Sacred Leader,” Han Sen thought.\n\nQin Xiu looked at the holy garden and sighed, “I wanted to keep Wan’er here so she could live forever. She could watch her favorite views, eat her favorite meat, and drink her favorite wine. She told me she would rather die than live in an endless loop.”\n\nQin Xiu poured out some wine and drank it all. He closed his eyes. It looked as if he was trying his best to enjoy it. He was remembering the person he used to love it.\n\n“So, I cut the Holy Kirin’s horn off to make a statue of her. If her soul was inside this statue, she could live forever and would still have her memories. She would just be unable to leave this holy garden.” He put down the cup, smiled, and said, “But Wan’er said told me it was like being put in prison. She defied my wishes for her.”\n\nHan Sen found this interesting, so he asked, “And then?”\n\nQin Xiu looked like he was smiling, but he was not smiling. He did not answer Han Sen’s question. He poured himself some wine and looked at the cup of wine in Han Sen’s hand.\n\nHan Sen was fascinated by hearing the tale, so he had forgotten to drink the wine. He quickly necked it down.\n\nQin Xiu was holding the wine bottle. He poured out another drink for Han Sen. He raised his cup and said, “I will cheer you again.”\n\nThis time, Han Sen did not ask why. He knew that Qin Xiu must have known Wan’er was being carried by him in some way. Otherwise, Sacred Leader Qin Xiu would likely not say cheers to a guy he did not even know.\n\nNine Thousand King, who was kneeling outside the pavilion, was frozen. To be cheered by Sacred Leader—in that sky, on that ground, in that life, in that world—was something he had only ever seen performed to Han Sen."
}