{
    "chapter": 2637,
    "title": "Bao’er’s Little Book",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_2637",
    "text": "Han Sen eventually agreed to accept the Wood Spirit Rhino in exchange for helping Yu Kun slay a deified xenogeneic.\n\nYu Kun had carried the Wood Spirit Rhino for hundreds of years. He had never been able to understand what was inside it, and after losing hope of ever learning its secrets, he was finally willing to use it as payment for Han Sen to help him slay a deified xenogeneic.\n\nIf Yu Kun obtained a deified’s xenogeneic gene, he could use it to help him become deified. Keeping the Wood Spirit Rhino as a mere ornament would be useless.\n\nHe wanted to give it to his heir, but his only son had died in an accident. No one else was able to carry on his legacy. “What a poor man,” Han Sen thought, playing distractedly with the Wood Spirit Rhino. Yu Kun had already given Han Sen the Wood Spirit Rhino; it was his whether they succeeded or not.\n\nHan Sen’s personality was a little strange. If someone was trying to trick him, then he wouldn’t let them get away with it no matter how bad the situation was. But for someone like Yu Kun, who was willing to pay up-front, Han Sen would help him no matter the cost.\n\nThe Wood Spirit Rhino was very beautiful. It gleamed like jade. Although it was made of wood, it was heavier than a lump of gold.\n\nThe strange thing was, Han Sen was unable to discern the Wood Spirit Rhino’s power even though he was holding it. It seemed like an ordinary wood carving. It didn’t look like a piece of butterfly-class wood.\n\nHan Sen didn’t think Yu Kun had given him a fake item, and that was because he had tested it. He tried his hardest to destroy the little statue, but it didn’t buckle and break. That was verification of its deified status. But despite its resilience and beautifully polished surface, it didn’t have a strong presence.\n\n“Does that mean the Wood Spirit Rhino doesn’t have power? Is it merely the secrets within that hold its strength? If I can open and learn its secrets, can I gain access to the power myself?” Han Sen kept wondering. He stared at the Wood Rhino Spirit.\n\nThe Wood Spirit Rhino’s carving appeared so alive, but there was no text or symbols on it. There was no semblance of a mind left behind. Han Sen prodded it a few times and used his Dongxuan Area and the Purple-Eye Butterfly to examine it. He was unable to find out anything tricky about it.\n\nNo matter how he viewed it, it was an ordinary miniature rhino carved out of wood through no extraordinary means. Aside from the material used, he could not discern anything special about the thing.\n\nAs Han Sen was investigating the Wood Spirit Rhine, Bao’er had somehow managed to climb onto his back. Her head was next to Han Sen’s shoulder, and she stared at the Wood Spirit Rhino in his hands.\n\n“Daddy, what are you holding?”\n\n“This wooden statue has a secret in it, but I can’t tell what it is,” Han Sen said.\n\n“Let Bao’er see it.” Bao’er jumped down onto Han Sen’s chest and stole the Wood Spirit Rhino out of his grip. Her little hand started to shake the Wood Spirit Rhino.\n\nThen, suddenly, Han Sen noticed a yellow gleam like moonlight shining in the eyes of the wooden item. The light projected onto the wall, revealing some text.\n\n“Bao’er, how did you do that?” Han Sen asked in delighted surprise. He had been watching her the whole time, but he didn’t know how she had managed to summon the light coming out of the Wood Spirit Rhino’s eyes.\n\nBao’er had only touched the Wood Spirit Rhino for a second or two, and Han Sen had watched the position of her hands at the time. He tried replicating the move she had made, but he was unable to make the statue light up.\n\n“It is so easy. Just pat it on the head,” Bao’er said as she patted the Wood Spirit Rhino’s head. With that, the light in its eyes suddenly disappeared.\n\n“Let me try.” Han Sen reached his hand out and patted the rhino’s head. There was nothing.\n\nBao’er reached out her hand and pressed the head, which made more light shoot out of the statue’s eyes. Han Sen’s inability to achieve the same results depressed him.\n\nHe couldn’t be bothered to figure out why Bao’er was able to succeed where he had failed, though. Instead, he focused on recording the text the Wood Spirit Rhino was displaying. It was a skill called Heart Connection.\n\nHan Sen seared the geno art into his memory, but he didn’t find the power mentioned by Yu\n\nJing.\n\n“Does this mean I can only get the power from the Wood Spirit Rhino if I learn the geno art?” Han Sen guessed. Then, he tried researching the Heart Connection geno art.\n\nSince the name sounded rather romantic, Han Sen expected the geno art to be spiritual in nature. Perhaps it would have interpersonal properties.\n\nHan Sen soon discovered he was incorrect. The geno art wasn’t at all spiritual; it was actually rather violent. It was a geno art that gathered up power, then released it in a sudden burst.\n\nIt was like a rhino’s ramming attack. Power was gathered like a charging rhino gaining momentum, then concentrated into the rhino’s horn.\n\nBut the side effects could be devastating. After an attack was unleashed, your body would become weak. Your power would be sucked dry, and it couldn’t be used anymore.\n\n“This is a very dangerous geno art,” Han Sen complimented.\n\nAlthough the geno art wasn’t as destructive as Break Six Skies, it had the precision of a steel needle. It could pierce through anything. It was a very powerful geno art, but it was also very unique.\n\nBreak Six Skies had to be used at a distance unless the caster wanted to blow themselves up, but Heart Connection didn’t have a range requirement. “This geno art could be a trump card. If I’m facing death, I can use this as one last attack to save myself.” After Han Sen researched it, he tried practicing it. It wasn’t difficult to learn the basics, but it would take a while to become skilled with the art.\n\nHan Sen gave Bao’er many snacks, but she wasn’t as happy as she had been. She didn’t pay much attention to the snacks. Instead, she looked at Han Sen and told him, “Dad, I want to go to the Very High!”\n\n“It is too dangerous there. Kids cannot visit them. You can stay and play with your aunties. You like Nightmare Beast, don’t you? You can go play with him.” Han Sen couldn’t take Bao’er with him to the Very High. If his undercover activities were exposed, it would be difficult for him to escape. And he wouldn’t want Bao’er to get involved in that.\n\n“Dad, if you don’t take me, I will go and find mom,” Bao’er said with a blink.\n\n“Yes, you can spend time with mom. That is good. And then go to kindergarten for a few days. Didn’t you like that kindergarten teacher? What was her name? Oh, right, it was Lu Zimei.” Han Sen nodded.\n\nBao’er smiled and said, “I’m not going to school. I am going to snitch to mother.”“Snitch about what?” Han Sen looked at Bao’er with interest. He didn’t think he had any dirty secrets to hide.\n\nBao’er lifted her hand and used her fingers to count. “Sister Suyi, Sister Yisha, and that Sister Exquisite…”\n\nBao’er quickly realized she wasn’t going to have enough fingers on one hand. She was about to continue when Han Sen stopped her and said, “There’s nothing between me and any of those women. You can’t threaten me with that.”\n\n“Owning the whole universe is pointless, and only your smile is eternal… I hope the next time I see you, I will be able to see you smile…” Bao’er replicated Han Sen’s speech and tone. She looked innocent while she said it. “You know, I remember a lot. I think I will tell mom all about this. She will be very touched and happy.”\n\nAfter that, Bao’er pulled out her little book. She opened it, and Han Sen saw that it was filled with childish scribbling. It was Bao’er’s writing, and they were all of the things Han Sen had said.\n\nHan Sen’s forehead broke out in a cold sweat. Those words hadn’t been inappropriate when they were spoken, but if they were read without any context, problems could arise.\n\n“Ahem, Bao’er. Fathers and their daughters should communicate well with each other. There shouldn’t be any conflict between us, right?” Han Sen looked at Bao’er and her little book.\n\nBao’er put away the little book and laughed. “Yes! So, does that mean Bao’er can follow Daddy to the Very High?”"
}