{
    "chapter": 1259,
    "title": "Accidentally Meeting Again",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1259",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen explained how he managed to obtain the jue and what he had experienced with the altar.\n\nDragon King’s expression warped, and he said, “If I am correct, then this jue is not a Demi-God Geno Core. It is still an item from the Fourth God’s Sanctuary, however.”\n\n“Why isn’t this a Demi-God Geno Core from Blood River King?” Han Sen asked.\n\nThis jue had opened a passage to an altar. This was all on the same island as Blood River Shelter, so Han Sen found it quite peculiar, hearing that this did not actually belong to Blood River King.\n\nDragon King said, “Blood River King wants Demi-God Geno Cores, sure. But he can only gain hold of them by doing what we all must do: ascending The Ten Steps of the Holy Door. The only way he might have been able to create the Demi-God Geno Core in the Third God’s Sanctuary was while walking the ten steps and failing. Failure leads to death, mind you. That could be left in his absence.”\n\n“What makes you think Blood River King is not dead, though?” Han Sen frowned.\n\n“If he was dead, you wouldn’t be able to summon his altar. The ritual you had was one that summoned a demi-god. If you activated it, then that means he is still alive,” Dragon King explained.\n\n“But that can’t be right. My jue summoned the altar, and that must mean the jue was created by a demi-god,” Han Sen said.\n\n“That’s why this is bad. Blood River King is still here, and the jue must not be the true Geno Core he created. But it was able to summon the altar and almost summon the king himself; if you didn’t destroy the altar, he’d be back. All these facts lead me to one startling conclusion.” Dragon King’s tone and look gained a significant amount of gravitas.\n\n“What?” Han Sen asked.\n\n“The jue can summon other demi-gods. The workings of this thing are wild and unpredictable; it’s too dangerous to carry around,” Dragon King said.\n\nHan Sen didn’t think his time at the altar was all that special. He had managed to kill all three statues with relative ease, and he had obtained three Battle Geno Essences for his trouble.\n\n“If the demi-gods return, what can they do?” Han Sen asked.\n\nThey were demi-gods, so it didn’t seem as if there’d be a reason or purpose for them to occupy the Third God’s Sanctuary.\n\n“That is the secret. Give me the egg and I’ll tell you.” Dragon King hushed his lips after this.\n\nHan Sen clicked his fingers and put Dragon King away for the time being. Han Sen flew around the area he had ended up in, wanting to check it out some more.\n\nTo the east were an abundance of hills, and to the west were thorny vines and a river. So, Han Sen traveled to the west.\n\nA strange expression fell across Han Sen’s face as he realized the place looked similar to the area he had met the lantern fish. In the river, he saw them again. The stream was filled with the lantern fish, and they were all headed upstream.\n\n“Nice. Yaksha wants to fight the king fish and the vine, doesn’t he? I should get ready to swoop in and aid Lord Fish.” Han Sen followed the stream up, hoping to catch up with the king.\n\nAfter flying a few hundred miles, he didn’t find the fish king. What he did find, however, was a shelter.\n\nThe shelter was nothing fancy. It was just a mere, solitary royal shelter.\n\nHan Sen planned to take it over. Even if he had no need for it, it would allow future humans who spawned there to be safe.\n\nWhen he entered the shelter, though, there were no foes to rout. It had already been abandoned, and there was nobody there.\n\nThe entire shelter had one teleporter inside, though, and it was in perfect working condition.\n\nHan Sen returned to the Alliance and took a break with Ji Yanran. After that, he returned to the sanctuary.\n\nHan Sen packed his stuff alongside Little Angel, when suddenly, something seemed to be coming through the teleporter behind him.\n\n“A human is spawning here? Neat timing.” Han Sen was wondering who it might be.\n\nIf it wasn’t an enemy, Han Sen wouldn’t mind lending a hand for a while. He didn’t want anything bad to befall humans, as there was a long road to go for them to occupy and govern a greater portion of control over the Third God’s Sanctuary. And every new person needed all the help they could get.\n\nSeeing the dimensions distort, someone appeared.\n\nIt was a woman with a rapturously gorgeous figure, and when Han Sen pried his eyes away from her curves, he was shocked to discover who it was.\n\nThe woman had a similar response seeing Han Sen, and she too was surprised to see who she had immediately encountered.\n\n“It’s you!” they both said in tandem.\n\nHan Sen had just spent time with her on Skynet, not so long ago. It was Qin Xuan.\n\n“Well, this seems too far-fetched to be a coincidence.” Han Sen thought the chances of her ending up there with him were a little too unlikely. It was an enormous world, yet she had ended up with Han Sen in her first moment there.\n\n“I am so lucky to see you, aren’t I? What are the chances? You are going to carry me, aren’t you?” Qin Xuan laughed.\n\n“That’s no problem. I’m getting used to carrying people.” Han Sen smiled.\n\nJust as Qin Xuan started to speak again, a number of loud, repetitive noises sounded from someplace not too far away. They were like the repeated drumming of a stampede. Han Sen’s face changed, so he flew up and had a look.\n\nMany creatures were coming from the river, and they looked terrified as they took refuge in the shelter."
}