{
    "chapter": 3004,
    "title": "Great-Grandad",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_3004",
    "text": "“Believe? All creatures will die one day.” Han Sen was not mad, so that was how he replied.\n\nThe old man shook his head. He did not continue with that particular subject. He pulled out an object and gave it to Han Sen. “This is for you. It should help you.”\n\nHan Sen did not immediately grab it. He was looking at the item in the old man’s hand. He was holding a transparent tube-shaped container. There was some blood-red liquid inside.\n\n“What is that?” Han Sen asked.\n\n“It is a medicine that can control the blood power,” the old man said. “It can make your blood stable, but it is only temporary. It does not really solve the problem. If you want to sort out the problem concerning your blood, you need to find someone.” The old man threw the medicine at Han Sen.\n\nHan Sen took the medicine. He frowned and asked, “Who are you? What is your aim?”\n\n“I actually found out a disaster was set to occur in your fate,” the old man said with a laugh. “I am here to help you through it. Do you believe\n\nme?”\n\nHan Sen looked at the old man but did not speak. He was not three years old. He would not believe in words that sounded like a trick.\n\nThe old man knew Han Sen did not believe it. He shrugged his shoulders and drank his wine. “If what I have told you is something you do not believe, do you believe in the words spoken to you by Han Jinzhi?”\n\n“Are you Han Jinzhi?” Han Sen was shocked. His eyes were open wide as he looked at the old man.\n\nHe knew Han Jinzhi hailed from a faction that was full of scammers a long time ago. They pretended to be fortune-tellers. By doing that, they scammed people. It was just like the old man said.\n\n“Since we are relatives, you should be calling me great-grandad.” The old man smiled. “How am I supposed to know if you are really Han Jinzhi?” Han Sen asked. “If you really are, you might not have the same blood as me.”\n\n“If I did not leave the Blood Legion’s secret item, the pendant, your body would have been corroded by blue blood,” Han Jinzhi said. “You would not be having this chance to talk to me right now.”\n\nHan Sen looked at Han Jinzhi and asked, “The notebook… What was written with the relic?” He took this very seriously. The old man in front of him was Han Jinzhi. He had been chasing down mysteries about him for a very long time. Perhaps now he would finally receive the answers he sought.\n\n“If I, the old man, remember, I wrote down the ‘Super God Gene’ with a question mark,” Han Jinzhi said.\n\nHan Sen looked at Han Jinzhi with shock. He had been looking for him for many years. Now, he had finally discovered Han Jinzhi standing right in front of him. He did not know what to ask.\n\nHan Sen opened his mouth. He wished to say something, but he did not say anything. Han Jinzhi spoke first. “You are my great-grandchild. Your father is my grandchild. There is no doubting this.”\n\nHan Sen opened his mouth, but Han Jinzhi stopped him from speaking. “In the past, I had no choice. I had to shirk my identity and keep your father in the Han house. Someone in the Han family lost their life because of it. Just like your father said, we own the Han family. All these things should be paid back. We owe them that.”\n\nIt was hard for Han Sen to find a gap to speak. He tried to speak again but Han Jinzhi said, “Do not ask me why I do this. Even if I was to explain, you would not believe me. Just like you did not believe what I said when I said your family would die.”\n\nHan Sen opened his mouth. This time, Han Jinzhi did not stop him. Yet, he could not speak. That was because the question Had Sen had thought of before had already been answered. Now, he did not know what to ask.\n\nHan Jinzhi smiled. He poured out some wine and said, “The blue blood inside your body was me. I had Human King give it to you.”\n\n“Why?” Han Sen’s heart sank. He did not expect Human King would end up giving him blue blood. Now, there was a twist like this to the story.\n\n“Only by doing that could you stop the unfortunate things from happening,” Han Jinzhi weirdly said.\n\n“What unlucky thing?” Han Sen asked. “Is it like you said? Will my family die?”\n\n“Not just you,” Han Jinzhi seriously said. “The entire world.”\n\n“Are you saying I’m the savior?” Han Sen coldly laughed. He looked at Han Jinzhi as if he was a liar.\n\n“No, you are not,” Han Jinzhi said. “No one is a savior. Everything is meant to be destroyed. What we can do is stop the end from being the end.”\n\n“What does that mean?” Han Sen frowned.\n\nHan Jinzhi shook his head. “That is what I meant. There are things that even if I explained, you would not believe me. No matter what, we deal with the blue blood problem first. Drink the medicine and restrict the blood’s power. Then, look for Han Yufei. Only she will have a way to control the blue blood power within you.”\n\n“I do not need the blue blood power,” Han Sen said.\n\n“No, you do need it,” Han Jinzhi said with certainty. “You need the blue blood power so Qin Xiu cannot kill you.”\n\n“Wasn’t Qin Xiu killed a long time ago?” Han Sen was shocked.\n\n“It would be good if he was dead.” Han Jinzhi stood up and glanced at the backyard. He then looked at Han Sen and said, “Only blue blood power can combat blue blood power. If you cannot win, you can at least have a chance of surviving. Willing or not, you are already blue blood. There is no other choice now. Han Yufei is on a cold planet. Go and find her. Tell her who you are, and she will help you.” Han Sen looked at Han Jinzhi and thought of many things.\n\nTo be honest, from now on, Han Sen still thought the Han Jinzhi was still kind of fake. Even though it might have been him, what he talked about was hard to believe. It was beyond belief.\n\nHan Sen looked at Han Jinzhi and said, “Many people say you cannot have babies. Why is that?”\n\n“Go and find Han Yufei. She will give you all the answers you want.” Han Jinzhi looked at the sky and said, “There is no time. The red umbrella is coming. You should go.” “Red umbrella?” Han Sen asked. “Is that the woman with Human King? What is your relationship with him?”\n\nHan Jinzhi looked at Han Sen and laughed. He suddenly kicked Han Sen in the face and pushed him back.\n\nThere should have been a stone floorboard behind him, but Han Sen had flipped the stone floorboard. He fell. It was like he was falling into an abyss.\n\n“Kid, remember to live no matter what. Even if things are bleak, don’t ever give up. You must live at all costs because you need to live. Do that, and your family has hope.” Han Jinzhi’s voice rang in Han Sen’s ear. Han Sen felt some power continue to pull him down. He could not shake it off.\n\nPerhaps it was because Han Sen could not control his body now, but that power could not stop him. Now, Han Sen was not able to stop falling"
}