{
    "chapter": 1064,
    "title": "Stone Ding",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1064",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen now knew why Sunset asked him if he believed in God.\n\nBut Han Sen still thought he was missing a piece of the puzzle. After all, why would she want to kill Han Jingzhi, if he had only said something blasphemous or comical towards God?\n\n“It does not matter if you believe he should be killed or not, just deliver this message to Qin Huaizhen. Han Jingzhi must die,” Sunset said.\n\nHan Sen, with a wry smile, said, “Qin Huaizhen is dead. He has been for a while.”\n\n“What? Qin Huaizhen is dead?” She suddenly looked angry. She grabbed Han Sen and shouted, “You’re a liar! He can’t have died. I thought he used…”\n\nSunset’s dialogue trailed off, but her now-psychotic look remained fixed on Han Sen.\n\n“Why are you sure he cannot be dead? He really is.” Han Sen then went on to tell her about Qin Xuan’s story.\n\n“No, that’s wrong. He’s immortal. You’re lying!” Sunset became hysterical.\n\nHan Sen frowned, but he knew he had stumbled into something rather big. Something profound and complex was going on, and this was the biggest thread to its unraveling he had yet found.\n\nHan Sen then told her, “If Qin Huaizhen really did not die, then there is one other possibility.”\n\n“And what possibility might that be?” Sunset asked.\n\nHan Sen then proceeded to tell her of his encounter with Qin Huaizhen beneath the Black Desert, and what had occurred there.\n\n“Qin Haizhen… why would he have gone there?” Suddenly, Sunset’s face went all pale. She carried on to say, “We were wrong. We were tricked!”\n\n“What’s wrong?” Han Sen asked, knowing the truth was so close, at long last.\n\nSunset seemed a little mad now, as if she had blown a fuse. She repeatedly mumbled how something had gone awfully wrong, and about how she and the others had been tricked in some way.\n\nWhen Han Sen wanted to ask again, he noticed something amiss with her face. It didn’t look as pretty as it had earlier. It seemed aged.\n\nShe looked older and older, as wrinkles crept across her face. Her soft skin started to hang like a leather sack, and her hair turned grey and thinned. She was drying out.\n\n“Your body!” Han Sen shouted.\n\nSunset looked at her hands, and she herself looked shocked. She tried to compose herself, and when she did, she looked at Han Sen and said, “Find Han Jingzhi, and tell him about me and Qin Huaizhen. If he didn’t die, then maybe… maybe…”\n\nBefore she could finish, her lifeforce was switched off. Her body had withered to become an old skeletal husk. The moment before she died, she collapsed into Han Sen’s arms and said one last word.\n\n“Wrong.”\n\nAfter that, there was nothing more. She was gone. In a few seconds, she had died of old age.\n\nWhen her eyes closed for the final time, Han Sen saw the fading flicker of hatred and regrets going with her.\n\n“Where did they go and what did they do?” Han Sen’s mind was in disarray over what he had learned and what he had not.\n\nIt made him sad to see such a beautiful woman grow old and die right before him.\n\nHan Sen stood there for a while in thought, but when he decided it was time to move on, he first chose to dig a grave for her inside the temple.\n\nHan Sen wouldn’t have been able to take her back home, and neither could he explain who she was or why she was there.\n\nHan Sen had heard many things, and while some questions were answered, the answers themselves just brought more questions with them.\n\nHan Sen left the temple. When he exited, he saw the green beetles were still there waiting for his return. Just as he wished to leave, though, the green beetles built a wall to prevent his passage.\n\n“What else do you guys want from me?” Han Sen frowned.\n\nHe initially believed the beetles had brought him there in order to save Sunset, but seeing as she was human, perhaps her being there was all circumstance. Perhaps they wanted something else.\n\nPerhaps it was indeed a coincidence, and Sunset really didn’t have anything to do with the beetles.\n\nHan Sen tried to walk around the wall of beetles, but they scurried over to prohibit his passage.\n\nHe took a few steps back, as if he was returning to the interior of the temple, and watched the beetles disassemble their wall.\n\nThinking it best to oblige their desire, he walked back inside to see if he could find any particular item they might have wanted.\n\nAside from the now-broken crystal vase, though, there was nothing. There were only the stone dings left in there.\n\nThere were three of them in total. Each was one meter in height.\n\n“Do they want me to move these things outside for them?” Han Sen wondered.\n\nHe approached one of them, and with his power, managed to lift it up and bring it outside.\n\nWhen Han Sen brought one of them out, the beetles looked happier. Then, they quickly parted to form a path that Han Sen should follow.\n\nHan Sen looked to the end of this new trail and noticed that it led to another building. But that one was not exquisite like the temple was. It was like the rest of the area’s buildings; half-collapsed and in decay. There was only one room left that was intact.\n\nHan Sen walked there, stone ding in hand. He was quite interested in seeing what the beetles were ultimately up to."
}