{
    "chapter": 1224,
    "title": "The Coming Storm",
    "url": "https://bestlightnovel.com/novel_888112448/chapter_1224",
    "text": "Translator: Nyoi-Bo Studio Editor: Nyoi-Bo Studio\n\nHan Sen used his lightning-derived healing ability, the ability he had received from silver fox, to start healing Xie Qing King’s wounds. It exhausted Han Sen, and if Xie Qing King was to fully recover, it’d take a few days.\n\nInside the shelter’s palace, Han Sen brought out the Cruel Bottle and released Qing Jun.\n\nAs soon as she was released, the sprouts and vines resumed their growth. She did not know why Han Sen had summoned her, and she started to panic.\n\n“Zero!” Han Sen called, wanting to see if the Asura Sutra could deal with the affliction.\n\nThere was going to be a battle, and if Han Sen could fix his bottled collection of spirits and creatures, they’d be of immeasurable help.\n\nZero approached Qing Jun in a fiesty rush, flailing her arms as if to attack her. As this occurred, Han Sen slipped behind Qing Jun and held her by the arms, restricting her movement.\n\nZero slashed her body, killing the invasive vine sprouts and eliminating their roots.\n\nDragon King was correct. The Asura Sutra was indeed able to destroy the vines.\n\nQing Jun and Dry Bone King had attempted to get rid of them over the course of their incarceration in the bottle. None of their attempts had yielded any positive results thus far. She was surprised a little human had again provided them a definitive answer to another one of their problems.\n\n“Qing Jun, are you free from those Sky Vines?” Han Sen asked.\n\nQing Jun, released from his clutches, patted herself down to examine her body. Then she said, “Yes, actually! I don’t think I feel them.”\n\n“Good. But you’re out of the frying bottle and into the fire, I’m afraid. We’re going to come under the assault of a terrible enemy. I need your help. Tell the others I will remove their vines, but only if they truthfully remain here to help in the defense of this shelter.” Han Sen paused, and then went on to say, “And don’t forget to mention the king spirits will have to provide me their spirit stones, and super creatures will have to sign a contract. That’s by the by, but just make sure to mention it, so they understand the terms that will allow them to be free of the bottle and free of the vines.”\n\n“I’m not entirely sure they’ll agree to that,” Qing Jun said.\n\n“Ask and see what they say first,” Han Sen told her.\n\nQing Jun returned to the Cruel Bottle. She started by telling the inhabitants of the bottle they could be cured, and Han Sen was willing to release them. This made them all very excited.\n\nTheir attitudes quickly soured when they heard they’d have to come into service beneath Han Sen.\n\n“Why would we have to obey him? He is a weakling!”\n\n“Pah! Who does he think he is? An emperor? No way!”\n\n…\n\n“Do you guys want to stay in this bottle forever or do you want to get out?” Qing Jun said sternly, looking into the eyes of each.\n\n“Immortal Emperor will try to reach the Fourth God’s Sanctuary, and when he does, we will be free, anyway,” Ghost Eye said.\n\nQing Jun responded by saying, “Do you not realize the terms of your entrapment inside the bottle? You can’t escape it by your own volition.”\n\nThe super creatures were all shocked when they understood what that meant. Ghost Eye spoke again, asking, “Is Han Sen keeping us in here on purpose? Has he gotten us bottled up in here for this very reason?!”\n\n“Yes and no. But try to leave by yourself. Go on. Try it.” Qing Jun was making a good case.\n\nThe Cruel Bottle might have been their sanctuary, but it was a glass prison at the same time. If Han Sen didn’t let them out, they’d be stuck in there, and they were only now becoming aware of that fact.\n\nWater Fairy suddenly said, “Qing Jun, tell Han Sen I am willing to sign a contract!”\n\n“Are you mad?!” Ghost Eye shouted.\n\n“There is no harm going under his employ. Besides, anything is better than being stuck inside here, suffering the scent of your sweaty reeking,” Water Fairy rebutted.\n\n“But he’s so… weak! Can you all not see that?” Ghost Eye said.\n\nQing Jun said, “You’re a broken record; don’t keep me going in circles on this. Again, can you remove the vines by yourself? Can you leave the bottle by yourself?”\n\n“I wouldn’t be here if I could,” Ghost Eye admitted.\n\n“A little girl accompanies Han Sen, and she can remove them,” Qing Jun said.\n\nAll the super creatures, hearing this, were shocked.\n\n“I will sign a contract with Han Sen! Me first. Tell him!” Water Fairy pleaded.\n\n“Okay.” Qing Jun nodded.\n\nHan Sen was watching the bottle the entire time. Dry Bone King, Water Fairy, and Ghost Eye were willing to join up with Han Sen. Only Rock Giant refused.\n\nDry Bone King provided Han Sen with his spirit stone, while Water Fairy and Ghost Eye signed the blood contract.\n\nKing Spirits: Moment Queen; Thorn Queen; Dry Bone King; Qing Jun King; Purple Emperor.\n\nSuper Creatures: Blue Dinosaur; Metal Eater; Water Fairy; Ghost Eye; Snowball.\n\nHan Sen had more power in his back pocket than the average king spirit shelter, not to mention his other companions. He still had Xie Qing King, Bao’er, Zero, Little Angel, Disloyal Knight, and even Ghost Baby and Golden Growler, if push came to shove.\n\nHan Sen wished he had more knowledge of his opponent, and he wished he could view the troops they’d be sending, though.\n\nIf it was a king spirit coming for them, with a few super creatures in tow, Han Sen would laugh in the face of that adversity. He wouldn’t be afraid. But if Thunder Hell Emperor himself was going to show, he would rather lose the shelter and not risk the battle.\n\nHan Sen suddenly felt something move inside his Sea of Soul. The sound of a raven cawing was heard. The Gold Raven had finished evolving.\n\nGold Raven: Berserk Super Beast Soul Shapeshifting Type\n\nHan Sen was delighted. He hadn’t expected it to finish evolving in time for the fight, and having this meant he didn’t have to risk using super king spirit mode.\n\n“I will come with you,” Xie Qing King said, as Han Sen was about to leave.\n\n“I’m only performing some light reconnaissance to get a sneak peek at the guest list,” Han Sen said.\n\n“Why don’t we move to meet with them, dude? Why not battle them out on the plains, instead of risking the ruin of the shelter? This crib has already suffered enough,” Xie Qing King suggested.\n\n“That’s good thinking, actually. You may be right,” Han Sen agreed, and so he led his host of minions to where Thunder Hell Emperor’s forces were said to be."
}